{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCassini–Huygens - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tCassini–Huygens\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tSpacecraft sent to the Saturn system\n\nCassini–Huygens\tArtist's concept of Cassini's orbit insertion around Saturn\n\n\t\n\tMission type\tCassini: Saturn orbiter\nHuygens: Titan lander\n\tOperator\tCassini: NASA / JPL \n Huygens: ESA / ASI\n\tCOSPAR ID\t1997-061A\n\tSATCAT no.\t25008\n\tWebsite\t\n\tNASA\n\tESA\n\tASI\n\n\n\n\tMission duration\t\n\tOverall:\n\t 19 years, 335 days \n\t 13 years, 76 days at Saturn\n\n\n\tEn route:\n\t 6 years, 261 days\n\n\n\tPrime mission:\n\t 3 years\n\n\n\tExtended missions:\n\t Equinox: 2 years, 62 days\n\t Solstice: 6 years, 205 days\n\t Finale: 4 months, 24 days\n\n\n\n\n\n\n\t\n\n\t\n\tSpacecraft properties\n\tManufacturer\tCassini: Jet Propulsion Laboratory \n Huygens: Thales Alenia Space\n\tLaunch mass\t5,712 kg (12,593 lb)[1][2]\n\tDry mass\t2,523 kg (5,562 lb)[1]\n\tPower\t~885 watts (BOL)[1]\n ~670 watts (2010)[3] \n ~663 watts (EOM/2017)[1]\n\t\n\n\t\n\tStart of mission\n\tLaunch date\tOctober 15, 1997, 08:43:00 (1997-10-15UTC08:43) UTC\n\tRocket\t Titan IV(401)B B-33\n\tLaunch site\tCape Canaveral SLC-40\n\t\n\n\t\n\tEnd of mission\n\tDisposal\tControlled entry into Saturn[4][5]\n\tLast contact\tSeptember 15, 2017\n\t11:55:39 UTC X-band telemetry\n\t11:55:46 UTC S-band radio science[6]\n\n\n\n\t\n\n\t\n\tOrbital parameters\n\tReference system\tKronocentric\n\t\n\n\t\n\tFlyby of Venus (Gravity assist)\n\tClosest approach\tApril 26, 1998\n\tDistance\t283 km (176 mi)\n\tFlyby of Venus (Gravity assist)\n\tClosest approach\tJune 24, 1999\n\tDistance\t623 km (387 mi)\n\tFlyby of Earth-Moon system (Gravity assist)\n\tClosest approach\tAugust 18, 1999, 03:28 UTC\n\tDistance\t1,171 km (728 mi)\n\tFlyby of 2685 Masursky (Incidental)\n\tClosest approach\tJanuary 23, 2000\n\tDistance\t1,600,000 km (990,000 mi)\n\tFlyby of Jupiter (Gravity assist)\n\tClosest approach\tDecember 30, 2000\n\tDistance\t9,852,924 km (6,122,323 mi)\n\tSaturn orbiter\n\tOrbital insertion\tJuly 1, 2004, 02:48 UTC\n\tTitan lander\n\tSpacecraft component\tHuygens\n\tLanding date\tJanuary 14, 2005\n\t\n\n\tLarge Strategic Science Missions\n← Galileo\nMars Science Laboratory →\n\n \n\n\nThe Cassini–Huygens space-research mission (/kəˈsiːni ˈhɔɪɡənz/ kə-SEE-nee HOY-gənz), commonly called Cassini, involved a collaboration between NASA, the European Space Agency (ESA), and the Italian Space Agency (ASI) to send a probe to study the planet Saturn and its system, including its rings and natural satellites. The Flagship-class robotic spacecraft comprised both NASA's Cassini probe and ESA's Huygens lander, which landed on Saturn's largest moon, Titan.[7] Cassini was the fourth space probe to visit Saturn and the first to enter its orbit. The two craft took their names from the  astronomers Giovanni Cassini and Christiaan Huygens.\n\nLaunched aboard a  Titan IVB/Centaur on October 15, 1997, Cassini was active in space for nearly 20 years, with 13 years spent orbiting Saturn and studying the planet and its system after entering orbit on July 1, 2004.[8] The voyage to Saturn included flybys of Venus (April 1998 and July 1999), Earth (August 1999), the asteroid 2685 Masursky, and Jupiter (December 2000). The mission ended on September 15, 2017, when Cassini's trajectory took it into Saturn's upper atmosphere and it burned up[9][10] in order to prevent any risk of contaminating Saturn's moons, which might have offered habitable environments to stowaway terrestrial microbes on the spacecraft.[11][12] The mission is widely perceived[by whom?] to have been successful beyond expectations. NASA's Planetary Science Division Director, Jim Green, described Cassini-Huygens as a \"mission of firsts\",[13] that has revolutionized human understanding of the Saturn system, including its moons and rings, and our understanding of where life might be found in the Solar System.[citation needed]\n\nCassini's planners originally scheduled a mission of four years, from June 2004 to May 2008. The mission was extended for another two years until September 2010, branded the Cassini Equinox Mission. The mission was extended a second and final time with the Cassini Solstice Mission, lasting another seven years until September 15, 2017, on which date Cassini was de-orbited to burn up in Saturn's upper atmosphere.\n\nThe Huygens module traveled with Cassini until its separation from the probe on December 25, 2004; it  landed by parachute on Titan on January 14, 2005. It returned data to Earth for around 90 minutes, using the orbiter as a relay. This was the first landing ever accomplished in the outer Solar System and the first landing on a moon other than Earth's Moon.\n\nAt the end of its mission, the Cassini spacecraft executed its \"Grand Finale\": a number of risky passes through the gaps between Saturn and Saturn's inner rings.[4][5]\nThis phase aimed to maximize Cassini's scientific outcome before the spacecraft was disposed.[14] The atmospheric entry of Cassini ended the mission, but analyses of the returned data will continue for many years.\n\n\nContents\n\n\n\t1 Overview\n\t2 Naming\n\t3 Objectives\n\t3.1 Itinerary\n\n\n\n\t4 History\n\t5 Spacecraft design\n\t6 Instruments\n\t6.1 Summary\n\t6.2 Description\n\n\n\n\t7 Plutonium power source\n\t8 Telemetry\n\t9 Huygens probe\n\t10 Selected events and discoveries\n\t10.1 Venus and Earth fly-bys and the cruise to Jupiter\n\t10.2 Jupiter flyby\n\t10.3 Tests of general relativity\n\t10.4 New moons of Saturn\n\t10.5 Phoebe flyby\n\t10.6 Saturn rotation\n\t10.7 Orbiting Saturn\n\t10.8 Titan flybys\n\t10.9 Huygens lands on Titan\n\t10.10 Enceladus flybys\n\t10.11 Radio occultations of Saturn's rings\n\t10.12 Spokes in rings verified\n\t10.13 Lakes of Titan\n\t10.14 Saturn hurricane\n\t10.15 Iapetus flyby\n\t10.16 Mission extension\n\t10.17 Second mission extension\n\t10.18 Great Storm of 2010 and aftermath\n\t10.19 Venus transit\n\t10.20 The Day the Earth Smiled\n\t10.21 Rhea flyby\n\t10.22 Hyperion flyby\n\t10.23 Dione flyby\n\t10.24 Hexagon changes color\n\n\n\n\t11 Grand Finale and destruction\n\t11.1 Missions\n\n\n\n\t12 Glossary\n\t13 See also\n\t14 References\n\t15 Further reading\n\t16 External links\n\n\n\n\n\nOverview[edit]\n\nTeams from 28 countries made up the joint team responsible for designing, building, flying and collecting data from the Cassini orbiter and Huygens probe.\n\nThe mission was managed by NASA's Jet Propulsion Laboratory in the United States, where the orbiter was assembled. Huygens was developed by the European Space Research and Technology Centre. The Centre's prime contractor, Aérospatiale of France (now Thales Alenia Space), assembled the probe with equipment and instruments supplied by many European countries (Huygens' batteries and two scientific instruments by the United States). The Italian Space Agency (ASI) provided the Cassini orbiter's high-gain radio antenna, with the incorporation of a low-gain antenna (to ensure telecommunications with the Earth for the entire duration of the mission), a compact and lightweight radar, which also uses the high-gain antenna and serves as a synthetic-aperture radar, a radar altimeter, a radiometer, the radio science subsystem (RSS), the visible channel portion VIMS-V of VIMS spectrometer.[15]\n\nThe VIMS infrared counterpart was provided by NASA, as well as Main Electronic Assembly, which includes electronic subassemblies provided by CNES of France.[16][17]\n\nOn April 16, 2008, NASA announced a two-year extension of the funding for ground operations of this mission, at which point it was renamed the Cassini Equinox Mission.[18] The round of funding was again extended in February 2010 with the Cassini Solstice Mission.\n\n\nNaming[edit]\n\n  \nHuygens' explanation for the aspects of Saturn, Systema Saturnium (1659)\n\n\n\nThe mission consisted of two main elements: the ASI/NASA Cassini orbiter, named for the Italian astronomer Giovanni Domenico Cassini, discoverer of Saturn's ring divisions and four of its satellites; and the ESA-developed Huygens probe, named for the Dutch astronomer, mathematician and physicist Christiaan Huygens, discoverer of Titan.\n\nThe mission was commonly called Saturn Orbiter Titan Probe (SOTP) during gestation, both as a Mariner Mark II mission and generically.\n\nCassini-Huygens was a Flagship-class mission to the outer planets.[7] The other planetary flagships include Galileo, Voyager, and Viking.[7]\n\n\nObjectives[edit]\n\nCassini had several objectives, including:[19]\n\n\n\tDetermining the three-dimensional structure and dynamic behavior of the rings of Saturn.\n\tDetermining the composition of the satellite surfaces and the geological history of each object.\n\tDetermining the nature and origin of the dark material on Iapetus's leading hemisphere.\n\tMeasuring the three-dimensional structure and dynamic behavior of the magnetosphere.\n\tStudying the dynamic behavior of Saturn's atmosphere at cloud level.\n\tStudying the time variability of Titan's clouds and hazes.\n\tCharacterizing Titan's surface on a regional scale.\n\n\nCassini–Huygens was launched on October 15, 1997, from Cape Canaveral Air Force Station's Space Launch Complex 40 using a U.S. Air Force Titan IVB/Centaur rocket. The complete launcher was made up of a two-stage Titan IV booster rocket, two strap-on solid rocket engines, the Centaur upper stage, and a payload enclosure, or fairing.[20]\n\nThe total cost of this scientific exploration mission was about US$3.26 billion, including $1.4 billion for pre-launch development, $704 million for mission operations, $54 million for tracking and $422 million for the launch vehicle. The United States contributed $2.6 billion (80%), the ESA $500 million (15%), and the ASI $160 million (5%).[21] However, these figures are from the press kit which was prepared in October 2000. They do not include inflation over the course of a very long mission, nor do they include the cost of the extended missions.\n\nThe primary mission for Cassini was completed on July 30, 2008. The mission was extended to June 2010 (Cassini Equinox Mission).[22] This studied the Saturn system in detail during the planet's equinox, which happened in August 2009.[18]\n\nOn February 3, 2010, NASA announced another extension for Cassini, lasting 6​1⁄2 years until 2017, ending at the time of summer solstice in Saturn's northern hemisphere (Cassini Solstice Mission). The extension enabled another 155 revolutions around the planet, 54 flybys of Titan and 11 flybys of Enceladus.[23]\nIn 2017, an encounter with Titan changed its orbit in such a way that, at closest approach to Saturn, it was only 3,000 km above the planet's cloudtops, below the inner edge of the D ring. This sequence of \"proximal orbits\" ended when its final encounter with Titan sent the probe into Saturn's atmosphere to be destroyed.\n\n\nItinerary[edit]\n\n\n\tSelected destinations (ordered largest to smallest but not to scale)\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\n\tTitan\n\tEarth's Moon\n\tRhea\n\tIapetus\n\tDione\n\tTethys\n\tEnceladus\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\n\tMimas\n\tHyperion\n\tPhoebe\n\tJanus\n\tEpimetheus\n\tPrometheus\n\tPandora\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\t\n\n\n\n\tHelene\n\tAtlas\n\tPan\n\tTelesto\n\tCalypso\n\tMethone\n\n\n\n\nHistory[edit]\n\n  \nCassini-Huygens on the launch pad\n\n\n\nCassini–Huygens's origins date to 1982, when the European Science Foundation and the American National Academy of Sciences formed a working group to investigate future cooperative missions. Two European scientists suggested a paired Saturn Orbiter and Titan Probe as a possible joint mission. In 1983, NASA's Solar System Exploration Committee recommended the same Orbiter and Probe pair as a core NASA project. NASA and the European Space Agency (ESA) performed a joint study of the potential mission from 1984 to 1985. ESA continued with its own study in 1986, while the American astronaut Sally Ride, in her influential 1987 report NASA Leadership and America's Future in Space, also examined and approved of the Cassini mission.[24]\n\nWhile Ride's report described the Saturn orbiter and probe as a NASA solo mission, in 1988 the Associate Administrator for Space Science and Applications of NASA, Len Fisk, returned to the idea of a joint NASA and ESA mission. He wrote to his counterpart at ESA, Roger Bonnet, strongly suggesting that ESA choose the Cassini mission from the three candidates at hand and promising that NASA would commit to the mission as soon as ESA did.[25]\n\nAt the time, NASA was becoming more sensitive to the strain that had developed between the American and European space programs as a result of European perceptions that NASA had not treated it like an equal during previous collaborations. NASA officials and advisers involved in promoting and planning Cassini–Huygens attempted to correct this trend by stressing their desire to evenly share any scientific and technology benefits resulting from the mission. In part, this newfound spirit of cooperation with Europe was driven by a sense of competition with the Soviet Union, which had begun to cooperate more closely with Europe as ESA drew further away from NASA. Late in 1988, ESA chose Cassini–Huygens as its next major mission and the following year the program received major funding in the US.[26][27]\n\nThe collaboration not only improved relations between the two space programs but also helped Cassini–Huygens survive congressional budget cuts in the United States. Cassini–Huygens came under fire politically in both 1992 and 1994, but NASA successfully persuaded the United States Congress that it would be unwise to halt the project after ESA had already poured funds into development because frustration on broken space exploration promises might spill over into other areas of foreign relations. The project proceeded politically smoothly after 1994, although citizens' groups concerned about its potential environmental impact attempted to derail it through protests and lawsuits until and past its 1997 launch.[28][29][30][31][32]\n\n\nSpacecraft design[edit]\n\n  \nCassini-Huygens assembly\n\n\n\nThe spacecraft was planned to be the second three-axis stabilized, RTG-powered Mariner Mark II, a class of spacecraft developed for missions beyond the orbit of Mars. Cassini was developed simultaneously with the Comet Rendezvous Asteroid Flyby (CRAF) spacecraft, but budget cuts and project rescopings forced NASA to terminate CRAF development to save Cassini. As a result, Cassini became more specialized. The Mariner Mark II series was cancelled.\n\nThe combined orbiter and probe is the third-largest unmanned interplanetary spacecraft ever successfully launched, behind the Phobos 1 and 2 Mars probes, as well as being among the most complex.[33][34] The orbiter had a mass of 2,150 kg (4,740 lb), the probe 350 kg (770 lb). With the launch vehicle adapter and 3,132 kg (6,905 lb) of propellants at launch, the spacecraft had a mass of 5,600 kg (12,300 lb).\n\nThe Cassini spacecraft was 6.8 meters (22 ft) high and 4 meters (13 ft) wide. Spacecraft complexity was increased by its trajectory (flight path) to Saturn, and by the ambitious science at its destination. Cassini had 1,630 interconnected electronic components, 22,000 wire connections, and 14 kilometers (8.7 mi) of cabling.[35] The core control computer CPU was a redundant MIL-STD-1750A system. The main propulsion system consisted of one prime and one backup R-4D bipropellant rocket engine. The thrust of each engine was 490 newtons and the total spacecraft delta-v was about 2,040 meters per second.[36] Smaller monopropellant rockets provided attitude control.\n\nCassini was powered by 32.7 kg[37] of plutonium-238—the heat from the material's radioactive decay was turned into electricity. Huygens was supported by Cassini during cruise, but used chemical batteries when independent.\n\nThe probe contained a DVD with more than 616,400 signatures from citizens in 81 countries, collected in a public campaign.[38][39]\n\nUntil September 2017 the Cassini probe continued orbiting Saturn at a distance of between 8.2 and 10.2 astronomical units from the Earth. It took 68 to 84 minutes for radio signals to travel from Earth to the spacecraft, and vice versa. Thus ground controllers could not give \"real-time\" instructions for daily operations or for unexpected events. Even if response were immediate, more than two hours would have passed between the occurrence of a problem and the reception of the engineers' response by the satellite.\n\n\nInstruments[edit]\n\n  \nTitan's surface revealed by VIMS\n\n\n\n  \nRhea in front of Saturn\n\n\n\n  \nSaturn's north polar hexagon[40]\n\n\n\n  \nSaturn in natural-color (July 2018)\n\n\n\n  \nAnimated 3D model of the spacecraft\n\n\n\nSummary[edit]\n\nInstruments:[41]\n\n\n\tOptical Remote Sensing (\"Located on the remote sensing pallet\")[41]\n\tComposite Infrared Spectrometer (CIRS)\n\tImaging Science Subsystem (ISS)\n\tUltraviolet Imaging Spectrograph (UVIS)\n\tVisible and Infrared Mapping Spectrometer (VIMS)\n\n\n\tFields, Particles and Waves (mostly in situ)\n\tCassini Plasma Spectrometer (CAPS)\n\tCosmic Dust Analyzer (CDA)\n\tIon and Neutral Mass Spectrometer (INMS)\n\tMagnetometer (MAG)\n\tMagnetospheric Imaging Instrument (MIMI)\n\tRadio and Plasma Wave Science (RPWS)\n\n\n\tMicrowave Remote Sensing\n\tRadar\n\tRadio Science (RSS)\n\n\n\n\nDescription[edit]\n\nCassini's instrumentation consisted of: a synthetic aperture radar mapper, a charge-coupled device imaging system, a visible/infrared mapping spectrometer, a composite infrared spectrometer, a cosmic dust analyzer, a radio and plasma wave experiment, a plasma spectrometer, an ultraviolet imaging spectrograph, a magnetospheric imaging instrument, a magnetometer and an ion/neutral mass spectrometer. Telemetry from the communications antenna and other special transmitters (an S-band transmitter and a dual-frequency Ka-band system) was also used to make observations of the atmospheres of Titan and Saturn and to measure the gravity fields of the planet and its satellites.\n\n\n\tCassini Plasma Spectrometer (CAPS)\n\tCAPS was an in situ instrument that measured the flux of charged particles at the location of the spacecraft, as a function of direction and energy. The ion composition was also measured using a time-of-flight mass spectrometer. CAPS measured particles produced by ionisation of molecules originating from Saturn's and Titan's ionosphere, as well as the plumes of Enceladus. CAPS also investigated plasma in these areas, along with the solar wind and its interaction with Saturn's magnetosphere.[42][43] CAPS was turned off in June 2011, as a precaution due to a \"soft\" electrical short circuit that occurred in the instrument. It was powered on again in March 2012, but after 78 days another short circuit forced the instrument to be shut down permanently.[44]\n\n\n\tCosmic Dust Analyzer (CDA)\n\tThe CDA was an in situ instrument that measured the size, speed, and direction of tiny dust grains near Saturn. It could also measure the grains' chemical elements.[45] Some of these particles orbited Saturn, while others came from other star systems. The CDA on the orbiter was designed to learn more about these particles, the materials in other celestial bodies and potentially about the origins of the universe.[42]\n\n\n\tComposite Infrared Spectrometer (CIRS)\n\tThe CIRS was a remote sensing instrument that measured the infrared radiation coming from objects to learn about their temperatures, thermal properties, and compositions. Throughout the Cassini–Huygens mission, the CIRS measured infrared emissions from atmospheres, rings and surfaces in the vast Saturn system. It mapped the atmosphere of Saturn in three dimensions to determine temperature and pressure profiles with altitude, gas composition, and the distribution of aerosols and clouds. It also measured thermal characteristics and the composition of satellite surfaces and rings.[42]\n\n\n\tIon and Neutral Mass Spectrometer (INMS)\n\tThe INMS was an in situ instrument that measured the composition of charged particles (protons and heavier ions) and neutral particles (atoms and molecules) near Titan and Saturn to learn more about their atmospheres.  The instrument used a quadrupole mass spectrometer. INMS was also intended to measure the positive ion and neutral environments of Saturn's icy satellites and rings.[42][46][47]\n\n\n\tImaging Science Subsystem (ISS)\n\tThe ISS was a remote sensing instrument that captured most images in visible light, and also some infrared images and ultraviolet images. The ISS took hundreds of thousands of images of Saturn, its rings, and its moons. The ISS had both a wide-angle camera (WAC) and a narrow-angle camera (NAC). Each of these cameras used a sensitive charge-coupled device (CCD) as its electromagnetic wave detector. Each CCD had a 1,024 square array of pixels, 12 μm on a side. Both cameras allowed for many data collection modes, including on-chip data compression, and were fitted with spectral filters that rotated on a wheel to view different bands within the electromagnetic spectrum ranging from 0.2 to 1.1 μm.[42][48]\n\n\n\tDual Technique Magnetometer (MAG)\n\tThe MAG was an in situ instrument that measured the strength and direction of the magnetic field around Saturn. The magnetic fields are generated partly by the molten core at Saturn's center. Measuring the magnetic field is one of the ways to probe the core. MAG aimed to develop a three-dimensional model of Saturn's magnetosphere, and determine the magnetic state of Titan and its atmosphere, and the icy satellites and their role in the magnetosphere of Saturn.[42][49]\n\n\n\tMagnetospheric Imaging Instrument (MIMI)\n\tThe MIMI was both an in situ and remote sensing instrument that produces images and other data about the particles trapped in Saturn's huge magnetic field, or magnetosphere. The in situ component measured energetic ions and electrons while the remote sensing component (the Ion And Neutral Camera, INCA) was an energetic neutral atom imager.[50] This information was used to study the overall configuration and dynamics of the magnetosphere and its interactions with the solar wind, Saturn's atmosphere, Titan, rings, and icy satellites.[42][51]\n\n\n\tRadar\n\tThe on-board radar was an active and passive sensing instrument that produced maps of Titan's surface. Radar waves were powerful enough to penetrate the thick veil of haze surrounding Titan. By measuring the send and return time of the signals it is possible to determine the height of large surface features, such as mountains and canyons. The passive radar listened for radio waves that Saturn or its moons may emit.[42]\n\n\n\tRadio and Plasma Wave Science instrument (RPWS)\n\tThe RPWS was an in situ instrument and remote sensing instrument that receives and measures radio signals coming from Saturn, including the radio waves given off by the interaction of the solar wind with Saturn and Titan. RPWS measured the electric and magnetic wave fields in the interplanetary medium and planetary magnetospheres. It also determined the electron density and temperature near Titan and in some regions of Saturn's magnetosphere using either plasma waves at characteristic frequencies (e.g. the upper hybrid line) or a Langmuir probe. RPWS studied the configuration of Saturn's magnetic field and its relationship to Saturn Kilometric Radiation (SKR), as well as monitoring and mapping Saturn's ionosphere, plasma, and lightning from Saturn's (and possibly Titan's) atmosphere.[42]\n\n\n\tRadio Science Subsystem (RSS)\n\tThe RSS was a remote-sensing instrument that used radio antennas on Earth to observe the way radio signals from the spacecraft changed as they were sent through objects, such as Titan's atmosphere or Saturn's rings, or even behind the Sun. The RSS also studied the compositions, pressures and temperatures of atmospheres and ionospheres, radial structure and particle size distribution within rings, body and system masses and the gravitational field. The instrument used the spacecraft X-band communication link as well as S-band downlink and Ka-band uplink and downlink.[42]\n\n\n  \nVIMS spectra taken while looking through Titan's atmosphere towards the Sun helped understand the atmospheres of exoplanets (artist's concept; May 27, 2014).\n\n\n\n\tUltraviolet Imaging Spectrograph (UVIS)\n\tThe UVIS was a remote-sensing instrument that captured images of the ultraviolet light reflected off an object, such as the clouds of Saturn and/or its rings, to learn more about their structure and composition. Designed to measure ultraviolet light over wavelengths from 55.8 to 190 nm, this instrument was also a tool to help determine the composition, distribution, aerosol particle content and temperatures of their atmospheres. Unlike other types of spectrometer, this sensitive instrument could take both spectral and spatial readings. It was particularly adept at determining the composition of gases. Spatial observations took a wide-by-narrow view, only one pixel tall and 64 pixels across. The spectral dimension was 1,024 pixels per spatial pixel. It could also take many images that create movies of the ways in which this material is moved around by other forces.[42]\n\n\n\tVisible and Infrared Mapping Spectrometer (VIMS)\n\tThe VIMS was a remote sensing instrument that captured images using visible and infrared light to learn more about the composition of moon surfaces, the rings, and the atmospheres of Saturn and Titan. It consisted of two cameras - one used to measure visible light, the other infrared. VIMS measured reflected and emitted radiation from atmospheres, rings and surfaces over wavelengths from 350 to 5100 nm, to help determine their compositions, temperatures and structures. It also observed the sunlight and starlight that passes through the rings to learn more about their structure. Scientists used VIMS for long-term studies of cloud movement and morphology in the Saturn system, to determine Saturn's weather patterns.[42]\n\n\nPlutonium power source[edit]\n\n  \nA Cassini RTG before installation\n\n\n\nBecause of Saturn's distance from the Sun, solar arrays were not feasible as power sources for this space probe.[52] To generate enough power, such arrays would have been too large and too heavy.[52] Instead, the Cassini orbiter was powered by three radioisotope thermoelectric generators (RTGs), which use heat from the decay of about 33 kg (73 lb) of plutonium-238 (in the form of plutonium dioxide) to generate direct current electricity via thermoelectrics.[52]\nThe RTGs on the Cassini mission have the same design as those used on the New Horizons, Galileo, and Ulysses space probes, and they were designed to have very long operational lifetimes.[52]\nAt the end of the nominal 11-year Cassini mission, they were still able to produce 600 to 700 watts of electrical power.[52] (One of the spare RTGs for the Cassini mission was used to power the New Horizons mission to Pluto and the Kuiper belt, which was designed and launched later.[citation needed])\n\nPower distribution was accomplished by 192 solid-state power switches (SSPS), which also functioned as circuit breakers in the event of an overload condition. The switches were developed from a combination of two semiconductor devices with switching capabilities: the MOSFET (metal-oxide-semiconductor field-effect transistor) and the ASIC (application-specific integrated circuit). This combination resulted in advanced power switches that had better performance characteristics than traditional mechanical switches.[53]\n\n\n  \nA glowing-hot plutonium pellet that is the power source of the probe's radioisotope thermoelectric generator\n\n\n\nTo gain momentum while already in flight, the trajectory of the Cassini mission included several gravitational slingshot maneuvers: two fly-by passes of Venus, one more of the Earth, and then one of the planet Jupiter. The terrestrial flyby was the final instance when the probe posed any conceivable danger to human beings. The maneuver was successful, with Cassini passing by 1,171 km (728 mi) above the Earth on August 18, 1999.[54]\nHad there been any malfunction causing the probe to collide with the Earth, NASA's complete environmental impact study estimated that, in the worst case (with an acute angle of entry in which Cassini would gradually burn up), a significant fraction of the 33 kg[37] of plutonium-238 inside the RTGs would have been dispersed into the Earth's atmosphere so that up to five billion people (i.e. almost the entire terrestrial population) could have been exposed, causing up to an estimated 5,000 additional cancer deaths over the subsequent decades[55] (0.0005 per cent, i.e. a fraction 0.000005, of a billion cancer deaths expected anyway from other causes; the product is incorrectly calculated elsewhere[56] as 500,000 deaths).  However, the chance of this happening were estimated to be less than one in one million, i.e. a chance of one person dying (assuming 5,000 deaths) as less than 1 in 200.[55]\n\n\nTelemetry[edit]\n\nThe Cassini spacecraft was capable of transmitting in several different telemetry formats. The telemetry subsystem is perhaps the most important subsystem, because without it there could be no data return.\n\nThe telemetry was developed from ground up, due to the spacecraft using a more modern set of computers than previous missions.[57] Therefore, Cassini was the first spacecraft to adopt mini-packets to reduce the complexity of the Telemetry Dictionary, and the software development process led to the creation of a Telemetry Manager for the mission.\n\nThere were around 1088 channels (in 67 mini-packets) assembled in the Cassini Telemetry Dictionary. Out of these 67 lower complexity mini-packets, 6 mini-packets contained the subsystem covariance and Kalman gain elements (161 measurements), not used during normal mission operations. This left 947 measurements in 61 mini-packets.\n\nA total of seven telemetry maps corresponding to 7 AACS telemetry modes were constructed. These modes are: (1) Record; (2) Nominal Cruise; (3) Medium Slow Cruise; (4) Slow Cruise; (5) Orbital Ops; (6) Av; (7) ATE (Attitude Estimator) Calibration. These 7 maps cover all spacecraft telemetry modes.\n\n\nHuygens probe[edit]\n\nMain article: Huygens (spacecraft)\n\n\nHuygens view of Titan's surface\n\n\nSame image with different data processing\n\n\n\n\n\nThe Huygens probe, supplied by the European Space Agency (ESA) and named after the 17th century Dutch astronomer who first discovered Titan, Christiaan Huygens, scrutinized the clouds, atmosphere, and surface of Saturn's moon Titan in its descent on January 15, 2005. It was designed to enter and brake in Titan's atmosphere and parachute a fully instrumented robotic laboratory down to the surface.[58]\n\nThe probe system consisted of the probe itself which descended to Titan, and the probe support equipment (PSE) which remained attached to the orbiting spacecraft. The PSE includes electronics that track the probe, recover the data gathered during its descent, and process and deliver the data to the orbiter that transmits it to Earth. The core control computer CPU was a redundant MIL-STD-1750A control system.\n\nThe data were transmitted by a radio link between Huygens and Cassini provided by Probe Data Relay Subsystem (PDRS). As the probe's mission could not be telecommanded from Earth because of the great distance, it was automatically managed by the Command Data Management Subsystem (CDMS). The PDRS and CDMS were provided by the Italian Space Agency (ASI).\n\nAfter Cassini's launch, it was discovered that data sent back from the probe to European Space Agency's mission control center was largely unreadable. It was determined that Cassini's receiver was unable to accurately process the changes in frequency and wavelength of the signal it would be receiving from Huygens during its descent to Titan.[14] The problem was rectified by changing the distance and angle of Cassini's trajectory to Huygens during the landing.[14][59]\n\n\n\n\nSelected events and discoveries[edit]\n\nMain article: Cassini–Huygens timeline\n\n  \nAnimation of Cassini's trajectory from 15 October 1997 to 4 May 2008 \n   Cassini–Huygens ·   Jupiter ·   Saturn ·   Earth ·   Venus ·    2685 Masursky\n\n\n\n  \nAnimation of  Cassini's trajectory around Saturn from 1 May 2004 to 15 September 2017\n    Cassini ·   Saturn ·   Enceladus ·   Titan ·   Iapetus\n\n\n\nVenus and Earth fly-bys and the cruise to Jupiter[edit]\n\n  \nPicture of the Moon during flyby\n\n\n\nThe Cassini space probe performed two gravitational-assist flybys of Venus on April 26, 1998, and June 24, 1999. These flybys provided the space probe with enough momentum to travel all the way out to the asteroid belt. At that point, the Sun's gravity pulled the space probe back into the inner Solar System.\n\nOn August 18, 1999, at 03:28 UTC, the craft made a gravitational-assist flyby of the Earth. One hour and 20 minutes before closest approach, Cassini made its closest approach to the Earth's Moon at 377,000 kilometers, and it took a series of calibration photos.\n\nOn January 23, 2000, Cassini performed a flyby of the asteroid 2685 Masursky at around 10:00 UTC. It took photos[60] in the period five to seven hours before the flyby at a distance of 1.6 million kilometers, and a diameter of 15 to 20 km was estimated for the asteroid.\n\n\nJupiter flyby[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Cassini–Huygens\" – news · newspapers · books · scholar · JSTOR  (October 2018) (Learn how and when to remove this template message)\n\n\n\n  \nA Jupiter flyby picture\n\n\n\nCassini made its closest approach to Jupiter on December 30, 2000, and made many scientific measurements.  About 26,000 images of Jupiter, its faint rings, and its moons were taken during the six-month flyby. It produced the most detailed global color portrait of the planet yet (see image at right), in which the smallest visible features are approximately 60 km (37 mi) across.[61]\n\n\n  \nCassini photographed Io transiting Jupiter on January 1, 2001.\n\n\n\nA major finding of the flyby, announced on March 6, 2003, was of Jupiter's atmospheric circulation. Dark \"belts\" alternate with light \"zones\" in the atmosphere, and scientists had long considered the zones, with their pale clouds, to be areas of upwelling air, partly because many clouds on Earth form where air is rising. But analysis of Cassini imagery showed that individual storm cells of upwelling bright-white clouds, too small to see from Earth, pop up almost without exception in the dark belts. According to Anthony Del Genio of NASA's Goddard Institute for Space Studies, \"the belts must be the areas of net-rising atmospheric motion on Jupiter, [so] the net motion in the zones has to be sinking.\"\n\nOther atmospheric observations included a swirling dark oval of high atmospheric haze, about the size of the Great Red Spot, near Jupiter's north pole. Infrared imagery revealed aspects of circulation near the poles, with bands of globe-encircling winds, with adjacent bands moving in opposite directions.\n\nThe same announcement also discussed the nature of Jupiter's rings. Light scattering by particles in the rings showed the particles were irregularly shaped (rather than spherical) and likely originate as ejecta from micrometeorite impacts on Jupiter's moons, probably Metis and Adrastea.\n\n\nTests of general relativity[edit]\n\nOn October 10, 2003, the mission's science team announced the results of tests of Albert Einstein's general theory of relativity, performed by using radio waves transmitted from the Cassini space probe.[62] The radio scientists measured a frequency shift in the radio waves to and from the spacecraft, as those passed close to the Sun. According to the general theory of relativity, a massive object like the Sun causes space-time to curve, causing a beam of radiowaves (or light, or any form of electromagnetic radiation) that passes by the Sun to travel farther (known as the Shapiro time delay).[clarification needed]\n\nAlthough some measurable deviations from the values calculated using the general theory of relativity are predicted by some unusual cosmological models, no such deviations were found by this experiment. Previous tests using radiowaves transmitted by the Viking and Voyager space probes were in agreement with the calculated values from general relativity to within an accuracy of one part in one thousand. The more refined measurements from the Cassini space probe experiment improved this accuracy to about one part in 51,000.[63] The data firmly support Einstein's general theory of relativity.[citation needed]\n\n\nNew moons of Saturn[edit]\n\n  \nThe possible formation of a new moon was captured on April 15, 2013.\n\n\n\nIn total, the Cassini mission discovered seven new moons orbiting Saturn.[64] Using images taken by Cassini, researchers discovered Methone, Pallene and Polydeuces in 2004,[65] although later analysis revealed that Voyager 2 had photographed Pallene in its 1981 flyby of the ringed planet.[66]\n\n\n  \nDiscovery photograph of moon Daphnis\n\n\n\nOn May 1, 2005, a new moon was discovered by Cassini in the Keeler gap. It was given the designation S/2005 S 1 before being named Daphnis. A fifth new moon was discovered by Cassini on May 30, 2007, and was provisionally labeled S/2007 S 4. It is now known as Anthe. A press release on February 3, 2009 showed a sixth new moon found by Cassini. The moon is approximately 1/3 of a mile (500 m) in diameter within the G-ring of the ring system of Saturn, and is now named Aegaeon (formerly S/2008 S 1).[67] A press release on November 2, 2009 mentions the seventh new moon found by Cassini on July 26, 2009. It is presently labeled S/2009 S 1 and is approximately 300 m (1000 ft) in diameter in the B-ring system.[68]\n\nOn April 14, 2014, NASA scientists reported the possible beginning of a new moon in Saturn's A Ring.[69]\n\n\nPhoebe flyby[edit]\n\n  \nCassini arrival (left) and departure mosaics of Phoebe (2004)\n\n\n\nOn June 11, 2004, Cassini flew by the moon Phoebe.  This was the first opportunity for close-up studies of this moon (Voyager 2 performed a distant flyby in 1981 but returned no detailed images). It also was Cassini's only possible flyby for Phoebe due to the mechanics of the available orbits around Saturn.[70]\n\nThe first close-up images were received on June 12, 2004, and mission scientists immediately realized that the surface of Phoebe looks different from asteroids visited by spacecraft. Parts of the heavily cratered surface look very bright in those pictures, and it is currently believed that a large amount of water ice exists under its immediate surface.\n\n\nSaturn rotation[edit]\n\nIn an announcement on June 28, 2004, Cassini program scientists described the measurement of the rotational period of Saturn.[71] Because there are no fixed features on the surface that can be used to obtain this period, the repetition of radio emissions was used. This new data agreed with the latest values measured from Earth, and constituted a puzzle to the scientists. It turns out that the radio rotational period had changed since it was first measured in 1980 by Voyager 1, and it was now 6 minutes longer. This, however, does not indicate a change in the overall spin of the planet. It is thought to be due to variations in the upper atmosphere and ionosphere at the latitudes which are magnetically connected to the radio source region.\n\n\nOrbiting Saturn[edit]\n\n  \nSaturn reached equinox in 2008, shortly after the end of the prime mission.\n\n\n\nOn July 1, 2004, the spacecraft flew through the gap between the F and G rings and achieved orbit, after a seven-year voyage.[72] It was the first spacecraft to ever orbit Saturn.\n\nThe Saturn Orbital Insertion (SOI) maneuver performed by Cassini was complex, requiring the craft to orient its High-Gain Antenna away from Earth and along its flight path, to shield its instruments from particles in Saturn's rings. Once the craft crossed the ring plane, it had to rotate again to point its engine along its flight path, and then the engine fired to decelerate the craft by 622 meters/s to allow Saturn to capture it.[73] Cassini was captured by Saturn's gravity at around 8:54 pm Pacific Daylight Time on June 30, 2004. During the maneuver Cassini passed within 20,000 km (12,000 mi) of Saturn's cloud tops.\n\nWhen Cassini was in Saturnian orbit, departure from the Saturn system was evaluated in 2008 during end of mission planning.[74][clarification needed]\n\n\nTitan flybys[edit]\n\n  \n Titan – infrared views (2004 – 2017)\n\n\n\nCassini had its first flyby of Saturn's largest moon, Titan, on July 2, 2004, a day after orbit insertion, when it approached to within 339,000 km (211,000 mi) of Titan. Images taken through special filters (able to see through the moon's global haze) showed south polar clouds thought to be composed of methane and surface features with widely differing brightness. On October 27, 2004, the spacecraft executed the first of the 45 planned close flybys of Titan when it passed a mere 1,200 kilometers above the moon.  Almost four gigabits of data were collected and transmitted to Earth, including the first radar images of the moon's haze-enshrouded surface. It revealed the surface of Titan (at least the area covered by radar) to be relatively level, with topography reaching no more than about 50 meters in altitude. The flyby provided a remarkable increase in imaging resolution over previous coverage. Images with up to 100 times better resolution were taken and are typical of resolutions planned for subsequent Titan flybys. Cassini collected pictures of Titan and the lakes of methane were similar to the lakes of Earth.\n\n\nHuygens lands on Titan[edit]\n\nMain article: Huygens (spacecraft)\n\nExternal image\t Raw images from the Huygens probe descent on 14 January 2005 (37 pages) \n© ESA/NASA/JPL/U. of Arizona. (ESA hosting)\n\n\nCassini released the Huygens probe on December 25, 2004, by means of a spring and spiral rails intended to rotate the probe for greater stability. It entered the atmosphere of Titan on January 14, 2005, and after a two-and-a-half-hour descent landed on solid ground.[5] Although Cassini successfully relayed 350 of the pictures that it received from Huygens of its descent and landing site, a software error failed to turn on one of the Cassini receivers and caused the loss of another 350 pictures. While landing, for caution, NASA loaded Huygens with 3 parachutes.[75]\n\n\nEnceladus flybys[edit]\n\n  \nView of Enceladus's Europa-like surface with the Labtayt Sulci fractures at center and the Ebony (left) and Cufa dorsa at lower left; imaged by Cassini on February 17, 2005\n\n\n\nDuring the first two close flybys of the moon Enceladus in 2005,  Cassini discovered a deflection in the local magnetic field that is characteristic for the existence of a thin but significant atmosphere. Other measurements obtained at that time point to ionized water vapor as its main constituent. Cassini also observed water ice geysers erupting from the south pole of Enceladus, which gives more credibility to the idea that Enceladus is supplying the particles of Saturn's E ring. Mission scientists began to suspect that there may be pockets of liquid water near the surface of the moon that fuel the eruptions.[76]\n\nOn March 12, 2008, Cassini made a close fly-by of Enceladus, passing within 50 km of the moon's surface.[77] The spacecraft passed through the plumes extending from its southern geysers, detecting water, carbon dioxide and various hydrocarbons with its mass spectrometer, while also mapping surface features that are at much higher temperature than their surroundings with the infrared spectrometer.[78] Cassini was unable to collect data with its cosmic dust analyzer due to an unknown software malfunction.\n\n\n\t\tWikinews has related news:\n Cassini discovers organic material on Saturn moon\n\n\nOn November 21, 2009, Cassini made its eighth flyby of Enceladus,[79] this time with a different geometry, approaching within 1,600 kilometers (990 mi) of the surface. The Composite Infrared Spectrograph (CIRS) instrument produced a map of thermal emissions from the Baghdad Sulcus 'tiger stripe'. The data returned helped create a detailed and high resolution mosaic image of the southern part of the moon's Saturn-facing hemisphere.\n\nOn April 3, 2014, nearly ten years after Cassini entered Saturn's orbit, NASA reported evidence of a large salty internal ocean of liquid water in Enceladus. The presence of an internal salty ocean in contact with the moon's rocky core, places Enceladus \"among the most likely places in the Solar System to host alien microbial life\".[80][81][82] On June 30, 2014, NASA celebrated ten years of Cassini exploring Saturn and its moons, highlighting the discovery of water activity on Enceladus among other findings.[83]\n\nIn September 2015, NASA announced that gravitational and imaging data from Cassini were used to analyze the librations of Enceladus' orbit and determined that the moon's surface is not rigidly joined to its core, concluding that the underground ocean must therefore be global in extent.[84]\n\nOn October 28, 2015, Cassini performed a close flyby of Enceladus, coming within  49 km (30 mi) of the surface, and passing through the icy plume above the south pole.[85]\n\n\nRadio occultations of Saturn's rings[edit]\n\nIn May 2005, Cassini began a series of radio occultation experiments, to measure the size-distribution of particles in Saturn's rings, and measure the atmosphere of Saturn itself. For over four months, the craft completed orbits designed for this purpose. During these experiments, it flew behind the ring plane of Saturn, as seen from Earth, and transmitted radio waves through the particles. The radio signals received on Earth were analyzed, for frequency, phase, and power shift of the signal to determine the structure of the rings.\n\n\n\n \nUpper image: visible color mosaic of Saturn's rings taken on December 12, 2004. Lower image: simulated view constructed from a radio occultation observation on May 3, 2005. Color in the lower image represents ring particle sizes.\n\n\n\nSpokes in rings verified[edit]\n\nIn images captured September 5, 2005, Cassini detected spokes in Saturn's rings,[86] previously seen only by the visual observer Stephen James O'Meara in 1977 and then confirmed by the Voyager space probes in the early 1980s.[87][88]\n\n\nLakes of Titan[edit]\n\nMain article: Lakes of Titan\n\n  \nLigeia Mare, on the left, is compared at scale to Lake Superior.\n\n\n\n  \nTitan - Evolving feature in Ligeia Mare (August 21, 2014).\n\n\n\nRadar images obtained on July 21, 2006 appear to show lakes of liquid hydrocarbon (such as methane and ethane) in Titan's northern latitudes. This is the first discovery of currently existing lakes anywhere besides on Earth. The lakes range in size from one to one-hundred kilometers across.[89]\n\nOn March 13, 2007, the Jet Propulsion Laboratory announced that it had found strong evidence of seas of methane and ethane in the northern hemisphere of Titan. At least one of these is larger than any of the Great Lakes in North America.[90]\n\n\nSaturn hurricane[edit]\n\nIn November 2006, scientists discovered a storm at the south pole of Saturn with a distinct eyewall. This is characteristic of a hurricane on Earth and had never been seen on another planet before. Unlike a terrestrial hurricane, the storm appears to be stationary at the pole. The storm is 8,000 kilometers (5,000 mi) across, and 70 kilometers (43 mi) high, with winds blowing at 560 kilometers per hour (350 mph).[91]\n\n\nIapetus flyby[edit]\n\n  \nTaken on September 10, 2007 at a distance of 62,331 km (38,731 mi) Iapetus's equatorial ridge and surface are revealed. (CL1 and CL2 filters)\n\n\n\n  \nCloseup of Iapetus surface, 2007\n\n\n\nOn September 10, 2007,  Cassini completed its flyby of the strange, two-toned, walnut-shaped moon, Iapetus. Images were taken from 1,000 miles (1,600 km) above the surface. As it was sending the images back to Earth, it was hit by a cosmic ray that forced it to temporarily enter safe mode. All of the data from the flyby were recovered.[92]\n\n\nMission extension[edit]\n\nOn April 15, 2008, Cassini received funding for a 27-month extended mission. It consisted of 60 more orbits of Saturn, with 21 more close Titan flybys, seven of Enceladus, six of Mimas, eight of Tethys, and one targeted flyby each of Dione, Rhea, and Helene.[93] The extended mission began on July 1, 2008, and was renamed the Cassini Equinox Mission as the mission coincided with Saturn's equinox.[94]\n\n\nSecond mission extension[edit]\n\nA proposal was submitted to NASA for a second mission extension (September 2010 – May 2017), provisionally named the extended-extended mission or XXM.[95] This ($60M pa) was approved in February 2010 and renamed the Cassini Solstice Mission.[96] It included Cassini orbiting Saturn 155 more times, conducting 54 additional flybys of Titan and 11 more of Enceladus.\n\n\nGreat Storm of 2010 and aftermath[edit]\n\n  \nNorthern hemisphere storm in 2011\n\n\n\nOn October 25, 2012, Cassini witnessed the aftermath of the massive Great White Spot storm that recurs roughly every 30 years on Saturn.[97] Data from the composite infrared spectrometer (CIRS) instrument indicated a powerful discharge from the storm that caused a temperature spike in the stratosphere of Saturn 83 K (83 °C; 149 °F) above normal. Simultaneously, a huge increase in ethylene gas was detected by NASA researchers at Goddard Research Center in Greenbelt, Maryland.  Ethylene is a colorless gas that is highly uncommon on Saturn and is produced both naturally and through man-made sources on Earth. The storm that produced this discharge was first observed by the spacecraft on December 5, 2010 in Saturn's northern hemisphere. The storm is the first of its kind to be observed by a spacecraft in orbit around Saturn as well as the first to be observed at thermal infrared wavelengths, allowing scientists to observe the temperature of Saturn's atmosphere and track phenomena that are invisible to the naked eye. The spike of ethylene gas that was produced by the storm reached levels that were 100 times more than those thought possible for Saturn. Scientists have also determined that the storm witnessed was the largest, hottest stratospheric vortex ever detected in the Solar System, initially being larger than Jupiter's Great Red Spot.\n\n\nVenus transit[edit]\n\nOn December 21, 2012, Cassini observed a transit of Venus across the Sun.[98] The VIMS instrument analyzed sunlight passing through the Venusian atmosphere.[98] VIMS previously observed the transit of exoplanet HD 189733 b.[98]\n\n\nThe Day the Earth Smiled[edit]\n\n  \nThe Day the Earth Smiled - Saturn with some of its moons, Earth, Venus, and Mars as visible in this Cassini montage (July 19, 2013)[99]\n\n\n\nMain article: The Day the Earth Smiled\n\nOn July 19, 2013, the probe was pointed towards Earth to capture an image of the Earth and the Moon, as part of a natural light, multi-image portrait of the entire Saturn system. The event was unique as it was the first time NASA informed the public that a long-distance photo was being taken in advance.[99][100] The imaging team said they wanted people to smile and wave to the skies, with Cassini scientist Carolyn Porco describing the moment as a chance to \"celebrate life on the Pale Blue Dot\".[101]\n\n\nRhea flyby[edit]\n\nOn February 10, 2015, the Cassini spacecraft visited Rhea more closely, coming within 47,000 km (29,000 mi).[102] The spacecraft observed the moon with its cameras producing some of the highest resolution color images yet of Rhea.[103]\n\n\nHyperion flyby[edit]\n\nCassini performed its latest flyby of Saturn's moon Hyperion on May 31, 2015, at a distance of about 34,000 km (21,000 mi).[104]\n\n\n\n\n\n\nHyperion - context view\nfrom 37,000 km (23,000 mi)\n(May 31, 2015)\n\n\nHyperion - close-up view\nfrom 38,000 km (24,000 mi)\n(May 31, 2015)\n\n\n\n\n\nDione flyby[edit]\n\nCassini performed its last flyby of Saturn's moon Dione on August 17, 2015, at a distance of about 475 km (295 mi). A previous flyby was performed on June 16.[105]\n\n\nHexagon changes color[edit]\n\nMain article: Saturn's hexagon\n\nBetween 2012 and 2016, the persistent hexagonal cloud pattern at Saturn's north pole changed from a mostly blue color to more of a golden color.[106] One theory for this is a seasonal change: extended exposure to sunlight may be creating haze as the pole swivels toward the sun.[106] It was previously noted that there was less blue color overall on Saturn between 2004 and 2008.[107]\n\n\n  \n2012 and 2016:\nhexagon color changes\n\n\n\n  \n2013 and 2017:\nhexagon color changes\n\n\n\n\n\nGrand Finale and destruction[edit]\n\nMain article: Cassini retirement\n\nCassini's end involved a series of close Saturn passes, approaching within the rings, then an entry into Saturn's atmosphere on September 15, 2017, to destroy the spacecraft.[5][10][74] This method was chosen because it is imperative to ensure protection and prevent biological contamination to any of the moons of Saturn thought to offer potential habitability.[108]\n\nIn 2008 a number of options were evaluated to achieve this goal, each with varying funding, scientific, and technical challenges.[109] A short period Saturn impact for an end of mission was rated \"excellent\" with the reasons \"D-ring option satisfies unachieved AO goals; cheap and easily achievable\" while collision with an icy moon was rated \"good\" for being \"cheap and achievable anywhere/time\".[109]\n\nOn November 29, 2016, the spacecraft performed a Titan flyby that took it to the gateway of F-ring orbits: This was the start of the Grand Finale phase culminating in its impact with the planet.[110][111] A final Titan flyby on April 22, 2017, changed the orbit again to fly through the gap between Saturn and its inner ring days later on April 26. Cassini passed about 3,100 km (1,900 mi) above Saturn's cloud layer and 320 km (200 mi) from the visible edge of the inner ring; it successfully took images of Saturn's atmosphere and began returning data the next day.[112] After a further 22 orbits through the gap, the mission was ended with a dive into Saturn's atmosphere on September 15; signal was lost at 7:55:46 AM EDT  on September 15, 2017, just 30 seconds later than predicted. It is estimated that the spacecraft burned up about 45 seconds after the last transmission.\n\nIn September 2018, NASA won an Emmy Award for Outstanding Original Interactive Program for its presentation of the Cassini mission's Grand Finale at Saturn.[113]\n\nIn January 2019, new research using data collected during Cassini's Grand Finale phase was published:\n\n\n\tThe final close passes by the rings and planet enabled scientists to measure the length of a day on Saturn: 10 hours, 33 minutes and 38 seconds.\n\tSaturn's rings are relatively new, 10 to 100 million years old. They may have formed during the age of dinosaurs on Earth.[114]\n\n\n\n\n\n\n\nCassini orbiting Saturn before Grand Finale (artist concepts)\n\n\n\n\n\n\n\n\nCassini impact site on Saturn (visual/IR mapping spectrometer; September 15, 2017)\n\n\n\n\n\n\n\nA close-up image of Saturn's atmosphere from about 3,100 km (1,900 mi) above the cloud layer, taken by Cassini on its first dive on April 26, 2017, at the start of the Grand Finale\n\n\nLast image (color) taken by Cassini as it descended toward Saturn. The image was taken 634,000 km (394,000 mi) above Saturn on September 14, 2017, at 19:59 UTC.[115]\n\n\nLast image (b&w) taken by the imaging cameras on the Cassini spacecraft (September 14, 2017, at 19:59 UTC)\n\n\n\n\n\n\nPlay media\n\nVideo (03:40) detailing Cassini's Grand Finale mission and a look back at what the mission has accomplished.\n\n\n\n\n\nMissions[edit]\n\nThe spacecraft operation was organized around a series of missions.[116]  Each is structured according to a certain amount of funding, goals, etc.[116] At least 260 scientists from 17 countries have worked on the Cassini–Huygens mission; in addition thousands of people overall worked to design, manufacture, and launch the mission.[117]\n\n\n\tPrime Mission, July 2004 through June 2008.[118][119]\n\tCassini Equinox Mission was a two-year mission extension which ran from July 2008 through September 2010.[116]\n\tCassini Solstice Mission ran from October 2010 through April 2017.[116][120] (Also known as the XXM mission.)[107]\n\tGrand Finale (spacecraft directed into Saturn), April 2017 to September 15, 2017.[120]\n\n\n\t\n\t\t\t\n\n\n\t\t\t\nSaturn by Cassini, 2016\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nCassini-Huygens by the numbers\n(September 2017)\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nFarewell to Saturn and moons (Enceladus, Epimetheus, Janus, Mimas, Pandora and Prometheus) \n (November 21, 2017)\n\n\n\t\t\t\n\n\t\t\n\n\n\nGlossary[edit]\n\n\n\tAACS: Attitude and Articulation Control Subsystem\n\tACS: Attitude Control Subsystem\n\tAFC: AACS Flight Computer\n\tARWM: Articulated Reaction Wheel Mechanism\n\tASI: Agenzia Spaziale Italiana, the Italian space agency\n\tBIU: Bus Interface Unit\n\tBOL: Beginning of Life\n\tCAM: Command Approval Meeting\n\tCDS: Command and Data Subsystem—Cassini computer that commands and collects data from the instruments\n\tCICLOPS: Cassini Imaging Central Laboratory for Operations\n\tCIMS: Cassini Information Management System\n\tCIRS: Composite Infrared Spectrometer\n\tDCSS: Descent Control Subsystem\n\tDSCC: Deep Space Communications Center\n\tDSN: Deep Space Network (large antennas around the Earth)\n\tDTSTART: Dead Time Start\n\tELS: Electron Spectrometer (part of CAPS instrument)\n\tEOM: End of Mission\n\tERT: Earth-received time, UTC of an event\n\tESA: European Space Agency\n\tESOC: European Space Operations Centre\n\tFSW: flight software\n\tHGA: High Gain Antenna\n\tHMCS: Huygens Monitoring and Control System\n\tHPOC: Huygens Probe Operations Center\n\tIBS: Ion Beam Spectrometer (part of CAPS instrument)\n\tIEB: Instrument Expanded Blocks (instrument command sequences)\n\tIMS: Ion Mass Spectrometer (part of CAPS instrument)\n\tITL: Integrated Test Laboratory—spacecraft simulator\n\tIVP: Inertial Vector Propagator\n\tLGA: Low Gain Antenna\n\tNAC: Narrow Angle Camera\n\tNASA: National Aeronautics and Space Administration, the United States of America space agency\n\tOTM: Orbit Trim Maneuver\n\tPDRS: Probe Data Relay Subsystem\n\tPHSS: Probe Harness SubSystem\n\tPOSW: Probe On-Board Software\n\tPPS: Power and Pyrotechnic Subsystem\n\tPRA: Probe Relay Antenna\n\tPSA: Probe Support Avionics\n\tPSIV: Preliminary Sequence Integration and Validation\n\tPSE: probe support equipment\n\tRCS: Reaction Control System\n\tRFS: Radio Frequency Subsystem\n\tRPX: ring plane crossing\n\tRWA: Reaction Wheel Assembly\n\tSCET: Spacecraft Event Time\n\tSCR: sequence change requests\n\tSKR: Saturn Kilometric Radiation\n\tSOI: Saturn Orbit Insertion (July 1, 2004)\n\tSOP: Science Operations Plan\n\tSSPS: Solid State Power Switch\n\tSSR: Solid State Recorder\n\tSSUP: Science and Sequence Update Process\n\tTLA: Thermal Louver Assemblies\n\tUSO: UltraStable Oscillator\n\tVRHU: Variable Radioisotope Heater Units\n\tWAC: Wide Angle Camera\n\tXXM: Extended-Extended Mission\n\n\n\n\nSee also[edit]\n\n\n\tEuroplanet, data network\n\tGalileo, Jupiter orbiter and entry probe (1989–2003)\n\tIn Saturn's Rings\n\tList of missions to the outer planets\n\tList of missions to Venus\n\tPlanetary Science Decadal Survey\n\tTimeline of Cassini–Huygens\n\n\n\n\nReferences[edit]\n\n\n\t^ a b c d \"Cassini–Huygens: Quick Facts\". NASA. Retrieved August 20, 2011.\n\n\t^ Krebs, Gunter Dirk. \"Cassini / Huygens\". Gunter's Space Page. Retrieved June 15, 2016.\n\n\n\t^ Barber, Todd J. (August 23, 2010). \"Insider's Cassini: Power, Propulsion, and Andrew Ging\". NASA. Archived from the original on April 2, 2012. Retrieved August 20, 2011.\n\n\n\t^ a b Brown, Dwayne; Cantillo, Laurie; Dyches, Preston (September 15, 2017). \"NASA's Cassini Spacecraft Ends Its Historic Exploration of Saturn\". NASA. Retrieved September 15, 2017.\n\n\n\t^ a b c d \nChang, Kenneth (September 14, 2017). \"Cassini Vanishes Into Saturn, Its Mission Celebrated and Mourned\". The New York Times. Retrieved September 15, 2017.\n\n\n\t^ \"Cassini Post-End of Mission News Conference\" (Interview). Pasadena, CA: NASA Television. September 15, 2017.\n\n\n\t^ a b c \"Outer Planets Flagship - Science Mission Directorate\". NASA.\n\n\n\t^ Corum, Jonathan (December 18, 2015). \"Mapping Saturn's Moons\". The New York Times. Retrieved December 18, 2015.\n\n\n\t^ \"Saturn Plunge Nears for Cassini Spacecraft\". NASA - National Aeronautics and Space Administration. August 29, 2017. Retrieved August 30, 2017.\n\n\n\t^ a b Overbye, Dennis (September 8, 2017). \"Cassini Flies Toward a Fiery Death on Saturn\". The New York Times. Retrieved September 10, 2017.\n\n\n\t^ Mosher, Dave (April 5, 2017). \"NASA will destroy a $3.26 billion Saturn probe this summer to protect an alien water world\". Business Insider. Retrieved May 2, 2017.\n\n\n\t^ Chang, Kenneth (May 3, 2017). \"The 'Sounds' of Space as NASA's Cassini Dives by Saturn\". The New York Times. Retrieved May 3, 2017.\n\n\n\t^ \"Cassini's First Dive Between Saturn and its Rings\".\n\n\n\t^ a b c \"'Our Saturn years' - Cassini-Huygens' epic journey to the ringed planet, told by the people who made it happen\". BBC News. Retrieved September 14, 2017.\n\n\n\t^ \"Cassini-Huygens\". Agenzia Spaziale Italiana. December 2008.\n\n\n\t^ Miller, Edward A.; Klein, Gail; Juergens, David W.; Mehaffey, Kenneth; Oseas, Jeffrey M.;  et al. (October 1996). \"The Visual and Infrared Mapping Spectrometer for Cassini\" (PDF). Proceedings of the SPIE: Cassini/Huygens: A Mission to the Saturnian Systems. Cassini/Huygens: A Mission to the Saturnian Systems. 2803: 206–220. Bibcode:1996SPIE.2803..206M. doi:10.1117/12.253421.\n\n\n\t^ Reininger, Francis M.; Dami, Michele; Paolinetti, Riccardo; Pieri, Silvano; Falugiani, Silvio;  et al. (June 1994). \"Visible Infrared Mapping Spectrometer--visible channel (VIMS-V)\". Proceedings of the SPIE: Instrumentation in Astronomy VIII. Instrumentation in Astronomy VIII. 2198: 239–250. Bibcode:1994SPIE.2198..239R. doi:10.1117/12.176753.\n\n\n\t^ a b Brown, Dwayne; Martinez, Carolina (April 15, 2008). \"NASA Extends Cassini's Grand Tour of Saturn\". NASA / Jet Propulsion Laboratory. Retrieved August 14, 2017.\n\n\n\t^ \"Cassini-Huygens mission objectives\". March 27, 2012.\n\n\n\t^ \"Mission Summary\". sci.esa.int. Retrieved February 3, 2017.\n\n\n\t^ \"Cassini Solstice Mission-FAQs\". Jet Propulsion Laboratory. Retrieved January 24, 2014.\n\n\n\t^ \"NASA Extends Cassini Probe's Mission at Saturn\". Space.com. April 15, 2008. Retrieved September 1, 2010.\n\n\n\t^ Moskowitz, Clara (February 3, 2010). \"Cassini Saturn Probe Gets 7-Year Life Extension\". Space.com. Retrieved August 20, 2011.\n\n\n\t^ Ride, Sally K. (August 1987). Leadership and America's Future in Space (Report). NASA. p. 27. NASA-TM-89638; N87-30248. Archived (PDF) from the original on May 1, 2018.\n\n\n\t^ Ip, Wing; Gautier, Daniel; Owen, Tobias (April 16, 2004). The genesis of Cassini-Huygens. Titan - from Discovery to Encounter: International Conference on the occasion of the 375th birthday of Christiaan Huygens. April 13–17, 2004. ESTEC, Noordwijk, the Netherlands. p. 218. Bibcode:2004ESASP1278..211I.\n\n\n\t^ Rensberger, Royce (November 28, 1988). \"EUROPEANS ENDORSE JOINT SPACE MISSION\". Retrieved September 15, 2017.\n\n\n\t^ Morgan, Dan (October 18, 1989). \"BIG INCREASES APPROVED FOR HOUSING, VETS' CARE\". Retrieved September 15, 2017.\n\n\n\t^ William J. Broad (September 8, 1997). \"Saturn Mission's Use of Plutonium Fuel Provokes Warnings of Danger\". The New York Times. Retrieved September 1, 2010.\n\n\n\t^ \"Dozens arrested in protest of plutonium-fueled space mission\". CNN. October 4, 1997. Retrieved September 1, 2010.\n\n\n\t^ Christopher Boyd (October 5, 1997). \"27 Arrested at Protest of Cassini\". Orlando Sentinel. Retrieved September 1, 2010.\n\n\n\t^ \"Cassini Spacecraft Nears Liftoff, but Critics Object to its Risks\". The New York Times. October 12, 1997. Retrieved September 1, 2010.\n\n\n\t^ Daniel Sorid (August 18, 1999). \"Activists Stand their Ground, Even As Cassini Sails Safely Away\". Space.com. Retrieved September 1, 2010.\n\n\n\t^ \"Cassini spacecraft\". European Space Agency. Retrieved April 5, 2018.\n\n\n\t^ \"Cassini Spacecraft and Huygens Probe\" (PDF). NASA/Jet Propulsion Laboratory. May 1999. JPL 400-777.\n\n\n\t^ Coustenis, Athena; Taylor, Fredric W. (2008). Titan: Exploring an Earthlike World. Series on Atmospheric, Oceanic and Planetary Physics. 4 (2nd ed.). World Scientific. p. 75. ISBN 978-981-270-501-3.\n\n\n\t^ Michael W Leeds: AIAA 96-2864 Development of the Cassini Propulsion Subsystem. 32nd AIAA/ASME/SAE/ASEE Joint Propulsion Conference, July 1, 1996, retrieved January 8, 2016\n\n\t^ a b Ruslan Krivobok: Russia to develop nuclear-powered spacecraft for Mars mission. Ria Novosti, November 11, 2009, retrieved January 2, 2011\n\n\t^ \"Signatures from Earth Board Spacecraft to Saturn\". Cassini: The Grand Finale. Retrieved October 10, 2017.\n\n\n\t^ \"616,400 Signatures\". Cassini: The Grand Finale. Retrieved October 10, 2017.\n\n\n\t^ Overbye, Dennis (August 6, 2014). \"Storm Chasing on Saturn\". The New York Times. Retrieved August 6, 2014.\n\n\n\t^ a b \"Cassini: Mission to Saturn: Cassini Orbiter\".\n\n\n\t^ a b c d e f g h i j k l \"Cassini Orbiter Instruments\". Saturn.jpl.nasa.gov. Retrieved August 20, 2011.\n\n\n\t^ \"CAPS team page\". Caps.space.swri.edu. Retrieved August 20, 2011.\n\n\n\t^ \"Cassini Significant Events newsletter 2012 03 26\". JPL. Archived from the original on September 12, 2015. Retrieved December 13, 2018.\n\n\n\t^ Flux and composition of interstellar dust at Saturn from Cassini's Cosmic Dust Analyzer. N. Altobelli1,\nF. Postberg, K. Fiege, M. Trieloff, H. Kimura, V. J. Sterken. Science April 15, 2016:\nVol. 352, Issue 6283, pp. 312-318. doi:10.1126/science.aac6397\n\n\t^ Waite J. H.; Lewis S.; Kasprzak W. T.; Anicich V. G.; Block B. P.; Cravens T. E.; Fletcher G. G.; Ip W. H.; Luhmann J. G.; McNutt R. L.; Niemann H. B.; Parejko J. K.; Richards J. E.; Thorpe R. L.; Walter E. M.; Yelle R. V. (2004). \"The Cassini ion and neutral mass spectrometer (INMS) investigation\" (PDF). Space Science Reviews. 114 (1–4): 113–231. Bibcode:2004SSRv..114..113W. doi:10.1007/s11214-004-1408-2. hdl:2027.42/43764.\n\n\n\t^ \"INMS team page\". Inms.space.swri.edu. Retrieved August 20, 2011.\n\n\n\t^ Porco C. C.; West R. A.; Squyres S.; McEwen A.; Thomas P.; Murray C. D.; Delgenio A.; Ingersoll A. P.; Johnson T. V.; Neukum G.; Veverka J.; Dones L.; Brahic A.; Burns J. A.; Haemmerle V.; Knowles B.; Dawson D.; Roatsch T.; Beurle K.; Owen W. (2004). \"Cassini Imaging Science: Instrument characteristics and anticipated scientific investigations at Saturn\". Space Science Reviews. 115 (1–4): 363–497. Bibcode:2004SSRv..115..363P. doi:10.1007/s11214-004-1456-7.\n\n\n\t^ Dougherty M. K.; Kellock S.; Southwood D. J.; Balogh A.; Smith E. J.; Tsurutani B. T.; Gerlach B.; Glassmeier K. H.; Gleim F.; Russell C. T.; Erdos G.; Neubauer E. M.; Cowley S. W. H. (2004). \"The Cassini magnetic field investigation\" (PDF). Space Science Reviews. 114 (1–4): 331–383. Bibcode:2004SSRv..114..331D. CiteSeerX 10.1.1.454.6826. doi:10.1007/s11214-004-1432-2.\n\n\n\t^ \"Mimi Inca\". Sd-www.jhuapl.edu. Retrieved August 20, 2011.\n\n\n\t^ Krimigis S. M.; Mitchell D. G.; Hamilton D. C.; Livi S.; Dandouras J.; Jaskulek S.; Armstrong T. P.; Boldt J. D.; Cheng A. F.; Gloeckler G.; Hayes J. R.; Hsieh K. C.; Ip W. H.; Keath E. P.; Kirsch E.; Krupp N.; Lanzerotti L. J.; Lundgren R.; Mauk B. H.; McEntire R. W.; Roelof E. C.; Schlemm C. E.; Tossman B. E.; Wilken B.; Williams D. J. (2004). \"Magnetosphere imaging instrument (MIMI) on the Cassini mission to Saturn/Titan\". Space Science Reviews. 114 (1–4): 233–329. Bibcode:2004SSRv..114..233K. doi:10.1007/s11214-004-1410-8.\n\n\n\t^ a b c d e \"Why the Cassini Mission Cannot Use Solar Arrays\" (PDF). NASA/JPL. December 6, 1996. Archived from the original (PDF) on February 26, 2015. Retrieved March 21, 2014.\n\n\n\t^ Meltzer, Michael (2015). The Cassini-Huygens Visit to Saturn: An Historic Mission to the Ringed Planet. Springer. p. 70. ISBN 9783319076089.\n\n\n\t^ \"Cassini–Huygens:Quick Facts\". Saturn.jpl.nasa.gov. Retrieved July 1, 2014.\n\n\n\t^ a b Cassini Final Environmental Impact Statement Archived June 8, 2011, at the Wayback Machine, see Chapter 2 Archived January 19, 2012, at the Wayback Machine, Table 2-8\n\n\t^ Friedensen, Victoria Pidgeon (1999). \"Chapter 3\" (PDF). Protest Space: A Study of Technology Choice, Perception of Risk, and Space Exploration (Master of Science thesis). Archived from the original (PDF) on March 6, 2002. Retrieved February 28, 2011.\n\n\n\t^ Kan, Edwin P. (November 1994). Process and Methodology of Developing Cassini G&C Telemetry Dictionary (PDF). Third International Symposium on Space Mission Operations and Ground Data Systems. Greenbelt. Archived from the original (PDF) on May 10, 2013.\n\n\n\t^ How to Land on Titan Archived July 21, 2011, at the Wayback Machine, Ingenia, June 2005\n\n\t^ How Huygens avoided disaster, James Oberg, The Space Review, January 17, 2005.\n\n\t^ \"New Cassini Images of Asteroid Available\" (Press release). JPL. February 11, 2000. Archived from the original on June 12, 2010. Retrieved October 15, 2010.\n\n\n\t^ Hansen C. J.; Bolton S. J.; Matson D. L.; Spilker L. J.; Lebreton J. P. (2004). \"The Cassini–Huygens flyby of Jupiter\". Icarus. 172 (1): 1–8. Bibcode:2004Icar..172....1H. doi:10.1016/j.icarus.2004.06.018.\n\n\n\t^ Bertotti B.; Iess L.; Tortora P. (2003). \"A test of general relativity using radio links with the Cassini spacecraft\". Nature. 425 (6956): 374–376. Bibcode:2003Natur.425..374B. doi:10.1038/nature01997. PMID 14508481.\n\n\n\t^ This is currently the best measurement of post-Newtonian parameter γ; the result γ = 1 + (2.1 ± 2.3) × 10−5 agrees with the prediction of standard General Relativity, γ = 1\n\n\t^ Meltzer 2015, pp. 346-351\n\n\t^ \"Newest Saturn moons given names\", BBC, February 28, 2005, retrieved September 1, 2016\n\n\n\t^ Spitale, J. N.; Jacobson, R. A.; Porco, C. C.; Owen, W. M., Jr. (2006). \"The orbits of Saturn's small satellites derived from combined historic and Cassini imaging observations\" (PDF). The Astronomical Journal. 132 (2): 692–710. Bibcode:2006AJ....132..692S. doi:10.1086/505206.\n\n\n\t^ \"Surprise! Saturn has small moon hidden in ring\". NBC News. March 3, 2009. Archived from the original on December 17, 2013. Retrieved August 29, 2015.\n\n\n\t^ Daniel W. E. Green (November 2, 2009). \"IAU Circular No. 9091\". Ciclops.org. Retrieved August 20, 2011.\n\n\n\t^ Platt, Jane; Brown, Dwayne (April 14, 2014). \"NASA Cassini Images May Reveal Birth of a Saturn Moon\". NASA. Retrieved April 14, 2014.\n\n\n\t^ Porco C. C.; Baker E.; Barbara J.; Beurle K.; Brahic A.; Burns J. A.; Charnoz S.; Cooper N.; Dawson D. D.; Del Genio A. D.; Denk T.; Dones L.; Dyudina U.; Evans M. W.; Giese B.; Grazier K.; Heifenstein P.; Ingersoll A. P.; Jacobson R. A.; Johnson T. V.; McEwen A.; Murray C. D.; Neukum G.; Owen W. M.; Perry J.; Roatsch T.; Spitale J.; Squyres S.; Thomas P. C.; Tiscareno M.; Turtle E.; Vasavada A. R.; Veverka J.; Wagner R.; West R. (2005). \"Cassini Imaging Science: Initial results on Phoebe and Iapetus\" (PDF). Science. 307 (5713): 1237–1242. Bibcode:2005Sci...307.1237P. doi:10.1126/science.1107981. PMID 15731440.\n\n\n\t^ Carolina Martinez; Gary Galluzzo (June 28, 2004). \"Scientists Find That Saturn's Rotation Period is a Puzzle\". Jpl.Nasa.Gov. Retrieved August 20, 2011.\n\n\n\t^ Porco, Carolyn C. (2007). \"Cassini, the first one thousand days\". American Scientist. 95 (4): 334–341. doi:10.1511/2007.66.334.\n\n\n\t^ \"Cassini/Huygens: Heavily Instrumented Flight Systems Approaching Saturn and Titan\" (PDF). Archived from the original (PDF) on August 7, 2011. Retrieved August 20, 2011.\n\n\n\t^ a b \"Spilker_OPAG_0408.ppt\" (PDF). Retrieved August 20, 2011.\n\n\n\t^ \"Huygens Probe Returns First Images of Titan's Surface\". Retrieved January 9, 2015.\n\n\n\t^ Jia-Rui Cook; Dyawne C. Brown (July 6, 2011). \"Cassini Spacecraft Captures Images and Sounds of Big Saturn Storm\". Saturn.jpl.nasa.gov. Archived from the original on March 3, 2008. Retrieved August 20, 2011.\n\n\n\t^ Cassini Spacecraft to Dive Into Water Plume of Saturn Moon NASA.gov, March 10, 2008\n\n\t^ Cassini Tastes Organic Material at Saturn's Geyser Moon NASA, March 26, 2008\n\n\t^ \"Cassini Sends Back Images of Enceladus as Winter Nears\". Archived from the original on March 11, 2016. Retrieved December 13, 2018.\n\n\n\t^ Amos, Jonathan (April 3, 2014). \"Saturn's Enceladus moon hides 'great lake' of water\". BBC News. Retrieved April 7, 2014.\n\n\n\t^ Iess, L.; Stevenson, D.J.; Parisi, M.; Hemingway, D.; Jacobson, R.A.; Lunine, J.I.; Nimmo, F.; Armstrong, J.w.; Asmar, S.w.; Ducci, M.; Tortora, P. (April 4, 2014). \"The Gravity Field and Interior Structure of Enceladus\" (PDF). Science. 344 (6179): 78–80. Bibcode:2014Sci...344...78I. doi:10.1126/science.1250551. PMID 24700854.\n\n\n\t^ Sample, Ian (April 3, 2014). \"Ocean discovered on Enceladus may be best place to look for alien life\". The Guardian. Retrieved April 3, 2014.\n\n\n\t^ Dyches, Preston; Clavin, Whitney (June 25, 2014). \"Cassini Celebrates 10 Years Exploring Saturn\". NASA. Retrieved June 25, 2014.\n\n\n\t^ \"Cassini Finds Global Ocean in Saturn's Moon Enceladus\". Retrieved September 14, 2015.\n\n\n\t^ \"Deepest-Ever Dive Through Enceladus Plume Completed\". Jet Propulsion Laboratory. October 28, 2015. Retrieved October 29, 2015.\n\n\n\t^ Nemiroff, R.; Bonnell, J., eds. (November 27, 2006). \"Mysterious Spokes in Saturn's Rings\". Astronomy Picture of the Day. NASA. Retrieved December 5, 2013.\n\n\n\t^ \"Catalog Page for PIA05380: Approach to Saturn\". Photojournal.jpl.nasa.gov. NASA Jet Propulsion Laboratory. February 26, 2004. Retrieved August 20, 2011.\n\n\n\t^ \"The Rings of Saturn\". phys.utk.edu. University of Tennessee in Knoxville. Archived from the original on December 12, 2013. Retrieved December 5, 2013.\n\n\n\t^ \"Cassini Spacecraft Captures Images and Sounds of Big Saturn Storm\". Saturn.jpl.nasa.gov. July 6, 2011. Archived from the original on April 30, 2008. Retrieved August 20, 2011.\n\n\n\t^ \"Cassini-Huygens: News\". Saturn.jpl.nasa.gov. Archived from the original on May 8, 2008. Retrieved August 20, 2011.\n\n\n\t^ \"Huge 'hurricane' rages on Saturn\". BBC News. November 10, 2006. Retrieved November 10, 2006.\n\n\n\t^ \"Cassini Probe Flies by Iapetus, Goes into Safe Mode\". Fox News. September 14, 2007. Archived from the original on October 21, 2012. Retrieved September 17, 2007.\n\n\n\t^ \"Cassini's Tour of the Saturn System\". Planetary Society. Archived from the original on April 25, 2009. Retrieved February 26, 2009.\n\n\n\t^ \"Cassini To Earth: 'Mission Accomplished, But New Questions Await!'\". Science Daily. June 29, 2008. Retrieved January 5, 2009.\n\n\n\t^ John Spencer (February 24, 2009). \"Cassini's proposed extended-extended mission tour\". Planetary.org. Retrieved August 20, 2011.\n\n\n\t^ NASA Extends Cassini's Tour of Saturn, Continuing International Cooperation for World Class Science Archived April 13, 2016, at the Wayback Machine. NASA / California Institute of Technology / Jet Propulsion Laboratory, February 3, 2010, retrieved January 2, 2011\n\n\t^ \"NASA - NASA Spacecraft Sees Huge Burp At Saturn After Large Storm\".\n\n\n\t^ a b c \"Cassini Instrument Learns New Tricks\".\n\n\n\t^ a b Overbye, Dennis (November 12, 2013). \"The View From Saturn\". The New York Times. Retrieved November 12, 2013.\n\n\n\t^ \"Cassini probe takes image of Earth from Saturn orbit\". BBC News. July 23, 2013. Retrieved July 24, 2013.\n\n\n\t^ \"Smile! Cassini sets up photo of Earth\". BBC News. July 19, 2013. Retrieved July 24, 2013.\n\n\n\t^ \"Saturn Tour Dates: 2015\". NASA / Jet Propulsion Laboratory. 2015. Archived from the original on May 18, 2015. Retrieved May 2, 2017.\n\n\n\t^ \"Return to Rhea (NASA Cassini Saturn Mission Images)\". Cassini Imaging Central Laboratory for Operations. March 30, 2015. PIA19057.\n\n\n\t^ \"Cassini Prepares for Last Up-close Look at Hyperion\". NASA / Jet Propulsion Laboratory. May 28, 2015. Retrieved May 29, 2015.\n\n\n\t^ \"Cassini to Make Last Close Flyby of Saturn Moon Dione\". NASA / Jet Propulsion Laboratory. August 13, 2015. Retrieved August 20, 2015.\n\n\n\t^ a b \"Changing Colors in Saturn's North\".\n\n\n\t^ a b Spencer, John (February 24, 2009). \"Cassini's Proposed Extended-Extended Mission Tour\". The Planetary Society.\n\n\n\t^ Blabber, Phillipa; Verrecchia, Angélique (April 3, 2014). \"Cassini-Huygens: Preventing Biological Contamination\". Space Safety Magazine. Retrieved August 1, 2015.\n\n\n\t^ a b Bailey, Frederick; Rabstejnek, Paul. \"Cassini Mission and Results\". Oglethorpe University. Archived from the original on February 19, 2008.\n\n\n\t^ \"2016 Saturn Tour Highlights\".\n\n\n\t^ Lewin, Sarah. \"Cassini Mission Kicks Off Finale at Saturn\". Scientific American. Retrieved November 30, 2016.\n\n\n\t^ Dyches, Preston; Brown, Dwayne; Cantillo, Laurie (April 27, 2017). \"NASA Spacecraft Dives Between Saturn and Its Rings\". NASA / Jet Propulsion Laboratory. Retrieved May 2, 2017.\n\n\n\t^ McGregor, Veronica; Brown, Dwight; Wendel, JoAnna (September 10, 2018). \"And the Emmy goes to: Cassini's Grand Finale\". NASA. Retrieved September 10, 2018.\n\n\n\t^ \"Overview | Cassini\". Solar System Exploration: NASA Science. Retrieved January 25, 2019.\n\n\n\t^ Loff, Sarah (September 15, 2017). \"Impact Site: Cassini's Final Image\". NASA. Retrieved September 17, 2017.\n\n\n\t^ a b c d \"Cassini Equinox Mission\". European Space Agency. October 18, 2011. Retrieved April 15, 2017.\n\n\n\t^ \"Cassini: Mission to Saturn: The Team\". NASA.\n\n\n\t^ \"Cassini Tour of Saturn and its Moons\". European Space Agency. October 7, 2008. Retrieved April 15, 2017.\n\n\n\t^ \"Start of the Cassini Equinox Mission\". European Space Agency. June 30, 2008. Retrieved April 15, 2017.\n\n\n\t^ a b \"The Grand Finale Toolkit\". NASA. Retrieved April 15, 2017.\n\n\n\n\n\nFurther reading[edit]\n\n\tRalph Lorenz (2017). NASA/ESA/ASI Cassini-Huygens: 1997 onwards (Cassini orbiter, Huygens probe and future exploration concepts) (Owners' Workshop Manual). Haynes Manuals, UK. ISBN 978-1785211119.\n\n\tKarl Grossman (1997). The Wrong Stuff: The Space Program's Nuclear Threat to Our Planet. Common Courage Press. ISBN 978-1-56751-125-3.\n\n\tDavid M. Harland (2002). Mission to Saturn: Cassini and the Huygens Probe. Springer-Verlag. ISBN 978-1-85233-656-1.\n\n\tRalph Lorenz; Jacqueline Mitton (2002). Lifting Titan's Veil: Exploring the Giant Moon of Saturn. Cambridge University Press. ISBN 978-0-521-79348-3.\n\n\tMeltzer, Michael (2015). The Cassini-Huygens Visit to Saturn: A Historic Mission to the Ringed Planet. Cham: Springer International Publishing Switzerland. ISBN 978-3-319-07608-9.\n\n\tIrene Klotz (August 31, 2017). \"Cassini's Ringside Seat At Saturn Coming To An End\". Aviation Week & Space Technology. An epic journey of discovery at Saturn ends, leaving mysteries for future explorers.\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Cassini-Huygens.\n\n\nOfficial websites\n\n\n\tCassini-Huygens website by the Jet Propulsion Laboratory\n\tCassini-Huygens website by NASA\n\tCassini-Huygens website by the European Space Agency\n\tCassini-Huygens website by NASA's Solar System Exploration division\n\n\nMedia and telecommunications\n\n\n\tCICLOPS.org, Cassini imaging homepage\n\tCassini Hall of Fame, image galleries by the Jet Propulsion Laboratory\n\t\"Cassini at Saturn\", a YouTube playlist by the Jet Propulsion Laboratory\n\t\"Titan Touchdown\", Depiction of Huygens descent and landing\n\n\n\tDESCANSO DSN Telecom information\n\tIn Saturn's Rings, film animated from millions of still photographs\n\tAround Saturn, film animated from more than 200,000 images taken by Cassini from 2004 to 2012\n\tWebGL-based 3D rendering of Cassini\n\tCassini image album by Kevin M. Gill\n\thttps://www.nasa.gov/sites/default/files/atoms/files/the_saturn_system.pdf - THROUGH THE EYES OF CASSINI\n\n\n\t\tv\n\tt\n\te\n\n\nCassini–Huygens\n\n\tSpacecraft\t\n\tCassini–Huygens (Saturn orbiter)\n\tHuygens (Titan lander)\n\n\n\n\t\n\n\tMission\t\n\tTimeline\n\tThe Day the Earth Smiled\n\tEnd of mission\n\n\n\n\n\tNamesakes\t\n\tGiovanni Domenico Cassini\n\tChristiaan Huygens\n\n\n\n\n\t\n\tSaturn\n\tRings of Saturn\n\n\n\tMoons of Saturn\n\tTitan (moon)\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft missions to Saturn\n\n\tPast\t\n\tFlybys\t\n\tPioneer 11\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\tOrbiters\t\n\tCassini–Huygens\n\ttimeline\n\tretirement\n\n\n\n\n\n\n\tLanders\t\n\tHuygens (on Titan)\n\n\n\n\n\n\n\t\n\n\n\tProposed\t\n\tto Saturn and rings\t\n\tKronos\n\tSaturn Atmospheric Entry Probe\n\tSPRITE\n\tTitan Saturn System Mission\n\n\n\n\n\tto Enceladus\t\n\tEnceladus Life Finder\n\tEnceladus Explorer\n\tLife Investigation For Enceladus\n\n\n\n\n\tto Titan\t\n\tAVIATR\n\tOceanus\n\tTALISE\n\tTitan Mare Explorer\n\n\n\n\n\tto several moons\t\n\tExplorer of Enceladus and Titan\n\tJourney to Enceladus and Titan\n\n\n\n\n\n\n\n\tPlanned\t\n\tDragonfly (to Titan, 2026)\n\n\n\n\n\t\n\tThere are no ongoing missions to Saturn\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n21st-century space probes\n\n\tActive space probes\n(deep space missions)\t\n\tMoon\t\n\tARTEMIS\n\tChandrayaan-2\n\tChang'e 3\n\tChang'e 4 (Yutu-2)\n\tLunar Reconnaissance Orbiter\n\n\n\n\n\tMars\t\n\tExoMars TGO\n\tInSight\n\tMars Orbiter Mission\n\tMars Express\n\t2001 Mars Odyssey\n\tMAVEN\n\tMRO\n\tMSL Curiosity\n\n\n\n\n\tVenus\t\n\tAkatsuki\n\n\n\n\n\tMinor planet\t\n\tChang'e 2\n\tHayabusa2 / MINERVA-II\n\tNew Horizons\n\tOSIRIS-REx\n\n\n\n\n\tSolar science\t\n\tACE\n\tDSCOVR\n\tParker Solar Probe\n\tSOHO\n\tSTEREO\n\tWind\n\n\n\n\n\tOthers\t\n\tBepiColombo\n\tGaia\n\tJuno\n\tTHEMIS\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\n\n\n\tCompleted after 2000\n(by termination date)\t\n\t2000s\t\n\t2001\n\tNEAR Shoemaker\n\tDeep Space 1\n\n\n\t2003\n\tPioneer 10\n\tGalileo\n\tNozomi\n\n\n\t2004\n\tGenesis\n\n\n\t2005\n\tHuygens\n\n\n\t2006\n\tMars Global Surveyor\n\n\n\t2008\n\tPhoenix\n\n\n\t2009\n\tChang'e 1\n\tUlysses\n\tChandrayaan-1\n\tSELENE\n\tLCROSS\n\n\n\n\n\n\n\t2010s\t\n\t2010\n\tHayabusa\n\tMER Spirit\n\n\n\t2011\n\tStardust\n\n\n\t2012\n\tGRAIL\n\n\n\t2013\n\tDeep Impact\n\n\n\t2014\n\tLADEE\n\tVenus Express\n\tChang'e 5-T1\n\n\n\t2015\n\tMESSENGER\n\tPROCYON\n\tIKAROS\n\n\n\t2016\n\tRosetta / Philae\n\tYutu\n\tExoMars Schiaparelli\n\n\n\t2017\n\tLISA Pathfinder\n\tCassini\n\n\n\t2018\n\tMASCOT\n\tDawn\n\tLongjiang-1\n\n\n\t2019\n\tMarCO\n\tMER Opportunity\n\tBeresheet\n\tLongjiang-2\n\tVikram / Pragyan\n\n\n\n\n\n\n\n\n\n\t\n\tList of Solar System probes\n\tList of lunar probes\n\tList of space telescopes\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nJet Propulsion Laboratory\n\n\tCurrent missions\t\n\tACRIMSAT\n\tASTER\n\tAtmospheric infrared sounder (AIRS)\n\tDeep Space Atomic Clock\n\tGRACE-FO\n\tInSight\n\tJuno\n\tKeck observatory\n\tLarge Binocular Telescope (LBT)\n\tMars Odyssey\n\tMars Reconnaissance Orbiter (MRO)\n\tMars Science Laboratory (MSL)\n\tMicrowave limb sounder (MLS)\n\tMulti-angle imaging spectroradiometer (MISR)\n\tSpitzer Space Telescope\n\tTropospheric Emission Spectrometer (TES)\n\tVoyager program\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\n\n\tPlanned\t\n\tMars 2020 rover\n\tPsyche\n\tEuclid\n\tEuropa Clipper\n\tLunar Flashlight\n\tNEA Scout\n\tSPHEREx\n\tSWOT\n\tWFIRST\n\n\n\n\n\tProposed\t\n\tEuropa Lander\n\tFINESSE\n\n\n\n\n\tPast\t\n\tCassini-Huygens\n\tDawn\n\tDeep Impact\n\tDeep Space 1\n\tDeep Space 2\n\tExplorers\n\tGALEX\n\tGalileo\n\tGenesis\n\tGRACE\n\tHerschel\n\tIRAS\n\tJason-1\n\tKepler\n\tMagellan\n\tMariner\n\tMars Climate Orbiter\n\tMars Cube One (MarCO)\n\tMars Observer\n\tMars Pathfinder\n\tMars Polar Lander\n\tMars Global Surveyor\n\tMars Exploration Rover (MER)\n\tNSCAT\n\tPhoenix\n\tPioneer\n\tQuikSCAT\n\tRanger\n\tRosetta\n\tSeasat\n\tShuttle Radar Topography Mission (SRTM)\n\tSolar Mesosphere Explorer (SME)\n\tSpaceborne Imaging Radar (SIR)\n\tStardust\n\tSurveyor\n\tSVLBI\n\tTOPEX/Poseidon\n\tUlysses\n\tViking\n\tWide Field and Planetary Camera (WFPC)\n\tWide Field Infrared Explorer (WIRE)\n\n\n\n\n\tCancelled missions\t\n\tAstrobiology Field Laboratory (AFL)\n\tMars Astrobiology Explorer-Cacher (MAX-C)\n\n\n\n\n\tRelated organizations\t\n\tNASA\n\tCaltech\n\tNASA Deep Space Network\n\tGoldstone Complex\n\tTable Mountain Observatory\n\tSolar System Ambassadors\n\n\n\n\n\t\n\tJet Propulsion Laboratory Science Division\n\tNear-Earth Asteroid Tracking\n\tSpace Flight Operations Facility\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNASA\n\n\tPolicy and history\t\n\tHistory\t\n\tNACA (1915)\n\tNational Aeronautics and Space Act (1958)\n\tSpace Task Group (1958)\n\tPaine (1986)\n\tRogers (1986)\n\tRide (1987)\n\tSpace Exploration Initiative (1989)\n\tAugustine (1990)\n\tU.S. National Space Policy (1996)\n\tCFUSAI (2002)\n\tCAIB (2003)\n\tVision for Space Exploration (2004)\n\tAldridge (2004)\n\tAugustine (2009)\n\n\n\n\n\tGeneral\t\n\tSpace Race\n\tAdministrator and Deputy Administrator\n\tChief Scientist\n\tAstronaut Corps\n\tRanks and positions\n\tChief\n\n\n\tBudget\n\tSpin-off technologies\n\tNASA TV\n\tNASA Social\n\tLaunch Services Program\n\tMercury Control Center\n\tKennedy Space Center\n\tVehicle Assembly Building\n\tLaunch Complex 39\n\tLaunch Control Center\n\tOperations and Checkout Building\n\n\n\tJohnson Space Center\n\tMission Control\n\tLunar Sample Laboratory\n\n\n\n\n\n\n\n\n\t\n\n\tRobotic programs\t\n\tPast\t\n\tHitchhiker\n\tMariner\n\tMariner Mark II\n\tMESUR\n\tMars Surveyor '98\n\tNew Millennium\n\tLunar Orbiter\n\tPioneer\n\tPlanetary Observer\n\tRanger\n\tSurveyor\n\tViking\n\tProject Prometheus\n\tMars Scout\n\tMars Exploration Rover\n\n\n\n\n\tCurrent\t\n\tLiving With a Star\n\tLunar Precursor Robotic Program\n\tEarth Observing System\n\tGreat Observatories program\n\tExplorer\n\tSmall explorer\n\tVoyager\n\tDiscovery\n\tNew Frontiers\n\tSolar Terrestrial Probes\n\tCommercial Lunar Payload Services\n\n\n\n\n\n\n\n\tHuman spaceflight\nprograms\t\n\tPast\t\n\tX-15 (suborbital)\n\tMercury\n\tGemini\n\tApollo\n\tApollo–Soyuz Test Project (with the Soviet space program)\n\tSkylab\n\tSpace Shuttle\n\tShuttle–Mir (with Roscosmos State Corporation)\n\tConstellation\n\n\n\n\n\tCurrent\t\n\tInternational Space Station\n\tCommercial Orbital Transportation Services\n\tCommercial Crew Development\n\tOrion\n\tArtemis\n\tLunar Gateway\n\n\n\n\n\n\n\n\tIndividual featured\n missions\n(human and robotic)\t\n\tPast\t\n\tCOBE\n\tMercury 3\n\tMercury-Atlas 6\n\tMagellan\n\tPioneer 10\n\tPioneer 11\n\tGalileo\n\tGALEX\n\tGRAIL\n\tWMAP\n\tSpace Shuttle\n\tSojourner rover\n\tSpirit rover\n\tLADEE\n\tMESSENGER\n\tAquarius\n\tCassini\n\tDawn\n\tKepler space telescope\n\tOpportunity rover\n\tRHESSI\n\tobserved\n\n\n\n\n\n\n\tCurrently\noperating\t\n\tMars Reconnaissance Orbiter\n\t2001 Mars Odyssey\n\tNew Horizons\n\tInternational Space Station\n\tHubble Space Telescope\n\tSpitzer\n\tSwift\n\tTHEMIS\n\tMars Exploration Rover\n\tCuriosity rover\n\ttimeline\n\n\n\tInSight\n\tGOES 14\n\tLunar Reconnaissance Orbiter\n\tGOES 15\n\tVan Allen Probes\n\tSolar Dynamics Observatory\n\tJuno\n\tMars Science Laboratory\n\ttimeline\n\n\n\tNuSTAR\n\tVoyager 1\n\tVoyager 2\n\tWISE\n\tMAVEN\n\tMMS\n\tOSIRIS-REx\n\tTransiting Exoplanet Survey Satellite\n\n\n\n\n\tFuture\t\n\tJoint Polar Satellite System\n\tJames Webb Space Telescope\n\tWide Field Infrared Survey Telescope\n\tMars 2020\n\tNISAR\n\tEuropa Clipper\n\n\n\n\n\n\n\n\tCommunications\nand navigation\t\n\tNear Earth Network\n\tSpace Network\n\tDeep Space Network (Goldstone\n\tMadrid\n\tCanberra\n\tSpace Flight Operations Facility)\n\tDeep Space Atomic Clock\n\n\n\n\n\tNASA lists\t\n\tAstronauts\n\tby name\n\tby year\n\tGemini astronauts\n\tApollo astronauts\n\n\n\tList of NASA aircraft\n\tList of NASA missions\n\tuncrewed missions\n\n\n\tList of NASA contractors\n\tList of United States rockets\n\tList of NASA cancellations\n\tList of Space Shuttle missions\n\tcrews\n\n\n\tList of NASA cameras on spacecraft\n\n\n\n\n\tNASA images\nand artwork\t\n\tEarthrise\n\tThe Blue Marble\n\tFamily Portrait\n\tPale Blue Dot\n\n\n\tPillars of Creation\n\tMystic Mountain\n\tSolar System Family Portrait\n\tThe Day the Earth Smiled\n\tFallen Astronaut\n\tLunar plaques\n\tPioneer plaques\n\tVoyager Golden Record\n\tApollo 11 goodwill messages\n\tNASA insignia\n\tGemini and Apollo medallions\n\tMission patches\n\n\n\n\n\tRelated\t\n\tApollo 15 postal covers incident\n\tSpace Mirror Memorial\n\tThe Astronaut Monument\n\tU.S. Astronaut Hall of Fame\n\tSpace program on U.S. stamps\n\tApollo 17 Moon mice\n\tOther primates in space\n\tNASA spinoff technologies\n\n\n\n\n\t\n\t Category\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSaturn\n\n\t\n\tOutline of Saturn\n\n\n\n\n\tGeography\t\n\tDragon Storm\n\tGreat White Spot\n\tHexagon\n\tMagnetosphere\n\tRings\n\n\n\n\t\n\n\tMoons\t\n\tS/2009 S 1\n\tRing moonlets\n\tPan\n\tDaphnis\n\tAtlas\n\tPrometheus\n\tS/2004 S 6\n\tS/2004 S 4\n\tS/2004 S 3\n\n\n\tPandora\n\tEpimetheus\n\tJanus\n\tAegaeon\n\tMimas\n\tMethone\n\tAnthe\n\tPallene\n\tEnceladus\n\tTethys\n\tTelesto\n\tCalypso\n\n\n\tDione\n\tHelene\n\tPolydeuces\n\n\n\tRhea\n\tTitan\n\tHyperion\n\tIapetus\n\tKiviuq\n\tIjiraq\n\tPhoebe\n\tPaaliaq\n\tSkathi\n\tAlbiorix\n\tS/2007 S 2\n\tBebhionn\n\tErriapus\n\tSkoll\n\tSiarnaq\n\tTarqeq\n\tS/2004 S 13\n\tGreip\n\tHyrrokkin\n\tJarnsaxa\n\tTarvos\n\tMundilfari\n\tS/2006 S 1\n\tS/2004 S 17\n\tBergelmir\n\tNarvi\n\tSuttungr\n\tHati\n\tS/2004 S 12\n\tFarbauti\n\tThrymr\n\tAegir\n\tS/2007 S 3\n\tBestla\n\tS/2004 S 7\n\tS/2006 S 3\n\tFenrir\n\tSurtur\n\tKari\n\tYmir\n\tLoge\n\tFornjot\n\n\n\n\n\tAstronomy\t\n\tDelta Octantis\n\tSaturn-crossing minor planets\n\n\n\n\n\tExploration\t\n\tCassini–Huygens (Huygens)\n\ttimeline\n\tretirement\n\n\n\tPioneer 11\n\tVoyager program\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\n\n\tRelated\t\n\tFiction\n\tMoons\n\n\n\tThe Day the Earth Smiled\n\tIn Saturn's Rings (2018 documentary)\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nTitan\n\n\tGeneral\t\n\tAtmosphere of Titan\n\tClimate of Titan\n\tLife on Titan\n\n\n\n\t\n\n\tLists\t\n\tLakes of Titan\n\tList of geological features on Titan\n\n\n\n\n\tLakes\nand seas\t\n\tSeas\t\n\tKraken Mare\n\tLigeia Mare\n\tPunga Mare\n\n\n\n\n\tLakes\t\n\tAbaya Lacus\n\tBolsena Lacus\n\tFeia Lacus\n\tHammar Lacus\n\tJingpo Lacus\n\tKivu Lacus\n\tKoitere Lacus\n\tLadoga Lacus\n\tMackay Lacus\n\tMüggel Lacus\n\tNeagh Lacus\n\tOntario Lacus\n\tSotonera Lacus\n\tAlbano Lacus\n\n\n\n\n\tRivers\t\n\tVid Flumina\n\n\n\n\n\tDry lakes\t\n\tEyre Lacuna\n\tNgami Lacuna\n\tWoytchugga Lacuna\n\n\n\n\n\n\n\n\tFeatures\t\n\tAdiri\n\tArrakis Planitia\n\tDilmun\n\tDoom Mons\n\tErebor Mons\n\tGanesa Macula\n\tGuabonito\n\tIrensaga Montes\n\tMayda Insula\n\tMenrva\n\tMezzoramia\n\tMindolluin Montes\n\tMisty Montes\n\tMithrim Montes\n\tPerkunas Virgae\n\tSelk\n\tShangri-La\n\tShikoku Facula\n\tSotra Patera\n\tTaniquetil Montes\n\tTsegihi\n\tTui Regio\n\tXanadu\n\n\n\n\n\tExploration\t\n\tPast\t\n\tPioneer program\n\tPioneer 11\n\n\n\tVoyager program\n\tVoyager 1\n\tVoyager 2\n\n\n\tCassini–Huygens\n\tHuygens\n\n\n\n\n\n\n\tProposed\t\n\tAVIATR\n\tExplorer of Enceladus and Titan\n\tJourney to Enceladus and Titan\n\tTALISE\n\tTitan Mare Explorer\n\tTitan Saturn System Mission\n\tOceanus\n\n\n\n\n\tPlanned\t\n\tDragonfly (2026)\n\n\n\n\n\n\n\n\tSee also\t\n\tColonization of Titan\n\n\n\n\n\tOther topics\t\n\tMemorials on Titan\n\tTitan in fiction\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nChristiaan Huygens\n\n\tBooks\t\n\tSystema Saturnium (1659)\n\tDe Vi Centrifiga (1659)\n\tHorologium Oscillatorium (1673)\n\tTraité de la Lumiére (1692)\n\tCosmotheoros (1698)\n\n\n\n\n\tIn science and \n natural philosophy\t\n\tCentripetal acceleration\n\tCoupled oscillation\n\tConception of the standardization of the temperature scale\n\tEarly history of classical mechanics\n\tEarly history of calculus\n\tHuygens' law\n\tHuygens' lemniscate\n\tHuygens' principle (Huygens–Fresnel principle)\n\tHuygens' construction\n\tHuygens' tritone\n\tHuygens' wavelet\n\tHuygens' wave theory\n\tHuygens–Steiner theorem\n\tHypothesis of intelligent extraterrestrial life\n\tIsochrone curve (tautochrone curve)\n\tFoundations of differential geometry of curves \n (mathematical notions of the evolute and involute of the curve)\n\tScientific foundations of horology\n\tMathematical and physical investigations of properties of the pendulum\n\tModern conception of centrifugal and centripetal forces\n\tMusic theory of microtones (31 equal temperament)\n\tPolarization of light (Iceland spar)\n\tRings of Saturn\n\tTitan (moon)\n\tTheoretical foundations of wave optics (wave theory of light)\n\n\n\n\n\tIn technology\t\n\tInventions by Huygens\n\tAerial telescope\n\tCentrifugal governor\n\tCycloidal pendulum\n\tHuygens' engine 1\n\tHuygens' eyepiece\n\tMagic lantern \n2\n\tSpiral balance spring\n\tPrecision timekeeping (pendulum clock and spiral-hairspring watch)\n\n\n\n\n\tRecognitions\t\n\tList of things named after Christiaan Huygens\n\t2801 Huygens\n\tCassini–Huygens\n\tHuygens probe\n\n\n\tMons Huygens\n\tMV Christiaan Huygens\n\tHuygens (crater)\n\tHuygens-Fokker Foundation\n\tHuygens Gap\n\tHuygens Ringlet\n\tHorologium (constellation)\n\n\n\n\n\tOther topics\t\n\tCosmos: A Personal Voyage - Episode 6: \"Travellers' Tales\" \n (1980 documentary TV series by Carl Sagan)\n\tClocks and Culture, 1300–1700 (1967 history book by Carlo Cipolla)\n\tRevolution in Time: Clocks and the Making of the Modern World \n (1983 history book by David Landes)\n\tScientific Revolution\n\tGolden Age of Dutch science and technology\n\tScience and technology in the Dutch Republic\n\tAcadémie des Sciences\n\n\n\n\n\tRelated people\t\n\tHuygens family\n\tGalileo Galilei\n\tRené Descartes\n\tSalomon Coster\n\tAntonie van Leeuwenhoek\n\tGottfried Wilhelm Leibniz\n\tIsaac Newton\n\tRobert Hooke\n\tDenis Papin\n\tAugustin-Jean Fresnel\n\tThomas Young\n\n\n\n\n\t\t1 A rudimentary prototype of internal combustion piston engine. \n 2 An early practical type of image projector and a precursor to both the modern slide projector and the movie projector.\n\n\n\n\t Wikiquote\n\t Wikisource texts\n\n\n\n\n\n\n\tAstronomy portal\n\tSolar System portal\n\tSpaceflight portal\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Cassini–Huygens&oldid=917815541\"\n\n\t\t\n\t\tCategories: \tCassini–Huygens\n\tSpacecraft launched in 1997\n\tSpacecraft decommissioned in 2017\n\tEuropean Space Agency space probes\n\tNASA space probes\n\tSpacecraft launched by Titan rockets\n\tLunar flybys\n\tSpace synthetic aperture radar\n\tMissions to main-belt asteroids\n\tMissions to Saturn\n\tMissions to Jupiter\n\tJet Propulsion Laboratory\n\t1997 in Florida\n\tChristiaan Huygens\n\tOrbiters (space probe)\n\tSpace radars\n\tGiovanni Domenico Cassini\n\tExtraterrestrial atmosphere entry\n\tDestroyed space probes\n\tNuclear-powered robots\n\n\nHidden categories: \tWebarchive template wayback links\n\tArticles with short description\n\tArticles with specifically marked weasel-worded phrases from May 2019\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from May 2019\n\tArticles with unsourced statements from September 2017\n\tArticles needing additional references from October 2018\n\tAll articles needing additional references\n\tWikipedia articles needing clarification from February 2019\n\tArticles with unsourced statements from February 2016\n\tWikipedia articles needing clarification from February 2016\n\tPages using multiple image with auto scaled images\n\tCommons category link is on Wikidata\n\tUse mdy dates from July 2018\n\tUse American English from March 2018\n\tAll Wikipedia articles written in American English\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tالعربية\n\tAragonés\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tभोजपुरी\n\tБългарски\n\tBosanski\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\t한국어\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tInterlingua\n\tÍslenska\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tქართული\n\tKiswahili\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tLimburgs\n\tLumbaart\n\tMagyar\n\tമലയാളം\n\tBahasa Melayu\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tShqip\n\tSicilianu\n\tසිංහල\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 25 September 2019, at 16:35 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "21", "dc:title": "Cassini–Huygens - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Cassini_Saturn_Orbit_Insertion.jpg/1200px-Cassini_Saturn_Orbit_Insertion.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-cassini-e2-80-93huygens", "title": "Cassini–Huygens - Wikipedia"}}