{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nActuator - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tActuator\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Actuators)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tAn actuator is a component of a machine that is responsible for moving and controlling a mechanism or system, for example by opening a valve. In simple terms, it is a \"mover\".\n\nAn actuator requires a control signal and a source of energy. The control signal is relatively low energy and may be electric voltage or current, pneumatic or hydraulic pressure, or even human power. Its main energy source  may be an electric current, hydraulic fluid pressure, or pneumatic pressure. When it receives a control signal, an actuator responds by converting the signal's energy into mechanical motion.\n\nAn actuator is the mechanism by which a control system acts upon an environment. The control system can be simple (a fixed mechanical or electronic system), software-based (e.g. a printer driver, robot control system), a human, or any other input.[1]\n\n\nContents\n\n\n\t1 History\n\t1.1 Hydraulic\n\t1.2 Pneumatic\n\t1.3 Electric\n\t1.4 Twisted and coiled polymer (TCP) or supercoiled polymer (SCP)\n\t1.5 Thermal or magnetic\n\t1.6 Mechanical\n\n\n\n\t2 3D printed soft actuators\n\t3 Examples and applications\n\t3.1 Examples of actuators\n\t3.2 Circular to linear conversion\n\t3.3 Virtual instrumentation\n\n\n\n\t4 Performance metrics\n\t4.1 Force\n\t4.2 Speed\n\t4.3 Operating conditions\n\t4.4 Durability\n\n\n\n\t5 See also\n\t6 References\n\n\n\n\n\nHistory[edit]\n\nThe history of the pneumatic actuation system and the hydraulic actuation system dates to around the time of World War II (1938). It was first created by Xhiter Anckeleman[2] who used his knowledge of engines and brake systems to come up with a new solution to ensure that the brakes on a car exert the maximum force, with the least possible wear and tear. \n\n\nHydraulic[edit]\n\nMain article: Hydraulics\n\nA hydraulic actuator consists of  cylinder or fluid motor that uses hydraulic power to facilitate mechanical operation. The mechanical motion gives an output in terms of linear, rotatory or oscillatory motion. As liquids are nearly impossible to compress, a hydraulic actuator can exert a large force. The drawback of this approach is its limited acceleration.\n\n\nThe hydraulic cylinder consists of a hollow cylindrical tube along which a piston can slide. The term single acting is used when the fluid pressure is applied to just one side of the piston. The piston can move in only one direction, a spring being frequently used to give the piston a return stroke. The term double acting is used when pressure is applied on each side of the piston; any difference in pressure between the two sides of the piston moves the piston to one side or the other.[3]\n  \nPneumatic rack and pinion actuators for valve controls of water pipes\n\n\n\nPneumatic[edit]\n\nMain article: Pneumatics\n\nPneumatic actuators enable considerable forces to be produced from relatively small pressure changes. A pneumatic actuator converts energy formed by vacuum or compressed air at high pressure into either linear or rotary motion. Pneumatic energy is desirable for main engine controls because it can quickly respond in starting and stopping as the power source does not need to be stored in reserve for operation. Moreover, pneumatic actuators are safer, cheaper, and often more reliable and powerful than other actuators. These forces are often used with valves to move diaphragms to affect the flow of air through the valve.[4][5]\n\n\n  \nElectric valve actuator controlling a ½ needle valve.\n\n\n\nElectric[edit]\n\nMain article: Electric motor\n\nAn electric actuator may provide the actuation force/torque in one of several ways.  Electromechanical actuators may be used to power a motor that converts electrical energy into mechanical torque. Another approach is an electrohydraulic actuator, where the electric motor remains the prime mover, but provides torque to operate a hydraulic accumulator that is then used to transmit actuation force in much the same way that diesel engine/hydraulics are typically used in heavy equipment. \n\nElectrical energy is used to actuate equipment such as multi-turn valves, or electric-powered construction and excavation equipment.\n\nAdditionally, a brake is typically installed above the motor to prevent the media from opening valve.[clarification needed] If no brake is installed, the actuator will uncover the opened valve and rotate it back to its closed position. If this continues to happen, the motor and actuator will eventually become damaged.[6] \n\nElectric actuators are one of the cleanest and most readily available forms of actuator because it does not directly involve oil or other fossil fuels.[7]\n\n\nTwisted and coiled polymer (TCP) or supercoiled polymer (SCP)[edit]\n\nTwisted and coiled polymer (TCP) actuator also known as supercoiled polymer (SCP) actuator is a coiled polymer that can be actuated by electric power.[8] A TCP actuator looks like a helical spring. TCP actuators are usually made from silver coated Nylon. TCP actuators can also be made from other electrical conductance coat such as gold. TCP actuator should be under a load to keep the muscle extended. The electrical energy transforms to thermal energy due to electrical resistance, which is also known as Joule heating, Ohmic heating, and resistive heating. As the temperature of the TCP actuator increases by Joule heating, the polymer contracts and it causes the actuator contraction.[8]\n\n\nThermal or magnetic[edit]\n\nMain article: Shape-memory alloy\n\nActuators which can be actuated by applying thermal or magnetic energy have been used in commercial applications. Thermal actuators tend to be compact, lightweight, economical and with high power density. These actuators use shape memory materials (SMMs), such as shape-memory alloys (SMAs) or magnetic shape-memory alloys (MSMAs). Some popular manufacturers of these devices are Finnish Modti Inc., American Dynalloy and Rotork.\n\n\nMechanical[edit]\n\nMain article: Mechanism (engineering)\n\nA mechanical actuator functions to execute movement by converting one kind of motion, such as rotary motion, into another kind, such as linear motion. An example is a rack and pinion. The operation of mechanical actuators is based on combinations of structural components, such as gears and rails, or pulleys and chains.\n\n\n3D printed soft actuators[edit]\n\nSoft actuators are being developed to handle fragile objects like fruit harvesting in agriculture or manipulating the internal organs in biomedicine that has always been a challenging task for robotics. Unlike conventional actuators, soft actuators produce flexible motion due to the integration of microscopic changes at the molecular level into a macroscopic deformation of the actuator materials.\n\nThe majority of the existing soft actuators are fabricated using multistep low yield processes such as micro-moulding,[9] solid freeform fabrication,[10] and mask lithography.[11] However, these methods require manual fabrication of devices, post processing/assembly, and lengthy iterations until maturity in the fabrication is achieved. To avoid the tedious and time-consuming aspects of the current fabrication processes, researchers are exploring an appropriate manufacturing approach for effective fabrication of soft actuators. Therefore, special soft systems that can be fabricated in a single step by rapid prototyping methods, such as 3D printing, are utilized to narrow the gap between the design and implementation of soft actuators, making the process faster, less expensive, and simpler. They also enable incorporation of all actuator components into a single structure eliminating the need to use external joints, adhesives, and fasteners. These result in a decrease in the number of discrete parts, post-processing steps, and fabrication time.[12]\n\n3D printed soft actuators are classified into two main groups namely “semi 3D printed soft actuators” and “3D printed soft actuators”. The reason for such classification is to distinguish between the printed soft actuators that are fabricated by means of 3D printing process in whole and the soft actuators whose parts are made by 3D printers and post processed subsequently. This classification helps to clarify the advantages of 3D printed soft actuators over the semi 3D printed soft actuators due to their capability of operating without the need of any further assembly.[13]\n\nShape memory polymer (SMP) actuators are the most similar to our muscles, providing a response to a range of stimuli such as light, electrical, magnetic, heat, pH, and moisture changes. They have some deficiencies including fatigue and high response time that have been improved through the introduction of smart materials and combination of different materials by means of advanced fabrication technology. The advent of 3D printers has made a new pathway for fabricating low-cost and fast response SMP actuators. The process of receiving external stimuli like heat, moisture, electrical input, light or magnetic field by SMP is referred to as shape memory effect (SME). SMP exhibits some rewarding features such a low density, high strain recovery, biocompatibility, and biodegradability.\n\nPhotopolymer/light activated polymers (LAP) are another type of SMP that are activated by light stimuli. The LAP actuators can be controlled remotely with instant response and, without any physical contact, only with the variation of light frequency or intensity.\n\nA need for soft, lightweight and biocompatible soft actuators in soft robotics has influenced researchers for devising pneumatic soft actuators because of their intrinsic compliance nature and ability to produce muscle tension.\n\nPolymers such as dielectric elastomers (DE), ionic polymer metal composites (IPMC), ionic electroactive polymers, polyelectrolyte gels, and gel-metal composites are common materials to form 3D layered structures that can be tailored to work as soft actuators. EAP actuators are categorized as 3D printed soft actuators that respond to electrical excitation as deformation in their shape.\n\n\nExamples and applications[edit]\n\nIn engineering, actuators are frequently used as mechanisms to introduce motion, or to clamp an object so as to prevent motion[14]. In electronic engineering, actuators are a subdivision of transducers. They are devices which transform an input signal (mainly an electrical signal) into some form of motion.\n\n\nExamples of actuators[edit]\n\n\tComb drive\n\tDigital micromirror device\n\tElectric motor\n\tElectroactive polymer\n\tHydraulic cylinder\n\tPiezoelectric actuator\n\tPneumatic actuator\n\tScrew jack\n\tServomechanism\n\tSolenoid\n\tStepper motor\n\tShape-memory alloy\n\tThermal bimorph\n\tHydraulic actuators\n\n\nCircular to linear conversion[edit]\n\nMotors are mostly used when circular motions are needed, but can also be used for linear applications by transforming circular to linear motion with a lead screw or similar mechanism. On the other hand, some actuators are intrinsically linear, such as piezoelectric actuators.  Conversion between circular and linear motion is commonly made via a few simple types of mechanism including:\n\n\n\tScrew: Screw jack, ball screw and roller screw actuators all operate on the principle of the simple machine known as the screw. By rotating the actuator's nut, the screw shaft moves in a line.  By moving the screw shaft, the nut rotates.\n\tWheel and axle: Hoist, winch, rack and pinion, chain drive, belt drive, rigid chain and rigid belt actuators operate on the principle of the wheel and axle. By rotating a wheel/axle (e.g. drum, gear, pulley or shaft) a linear member (e.g. cable, rack, chain or belt) moves.  By moving the linear member, the wheel/axle rotates.[15]\n\n\nVirtual instrumentation[edit]\n\nIn virtual instrumentation, actuators and sensors are the hardware complements of virtual instruments.\n\n\nPerformance metrics[edit]\n\nPerformance metrics for actuators include speed, acceleration, and force (alternatively, angular speed, angular acceleration, and torque), as well as energy efficiency and considerations such as mass, volume, operating conditions, and durability, among others.\n\n\nForce[edit]\n\nWhen considering force in actuators for applications, two main metrics should be considered. These two are static and dynamic loads. Static load is the force capability of the actuator while not in motion. Conversely, the dynamic load of the actuator is the force capability while in motion.\n\n\nSpeed[edit]\n\nSpeed should be considered primarily at a no-load pace, since the speed will invariably decrease as the load amount increases. The rate the speed will decrease will directly correlate with the amount of force and the initial speed.\n\n\nOperating conditions[edit]\n\nActuators are commonly rated using the standard IP Code rating system. Those that are rated for dangerous environments will have a higher IP rating than those for personal or common industrial use.\n\n\nDurability[edit]\n\nThis will be determined by each individual manufacturer, depending on usage and quality.\n\n\nSee also[edit]\n\n\tEnd effector\n\tHard disk drive actuator\n\tLinear actuator\n\tLoad cell\n\tMicroactuator\n\tNanotube nanomotor\n\tRobot actuators\n\tTorque motor\n\n\nReferences[edit]\n\n\n\t^ \"About Actuators\". www.thomasnet.com. Archived from the original on 2016-05-08. Retrieved 2016-04-26.\n\n\t^ \"A Great Combination: Pneumatic Actuator, Pneumatic Timer, Pneumatic Valves, and Pneumatic Indicators : Ellis/Kuhnke Controls\". www.ekci.com. Archived from the original on 2018-02-21. Retrieved 2018-02-20.\n\n\n\t^ \"What's the Difference Between Pneumatic, Hydraulic, and Electrical Actuators?\". machinedesign.com. Archived from the original on 2016-04-23. Retrieved 2016-04-26.\n\n\n\t^ \"What is a Pneumatic Actuator?\". www.tech-faq.com. Archived from the original on 2018-02-21. Retrieved 2018-02-20.\n\n\n\t^ \"Pneumatic Valve Actuators Information | IHS Engineering360\". www.globalspec.com. Archived from the original on 2016-06-24. Retrieved 2016-04-26.\n\n\n\t^ Tisserand, Olivier. \"How does an electric actuator work?\". Archived from the original on 2018-02-21. Retrieved 2018-02-20.\n\n\n\t^ \"Electric & Pneumatic Actuators\". www.baelzna.com. Archived from the original on 2016-04-30. Retrieved 2016-04-26.\n\n\n\t^ a b Jafarzadeh, Mohsen; Gans, Nicholas; Tadesse, Yonas (August 2018). \"Control of TCP muscles using Takagi–Sugeno–Kang fuzzy inference system\". Mechatronics. 53: 124–139. doi:10.1016/j.mechatronics.2018.06.007.\n\n\n\t^ Feng, Guo-Hua; Yen, Shih-Chieh (2015). \"Micromanipulation tool replaceable soft actuator with gripping force enhancing and output motion converting mechanisms\". 2015 Transducers - 2015 18th International Conference on Solid-State Sensors, Actuators and Microsystems (TRANSDUCERS). pp. 1877–80. doi:10.1109/TRANSDUCERS.2015.7181316. ISBN 978-1-4799-8955-3.\n\n\n\t^ Malone, Evan; Lipson, Hod (2006). \"Freeform fabrication of ionomeric polymer‐metal composite actuators\". Rapid Prototyping Journal. 12 (5): 244–53. doi:10.1108/13552540610707004.\n\n\n\t^ Kerdlapee, Pongsak; Wisitsoraat, Anurat; Phokaratkul, Ditsayuth; Leksakul, Komgrit; Phatthanakun, Rungreung; Tuantranont, Adisorn (2013). \"Fabrication of electrostatic MEMS microactuator based on X-ray lithography with Pb-based X-ray mask and dry-film-transfer-to-PCB process\". Microsystem Technologies. 20: 127–35. doi:10.1007/s00542-013-1816-x.\n\n\n\t^ Zolfagharian, Ali; Kouzani, Abbas Z.; Khoo, Sui Yang; Moghadam, Amir Ali Amiri; Gibson, Ian; Kaynak, Akif (2016). \"Evolution of 3D printed soft actuators\". Sensors and Actuators A: Physical. 250: 258–72. doi:10.1016/j.sna.2016.09.028.\n\n\n\t^ Zolfagharian, Ali; Kouzani, Abbas Z.; Khoo, Sui Yang; Gibson, Ian; Kaynak, Akif (2016). \"3D printed hydrogel soft actuators\". 2016 IEEE Region 10 Conference (TENCON). pp. 2272–7. doi:10.1109/TENCON.2016.7848433. ISBN 978-1-5090-2597-8.\n\n\n\t^ Shabestari, N. P. (2019). \"Fabrication of a simple and easy-to-make piezoelectric actuator and its use as phase shifter in digital speckle pattern interferometry\". Journal of Optics. 48 (2): 272–282. doi:10.1007/s12596-019-00522-4.\n\n\n\t^ Sclater, N., Mechanisms and Mechanical Devices Sourcebook, 4th Edition (2007), 25, McGraw-Hill\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4198914-4\n\tNDL: 00576265\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Actuator&oldid=919057853\"\n\n\t\t\n\t\tCategories: \tActuators\n\n\nHidden categories: \tWikipedia articles needing clarification from September 2019\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tEspañol\n\tفارسی\n\tFrançais\n\tGaeilge\n\t한국어\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tJawa\n\tLietuvių\n\tМонгол\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tPolski\n\tPortuguês\n\tРусский\n\tSimple English\n\tSuomi\n\tSvenska\n\tTagalog\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 October 2019, at 16:24 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "6", "dc:title": "Actuator - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-actuators", "title": "Actuator - Wikipedia"}}