{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAerocapture - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tAerocapture\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nThe five steps of an aerocapture\n\n\n\nAerocapture is an orbital transfer maneuver used to reduce the velocity of a spacecraft from a hyperbolic trajectory to an elliptical orbit around the targeted celestial body.\n\nAerocapture uses a planet's or moon's atmosphere to accomplish a quick, near-propellantless orbit capture to place a space vehicle in its science orbit (most science orbits require a near circular orbit around the celestial body). The aerocapture maneuver starts as the spacecraft enters the atmosphere of the target body from an approach trajectory. The aerodynamic drag generated by the dense atmosphere slows the craft. After the spacecraft slows enough to capture into orbit, it exits the atmosphere and executes a small motor firing to circularize the orbit. This nearly fuel-free method of deceleration could significantly reduce the mass of an interplanetary spacecraft. Less spacecraft mass allows for more science instrumentation to be added to the mission or allows for a smaller and less-expensive spacecraft, and potentially a smaller, less-expensive launch vehicle.[1] However, this approach requires significant thermal protection and precision closed-loop guidance during the maneuver. This level of control authority requires either the production of significant lift, or relatively large attitude control thrusters.[2]\n\n\nContents\n\n\n\t1 Benefits of aerocapture\n\t2 Aerocapture spacecraft designs\n\t2.1 Blunt body, rigid aeroshell design\n\t2.2 Inflatable aeroshell design\n\t2.3 Trailing ballute design\n\n\n\n\t3 In practice\n\t4 In fiction\n\t5 Related methods\n\t6 See also\n\t7 References\n\n\n\n\n\nBenefits of aerocapture[edit]\n\nNASA technologists are developing ways to place robotic space vehicles into long-duration scientific orbits around distant Solar System destinations without the need for the heavy fuel loads that have historically limited vehicle performance, mission duration, and mass available for science payloads.\n\nA study showed that using aerocapture over the next best method (propellant burn and aerobraking) would allow for a significant increase in scientific payload for missions ranging from Venus (79% increase) to Titan (280% increase) and Neptune (832% increase). Additionally, the study showed that using aerocapture technology could enable scientifically useful missions to Jupiter and Saturn.[3]\n\nAerocapture technology has also been evaluated for use in manned Mars missions and found to offer significant mass benefits. For this application, however, the trajectory must be constrained to avoid excessive deceleration loads on the crew.[4][5] Although there are similar constraints on trajectories for robotic missions, the human limits are typically more stringent, especially in light of the effects of prolonged microgravity on acceleration tolerances.\n\n\nAerocapture spacecraft designs[edit]\n\nThe aerocapture maneuver can be accomplished with three basic types of systems. The spacecraft can be enclosed by a structure covered with thermal protection material also known as the rigid aeroshell design. Similarly another option is for the vehicle to deploy an aerocapture device, such as an inflatable heat shield, known as the inflatable aeroshell design. The third major design option is of an inflatable, trailing ballute—a combination balloon and parachute made of thin, durable material towed behind the vehicle after deployment in the vacuum of space.\n\n\nBlunt body, rigid aeroshell design[edit]\n\nThe blunt body, rigid aeroshell system encases a spacecraft in a protective shell. This shell acts as an aerodynamic surface, providing lift and drag, and provides protection from the intense heating experienced during high-speed atmospheric flight. Once the spacecraft is captured into orbit, the aeroshell is jettisoned.\n\nNASA has used blunt aeroshell systems in the past for atmospheric entry missions. The most recent example is the Mars Exploration Rovers, Spirit and Opportunity, which launched in June and July 2003, and landed on the Martian surface in January 2004. Another example is the Apollo Command Module. The module was used for six unmanned space flights from February 1966 to April 1968 and eleven manned missions from Apollo 7 in October 1968 through the final manned Apollo 17 lunar mission in December 1972. Because of its extensive heritage, the aeroshell system design is well understood. Adaptation of the aeroshell from atmospheric entry to aerocapture requires mission-specific customization of the thermal protection material to accommodate the different heating environments of aerocapture. Also, higher-temperature adhesives and lightweight, high temperature structures are desired to minimize the mass of the aerocapture system.[1]\n\n\nInflatable aeroshell design[edit]\n\nThe inflatable aeroshell design looks much like the aeroshell or blunt body design. The inflatable aeroshell is often referred to as a hybrid system, with a rigid nosepiece and an inflated, attached decelerator to increase the drag area. Just prior to entering the atmosphere, the inflatable aeroshell extends from a rigid nose-cap and provides a larger surface area to slow the spacecraft down. Made of thin-film material and reinforced with a ceramic cloth, the inflatable aeroshell design could offer many of the same advantages and functionality as trailing ballute designs. While not as large as the trailing ballute, the inflatable aeroshell is roughly three times larger than the rigid aeroshell system and performs the aerocapture maneuver higher in the atmosphere, reducing heating loads. Because the system is inflatable, the spacecraft is not enclosed during launch and cruise, which allows more flexibility during spacecraft design and operations.[1]\n\n\nTrailing ballute design[edit]\n\nOne of the primary inflatable deceleration technologies is a trailing ballute configuration. The design features a toroidal, or donut-shaped, decelerator, made of a lightweight, thin-film material. The ballute is much larger than the spacecraft and is towed behind the craft, much like a parachute, to slow the vehicle down. The “trailing” design also allows for easy detachment after the aerocapture maneuver is complete. The trailing ballute design has performance advantages over the rigid aeroshell design, such as not constraining the spacecraft size and shape, and subjecting the vehicle to much lower aerodynamic and thermal loads. Because the trailing ballute is much larger than the spacecraft, aerocapture occurs high in the atmosphere where much less heat is generated. The ballute incurs most of the aerodynamic forces and heat, allowing the use of minimal thermal protection around the spacecraft. One of the primary advantages of the ballute configuration is mass. Where the rigid aeroshell may account for 30–40% of the mass of a spacecraft, the ballute mass fraction could be as little as 8–12%, saving mass for more science payload.[1]\n\n\nIn practice[edit]\n\nAerocapture has not yet been tried on a planetary mission, but the re-entry skip by Zond 6 and Zond 7 upon lunar return were aerocapture maneuvers, since they turned a hyperbolic orbit into an elliptical orbit. On these missions, since there was no attempt to raise the perigee after the aerocapture, the resulting orbit still intersected the atmosphere, and re-entry occurred at the next perigee.\n\nAerocapture was originally planned for the Mars Odyssey orbiter,[6] but later changed to aerobraking for reasons of cost and commonality with other missions.[7]\n\nAerocapture has been proposed and analyzed for arrival at Saturn's moon Titan.[8]\n\n\nIn fiction[edit]\n\nAerocapture within fiction can be read in Arthur C. Clarke's novel 2010: Odyssey Two, in which two spacecraft (one Russian, one Chinese) both use aerocapture in Jupiter's atmosphere to shed their excess velocity and position themselves for exploring Jupiter's satellites. This can be seen as a special effect in the movie version in which only a Russian spacecraft undergoes aerocapture (in the film incorrectly called aerobraking).\n\nPlayers of the video game Kerbal Space Program often employ aerocapture when exploring the satellites of Jool (a gas giant that serves as the game's analogue to Jupiter).\n\nIn the television serial Stargate Universe, the ship Destiny's autopilot employs aerocapture within the atmosphere of a gas giant at the edge of a star system. This puts the ship on a direct heading into the star at the center of the system.\n\n\nRelated methods[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (February 2019) (Learn how and when to remove this template message)\n\n\n\nAerocapture is part of a family of \"aeroassist\" technologies being developed by NASA for science missions to any planetary body with an appreciable atmosphere. These destinations could include Mars, Venus and Saturn's moon Titan, along with the outer planets.\n\nAerobraking is another aeroassist maneuver that shares some similarities but also some important differences with aerocapture. While aerocapture is used for inserting a spacecraft into orbit from a hyperbolic trajectory, aerobraking is used for reducing the apoapsis of a spacecraft that is already in orbit.\n\n\nComparison of aerocapture and aerobraking\n\t\n\tAerocapture\n\tAerobraking\n\n\tStarting trajectory\n\tInterplanetary\n\tHigh orbit\n\n\tAtmospheric passes over duration\n\t1 over hours to days\n\t100–400 over weeks to months\n\n\tDepth of atmospheric entry\n\tRelatively dense mid-atmosphere\n\tSparse outer atmosphere\n\n\tHardware requirements\n\tHeavy heat shield\n\tNo heat shield\n\n\n\nOne of the main advantages of using an aerocapture technique over that of an aerobraking technique is that it enables mission concepts for human spaceflight due to the rapid process of transitioning to the desired orbit, shortening the length of the mission by months.[remove or clarification needed]\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\tAerobraking\n\tAerogravity assist\n\tAsteroid capture\n\tAtmospheric reentry\n\tSkip reentry\n\n\nReferences[edit]\n\n\n\t^ a b c d NASAfacts, “Aerocapture Technology.” https://spaceflightsystems.grc.nasa.gov/SSPO/FactSheets/ACAP%20Fact%20Sheet.pdf. 12 September 2007\n\n\t^ Cruz, MI (May 8–10, 1979). \"The aerocapture vehicle mission design concept\". Technical Papers.(A79-34701 14–12). Conference on Advanced Technology for Future Space Systems, Hampton, Va. 1. New York: American Institute of Aeronautics and Astronautics. pp. 195–201. Bibcode:1979atfs.conf..195C.\n\n\t^ Hall, J. L., Noca, M. A., and Bailey, R. W. “Cost-Benefit Analysis of the Aerocapture Mission Set,” Journal of Spacecraft and Rockets, Vol. 42, No. 2, March–April 2005\n\n\t^ Physiologically constrained aerocapture for manned Mars missions, JE Lyne, NASA STI/Recon Technical Report N 93, 12720\n\n\t^ Physiological constraints on deceleration during the aerocapture of manned vehicles, JE Lyne, Journal of Spacecraft and Rockets 31 (3), 443–446\n\n\t^ \"SCIENCE TEAM AND INSTRUMENTS SELECTED FOR MARS SURVEYOR 2001 MISSIONS\". 6 November 1997.\n\n\n\t^ Percy, T.K.; Bright, E. & Torres, A.O. (2005). \"Assessing the Relative Risk of Aerocapture Using Probabilistic Risk Assessment\" (PDF).\n\n\n\t^ Way, David; Powell, Richard; Masciarelli, James; Starr, Brett; Edquist, Karl (2003). \"Aerocapture Simulation and Performance for the Titan Explorer Mission\". doi:10.2514/6.2003-4951. Cite journal requires |journal= (help)\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpaceflight\n\n\tGeneral\t\n\tAstrodynamics\n\tHistory\n\tTimeline\n\tSpace Race\n\tAsian Space Race\n\tRecords\n\tAccidents and incidents\n\n\n\tSpace policy\n\tAustralia\n\tChina\n\tEuropean Union\n\tIndia\n\tJapan\n\tRussia\n\tSoviet Union\n\tUnited States\n\n\n\tSpace law\n\tOuter Space Treaty\n\tRescue Agreement\n\tSpace Liability Convention\n\tRegistration Convention\n\tMoon Treaty\n\n\n\tPrivate spaceflight\n\n\n\n\t\n\n\tApplications\t\n\tAstronomy\n\tEarth observation\n\tArchaeology\n\tImagery and mapping\n\tReconnaissance\n\tWeather and environment monitoring\n\n\n\tSatellite communications\n\tInternet\n\tRadio\n\tTelephone\n\tTelevision\n\n\n\tSatellite navigation\n\tCommercial use of space\n\tSpace launch market competition\n\tMilitarisation of space\n\tSpace architecture\n\tSpace exploration\n\tSpace research\n\tSpace technology\n\tSpace weather\n\n\n\n\n\tHuman spaceflight\t\n\tGeneral\t\n\tAstronaut\n\tcommercial\n\n\n\tLife support system\n\tAnimals in space\n\tBioastronautics\n\tSpace suit\n\n\n\tExtravehicular activity\n\tWeightlessness\n\tSpace toilet\n\tSpace tourism\n\tSpace colonization\n\n\n\n\n\tPrograms\t\n\tVostok\n\tMercury\n\tVoskhod\n\tGemini\n\tSoyuz\n\tApollo\n\tSkylab\n\tApollo–Soyuz\n\n\n\tSpace Shuttle\n\tMir\n\tShuttle–Mir\n\n\n\tInternational Space Station\n\tShenzhou\n\tTiangong\n\n\n\n\n\tHealth issues\t\n\tEffect of spaceflight on the human body\n\tSpace adaptation syndrome\n\n\n\tHealth threat from cosmic rays\n\tSpace psychology\n\tPsychological and sociological effects\n\n\n\tSpace and survival\n\tSpace medicine\n\tSpace nursing\n\n\n\n\n\n\n\n\tSpacecraft\t\n\tLaunch vehicle\n\tRocket\n\tSpaceplane\n\tRobotic spacecraft\n\tSatellite\n\tSpace probe\n\tLander\n\tRover\n\tSelf-replicating spacecraft\n\tSpace telescope\n\n\n\tSpacecraft propulsion\n\tRocket engine\n\tElectric propulsion\n\tSolar sail\n\tGravity assist\n\n\n\n\n\n\n\tDestinations\t\n\tSub-orbital\n\tOrbital\n\tGeocentric\n\tGeosynchronous\n\n\n\tInterplanetary\n\tInterstellar\n\tIntergalactic\n\n\n\n\n\tSpace launch\t\n\tDirect ascent\n\tEscape velocity\n\tExpendable and reusable launch systems\n\tLaunch pad\n\tNon-rocket spacelaunch\n\tSpaceport\n\n\n\n\n\tGround segment\t\n\tFlight controller\n\tGround station\n\tPass\n\tMission control center\n\n\n\n\n\tSpace agencies\t\n\t CoNAE\n\t ASA\n\t AEB\n\t CSA\n\t CNSA\n\t ESA\n\t CNES\n\t DLR\n\t ISRO\n\t LAPAN\n\t ISA\n\t ISA\n\t ASI\n\t AEM\n\t JAXA\n\t NADA\n\t KARI\n\t SUPARCO\n\t Roscosmos\n\t SNSA\n\t SSAU\n\t UKSA\n\t NASA\n\n\n\n\n\t\n\t  Category\n\t  Portal\n\t  WikiProject\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Aerocapture&oldid=909223007\"\n\n\t\t\n\t\tCategories: \tSpacecraft propulsion\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tArticles needing additional references from February 2019\n\tAll articles needing additional references\n\tWikipedia articles needing clarification from February 2019\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tDeutsch\n\tEspañol\n\tFrançais\n\tBahasa Indonesia\n\tItaliano\n\tPortuguês\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 4 August 2019, at 00:05 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "10", "dc:title": "Aerocapture - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Aerocapture.svg/1200px-Aerocapture.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-aerocapture", "title": "Aerocapture - Wikipedia"}}