{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAerobraking - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tAerobraking\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tNot to be confused with Air brake (aeronautics).\n\n  \nAn artist's conception of aerobraking with the Mars Reconnaissance Orbiter\n\n\n\n  \nAn example of Aerobraking\n   Mars Reconnaissance Orbiter ·   Mars\n\n\n\nAerobraking is a spaceflight maneuver that reduces the high point of an elliptical orbit (apoapsis) by flying the vehicle through the atmosphere at the low point of the orbit (periapsis). The resulting drag slows the spacecraft. Aerobraking is used when a spacecraft requires a low orbit after arriving at a body with an atmosphere, and it requires less fuel than does the direct use of a rocket engine.\n\n\nContents\n\n\n\t1 Method\n\t2 Related methods\n\t3 Spacecraft missions\n\t4 Aerobraking in fiction\n\t5 Aerodynamic braking\n\t6 See also\n\t7 Notes\n\t8 References\n\n\n\n\n\nMethod[edit]\n\nWhen an interplanetary vehicle arrives at its destination, it must change its velocity to remain in the vicinity of that body. When a low, near-circular orbit around a body with substantial gravity (as is required for many scientific studies) is needed, the total required velocity changes can be on the order of several kilometers per second. If done by direct propulsion, the rocket equation dictates that a large fraction of the spacecraft mass must be fuel. This in turn means the spacecraft is limited to a relatively small science payload and/or the use of a very large and expensive launcher. Provided the target body has an atmosphere, aerobraking can be used to reduce fuel requirements. The use of a relatively small burn allows the spacecraft to be captured into a very elongated elliptic orbit. Aerobraking is then used to circularize the orbit. If the atmosphere is thick enough, a single pass through it can be sufficient to slow a spacecraft as needed. However, aerobraking is typically done with many orbital passes through a higher altitude, and therefore thinner region of the atmosphere.  This is done to reduce the effect of frictional heating, and because unpredictable turbulence effects, atmospheric composition, and temperature make it difficult to accurately predict the decrease in speed that will result from any single pass.  When aerobraking is done in this way, there is sufficient time after each pass to measure the change in velocity and make any necessary corrections for the next pass. Achieving the final orbit using this method takes a long time (e.g., over six months when arriving at Mars), and may require several hundred passes through the atmosphere of the planet or moon. After the last aerobraking pass, the spacecraft must be given more kinetic energy via rocket engines in order to raise the periapsis above the atmosphere.\n\nThe kinetic energy dissipated by aerobraking is converted to heat, meaning that a spacecraft using the technique needs to be capable of dissipating this heat. The spacecraft must also have sufficient surface area and structural strength to produce and survive the required drag, but the temperatures and pressures associated with aerobraking are not as severe as those of atmospheric reentry or aerocapture. Simulations of the Mars Reconnaissance Orbiter aerobraking use a force limit of 0.35 N per square meter with a spacecraft cross section of about 37 m², equate to a maximum drag force of about 7.4 N, and a maximum expected temperature as 170 °C.[1] The force density (i.e. pressure), roughly 0.2 N per square meter,[2] that was exerted on the Mars Observer during aerobraking is comparable to the aerodynamic resistance of moving at 0.6 m/s (2.16 km/h) at sea level on Earth, approximately the amount experienced when walking slowly.\n[3]\n\n\nRelated methods[edit]\n\nAerocapture is a related but more extreme method in which no initial orbit-injection burn is performed. Instead, the spacecraft plunges deeply into the atmosphere without an initial insertion burn, and emerges from this single pass in the atmosphere with an apoapsis near that of the desired orbit. Several small correction burns are then used to raise the periapsis and perform final adjustments.[4]\nThis method was originally planned for the Mars Odyssey orbiter,[5] but the significant design impacts proved too costly.[4]\n\nAnother related technique is that of aerogravity assist, in which the spacecraft flies through the upper atmosphere and utilises aerodynamic lift instead of drag at the point of closest approach. If correctly oriented, this can increase the deflection angle above that of a pure gravity assist, resulting in a larger delta-v.[6]\n\n\nSpacecraft missions[edit]\n\n  \nAnimation of 2001 Mars Odyssey's trajectory around Mars from 24 October 2001 to 24 October 2002\n   2001 Mars Odyssey ·   Mars\n\n\n\n  \nAnimation of ExoMars Trace Gas Orbiter's trajectory around Mars\n   Mars ·    ExoMars Trace Gas Orbiter \n\n\n\nAlthough the theory of aerobraking is well developed, utilising the technique is difficult because a very detailed knowledge of the character of the target planet's atmosphere is needed in order to plan the maneuver correctly. Currently, the deceleration is monitored during each maneuver and plans are modified accordingly. Since no spacecraft can yet aerobrake safely on its own, this requires constant attention from both human controllers and the Deep Space Network. This is particularly true near the end of the process, when the drag passes are relatively close together (only about 2 hours apart for Mars).[citation needed]  NASA has used aerobraking four times to modify a spacecraft's orbit to one with lower energy, reduced apoapsis altitude, and smaller orbit.[7]\n\nOn 19 March 1991, aerobraking was demonstrated by the Hiten spacecraft. This was the first aerobraking maneuver by a deep space probe.[8] Hiten (a.k.a. MUSES-A) was launched by the Institute of Space and Astronautical Science (ISAS) of Japan.[9] Hiten flew by the Earth at an altitude of 125.5 km over the Pacific at 11.0 km/s. Atmospheric drag lowered the velocity by 1.712 m/s and the apogee altitude by 8665 km.[10] Another aerobraking maneuver was conducted on 30 March.\n\nIn May 1993, aerobraking was used during the extended Venusian mission of the Magellan spacecraft. It was used to circularize the orbit of the spacecraft in order to increase the precision of the measurement of the gravity field. The entire gravity field was mapped from the circular orbit during a 243-day cycle of the extended mission. During the termination phase of the mission, a \"windmill experiment\" was performed: Atmospheric molecular pressure exerts a torque via the windmill-sail-like oriented solar cell wings, the necessary counter-torque to keep the sonde from spinning is measured.[11]\n\nIn 1997, the Mars Global Surveyor (MGS) orbiter was the first spacecraft to use aerobraking as the main planned technique of orbit adjustment. The MGS used the data gathered from the Magellan mission to Venus to plan its aerobraking technique. The spacecraft used its solar panels as \"wings\" to control its passage through the tenuous upper atmosphere of Mars and lower the apoapsis of its orbit over the course of many months. Unfortunately, a structural failure shortly after launch severely damaged one of the MGS's solar panels and necessitated a higher aerobraking altitude (and hence one third the force) than originally planned, significantly extending the time required to attain the desired orbit. More recently, aerobraking was used by the Mars Odyssey and Mars Reconnaissance Orbiter spacecraft, in both cases without incident.\n\nIn 2014, an aerobraking experiment was successfully performed on a test basis near the end of the mission of the ESA probe Venus Express.[12][13]\n\nIn 2017–2018, the ESA ExoMars Trace Gas Orbiter performed aerobraking at Mars to reduce the apocentre of the orbit, being the first operational aerobraking for a European mission.[14]\n\n\nAerobraking in fiction[edit]\n\nIn Robert A. Heinlein's 1948 novel Space Cadet, aerobraking is used to save fuel while slowing the spacecraft Aes Triplex for an unplanned extended mission and landing on Venus, during a transit from the Asteroid Belt to Earth.[15]\n\nThe spacecraft Cosmonaut Alexei Leonov in Arthur C. Clarke's novel 2010: Odyssey Two and its film adaptation uses aerobraking in the upper layers of Jupiter's atmosphere to establish itself at the L1 Lagrangian point of the Jupiter – Io system.\n\nIn the 2004 TV series Space Odyssey: Voyage to the Planets the crew of the international spacecraft Pegasus perform an aerobraking manoeuvre in Jupiter's upper atmosphere to slow them down enough to enter Jovian orbit.\n\nIn the fourth episode of Stargate Universe, the Ancient ship Destiny suffers an almost complete loss of power and must use aerobraking to change course. The episode ends in a cliffhanger with Destiny headed directly toward a star.\n\nIn the space simulation sandbox game Kerbal Space Program, this is a common method of reducing a craft's orbital speed. It is sometimes humorously referred to as \"aerobreaking\", because the high drag sometimes causes large crafts to split in several parts.\n\nIn Kim Stanley Robinson's Mars trilogy, the Ares spaceship carrying the first hundred humans to arrive on Mars uses aerobraking to enter into orbit around the planet. Later in the books, as an effort to thicken the atmosphere scientists bring an asteroid into aerobraking in order to vaporize it and release its contents into the atmosphere.\n\nIn the 2014 film Interstellar, astronaut pilot Cooper uses aerobraking to save fuel and slow the spacecraft Ranger upon exiting the wormhole to arrive in orbit above the first planet.\n\n\nAerodynamic braking[edit]\n\nSee also: Air brake (aeronautics)\n\n  \nAn F-22 Raptor landing at Elmendorf AFB, demonstrating aerodynamic braking.\n\n\n\n  \nAerodynamic braking in Space Shuttle landings.\n\n\n\nAerodynamic braking is a method used in landing aircraft to assist the wheel brakes in stopping the plane. It is often used for short runway landings or when conditions are wet, icy or slippery. Aerodynamic braking is performed immediately after the rear wheels (main mounts) touch down, but before the nose wheel drops. The pilot begins to pull back on the stick, applying elevator pressure to hold the nose high. The nose-high attitude exposes more of the craft's surface-area to the flow of air, which produces greater drag, helping to slow the plane. The raised elevators also cause air to push down on the rear of the craft, forcing the rear wheels harder against the ground, which aids the wheel brakes by helping to prevent skidding. The pilot will usually continue to hold back on the stick even after the elevators lose their authority, and the nose wheel drops, to keep added pressure on the rear wheels.\n\nAerodynamic braking is a common braking technique during landing, which can also help to protect the wheel brakes and tyres from excess wear, or from locking up and sending the craft sliding out of control. It is often used by private pilots, commercial planes, fighter aircraft, and was used by the space shuttles during landings.[16][17][18]\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\tAerocapture\n\tBoost-glide\n\tLithobraking\n\n\n\n\n\t\tWikimedia Commons has media related to Aerobraking.\n\n\nNotes[edit]\n\n\n\t^ Jill L. Hanna Prince & Scott A. Striepe. \"NASA LANGLEY TRAJECTORY SIMULATION AND ANALYSIS CAPABILITIES FOR MARS RECONNAISSANCE ORBITER\" (PDF). NASA Langley Research Center. Archived from the original (PDF) on 2009-03-20. Retrieved 2008-06-09.\n\n\t^ http://www.spacedaily.com/mars/features/aero-97g.html article on MGS\n\n\t^ Spaceflight Now | Destination Mars | Spacecraft enters orbit around Mars\n\n\t^ a b Percy, T.K.; Bright, E. & Torres, A.O. (2005). \"Assessing the Relative Risk of Aerocapture Using Probabilistic Risk Assessment\" (PDF).\n\n\n\t^ \"SCIENCE TEAM AND INSTRUMENTS SELECTED FOR MARS SURVEYOR 2001 MISSIONS\". 6 November 1997.\n\n\n\t^ McRonald, Angus D.; Randolph, James E. (Jan 8–11, 1990). \"Hypersonic maneuvering to provide planetary gravity assist\". AIAA-1990-539, 28th Aerospace Sciences Meeting. Reno, NV.\n\n\n\t^ Prince, Jill L. H.; Powell, Richard W.; Murri, Dan. \"Autonomous Aerobraking: A Design, Development, and Feasibility Study\" (PDF). NASA Langley Research Center. NASA Technical Reports Server. Retrieved 15 September 2011.\n\n\n\t^ \"Deep Space Chronicle: A Chronology of Deep Space and Planetary Probes 1958–2000\" Archived 2008-09-25 at the Wayback Machine by Asif A. Siddiqi, NASA Monographs in Aerospace History No. 24.\n\n\t^ J. Kawaguchi, T. Icbikawa, T. Nishimura, K. Uesugi, L. Efron, J. Ellis, P. R. Menon and B. Tucker,\n\"Navigation for Muses-A (HITEN) Aerobraking in the Earth's Atmosphere – Preliminary Report\" Archived December 26, 2010, at the Wayback Machine, Proceedings of the 47th Annual Meeting of the Institute of Navigation June 10–12, 1991, pp.17–27.\n\n\t^ Gunter's Space Page \"MUSES-A (Hiten)\"\n\n\t^ http://www2.jpl.nasa.gov/magellan/prmgnwind.html\n\n\t^ \"Surfing an alien atmosphere\". ESA.int. European Space Agency. Retrieved 11 June 2015.\n\n\n\t^ \"Venus Express rises again\". ESA.int. European Space Agency. Retrieved 11 June 2015.\n\n\n\t^ \"Trace Gas Orbiter Aerobraking\".\n\n\n\t^ Robert A. Heinlein (2007). Space Cadet. Tom Doherty Associates. pp. 157–158. ISBN 978-1-4299-1253-2.\n\n\n\t^ Airplane Flying Handbook By the Federal Aviation Administration – Skyhorse Publishing 2007\n\n\t^ \"Publications\". Archived from the original on 2016-06-10. Retrieved 2012-07-31.\n\n\n\t^ Cosmic Perspectives in Space Physics By S. Biswas – Kluwer Academic Publishing 2000 Page 28\n\n\n\n\n\nReferences[edit]\n\n\tJPL aerobraking report for MGS\n\tAn Explanation of How Aerobraking Works (PDF)\n\tHoffman, S. (August 20–22, 1984). A comparison of aerobraking and aerocapture vehicles for interplanetary missions. AIAA and AAS, Astrodynamics Conference. Seattle, Washington: American Institute of Aeronautics and Astronautics. pp. 25 p.. Retrieved 2007-07-31.\n\n\n\t\tv\n\tt\n\te\n\n\nMaglev\n\n\tTechnologies\t\n\tLinear induction motor\n\tMagnetic levitation\n\tElectromagnetic suspension (EMS)\n\tElectrodynamic suspension (EDS)\n\tGuideway\n\tMagnetic bearing\n\tServomechanism\n\tEddy current brake\n\tLift-to-drag ratio\n\n\n\n\n\tSystems\t\n\tHigh Speed Surface Transport\n\tInductrack\n\tLaunch loop\n\tVactrain\n\tStarTram\n\tTransrapid\n\n\n\n\n\tLines\t\n\tBeijing S1 Line\n\tBirmingham International Maglev shuttle\n\tCalifornia–Nevada Interstate Maglev\n\tChangsha Maglev Express\n\tDaejon Expo Maglev\n\tIncheon Airport Maglev\n\tLeningrad MagLev System\n\tLinimo\n\tL0 Series Shinkansen\n\tM-Bahn\n\tShanghai Maglev Train\n\tShanghai–Hangzhou Maglev Line\n\tSCMaglev (Chuo Shinkansen)\n\tUK Ultraspeed\n\n\n\n\n\tTransport Accidents\t\n\tLathen train collision\n\n\n\n\n\tProposals in italics\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Aerobraking&oldid=915069140\"\n\n\t\t\n\t\tCategories: \tSpacecraft propulsion\n\tSpaceflight\n\tAtmospheric entry\n\n\nHidden categories: \tWebarchive template wayback links\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from March 2011\n\tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCatalà\n\tČeština\n\tDeutsch\n\tEspañol\n\tFrançais\n\tGalego\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tLatviešu\n\tMagyar\n\tNederlands\n\t日本語\n\tPolski\n\tPortuguês\n\tSlovenčina\n\tСрпски / srpski\n\tSuomi\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 11 September 2019, at 01:34 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "14", "dc:title": "Aerobraking - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/MRO_Aerobrake.jpg/1200px-MRO_Aerobrake.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-aerobraking", "title": "Aerobraking - Wikipedia"}}