{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSatellite - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tSatellite\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Artificial satellite)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tHuman-made object put into an orbit\n\nThis article is about artificial satellites. For natural satellites, also known as moons, see Natural satellite. For other uses, see Satellite (disambiguation).\n\n\"Artificial moon\" redirects here. For the electric light used to simulate moonlight, see moonlight tower.\n\n\tPart of a series on\n\tSpaceflight\n\t\n\n\n\t\nHistory\n\t\n\tSpace Race\n\tTimeline of spaceflight\n\tSpace probes\n\tLunar missions\n\n\n\t\nApplications\n\t\n\tEarth observation satellites\n\tSpy satellites\n\tCommunications satellites\n\tSatellite navigation\n\tSpace telescopes\n\tSpace exploration\n\tSpace tourism\n\tSpace colonization\n\n\n\t\nSpacecraft\n\t\n\tRobotic spacecraft\n\n\tSatellite\n\tSpace probe\n\tCargo spacecraft\n\n\n\tHuman spaceflight\n\n\tSpace capsule\n\tSpace station\n\tSpaceplane\n\n\n\n\n\t\nLaunch\n\t\n\tSpaceport\n\tLaunch pad\n\tExpendable and reusable launch vehicles\n\tEscape velocity\n\tNon-rocket spacelaunch\n\n\n\t\nDestinations\n\t\n\tSub-orbital\n\tOrbital\n\tMoon\n\tInterplanetary spaceflight\n\tInterstellar travel\n\tIntergalactic travel\n\n\n\t\nSpace agencies\n\t\n\tESA\n\tCSA\n\tRKA\n\tCNES\n\tDLR\n\tISA\n\tCNSA\n\tISRO\n\tNASA\n\tJAXA\n\n\n\t\nPrivate spaceflight\n\t\n\tBigelow Aerospace\n\tBlue Origin\n\tOrbital ATK\n\tSierra Nevada Corporation\n\tSpaceX\n\tVirgin Galactic\n\n\n\t\n Spaceflight portal\n\t\tv\n\tt\n\te\n\n\n\n\n\n\n\n\nPlay media\n  \nNASA's Earth-observing fleet as of June 2019\n\n\n\n  \nA full-size model of the Earth observation satellite ERS 2\n\n\n\nIn the context of spaceflight, a satellite is an object that has been intentionally placed into orbit. These objects are called artificial satellites to distinguish them from natural satellites such as Earth's Moon.\n\nOn 4 October 1957 the Soviet Union launched the world's first artificial satellite, Sputnik 1. Since then, about 8,900 satellites from more than 40 countries have been launched. According to a 2018 estimate, some 5,000 remain in orbit. Of those about 1,900 were operational, while the rest have lived out their useful lives and become space debris. Approximately 63% of operational satellites are in low-Earth orbit, 6% are in medium-Earth orbit (at 20,000 km), 29% are in geostationary orbit (at 36,000 km) and the remaining 2% are in elliptic orbit.[1]\nA few large space stations have been launched in parts and assembled in orbit. Over a dozen space probes have been placed into orbit around other bodies and become artificial satellites of the Moon, Mercury, Venus, Mars, Jupiter, Saturn, a few asteroids,[2] a comet and the Sun. \n\nSatellites are used for many purposes. Among several other applications, they can be used to make star maps and maps of planetary surfaces, and also take pictures of planets they are launched into. Common types include military and civilian Earth observation satellites, communications satellites, navigation satellites, weather satellites, and space telescopes. Space stations and human spacecraft in orbit are also satellites. Satellite orbits vary greatly, depending on the purpose of the satellite, and are classified in a number of ways. Well-known (overlapping) classes include low Earth orbit, polar orbit, and geostationary orbit.\n\nA launch vehicle is a rocket that places a satellite into orbit. Usually, it lifts off from a launch pad on land. Some are launched at sea from a submarine or a mobile maritime platform, or aboard a plane (see air launch to orbit).\n\nSatellites are usually semi-independent computer-controlled systems. Satellite subsystems attend many tasks, such as power generation, thermal control, telemetry, attitude \n\n\nContents\n\n\n\t1 History\n\t2 Space Surveillance Network\n\t3 Non-military satellite services\n\t3.1 Fixed satellite services\n\t3.2 Mobile satellite systems\n\t3.3 Scientific research satellites (commercial and noncommercial)\n\n\n\n\t4 Types\n\t5 Orbit types\n\t5.1 Centric classifications\n\t5.2 Altitude classifications\n\t5.3 Inclination classifications\n\t5.4 Eccentricity classifications\n\t5.5 Synchronous classifications\n\t5.6 Special classifications\n\t5.7 Pseudo-orbit classifications\n\n\n\n\t6 Satellite subsystems\n\t6.1 Spacecraft bus or service module\n\t6.1.1 Structural subsystem\n\t6.1.2 Telemetry subsystem\n\t6.1.3 Power subsystem\n\t6.1.4 Thermal control subsystem\n\t6.1.5 Attitude and orbit control subsystem\n\n\n\n\t6.2 Communication payload\n\n\n\n\t7 End of life\n\t8 Launch-capable countries\n\t8.1 Attempted first launches\n\t8.2 Other notes\n\t8.3 Launch capable private entities\n\n\n\n\t9 First satellites of countries\n\t9.1 Attempted first satellites\n\t9.2 Planned first satellites\n\n\n\n\t10 Attacks on satellites\n\t10.1 Jamming\n\n\n\n\t11 Earth observation using satellites\n\t11.1 NASA\n\t11.2 ESA\n\t11.3 SpaceX\n\t11.4 Amazon and Lockheed\n\n\n\n\t12 Satellite services\n\t13 See also\n\t14 References\n\t15 External links\n\n\n\n\n\nHistory[edit]\n\n  \nKonstantin Tsiolkovsky\n\n\n\n  \nA 1949 issue of Popular Science depicts the idea of an \"artificial moon\"\n\n\n\n  \nAnimation depicting the orbits of GPS satellites in medium Earth orbit.\n\n\n\n  \nSputnik 1: The first artificial satellite to orbit Earth.\n\n\n\n  \n1U CubeSat ESTCube-1, developed mainly by the students from the University of Tartu, carries out a tether deployment experiment in low Earth orbit.\n\n\n\nThe first published mathematical study of the possibility of an artificial satellite was Newton's cannonball, a thought experiment in A Treatise of the System of the World by Isaac Newton (1687). The first fictional depiction of a satellite being launched into orbit was a short story by Edward Everett Hale, The Brick Moon.[3][4] The idea surfaced again in Jules Verne's The Begum's Fortune (1879).\n\nIn 1903, Konstantin Tsiolkovsky (1857–1935) published Exploring Space Using Jet Propulsion Devices, which is the first academic treatise on the use of rocketry to launch spacecraft. He calculated the orbital speed required for a minimal orbit, and that a multi-stage rocket fueled by liquid propellants could achieve this.\n\nIn 1928, Herman Potočnik (1892–1929) published his sole book, The Problem of Space Travel – The Rocket Motor. He described the use of orbiting spacecraft for observation of the ground and described how the special conditions of space could be useful for scientific experiments.\n\nIn a 1945 Wireless World article, the English science fiction writer Arthur C. Clarke described in detail the possible use of communications satellites for mass communications.[5] He suggested that three geostationary satellites would provide coverage over the entire planet.\n\nIn May 1946, the United States Air Force's Project RAND released the Preliminary Design of an Experimental World-Circling Spaceship, which stated that \"A satellite vehicle with appropriate instrumentation can be expected to be one of the most potent scientific tools of the Twentieth Century.\"[6] The United States had been considering launching orbital satellites since 1945 under the Bureau of Aeronautics of the United States Navy. Project RAND eventually released the report, but considered the satellite to be a tool for science, politics, and propaganda, rather than a potential military weapon.[7] In February 1954 Project RAND released \"Scientific Uses for a Satellite Vehicle,\" written by R.R. Carhart.[8] This expanded on potential scientific uses for satellite vehicles and was followed in June 1955 with \"The Scientific Use of an Artificial Satellite,\" by H.K. Kallmann and W.W. Kellogg.[9]\n\nIn the context of activities planned for the International Geophysical Year (1957–58), the White House announced on 29 July 1955 that the U.S. intended to launch satellites by the spring of 1958. This became known as Project Vanguard. On 31 July, the Soviets announced that they intended to launch a satellite by the fall of 1957.\n\nThe first artificial satellite was Sputnik 1, launched by the Soviet Union on 4 October 1957 under the Sputnik program, with Sergei Korolev as chief designer. Sputnik 1 helped to identify the density of high atmospheric layers through measurement of its orbital change and provided data on radio-signal distribution in the ionosphere. The unanticipated announcement of Sputnik 1's success precipitated the Sputnik crisis in the United States and ignited the so-called Space Race within the Cold War.\n\nSputnik 2 was launched on 3 November 1957 and carried the first living passenger into orbit, a dog named Laika.[10]\n\nIn early 1955, following pressure by the American Rocket Society, the National Science Foundation, and the International Geophysical Year, the Army and Navy were working on Project Orbiter with two competing programs. The army used the Jupiter C rocket, while the civilian/Navy program used the Vanguard rocket to launch a satellite. Explorer 1 became the United States' first artificial satellite on 31 January 1958.[11]\n\nIn June 1961, three-and-a-half years after the launch of Sputnik 1, the United States Space Surveillance Network cataloged 115 Earth-orbiting satellites.[12]\n\nEarly satellites were constructed to unique designs. With advancements in technology, multiple satellites began to be built on single model platforms called satellite buses. The first standardized satellite bus design was the HS-333 geosynchronous (GEO) communication satellite launched in 1972.\n\nCurrently the largest artificial satellite ever is the International Space Station.\n\n\nSpace Surveillance Network[edit]\n\nMain article: United States Space Surveillance Network\n\nThe United States Space Surveillance Network (SSN), a division of the United States Strategic Command, has been tracking objects in Earth's orbit since 1957 when the Soviet Union opened the Space Age with the launch of Sputnik I. Since then, the SSN has tracked more than 26,000 objects. The SSN currently tracks more than 8,000-artificial orbiting objects. The rest have re-entered Earth's atmosphere and disintegrated, or survived re-entry and impacted the Earth. The SSN tracks objects that are 10 centimeters in diameter or larger; those now orbiting Earth range from satellites weighing several tons to pieces of spent rocket bodies weighing only 10 pounds. About seven percent are operational satellites (i.e. ~560 satellites), the rest are space debris.[13] The United States Strategic Command is primarily interested in the active satellites, but also tracks space debris which upon reentry might otherwise be mistaken for incoming missiles.\n\n\nNon-military satellite services[edit]\n\nThere are three basic categories of non-military satellite services:[14]\n\n\nFixed satellite services[edit]\n\nFixed satellite services handle hundreds of billions of voice, data, and video transmission tasks across all countries and continents between certain points on the Earth's surface.\n\n\nMobile satellite systems[edit]\n\nMain article: Mobile-satellite service\n\nMobile satellite systems help connect remote regions, vehicles, ships, people and aircraft to other parts of the world and/or other mobile or stationary communications units, in addition to serving as navigation systems.\n\n\n Scientific research satellites (commercial and noncommercial)[edit]\n\nScientific research satellites provide meteorological information, land survey data (e.g. remote sensing), Amateur (HAM) Radio, and other different scientific research applications such as earth science, marine science, and atmospheric research.\n\n\nTypes[edit]\n\n\tAstronomical satellites are satellites used for observation of distant planets, galaxies, and other outer space objects.\n\tBiosatellites are satellites designed to carry living organisms, generally for scientific experimentation.\n\tCommunication satellites are satellites stationed in space for the purpose of telecommunications. Modern communications satellites typically use geosynchronous orbits, Molniya orbits or Low Earth orbits.\n\tEarth observation satellites are satellites intended for non-military uses such as environmental monitoring, meteorology, map making etc. (See especially Earth Observing System.)\n\tNavigational satellites are satellites which use radio time signals transmitted to enable mobile receivers on the ground to determine their exact location. The relatively clear line of sight between the satellites and receivers on the ground, combined with ever-improving electronics, allows satellite navigation systems to measure location to accuracies on the order of a few meters in real time.\n\tKiller Satellites are satellites that are designed to destroy enemy warheads, satellites, and other space assets.\n\tCrewed spacecraft (spaceships) are large satellites able to put humans into (and beyond) an orbit, and return them to Earth. Spacecraft including spaceplanes of reusable systems have major propulsion or landing facilities. They can be used as transport to and from the orbital stations.\n\tMiniaturized satellites are satellites of unusually low masses and small sizes.[15] New classifications are used to categorize these satellites: minisatellite (500–1000 kg), microsatellite (below 100 kg), nanosatellite (below 10 kg).[citation needed]\n\tReconnaissance satellites are Earth observation satellite or communications satellite deployed for military or intelligence applications. Very little is known about the full power of these satellites, as governments who operate them usually keep information pertaining to their reconnaissance satellites classified.\n\tRecovery satellites are satellites that provide a recovery of reconnaissance, biological, space-production and other payloads from orbit to Earth.\n\n\n  \nInternational Space Station\n\n\n\n\tSpace-based solar power satellites are proposed satellites that would collect energy from sunlight and transmit it for use on Earth or other places.\n\tSpace stations are artificial orbital structures that are designed for human beings to live on in outer space. A space station is distinguished from other crewed spacecraft by its lack of major propulsion or landing facilities. Space stations are designed for medium-term living in orbit, for periods of weeks, months, or even years.\n\tTether satellites are satellites which are connected to another satellite by a thin cable called a tether.\n\tWeather satellites are primarily used to monitor Earth's weather and climate.[16]\n\n\nOrbit types[edit]\n\nMain article: List of orbits\n\n  \nVarious earth orbits to scale; cyan represents low earth orbit, yellow represents medium earth orbit, the black dashed line represents geosynchronous orbit, the green dash-dot line the orbit of Global Positioning System (GPS) satellites, and the red dotted line the orbit of the International Space Station (ISS).\n\n\n\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 1,886[17] artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.\n\nThe commonly used altitude classifications of geocentric orbit are Low Earth orbit (LEO), Medium Earth orbit (MEO) and High Earth orbit (HEO). Low Earth orbit is any orbit below 2,000 km. Medium Earth orbit is any orbit between 2,000 and 35,786 km. High Earth orbit is any orbit higher than 35,786 km.\n\n\nCentric classifications[edit]\n\n\tGalactocentric orbit: An orbit around the centre of a galaxy. The Sun follows this type of orbit about the galactic centre of the Milky Way.\n\tGeocentric orbit: An orbit around the planet Earth, such as the Moon or artificial satellites. Currently there are approximately 1,886[17] artificial satellites orbiting the Earth.\n\tHeliocentric orbit: An orbit around the Sun. In our Solar System, all planets, comets, and asteroids are in such orbits, as are many artificial satellites and pieces of space debris. Moons by contrast are not in a heliocentric orbit but rather orbit their parent planet.\n\tAreocentric orbit: An orbit around the planet Mars, such as by moons or artificial satellites.\n\n\nThe general structure of a satellite is that it is connected to the earth stations that are present on the ground and connected through terrestrial links.\n\n\nAltitude classifications[edit]\n\n\tLow Earth orbit (LEO): Geocentric orbits ranging in altitude from 180 km – 2,000 km (1,200 mi)\n\tMedium Earth orbit (MEO): Geocentric orbits ranging in altitude from 2,000 km (1,200 mi) – 35,786 km (22,236 mi). Also known as an intermediate circular orbit.\n\tGeosynchronous orbit (GEO): Geocentric circular orbit with an altitude of 35,786 kilometres (22,236 mi). The period of the orbit equals one sidereal day, coinciding with the rotation period of the Earth. The speed is approximately 3,000 metres per second (9,800 ft/s).\n\tHigh Earth orbit (HEO): Geocentric orbits above the altitude of geosynchronous orbit 35,786 km (22,236 mi).\n\n\n  \nOrbital Altitudes of several significant satellites of earth.\n\n\n\nInclination classifications[edit]\n\n\tInclined orbit: An orbit whose inclination in reference to the equatorial plane is not zero degrees.\n\tPolar orbit: An orbit that passes above or nearly above both poles of the planet on each revolution. Therefore, it has an inclination of (or very close to) 90 degrees.\n\tPolar sun synchronous orbit: A nearly polar orbit that passes the equator at the same local time on every pass. Useful for image taking satellites because shadows will be nearly the same on every pass.\n\n\n\n\nEccentricity classifications[edit]\n\n\tCircular orbit: An orbit that has an eccentricity of 0 and whose path traces a circle.\n\tHohmann transfer orbit: An orbit that moves a spacecraft from one approximately circular orbit, usually the orbit of a planet, to another, using two engine impulses. The perihelion of the transfer orbit is at the same distance from the Sun as the radius of one planet's orbit, and the aphelion is at the other. The two rocket burns change the spacecraft's path from one circular orbit to the transfer orbit, and later to the other circular orbit. This maneuver was named after Walter Hohmann.\n\n\n\tElliptic orbit: An orbit with an eccentricity greater than 0 and less than 1 whose orbit traces the path of an ellipse.\n\tGeosynchronous transfer orbit: An elliptic orbit where the perigee is at the altitude of a Low Earth orbit (LEO) and the apogee at the altitude of a geosynchronous orbit.\n\tGeostationary transfer orbit: An elliptic orbit where the perigee is at the altitude of a Low Earth orbit (LEO) and the apogee at the altitude of a geostationary orbit.\n\tMolniya orbit: A highly elliptic orbit with inclination of 63.4° and orbital period of half of a sidereal day (roughly 12 hours). Such a satellite spends most of its time over two designated areas of the planet (specifically Russia and the United States).\n\tTundra orbit: A highly elliptic orbit with inclination of 63.4° and orbital period of one sidereal day (roughly 24 hours). Such a satellite spends most of its time over a single designated area of the planet.\n\n\n\n\nSynchronous classifications[edit]\n\n\tSynchronous orbit: An orbit where the satellite has an orbital period equal to the average rotational period (earth's is: 23 hours, 56 minutes, 4.091 seconds) of the body being orbited and in the same direction of rotation as that body. To a ground observer such a satellite would trace an analemma (figure 8) in the sky.\n\tSemi-synchronous orbit (SSO): An orbit with an altitude of approximately 20,200 km (12,600 mi) and an orbital period equal to one-half of the average rotational period (Earth's is approximately 12 hours) of the body being orbited\n\tGeosynchronous orbit (GSO): Orbits with an altitude of approximately 35,786 km (22,236 mi). Such a satellite would trace an analemma (figure 8) in the sky.\n\tGeostationary orbit (GEO): A geosynchronous orbit with an inclination of zero. To an observer on the ground this satellite would appear as a fixed point in the sky.[18]\n\tClarke orbit: Another name for a geostationary orbit. Named after scientist and writer Arthur C. Clarke.\n\n\n\tSupersynchronous orbit: A disposal / storage orbit above GSO/GEO. Satellites will drift west. Also a synonym for Disposal orbit.\n\tSubsynchronous orbit: A drift orbit close to but below GSO/GEO. Satellites will drift east.\n\tGraveyard orbit: An orbit a few hundred kilometers above geosynchronous that satellites are moved into at the end of their operation.\n\tDisposal orbit: A synonym for graveyard orbit.\n\tJunk orbit: A synonym for disposal orbit.\n\n\n\n\n\tAreosynchronous orbit: A synchronous orbit around the planet Mars with an orbital period equal in length to Mars' sidereal day, 24.6229 hours.\n\tAreostationary orbit (ASO): A circular areosynchronous orbit on the equatorial plane and about 17000 km (10557 miles) above the surface. To an observer on the ground this satellite would appear as a fixed point in the sky.\n\tHeliosynchronous orbit: A heliocentric orbit about the Sun where the satellite's orbital period matches the Sun's period of rotation. These orbits occur at a radius of 24,360 Gm (0.1628 AU) around the Sun, a little less than half of the orbital radius of Mercury.\n\n\nSpecial classifications[edit]\n\n\tSun-synchronous orbit: An orbit which combines altitude and inclination in such a way that the satellite passes over any given point of the planets' surface at the same local solar time. Such an orbit can place a satellite in constant sunlight and is useful for imaging, spy, and weather satellites.\n\tMoon orbit: The orbital characteristics of Earth's Moon. Average altitude of 384,403 kilometers (238,857 mi), elliptical–inclined orbit.\n\n\nPseudo-orbit classifications[edit]\n\n\tHorseshoe orbit: An orbit that appears to a ground observer to be orbiting a certain planet but is actually in co-orbit with the planet. See asteroids 3753 (Cruithne) and 2002 AA29.\n\tSuborbital spaceflight: A maneuver where a spacecraft approaches the height of orbit but lacks the velocity to sustain it.\n\tLunar transfer orbit (LTO)\n\tPrograde orbit: An orbit with an inclination of less than 90°. Or rather, an orbit that is in the same direction as the rotation of the primary.\n\tRetrograde orbit: An orbit with an inclination of more than 90°. Or rather, an orbit counter to the direction of rotation of the planet. Apart from those in sun-synchronous orbit, few satellites are launched into retrograde orbit because the quantity of fuel required to launch them is much greater than for a prograde orbit. This is because when the rocket starts out on the ground, it already has an eastward component of velocity equal to the rotational velocity of the planet at its launch latitude.\n\tHalo orbit and Lissajous orbit: Orbits \"around\" Lagrangian points.\n\n\nSatellite subsystems[edit]\n\nThe satellite's functional versatility is imbedded within its technical components and its operations characteristics. Looking at the \"anatomy\" of a typical satellite, one discovers two modules.[14] Note that some novel architectural concepts such as Fractionated spacecraft somewhat upset this taxonomy.\n\n\nSpacecraft bus or service module[edit]\n\nThe bus module consists of the following subsystems:\n\n\nStructural subsystem[edit]\n\nThe structural subsystem provides the mechanical base structure with adequate stiffness to withstand stress and vibrations experienced during launch, maintain structural integrity and stability while on station in orbit, and shields the satellite from extreme temperature changes and micro-meteorite damage.\n\n\nTelemetry subsystem[edit]\n\nThe telemetry subsystem (aka Command and Data Handling, C&DH) monitors the on-board equipment operations, transmits equipment operation data to the earth control station, and receives the earth control station's commands to perform equipment operation adjustments.\n\n\nPower subsystem[edit]\n\nThe power subsystem consists of solar panels to convert solar energy into electrical power, regulation and distribution functions, and batteries that store power and supply the satellite when it passes into the Earth's shadow. Nuclear power sources (Radioisotope thermoelectric generator) have also been used in several successful satellite programs including the Nimbus program (1964–1978).[19]\n\n\nThermal control subsystem[edit]\n\nMain article: Spacecraft thermal control\n\nThe thermal control subsystem helps protect electronic equipment from extreme temperatures due to intense sunlight or the lack of sun exposure on different sides of the satellite's body (e.g. optical solar reflector)\n\n\nAttitude and orbit control subsystem[edit]\n\nMain articles: Attitude control and Spacecraft propulsion\n\nThe attitude and orbit control subsystem consists of sensors to measure vehicle orientation, control laws embedded in the flight software, and actuators (reaction wheels, thrusters). These apply the torques and forces needed to re-orient the vehicle to a desired attitude, keep the satellite in the correct orbital position, and keep antennas pointed in the right directions.\n\n\nCommunication payload[edit]\n\nThe second major module is the communication payload, which is made up of transponders. A transponder is capable of :\n\n\n\tReceiving uplinked radio signals from earth satellite transmission stations (antennas).\n\tAmplifying received radio signals\n\tSorting the input signals and directing the output signals through input/output signal multiplexers to the proper downlink antennas for retransmission to earth satellite receiving stations (antennas).\n\n\nEnd of life[edit]\n\nWhen satellites reach the end of their mission (this normally occurs within 3 or 4 years after launch), satellite operators have the option of de-orbiting the satellite, leaving the satellite in its current orbit or moving the satellite to a graveyard orbit. Historically, due to budgetary constraints at the beginning of satellite missions, satellites were rarely designed to be de-orbited. One example of this practice is the satellite Vanguard 1. Launched in 1958, Vanguard 1, the 4th artificial satellite put in Geocentric orbit, was still in orbit as of March 2015[update], as well as the upper stage of its launch rocket.[20][21]\n\nInstead of being de-orbited, most satellites are either left in their current orbit or moved to a graveyard orbit.[22] As of 2002, the FCC requires all geostationary satellites to commit to moving to a graveyard orbit at the end of their operational life prior to launch.[23] In cases of uncontrolled de-orbiting, the major variable is the solar flux, and the minor variables the components and form factors of the satellite itself, and the gravitational perturbations generated by the Sun and the Moon (as well as those exercised by large mountain ranges, whether above or below sea level). The nominal breakup altitude due to aerodynamic forces and temperatures is 78 km, with a range between 72 and 84 km. Solar panels, however, are destroyed before any other component at altitudes between 90 and 95 km.[24]\n\n\nLaunch-capable countries[edit]\n\nMain article: Timeline of first orbital launches by nationality\n\nThis list includes countries with an independent capability to place satellites in orbit, including production of the necessary launch vehicle. Note: many more countries have the capability to design and build satellites but are unable to launch them, instead relying on foreign launch services. This list does not consider those numerous countries, but only lists those capable of launching satellites indigenously, and the date this capability was first demonstrated. The list does not include the European Space Agency, a multi-national state organization, nor private consortiums.\n\n\n\n\n\nFirst launch by country\n\tOrder\n\tCountry\tDate of first launch\tRocket\tSatellite(s)\n\n\t1\n\tSoviet Union\t4 October 1957\tSputnik-PS\tSputnik 1\n\n\t2\n\tUnited States\t1 February 1958\tJuno I\tExplorer 1\n\n\t3\n\tFrance\t26 November 1965\tDiamant-A\tAstérix\n\n\t4\n\tJapan\t11 February 1970\tLambda-4S\tOhsumi\n\n\t5\n\tChina\t24 April 1970\tLong March 1\tDong Fang Hong I\n\n\t6\n\tUnited Kingdom\t28 October 1971\tBlack Arrow\tProspero\n\n\t7\n\tIndia\t18 July 1980\tSLV\tRohini D1\n\n\t8\n\tIsrael\t19 September 1988\tShavit\tOfeq 1\n\n\t– [1]\n\tRussia\t21 January 1992\tSoyuz-U\tKosmos 2175\n\n\t– [1]\n\tUkraine\t13 July 1992\tTsyklon-3\tStrela\n\n\t9\n\tIran\t2 February 2009\tSafir-1\tOmid\n\n\t10\n\tNorth Korea\t12 December 2012\tUnha-3\tKwangmyŏngsŏng-3 Unit 2\n\n\t11\n\tSouth Korea\t30 January 2013\tNaro-1\tSTSAT-2C\n\n\t12\n\tNew Zealand\t12 November 2018\tElectron\tCubeSat\n\n\n\nAttempted first launches[edit]\n\n\t\tThis section needs expansion. You can help by adding to it.  (May 2012)\n\n\n\n\tThe United States tried in 1957 to launch the first satellite using its own launcher before successfully completing a launch in 1958.\n\tJapan tried four times in 1966–1969 to launch a satellite with its own launcher before successfully completing a launch in 1970.\n\tChina tried in 1969 to launch the first satellite using its own launcher before successfully completing a launch in 1970.\n\tIndia, after launching its first national satellite using a foreign launcher in 1975, tried in 1979 to launch the first satellite using its own launcher before succeeding in 1980.\n\tIraq have claimed an orbital launch of a warhead in 1989, but this claim was later disproved.[28]\n\tBrazil, after launching its first national satellite using a foreign launcher in 1985, tried to launch a satellite using its own VLS 1 launcher three times in 1997, 1999, and 2003, but all attempts were unsuccessful.\n\tNorth Korea claimed a launch of Kwangmyŏngsŏng-1 and Kwangmyŏngsŏng-2 satellites in 1998 and 2009, but U.S., Russian and other officials and weapons experts later reported that the rockets failed to send a satellite into orbit, if that was the goal. The United States, Japan and South Korea believe this was actually a ballistic missile test, which was a claim also made after North Korea's 1998 satellite launch, and later rejected.[29] The first (April 2012) launch of Kwangmyŏngsŏng-3 was unsuccessful, a fact publicly recognized by the DPRK. However, the December 2012 launch of the \"second version\" of Kwangmyŏngsŏng-3 was successful, putting the DPRK's first confirmed satellite into orbit.\n\tSouth Korea (Korea Aerospace Research Institute), after launching their first national satellite by foreign launcher in 1992, unsuccessfully tried to launch its own launcher, the KSLV (Naro)-1, (created with the assistance of Russia) in 2009 and 2010 until success was achieved in 2013 by Naro-3.\n\tThe First European multi-national state organization ELDO tried to make the orbital launches at Europa I and Europa II rockets in 1968–1970 and 1971 but stopped operation after failures.\n\n\nOther notes[edit]\n\n\t^  Russia and the Ukraine were parts of the Soviet Union and thus inherited their launch capability without the need to develop it indigenously. Through the Soviet Union they are also on the number one position in this list of accomplishments.\n\tFrance, the United Kingdom, and Ukraine launched their first satellites by own launchers from foreign spaceports.\n\tSome countries such as South Africa, Spain, Italy, Germany, Canada, Australia, Argentina, Egypt and private companies such as OTRAG, have developed their own launchers, but have not had a successful launch.\n\tOnly twelve, countries from the list below (USSR, USA, France, Japan, China, UK, India, Russia, Ukraine, Israel, Iran and North Korea) and one regional organization (the European Space Agency, ESA) have independently launched satellites on their own indigenously developed launch vehicles.\n\tSeveral other countries, including Brazil, Argentina, Pakistan, Romania, Taiwan, Indonesia, Australia, Malaysia, Turkey and Switzerland are at various stages of development of their own small-scale launcher capabilities.\n\n\nLaunch capable private entities[edit]\n\nOrbital Sciences Corporation launched a satellite into orbit on the Pegasus in 1990.  SpaceX launched a satellite into orbit on the Falcon 1 in 2008.  Rocket Lab launched three cubesats into orbit on the Electron in 2018.\n\n\nFirst satellites of countries[edit]\n\nMain article: Timeline of first satellites by country\n\nFirst satellites of countries including those launched indigenously or with the help of others[30]\n\tCountry\tYear of first launch\tFirst satellite\tOperational payloads in orbit as of July 2018\n\n\tSoviet Union \n (Russia)\t1957 \n (1992)\tSputnik 1 \n (Kosmos 2175)\t1507\n\n\tUnited States\t1958\tExplorer 1\t1619\n\n\tChina\t1970\tDong Fang Hong I\t0312\n\n\tJapan\t1970\tOhsumi\t0173\n\n\tIndia\t1975\tAryabhata\t0088\n\n\tFrance\t1965\tAstérix\t0068\n\n\tGermany\t1969\tAzur\t0054\n\n\tCanada\t1962\tAlouette 1\t0048\n\n\tUnited Kingdom\t1962\tAriel 1\t0043\n\n\tItaly\t1964\tSan Marco 1\t0027\n\n\tSouth Korea\t1992\tKitsat A\t24\n\n\tSpain\t1974\tIntasat\t00024\n\n\tAustralia\t1967\tWRESAT\t0021\n\n\tBrazil\t1985\tBrasilsat-A1\t0020\n\n\tArgentina\t1990\tLusat[31]\t19\n\n\tIsrael\t1988\tOfeq 1\t00017\n\n\tIndonesia\t1976\tPalapa A1\t16\n\n\tTurkey\t1994\tTurksat 1B\t15\n\n\tSaudi Arabia\t1985\tArabsat-1A\t0013\n\n\tMexico\t1985\tMorelos 1\t12\n\n\tSweden\t1986\tViking\t0012\n\n\tSingapore\t1998\tST-1[32][33]\t10\n\n\tNetherlands\t1974\tANS\t0006\n\n\tCzechoslovakia\t1978\tMagion 1\t2\n\n\tBulgaria\t1981\tIntercosmos Bulgaria 1300\t0001\n\n\tLuxembourg\t1988\tAstra 1A\t4\n\n\tPakistan\t1990\tBadr-1\t6\n\n\tPortugal\t1993\tPoSAT-1\t2\n\n\tThailand\t1993\tThaicom 1\t9\n\n\tCzech Republic\t1995\tMagion 4\t3\n\n\tUkraine\t1995\tSich-1\t0006\n\n\tMalaysia\t1996\tMEASAT\t7\n\n\tNorway\t1997\tThor 2\t9\n\n\tPhilippines\t1997\tMabuhay 1\t0002\n\n\tEgypt\t1998\tNilesat 101\t5\n\n\tChile\t1998\tFASat-Bravo\t3\n\n\tDenmark\t1999\tØrsted\t9\n\n\tSouth Africa\t1999\tSUNSAT\t6\n\n\tUnited Arab Emirates\t2000\tThuraya 1\t9\n\n\tMorocco\t2001\tMaroc-Tubsat\t0001\n\n\tBelgium\t2001\tPROBA-1\t0\n\n\tTonga[34]\t2002\tEsiafi 1 (former Comstar D4)\t0\n\n\tAlgeria\t2002\tAlsat 1\t6\n\n\tGreece\t2003\tHellas Sat 2\t4\n\n\tCyprus\t2003\tHellas Sat 2\t0\n\n\tNigeria\t2003\tNigeriasat 1\t6\n\n\tIran\t2005\tSina-1\t0001\n\n\tKazakhstan\t2006\tKazSat 1\t6\n\n\tColombia\t2007\tLibertad 1\t0\n\n\tMauritius\t2007\tRascom-QAF 1\t0\n\n\tVietnam\t2008\tVinasat-1\t0003\n\n\tVenezuela\t2008\tVenesat-1\t3\n\n\tSwitzerland\t2009\tSwissCube-1[35]\t0\n\n\tIsle of Man\t2011\tViaSat-1\t0001\n\n\tPoland[36]\t2012\tPW-Sat\t00004\n\n\tHungary\t2012\tMaSat-1\t0000\n\n\tSri Lanka\t2012\tSupremeSAT-I\t1\n\n\tRomania\t2012\tGoliat[37]\t0\n\n\tBelarus\t2012\tBKA (BelKA-2)[38]\t2\n\n\tNorth Korea\t2012\tKwangmyŏngsŏng-3 Unit 2\t2\n\n\tAzerbaijan\t2013\tAzerspace[39]\t1\n\n\tAustria\t2013\tTUGSAT-1/UniBRITE[40][41]\t0\n\n\tBermuda[42]\t2013\tBermudasat 1 (former EchoStar VI)\t0\n\n\tEcuador\t2013\tNEE-01 Pegaso\t2\n\n\tEstonia\t2013\tESTCube-1\t1\n\n\tJersey\t2013\tO3b-1, −2, −3, −4\t0\n\n\tQatar\t2013\tEs'hailSat1\t0\n\n\tPeru\t2013\tPUCPSAT-1[43]\t2\n\n\tBolivia\t2013\tTKSat-1\t1\n\n\tLithuania\t2014\tLituanicaSAT-1 and LitSat-1\t1\n\n\tUruguay\t2014\tAntelsat\t1\n\n\tIraq\t2014\tTigrisat[44]\t0\n\n\tTurkmenistan\t2015\tTurkmenAlem52E/MonacoSAT\t1\n\n\tLaos\t2015\tLaosat-1\t1\n\n\tFinland\t2017\tAalto-2\t1\n\n\tBangladesh\t2017\tBRAC Onnesha and Bangabandhu-1\t2\n\n\tGhana\t2017\tGhanaSat-1[45]\t1\n\n\tMongolia\t2017\tMazaalai\t1\n\n\tLatvia\t2017\tVenta-1\t1\n\n\tSlovakia\t2017\tskCUBE\t1\n\n\tAsgardia\t2017\tAsgardia-1\t1\n\n\tAngola\t2017\tAngoSat 1\t1\n\n\tNew Zealand\t2018\tHumanity Star\t1\n\n\tCosta Rica\t2018\tProyecto Irazú\t1\n\n\tKenya\t2018\t1KUNS-PF\t1\n\n\tBhutan\t2018\tCubeSat Bhutan-1[46]\t1\n\n\tJordan\t2018\tJY1-SAT\t1\n\n\tNepal\n\t2019\n\tNepal SAT 1\n\t1\n\n\n\n  \n  orbital launch and satellite operation\n   satellite operation, launched by foreign supplier\n   satellite in development\n   orbital launch project at advanced stage or indigenous ballistic missiles deployed\n\n\n\n\nWhile Canada was the third country to build a satellite which was launched into space,[47] it was launched aboard an American rocket from an American spaceport. The same goes for Australia, who launched first satellite involved a donated U.S. Redstone rocket and American support staff as well as a joint launch facility with the United Kingdom.[48] The first Italian satellite San Marco 1 launched on 15 December 1964 on a U.S. Scout rocket from Wallops Island (Virginia, United States) with an Italian launch team trained by NASA.[49] By similar occasions, almost all further first national satellites was launched by foreign rockets.\n\n\nAttempted first satellites[edit]\n\n\tUnited States tried unsuccessfully to launch its first satellite in 1957; they were successful in 1958.\n\tChina tried unsuccessfully to launch its first satellite in 1969; they were successful in 1970.\n\tIraq under Saddam Hussein fulfilled in 1989 an unconfirmed launch of warhead on orbit by developed Iraqi vehicle that intended to put later the 75 kg first national satellite Al-Ta’ir, also developed.[50][51]\n\tChile tried unsuccessfully in 1995 to launch its first satellite FASat-Alfa by foreign rocket; in 1998 they were successful.†\n\tNorth Korea has tried in 1998, 2009, 2012 to launch satellites, first successful launch on 12 December 2012.[52]\n\tLibya since 1996 developed its own national Libsat satellite project with the goal of providing telecommunication and remote sensing services[53] that was postponed after the fall of Gaddafi.\n\tBelarus tried unsuccessfully in 2006 to launch its first satellite BelKA by foreign rocket.†\n\n\n†-note: Both Chile and Belarus used Russian companies as principal contractors to build their satellites, they used Russian-Ukrainian manufactured rockets and launched either from Russia or Kazakhstan.\n\n\n\t\tThis section needs expansion. You can help by adding to it.  (January 2015)\n\n\n\nPlanned first satellites[edit]\n\n\tAfghanistan announced in April 2012 that it is planning to launch its first communications satellite to the orbital slot it has been awarded. The satellite Afghansat 1 was expected to be obtained by a Eutelsat commercial company in 2014.[54][55]\n\tArmenia in 2012 founded Armcosmos company[56] and announced an intention to have the first telecommunication satellite ArmSat. The investments estimates as $250 million and country selecting the contractor for building within 4 years the satellite amongst Russia, China and Canada[57][58][59]\n\tCambodia's Royal Group plans to purchase for $250–350 million and launch in the beginning of 2013 the telecommunication satellite.[60]\n\tCayman Islands's Global IP Cayman private company plans to launch GiSAT-1 geostationary communications satellite in 2018.\n\tDemocratic Republic of Congo ordered at November 2012 in China (Academy of Space Technology (CAST) and Great Wall Industry Corporation (CGWIC)) the first telecommunication satellite CongoSat-1 which will be built on DFH-4 satellite bus platform and will be launched in China till the end of 2015.[61]\n\tCroatia has a goal to construct a satellite by 2013–2014. Launch into Earth orbit would be done by a foreign provider.[62]\n\tEthiopian Space Science Society[63] planning the QB50-family research CubeSat ET-SAT by help of Belgian Von Karman Institute till 2015[64] and the small (20–25 kg) Earth observation and remote sensing satellite Ethosat 1 by help of Finnish Space Technology and Science Group till 2019.[65]\n\tIreland's team of Dublin Institute of Technology intends to launch the first Irish satellite within European University program CubeSat QB50.[66]\n\tJordan's first satellite to be the private amateur pocketqube SunewnewSat.[67][68][69]\n\tRepublic of Moldova's first remote sensing satellite plans to start in 2013 by Space centre at national Technical University.[70]\n\tMyanmar plans to purchase for $200 million their own telecommunication satellite.[71]\n\tNepal stated that planning to launch of own telecommunication satellite before 2015 by help of India or China.[72][73][74]\n\tNicaragua ordered for $254 million at November 2013 in China the first telecommunication satellite Nicasat-1 (to be built at DFH-4 satellite bus platform by CAST and CGWIC), that planning to launch in China at 2016.[75]\n\tParaguay under new Agencia Espacial del Paraguay –- AEP airspace agency plans first Eart observation satellite.[76][77]\n\tSerbia's first satellite Tesla-1 was designed, developed and assembled by nongovernmental organisations in 2009 but still remains unlaunched.\n\tSlovenia's Earth observation microsatellite for the Slovenian Centre of Excellence for Space Sciences and Technologies (Space-SI) now under development for $2 million since 2010 by University of Toronto Institute for Aerospace Studies – Space Flight Laboratory (UTIAS – SFL) and planned to launch in 2015–2016.[78][79]\n\tSri Lanka has a goal to construct two satellites beside of rent the national SupremeSAT payload in Chinese satellites. Sri Lankan Telecommunications Regulatory Commission has signed an agreement with Surrey Satellite Technology Ltd to get relevant help and resources. Launch into Earth orbit would be done by a foreign provider.[80][81]\n\tSyrian Space Research Center developing CubeSat-like small first national satellite since 2008.[82]\n\tTunisia is developing its first satellite, ERPSat01. Consisting of a CubeSat of 1 kg mass, it will be developed by the Sfax School of Engineering. ERPSat satellite is planned to be launched into orbit in 2013.[83]\n\tUzbekistan's State Space Research Agency (UzbekCosmos) announced in 2001 about intention of launch in 2002 first remote sensing satellite.[84] Later in 2004 was stated that two satellites (remote sensing and telecommunication) will be built by Russia for $60–70 million each[85]\n\n\n\t\tThis section needs expansion. You can help by adding to it.  (January 2015)\n\n\n\nAttacks on satellites[edit]\n\nFurther information: Anti-satellite weapon\n\nSince the mid-2000's, satellites have been hacked by militant organizations to broadcast propaganda and to pilfer classified information from military communication networks.[86][87]\n\nFor testing purposes, satellites in low earth orbit have been destroyed by ballistic missiles launched from earth. Russia, the United States, China and India have demonstrated the ability to eliminate satellites.[88] In 2007 the Chinese military shot down an aging weather satellite,[88] followed by the US Navy shooting down a defunct spy satellite in February 2008.[89] On 27 March 2019 the India shot down a live test satellite at 300 km altitude in 3 minutes. India became the fourth country to having capability to destroy live satellite.[90][91]\n\n\nJamming[edit]\n\nSee also: Radio jamming\n\nDue to the low received signal strength of satellite transmissions, they are prone to jamming by land-based transmitters. Such jamming is limited to the geographical area within the transmitter's range. GPS satellites are potential targets for jamming,[92][93] but satellite phone and television signals have also been subjected to jamming.[94][95]\n\nAlso, it is very easy to transmit a carrier radio signal to a geostationary satellite and thus interfere with the legitimate uses of the satellite's transponder. It is common for Earth stations to transmit at the wrong time or on the wrong frequency in commercial satellite space, and dual-illuminate the transponder, rendering the frequency unusable. Satellite operators now have sophisticated monitoring that enables them to pinpoint the source of any carrier and manage the transponder space effectively.[citation needed]\n\n\nEarth observation using satellites[edit]\n\nDuring the last five decades, space agencies have sent thousands of space crafts, space capsules, or satellites to the universe. In fact, weather forecasters make predictions on the weather and natural calamities based on observations from these satellites.[96]\n\nThe National Aeronautics and Space Administration (NASA)[97] requested the National Academies to publish a report entitled, Earth Observations from Space; The First 50 Years of Scientific Achievements in 2008. It described how the capability to view the whole globe simultaneously from satellite observations revolutionized studies about the planet Earth. This development brought about a new age of combined Earth sciences. The National Academies report concluded that continuing Earth observations from the galaxy are necessary to resolve scientific and social challenges in the future.[98]\n\n\nNASA[edit]\n\nSee also: Earth Observing System\n\nThe NASA introduced an Earth Observing System (EOS)[99] composed of several satellites, science component, and data system described as the Earth Observing System Data and Information System (EOSDIS). It disseminates numerous science data products as well as services designed for interdisciplinary education. EOSDIS data can be accessed online and accessed through File Transfer Protocol (FTP) and Hyper Text Transfer Protocol Secure (HTTPS).[100] Scientists and researchers perform EOSDIS science operations within a distributed platform of multiple interconnected nodes or Science Investigator-led Processing Systems (SIPS) and discipline-specific Distributed Active Archive Centers (DACCs).[101]\n\n\nESA[edit]\n\nThe European Space Agency[102] have been operating Earth Observation satellites since the launch of Meteosat 1 in November 1977[103]. ESA currently has plans to launch a satellite equipped with an artificial intelligence (AI) processor that will allow the spacecraft to make decisions on images to capture and data to transmit to the Earth.[104] BrainSat will use the Intel Myriad X vision processing unit (VPU). The launching will be scheduled in 2019. ESA director for Earth Observation Programs Josef Aschbacher made the announcement during the PhiWeek in November 2018.[105] This is the five-day meet that focused on the future of Earth observation. The conference was held at the ESA Center for Earth Observation in Frascati, Italy.[104] ESA also launched the PhiLab, referring to the future-focused team that works to harness the potentials of AI and other disruptive innovations.[106] Meanwhile, the ESA also announced that it expects to commence the qualification flight of the Space Rider space plane in 2021. This will come after several demonstration missions.[107] Space Rider is the sequel of the Agency's Intermediate Experimental vehicle (IXV) which was launched in 2015. It has the capacity payload of 800 kilograms for orbital missions that will last a maximum of two months.[108]\n\n\nSpaceX[edit]\n\nSpaceX was scheduled to launch a multiple satellite mission on 28 November 2018 from the United States Vandenberg Air Force Base after an initial 19 November schedule. The launch is expected to be visible once the rocket heads toward the south into an Earth observation trajectory traveling over the opposites.[109] However, the second supposed launched was delayed again because of poor weather conditions and the actual launch occurred on December 3, 2018.[110] The mission is known as the SSO-A Smallsat Express was executed by Spaceflight, a rideshare and mission management provider based in Seattle, Wash. [111] The launch was a landmark for Elon Musk, founder of SpaceX which had 19 rocket launches in 2018 alone. The estimated cost of this Falcon 9 rocket is approximately $62 million. The rocket has 64 satellites with each one going separate ways.[112]\n\n\nAmazon and Lockheed[edit]\n\nAmazon Web Services (AWS)[113] and Lockheed Martin[114] entered into a strategic partnership for the purpose of integrating the AWS ground station service with Lockheed's verge antenna network. These two corporations aim to merge these highly-capable systems that will provide clients with robust satellite uplinks and downlinks. Through these systems, users can incorporate satellite data with various AWS services which include computing, storage, analytics, and machine-learning.[115]\n\n\nSatellite services[edit]\n\n\n\tSatellite crop monitoring\n\tSatellite Internet access\n\tSatellite navigation\n\tSatellite phone\n\tSatellite radio\n\tSatellite television\n\n\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\n\t2009 satellite collision\n\tArtificial satellites in retrograde orbit\n\tAtmospheric satellite\n\tFractionated spacecraft\n\tImagery intelligence\n\tInternational Designator\n\tList of communications satellite firsts\n\tList of Earth observation satellites\n\tList of passive satellites\n\tSatellite Catalog Number\n\tSatellite formation flying\n\tSatellite geolocation\n\tSatellite watching\n\tSpace exploration\n\tSpace probe\n\tSpaceport (including list of spaceports)\n\tSatellites on stamps\n\tUSA-193 (2008 American anti-satellite missile test)\n\n\n\n\nReferences[edit]\n\n\n\t^ \"How many satellites are orbiting earth in 2018\". Pixalytics. 22 August 2018. Retrieved 27 September 2018.\n\n\t^ \"NASA Spacecraft Becomes First to Orbit a Dwarf Planet\". NASA. 6 March 2015.\n\n\n\t^ \"Rockets in Science Fiction (Late 19th Century)\". Marshall Space Flight Center. Archived from the original on 1 September 2000. Retrieved 21 November 2008.\n\n\n\t^ Bleiler, Everett Franklin; Bleiler, Richard (1991). Science-fiction, the Early Years. Kent State University Press. p. 325. ISBN 978-0-87338-416-2.\n\n\n\t^ Rhodes, Richard (2000). Visions of Technology. Simon & Schuster. p. 160. ISBN 978-0-684-86311-5.\n\n\n\t^ \n\"Preliminary Design of an Experimental World-Circling Spaceship\". RAND. Retrieved 6 March 2008.\n\n\n\t^ Rosenthal, Alfred (1968). Venture into Space: Early Years of Goddard Space Flight Center. NASA. p. 15.\n\n\n\t^ R.R. Carhart, Scientific Uses for a Satellite Vehicle, Project RAND Research Memorandum. (Rand Corporation, Santa Monica) 12 February 1954.\n\n\t^ 2. H.K Kallmann and W.W. Kellogg, Scientific Use of an Artificial Satellite, Project RAND Research Memorandum. (Rand Corporation, Santa Monica) 8 June 1955.\n\n\t^ Gray, Tara; Garber, Steve (2 August 2004). \"A Brief History of Animals in Space\". NASA.\n\n\n\t^ Chang, Alicia (30 January 2008). \"50th anniversary of first U.S. satellite launch celebrated\". SFGate. Associated Press. Archived from the original on 1 February 2008.\n\n\n\t^ Portree, David S. F.; Loftus, Jr, Joseph P. (1999). \"Orbital Debris: A Chronology\" (PDF). Lyndon B. Johnson Space Center. p. 18. Archived from the original (PDF) on 1 September 2000. Retrieved 21 November 2008.\n\n\n\t^ \"Orbital Debris Education Package\" (PDF). Lyndon B. Johnson Space Center. Archived from the original (PDF) on 8 April 2008. Retrieved 6 March 2008.\n\n\n\t^ a b Grant, A.; Meadows, J. (2004). Communication Technology Update (ninth ed.). Focal Press. p. 284. ISBN 978-0-240-80640-2.\n\n\n\t^ \"Workshop on the Use of Microsatellite Technologies\" (PDF). United Nations. 2008. p. 6. Retrieved 6 March 2008.\n\n\n\t^ \"Earth Observations from Space\" (PDF). National Academy of Science. 2007. Archived from the original (PDF) on 12 November 2007.\n\n\n\t^ a b \"UCS Satellite Database\". Union of Concerned Scientists. 10 August 2018. Retrieved 27 September 2018.\n\n\n\t^ Oberg, James (July 1984). \"Pearl Harbor in Space\". Omni. pp. 42–44.\n\n\n\t^ Schmidt, George; Houts, Mike (16 February 2006). \"Radioisotope-based Nuclear Power Strategy for Exploration Systems Development\" (PDF). STAIF Nuclear Symposium. 813: 334–339. Bibcode:2006AIPC..813..334S. doi:10.1063/1.2169210.\n\n\n\t^ \"Vanguard 1 – Satellite Information\". Satellite database. Heavens-Above. Retrieved 7 March 2015.\n\n\n\t^ \"Vanguard 1 Rocket – Satellite Information\". Satellite database. Heavens-Above. Retrieved 7 March 2015.\n\n\n\t^ \n\"Conventional Disposal Method: Rockets and Graveyard Orbits\". Tethers.\n\n\n\t^ \"FCC Enters Orbital Debris Debate\". Space.com. Archived from the original on 24 July 2009.\n\n\n\t^ \"Object SL-8 R/B – 29659U – 06060B\". Forecast for Space Junk Reentry. Satview. 11 March 2014.\n\n\n\t^ \"UNMOVIC report\" (PDF). United Nations Monitoring, Verification and Inspection Commission. p. 434 ff.\n\n\n\t^ \"Deception Activities – Iraq Special Weapons\". FAS. Archived from the original on 22 April 1999.\n\n\n\t^ \"Al-Abid LV\".\n\n\n\t^ The video tape of a partial launch attempt which was retrieved by UN weapons inspectors later surfaced showing that the rocket prematurely exploded 45 seconds after its launch.[25][26][27]\n\n\t^ Myers, Steven Lee (15 September 1998). \"U.S. Calls North Korean Rocket a Failed Satellite\". The New York Times. Archived from the original on 9 December 2018. Retrieved 9 September 2019.\n\n\n\t^ \"First time in History\". The Satellite Encyclopedia. Retrieved 6 March 2008.\n\n\n\t^ The first satellite built by Argentina, Arsat 1, was launched later in 2014\n\n\t^ The first satellite built by Singapore, X-Sat, was launched aboard a PSLV rocket later on 20 April 2011\n\n\t^ T.S., Subramanian (20 April 2011). \"PSLV-C16 puts 3 satellites in orbit\". The Hindu. Chennai, India.\n\n\n\t^ Esiafi 1 (former private American Comstar D4) satellite was transferred to Tonga being at orbit after launch in 1981\n\n\t^ \"India launches Switzerland's first satellite\". Swiss Info. 23 September 2009.\n\n\n\t^ In a difference of first full Bulgarian Intercosmos Bulgaria 1300 satellite, Poland's near first satellite, Intercosmos Copernicus 500 in 1973, were constructed and owned in cooperation with Soviet Union under the same Interkosmos program.\n\n\t^ \"First Romanian satellite Goliat successfully launched\". 13 February 2012.\n\n\n\t^ \"BKA (BelKa 2)\". skyrocket.de.\n\n\n\t^ \"Azerbaijan's first telecommunications satellite launched to orbit\". APA.\n\n\n\t^ Austria's first two satellites, TUGSAT-1 and UniBRITE, were launched together aboard the same carrier rocket in 2013. Both were based on the Canadian Generic Nanosatellite Bus design, however TUGSAT was assembled by Austrian engineers at Graz University of Technology while UniBRITE was built by the University of Toronto Institute for Aerospace Studies for the University of Vienna.\n\n\t^ \"Nanosatellite Launch Service\". University of Toronto Institute for Aerospace Studies. Archived from the original on 10 March 2013. Retrieved 2 March 2013.\n\n\n\t^ Bermudasat 1 (former private American EchoStar VI) satellite was transferred to Bermuda being at orbit after launch in 2000\n\n\t^ \"PUCP-SAT-1 Deploys POCKET-PUCP Femtosatellite\". AMSAT-UK. 14 December 2013. Retrieved 20 December 2013.\n\n\n\t^ Italian built (by La Sapienza) first Iraqi small experimental Earth observation cubesat-satellite Tigrisat Iraq to launch its first satellite before the end of 2013 launched in 2014 [1] Iraq launches its first satellite – TigriSat prior to ordered abroad also for $50 million the first national large communication satellite near 2015.Iraq launching the first satellite into space at a cost of $ 50 million Iraqi first satellite into space in 2015 Archived 15 September 2012 at the Wayback Machine\n\n\t^ \"Ghana launches its first satellite into space\". BBC News. BBC. 7 July 2017. Archived from the original on 8 July 2017. Retrieved 8 July 2017.\n\n\n\t^ \"Bhutan's maiden satellite on its way to space\". 30 June 2018.\n\n\n\t^ Burleson, Daphne (2005). Space Programs Outside the United States. McFarland & Company. p. 43. ISBN 978-0-7864-1852-7.\n\n\n\t^ Mike Gruntman (2004). Blazing the Trail. American Institute of Aeronautics and Astronautics. p. 426. ISBN 978-1-56347-705-8.\n\n\n\t^ Harvey, Brian (2003). Europe's Space Programme. Springer Science+Business Media. p. 114. ISBN 978-1-85233-722-3.\n\n\n\t^ Day, Dwayne A. (9 May 2011). \"Iraqi bird: Beyond Saddam's space program\". The Space Review.\n\n\n\t^ \"Iraq: Whether it is legal to purchase and own satellite dishes in Iraq, and the sanction for owning satellite dishes if it is illegal\". United Nations High Commissioner for Refugees. Archived from the original on 16 April 2013.\n\n\n\t^ \"North Korea says it successfully launched controversial satellite into orbit\". MSNBC. 12 December 2012.\n\n\n\t^ Wissam Said Idrissi. \"Libsat – Libyan Satellite Project\". libsat.ly.\n\n\n\t^ Graham-Harrison, Emma (9 April 2012). \"Afghanistan announces satellite tender\". The Guardian. London.\n\n\n\t^ \"Afghanistan deploys its first satellite into orbit by February\". khaama.com. 29 January 2014.\n\n\n\t^ \"Satellite department to be set up in Armenia's national telecommunication center\". arka.am.\n\n\n\t^ \"Canada's MDA Ready to Help Armenia Launch First Comsat\". Asbarez News. 9 August 2013.\n\n\n\t^ \"Armenia to Launch Its First Satellite\". sputniknews.com. 22 June 2013.\n\n\n\t^ \"China keen on Armenian satellite launch project\". arka.am.\n\n\n\t^ \"Royal Group receives right to launch first Cambodia satellite\". 19 April 2011.\n\n\n\t^ \"China to launch second African satellite-Science-Tech-chinadaily.com.cn\". chinadaily.com.cn.\n\n\n\t^ \"Vremenik\". Astronautica.\n\n\n\t^ \"ESSS\". ethiosss.org.et. Archived from the original on 3 January 2015.\n\n\n\t^ \"Ethiopia to design and construct first Satellite\". ethioabay.com.\n\n\n\t^ Kasia Augustyniak. \"Space Technology and Science Group Oy – Finland (STSG Oy) to design, develop and launch first Ethiopian research satellite – ETHOSAT1\". spacetsg.com. Archived from the original on 3 April 2015.\n\n\n\t^ Bray, Allison (1 December 2012). \"Students hope to launch first ever Irish satellite\". The Independent. Ireland.\n\n\n\t^ \"Behance\". Retrieved 25 June 2015.\n\n\n\t^ \"Meet the PocketQube team: Sunewnewsat\". PocketQube Shop.\n\n\n\t^ Team Interview Archived 19 August 2014 at the Wayback Machine\n\n\t^ \"Наши публикации\". ComelPro.\n\n\n\t^ \"Burma to launch first state-owned satellite, expand communications\". News. Mizzima. 14 June 2011. Archived from the original on 17 June 2011.\n\n\n\t^ \"A step for Nepal own Satellite\". Nabin Chaudhary. 3 June 2013.\n\n\n\t^ 张军棉. \"Nepal: No satellite launching plan so far\". china.org.cn.\n\n\n\t^ Ananth Krishnan (5 May 2013). \"Nepal may turn to China for satellite plan\". The Hindu. Retrieved 25 June 2015.\n\n\n\t^ \"Nicaragua says Nicasat-1 satellite still set for 2016 launch\". telecompaper.com.\n\n\n\t^ Zachary Volkert (26 December 2013). \"Paraguay to vote on aerospace agency bill in 2014\". BNamericas. Retrieved 25 June 2015.\n\n\n\t^ \"Why a little country like Paraguay is launching a space program\". GlobalPost.\n\n\n\t^ \"NEMO-HD – UTIAS Space Flight Laboratory\". utias-sfl.net.\n\n\n\t^ \"Slovenia will soon get its first satellite\". rtvslo.si.\n\n\n\t^ \"SSTL Contracted to Establish Sri Lanka Space Agency\". Satellite Today. Retrieved 28 November 2009.\n\n\n\t^ \"SSTL contracted to establish Sri Lanka Space Agency\". Adaderana. Retrieved 28 November 2009.\n\n\n\t^ \"Syria on the Internet\". souria.com. Archived from the original on 3 April 2015.\n\n\n\t^ Hamrouni, C.; Neji, B.; Alimi, A. M.; Schilling, K. (2009). 2009 4th International Conference on Recent Advances in Space Technologies. Explore. IEEE. pp. 750–755. doi:10.1109/RAST.2009.5158292. ISBN 978-1-4244-3626-2.\n\n\n\t^ \"Uzbekistan Planning First Satellite\". Sat News. 18 May 2001. Archived from the original on 13 July 2001.\n\n\n\t^ \"Uzbekistan Planning to Launch Two Satellites With Russian Help\". Red Orbit. 8 June 2004. Archived from the original on 12 January 2012.\n\n\n\t^ Morrill, Dan. \"Hack a Satellite while it is in orbit\". ITtoolbox. Archived from the original on 20 March 2008. Retrieved 25 March 2008.\n\n\n\t^ \"AsiaSat accuses Falungong of hacking satellite signals\". Press Trust of India. 22 November 2004.\n\n\n\t^ a b Broad, William J.; Sanger, David E. (18 January 2007). \"China Tests Anti-Satellite Weapon, Unnerving U.S.\" The New York Times.\n\n\n\t^ \"Navy Missile Successful as Spy Satellite Is Shot Down\". Popular Mechanics. 2008. Retrieved 25 March 2008.\n\n\n\t^ \"India successfully tests anti-satellite weapon: Modi\". The Week. Retrieved 27 March 2019.\n\n\n\t^ Diplomat, Harsh Vasani, The. \"India's Anti-Satellite Weapons\". The Diplomat. Retrieved 27 March 2019.\n\n\n\t^ Singer, Jeremy (2003). \"U.S.-Led Forces Destroy GPS Jamming Systems in Iraq\". Space.com. Archived from the original on 26 May 2008. Retrieved 25 March 2008.\n\n\n\t^ Brewin, Bob (2003). \"Homemade GPS jammers raise concerns\". Computerworld. Archived from the original on 22 April 2008. Retrieved 25 March 2008.\n\n\n\t^ \"Iran government jamming exile satellite TV\". Iran Focus. 2008. Retrieved 25 March 2008.\n\n\n\t^ Selding, Peter de (2007). \"Libya Pinpointed as Source of Months-Long Satellite Jamming in 2006\". Space.com. Archived from the original on 29 April 2008.\n\n\n\t^ \"Earth Observations from Space \" Earth Observations from Space\". nas-sites.org. Retrieved 28 November 2018.\n\n\n\t^ \"Home | The National Academies of Sciences, Engineering, and Medicine | National-Academies.org | Where the Nation Turns for Independent, Expert Advice\". www.nationalacademies.org. Retrieved 28 November 2018.\n\n\n\t^ Council, National Research (17 December 2008). Earth Observations from Space. doi:10.17226/11991. ISBN 978-0-309-11095-2.\n\n\n\t^ \"About EOSDIS | Earthdata\". earthdata.nasa.gov. Retrieved 28 November 2018.\n\n\n\t^ \"Earth Observation Data | Earthdata\". earthdata.nasa.gov. Retrieved 28 November 2018.\n\n\n\t^ \"EOSDIS Distributed Active Archive Centers (DAACs) | Earthdata\". earthdata.nasa.gov. Retrieved 28 November 2018.\n\n\n\t^ esa. \"ESA\". European Space Agency. Retrieved 28 November 2018.\n\n\n\t^ esa.int | ESA https://www.esa.int/About_Us/Welcome_to_ESA/ESA_history/50_years_of_Earth_Observation | ESA Check |url= value (help). Retrieved 21 August 2019. Missing or empty |title= (help)\n\n\n\t^ a b \"ESA preps Earth observation satellite with onboard AI processor - SpaceNews.com\". SpaceNews.com. 13 November 2018. Retrieved 28 November 2018.\n\n\n\t^ \"Movidius Myriad X VPU | Intel Newsroom\". Intel Newsroom. Retrieved 28 November 2018.\n\n\n\t^ \"The ESA Earth Observation Φ-week EO Open Science and FutureEO\". phiweek.esa.int. Retrieved 28 November 2018.\n\n\n\t^ \"ESA targets 2021 for Space Rider demo flight - SpaceNews.com\". SpaceNews.com. 13 November 2018. Retrieved 28 November 2018.\n\n\n\t^ esa. \"IXV\". European Space Agency. Retrieved 28 November 2018.\n\n\n\t^ \"SpaceX launch set for Wednesday, Nov. 28, from Vandenberg after delay\". Daily Breeze. 26 November 2018. Retrieved 28 November 2018.\n\n\n\t^ https://spaceflight.com/spaceflight-successfully-launches-64-satellites-on-first-dedicated-rideshare-mission/\n\n\t^ https://www.cnbc.com/2018/12/03/watch-spacex-set-to-break-records-with-smallsat-express-mission.html\n\n\t^ \"SpaceX Delays Historic Third Launch of Used Rocket (and Its Flock of Satellites)\". Space.com. Retrieved 28 November 2018.\n\n\n\t^ Sheetz, Michael (27 November 2018). \"Amazon cloud business reaches into space with satellite connection service\". CNBC. Retrieved 28 November 2018.\n\n\n\t^ \"Verge\". Lockheed Martin. Retrieved 28 November 2018.\n\n\n\t^ \"Amazon Web Services and Lockheed Martin Team to Make Downlinking Satellite Data Easier and Less Expensive\". AP NEWS. 27 November 2018. Retrieved 28 November 2018.\n\n\n\n\n\n\nExternal links[edit]\n\n\t[2] – showing orbitinf Satellites  at real time\n\n\n\t\tWikiquote has quotations related to: Satellite\n\n\n\t\tWikimedia Commons has media related to Satellites.\n\n\n\tSatellite at Curlie\n\tSatellite Ground Tracks Real time satellite tracks (Full catalog of satellite orbit). (in English) (in German) (in Spanish) (in French) (in Italian) (in Portuguese) (in Chinese)\n\tReal Time Satellite Tracking provides real-time tracks for about 17000 satellites, as well as 5-day predictions of visibility\n\tHeavens Above provides 10-day predictions of satellite visibility\n\tSatflare tracks in real time all the satellites orbiting the Earth\n\tEyes in the Sky Free video by the Vega Science Trust and the BBC/OU Satellites and their implications over the last 50 years.\n\n\n\t\tv\n\tt\n\te\n\n\nSpaceflight\n\n\tGeneral\t\n\tAstrodynamics\n\tHistory\n\tTimeline\n\tSpace Race\n\tAsian Space Race\n\tRecords\n\tAccidents and incidents\n\n\n\tSpace policy\n\tAustralia\n\tChina\n\tEuropean Union\n\tIndia\n\tJapan\n\tRussia\n\tSoviet Union\n\tUnited States\n\n\n\tSpace law\n\tOuter Space Treaty\n\tRescue Agreement\n\tSpace Liability Convention\n\tRegistration Convention\n\tMoon Treaty\n\n\n\tPrivate spaceflight\n\n\n\n\t\n\n\tApplications\t\n\tAstronomy\n\tEarth observation\n\tArchaeology\n\tImagery and mapping\n\tReconnaissance\n\tWeather and environment monitoring\n\n\n\tSatellite communications\n\tInternet\n\tRadio\n\tTelephone\n\tTelevision\n\n\n\tSatellite navigation\n\tCommercial use of space\n\tSpace launch market competition\n\tMilitarisation of space\n\tSpace architecture\n\tSpace exploration\n\tSpace research\n\tSpace technology\n\tSpace weather\n\n\n\n\n\tHuman spaceflight\t\n\tGeneral\t\n\tAstronaut\n\tcommercial\n\n\n\tLife support system\n\tAnimals in space\n\tBioastronautics\n\tSpace suit\n\n\n\tExtravehicular activity\n\tWeightlessness\n\tSpace toilet\n\tSpace tourism\n\tSpace colonization\n\n\n\n\n\tPrograms\t\n\tVostok\n\tMercury\n\tVoskhod\n\tGemini\n\tSoyuz\n\tApollo\n\tSkylab\n\tApollo–Soyuz\n\n\n\tSpace Shuttle\n\tMir\n\tShuttle–Mir\n\n\n\tInternational Space Station\n\tShenzhou\n\tTiangong\n\n\n\n\n\tHealth issues\t\n\tEffect of spaceflight on the human body\n\tSpace adaptation syndrome\n\n\n\tHealth threat from cosmic rays\n\tSpace psychology\n\tPsychological and sociological effects\n\n\n\tSpace and survival\n\tSpace medicine\n\tSpace nursing\n\n\n\n\n\n\n\n\tSpacecraft\t\n\tLaunch vehicle\n\tRocket\n\tSpaceplane\n\tRobotic spacecraft\n\tSatellite\n\tSpace probe\n\tLander\n\tRover\n\tSelf-replicating spacecraft\n\tSpace telescope\n\n\n\tSpacecraft propulsion\n\tRocket engine\n\tElectric propulsion\n\tSolar sail\n\tGravity assist\n\n\n\n\n\n\n\tDestinations\t\n\tSub-orbital\n\tOrbital\n\tGeocentric\n\tGeosynchronous\n\n\n\tInterplanetary\n\tInterstellar\n\tIntergalactic\n\n\n\n\n\tSpace launch\t\n\tDirect ascent\n\tEscape velocity\n\tExpendable and reusable launch systems\n\tLaunch pad\n\tNon-rocket spacelaunch\n\tSpaceport\n\n\n\n\n\tGround segment\t\n\tFlight controller\n\tGround station\n\tPass\n\tMission control center\n\n\n\n\n\tSpace agencies\t\n\t CoNAE\n\t ASA\n\t AEB\n\t CSA\n\t CNSA\n\t ESA\n\t CNES\n\t DLR\n\t ISRO\n\t LAPAN\n\t ISA\n\t ISA\n\t ASI\n\t AEM\n\t JAXA\n\t NADA\n\t KARI\n\t SUPARCO\n\t Roscosmos\n\t SNSA\n\t SSAU\n\t UKSA\n\t NASA\n\n\n\n\n\t\n\t  Category\n\t  Portal\n\t  WikiProject\n\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4136498-3\n\tLCCN: sh85008203\n\tNARA: 10639092\n\tNDL: 00574781\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Satellite&oldid=918959470\"\n\n\t\t\n\t\tCategories: \tSatellites\n\tSpacecraft\n\tRussian inventions\n\n\nHidden categories: \tWebarchive template wayback links\n\tPages with citations lacking titles\n\tPages with citations having bare URLs\n\tPages with URL errors\n\tArticles with short description\n\tUse dmy dates from August 2019\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from December 2012\n\tArticles containing potentially dated statements from March 2015\n\tAll articles containing potentially dated statements\n\tArticles to be expanded from May 2012\n\tAll articles to be expanded\n\tArticles using small message boxes\n\tArticles to be expanded from January 2015\n\tArticles with unsourced statements from September 2011\n\tCommons category link is on Wikidata\n\tArticles with Curlie links\n\tArticles with German-language external links\n\tArticles with Spanish-language external links\n\tArticles with French-language external links\n\tArticles with Italian-language external links\n\tArticles with Portuguese-language external links\n\tArticles with Chinese-language external links\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NARA identifiers\n\tWikipedia articles with NDL identifiers\n\tArticles containing video clips\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\tWikiquote\n\tWikiversity\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAragonés\n\tঅসমীয়া\n\tAsturianu\n\tAzərbaycanca\n\tتۆرکجه\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tभोजपुरी\n\tБългарски\n\tBosanski\n\tBrezhoneg\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tދިވެހިބަސް\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFøroyskt\n\tFrançais\n\tFrysk\n\tFurlan\n\tGaeilge\n\tGàidhlig\n\tGalego\n\t贛語\n\tગુજરાતી\n\tХальмг\n\t한국어\n\tHausa\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tJawa\n\tಕನ್ನಡ\n\tქართული\n\tҚазақша\n\tKiswahili\n\tKurdî\n\tКыргызча\n\tLatina\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tLimburgs\n\tMagyar\n\tमैथिली\n\tМакедонски\n\tമലയാളം\n\tMāori\n\tमराठी\n\tBahasa Melayu\n\tMirandés\n\tМонгол\n\tမြန်မာဘာသာ\n\tNederlands\n\tनेपाली\n\t日本語\n\tNordfriisk\n\tNorsk\n\tNorsk nynorsk\n\tNovial\n\tOccitan\n\tଓଡ଼ିଆ\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tپښتو\n\tPatois\n\tPlattdüütsch\n\tPolski\n\tPortuguês\n\tRomână\n\tРусиньскый\n\tРусский\n\tScots\n\tShqip\n\tSicilianu\n\tSimple English\n\tسنڌي\n\tSlovenčina\n\tSlovenščina\n\tSoomaaliga\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tТатарча/tatarça\n\tతెలుగు\n\tไทย\n\tТоҷикӣ\n\tತುಳು\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tئۇيغۇرچە / Uyghurche\n\tTiếng Việt\n\tWinaray\n\t吴语\n\tייִדיש\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 October 2019, at 02:51 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "20", "dc:title": "Satellite - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Soyuz_TMA-7_spacecraft2edit1.jpg/1200px-Soyuz_TMA-7_spacecraft2edit1.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-artificial_satellite", "title": "Satellite - Wikipedia"}}