{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArtificial gravity - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tArtificial gravity\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\t\n\tThis article has multiple issues. Please help improve it or discuss these issues on the talk page. (Learn how and when to remove these template messages)\n\n      \t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Artificial gravity\" – news · newspapers · books · scholar · JSTOR  (August 2017) (Learn how and when to remove this template message)\n\n\n\n\t\n\tThis article or section possibly contains synthesis of material which does not verifiably mention or relate to the main topic. Relevant discussion may be found on the talk page.  (May 2018) (Learn how and when to remove this template message)\n\n\n\n    \n\n\n (Learn how and when to remove this template message)\n\n\n\n\n\n\n  \nGemini 11 Agena tethered operations\n\n\n\n  \nProposed Nautilus-X International space station centrifuge demo\n\n\n\nArtificial gravity (sometimes referred to as pseudogravity) is the creation of an inertial force that mimics the effects of a gravitational force, usually by rotation.[1] \nArtificial gravity, or rotational gravity, is thus the appearance of a centrifugal force in a rotating frame of reference (the transmission of centripetal acceleration via normal force in the non-rotating frame of reference), as opposed to the force experienced in linear acceleration, which by the equivalence principle is indistinguishable from gravity.\nIn a more general sense, \"artificial gravity\" may also refer to the effect of linear acceleration, e.g. by means of a rocket engine.[1] \n\nRotational simulated gravity has been used in simulations to help astronauts train for extreme conditions.[2] \nRotational simulated gravity  has been proposed as a solution in human spaceflight to the adverse health effects caused by prolonged weightlessness. \nHowever, there are no current practical outer space applications of artificial gravity for humans due to concerns about the size and cost of a spacecraft necessary to produce a useful centripetal force comparable to the gravitational field strength on Earth (g).[3]\n\n\nContents\n\n\n\t1 Centripetal\n\t1.1 Mechanism\n\t1.2 Manned spaceflight\n\t1.2.1 Gemini missions\n\t1.2.2 Health benefits\n\t1.2.3 Proposals\n\t1.2.4 Issues with implementation\n\t1.2.5 In science fiction\n\n\n\n\t1.3 Centrifuges\n\n\n\n\t2 Linear acceleration\n\t3 Weightlessness/levitation\n\t3.1 Diamagnetism\n\t3.2 Parabolic flight\n\t3.3 Neutral buoyancy\n\n\n\n\t4 Speculative or fictional mechanisms\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nCentripetal[edit]\n\nFurther information: Absolute rotation and Bucket argument\n\n  \nArtificial gravity space station. 1969 NASA concept. This design is flawed because the astronauts would be walking back and forth between gravity and weightlessness.\n\n\n\nArtificial gravity can be created using a centripetal force. A centripetal force directed towards the center of the turn is required for any object to move in a circular path.  \nIn the context of a rotating space station it is the normal force provided by spacecraft's hull that acts as centripetal force. Thus, the \"gravity\" force felt by an object the centrifugal force perceived in the rotating frame of reference as pointing \"downwards\" towards the hull.\nIn accordance with Newton's Third Law the value of little g (the perceived \"downward\" acceleration) is equal in magnitude and opposite in direction\nto the centripetal acceleration.\n\n\nMechanism[edit]\n\n  \nBalls in a rotating spacecraft\n\n\n\nFrom the point of view of people rotating with the habitat, artificial gravity by rotation behaves in some ways similarly to normal gravity but with the following differences:\n\n\n\tCentrifugal force varies with distance: Unlike real gravity, which pulls towards a center of the planet, the apparent centrifugal force felt by observers in the habitat pushes radially outward from the center, and assuming a fixed rotation rate (constant angular velocity), the centrifugal force is directly proportional to distance from the center of the habitat. With a small radius of rotation, the amount of gravity felt at one's head would be significantly different from the amount felt at one's feet. This could make movement and changing body position awkward. In accordance with the physics involved, slower rotations or larger rotational radii would reduce or eliminate this problem. Similarly the linear velocity of the habitat should be significantly higher than the relative velocities with which an astronaut will change position within it. Otherwise moving in the direction of the rotation will increase the felt gravity (while moving in the opposite direction will decrease it) to the point that it should cause problems.\n\tThe Coriolis effect gives an apparent force that acts on objects that move relative to a rotating reference frame. This apparent force acts at right angles to the motion and the rotation axis and tends to curve the motion in the opposite sense to the habitat's spin. If an astronaut inside a rotating artificial gravity environment moves towards or away from the axis of rotation, he or she will feel a force pushing him or her towards or away from the direction of spin. These forces act on the inner ear and can cause dizziness, nausea and disorientation. Lengthening the period of rotation (slower spin rate) reduces the Coriolis force and its effects. It is generally believed that at 2 rpm or less, no adverse effects from the Coriolis forces will occur, although humans have been shown to adapt to rates as high as 23 rpm.[4]  It is not yet known whether very long exposures to high levels of Coriolis forces can increase the likelihood of becoming accustomed. The nausea-inducing effects of Coriolis forces can also be mitigated by restraining movement of the head.\n\n\nThis form of artificial gravity has additional engineering issues:\n\n\n\tKinetic energy and angular momentum: Spinning up (or down) parts or all of the habitat requires energy, while angular momentum must be conserved. This would require a propulsion system and expendable propellant, or could be achieved without expending mass, by an electric motor and a counterweight, such as a reaction wheel or possibly another living area spinning in the opposite direction.\n\tExtra strength is needed in the structure to keep it from flying apart because of the rotation. However, the amount of structure needed over and above that to hold a breathable atmosphere (10 tons force per square meter at 1 atmosphere) is relatively modest for most structures.\n\tIf parts of the structure are intentionally not spinning, friction and similar torques will cause the rates of spin to converge (as well as causing the otherwise stationary parts to spin), requiring motors and power to be used to compensate for the losses due to friction.\n\tA traversable interface between parts of the station spinning relative to each other requires large vacuum-tight axial seals.\n\n\n\tFormulae\n\n\t\n  \n    \n      \n        R\n        =\n        a\n        \n          \n            (\n            \n              \n                T\n                \n                  2\n                  π\n                \n              \n            \n            )\n          \n          \n            2\n          \n        \n        ,\n      \n    \n    {\\displaystyle R=a\\left({\\frac {T}{2\\pi }}\\right)^{2},}\n  \n\n\n  \n    \n      \n        a\n        =\n        R\n        \n          \n            (\n            \n              \n                \n                  2\n                  π\n                \n                T\n              \n            \n            )\n          \n          \n            2\n          \n        \n        \n        (\n        T\n        >\n        0\n        )\n        ,\n      \n    \n    {\\displaystyle a=R\\left({\\frac {2\\pi }{T}}\\right)^{2}\\quad (T>0),}\n  \n\n\n\n  \n    \n      \n        T\n        =\n        2\n        π\n        \n          \n            \n              R\n              a\n            \n          \n        \n        \n        (\n        a\n        >\n        0\n        )\n        ,\n      \n    \n    {\\displaystyle T=2\\pi {\\sqrt {\\frac {R}{a}}}\\quad (a>0),}\n  \n\n\nwhere:\n\nR = Radius from center of rotation\n\na = Artificial gravity\n\nT = Rotating spacecraft period\n\n\n\n\n\n  \nRotation speed in rpm for a centrifuge of various radii to achieve a given g-force\n\n\n\nManned spaceflight[edit]\n\nThe engineering challenges of creating a rotating spacecraft are comparatively modest to any other proposed approach.[original research?] Theoretical spacecraft designs using artificial gravity have a great number of variants with intrinsic problems and advantages. The formula for the centripetal force implies that the radius of rotation grows with the square of the rotating spacecraft period, so a doubling of the period requires a fourfold increase in the radius of rotation. For example, to produce standard gravity, ɡ0 = 9.80665 m/s2 with a rotating spacecraft period of 15 s, the radius of rotation would have to be 56 m (184 ft), while a period of 30 s would require it to be 224 m (735 ft). To reduce mass, the support along the diameter could consist of nothing but a cable connecting two sections of the spaceship. Among the possible solutions include a habitat module and a counterweight consisting of every other part of the spacecraft, alternatively two habitatable modules of similar weight could be attached to one another.\n\nWhatever design is chosen, it would be necessary for the spacecraft to possess some means to quickly transfer ballast from one section to another, otherwise even small shifts in mass could cause a substantial shift in the spacecraft's axis, which would result in a dangerous \"wobble.\" One possible solution would be to engineer the spacecraft's plumbing system to serve this purpose, using drinking water and/or waste water as the ballast. \n\nIt is not yet known whether exposure to high gravity for short periods of time is as beneficial to health as continuous exposure to normal gravity. It is also not known how effective low levels of gravity would be at countering the adverse effects on health of weightlessness. Artificial gravity at 0.1g and a rotating spacecraft period of 30 s would require a radius of only 22 m (72 ft). Likewise, at a radius of 10 m, a period of just over 6 s would be required to produce standard gravity (at the hips; gravity would be 11% higher at the feet), while 4.5 s would produce 2g. If brief exposure to high gravity can negate the harmful effects of weightlessness, then a small centrifuge could be used as an exercise area.\n\n\nGemini missions[edit]\n\nThe Gemini 11 mission attempted to produce artificial gravity by rotating the capsule around the Agena Target Vehicle to which it was attached by a 36-meter tether. They were able to generate a small amount of artificial gravity, about 0.00015 g, by firing their side thrusters to slowly rotate the combined craft like a slow-motion pair of bolas.[5]\nThe resultant force was too small to be felt by either astronaut, but objects were observed moving towards the \"floor\" of the capsule.[6]\n\nIt should be pointed out that the Gemini 8 mission achieved artificial gravity for a few minutes. This, however, was due to an accident. The acceleration forces upon the crew were so high (~ 4g's) that the mission had to be urgently terminated.\n\n\nHealth benefits[edit]\n\n  \nArtificial gravity has been suggested for interplanetary journey to Mars\n\n\n\nArtificial gravity has been suggested as a solution to the various health risks associated with spaceflight.[7] In 1964, the Soviet space program believed that a human could not survive more than 14 days in space due to a fear that the heart and blood vessels would be unable to adapt to the weightless conditions.[8] This fear was eventually discovered to be unfounded as spaceflights have now lasted up to 438 consecutive days,[9] with missions aboard the international space station commonly lasting 6 months. However, the question of human safety in space did launch an investigation into the physical effects of prolonged exposure to weightlessness. In June 1991, a Spacelab Life Sciences 1 flight performed 18 experiments on two men and two women over a period of nine days. In an environment without gravity, it was concluded that the response of white blood cells and muscle mass decreased. Additionally, within the first 24 hours spent in a weightless environment, blood volume decreased by 10%.[10][3][1] Upon return to earth, the effects of prolonged weightlessness continue to affect the human body as fluids pool back to the lower body, the heart rate rises, a drop in blood pressure occurs and there is a reduced ability to exercise.[10]\n\nArtificial gravity, due to its ability to mimic the behavior of gravity on the human body has been suggested as one of the most encompassing manners of combating the physical effects inherent with weightless environments. Other measures that have been suggested as symptomatic treatments include exercise, diet and penguin suits. However, criticism of those methods lays in the fact that they do not fully eliminate the health problems and require a variety of solutions to address all issues. Artificial gravity, in contrast, would remove the weightlessness inherent with space travel. By implementing artificial gravity, space travelers would never have to experience weightlessness or the associated side effects.[1] Especially in a modern-day six-month journey to Mars, exposure to artificial gravity is suggested in either a continuous or intermittent form to prevent extreme debilitation to the astronauts during travel.[7]\n\n\nProposals[edit]\n\n  \nRotating Mars spacecraft - 1989 NASA concept.\n\n\n\nA number of proposals have incorporated artificial gravity into their design:\n\n\n\tDiscovery II: a 2005 vehicle proposal capable of delivering a 172-metric-ton crew to Jupiter's orbit in 118 days. A very small portion of the 1,690 metric-ton craft would incorporate a centrifugal crew station.[11]\n\tMulti-Mission Space Exploration Vehicle (MMSEV): a 2011 NASA proposal for a long-duration crewed space transport vehicle; it included a rotational artificial gravity space habitat intended to promote crew-health for a crew of up to six persons on missions of up to two years in duration. The torus-ring centrifuge would utilize both standard metal-frame and inflatable spacecraft structures and would provide 0.11 to 0.69g if built with the 40 feet (12 m) diameter option.[12][13]\n\tISS Centrifuge Demo: a 2011 NASA proposal for a demonstration project preparatory to the final design of the larger torus centrifuge space habitat for the Multi-Mission Space Exploration Vehicle. The structure would have an outside diameter of 30 feet (9.1 m) with a ring interior cross-section diameter of 30 inches (760 mm). It would provide 0.08 to 0.51g partial gravity. This test and evaluation centrifuge would have the capability to become a Sleep Module for ISS crew.[12]\n\n\n  \nArtist view of TEMPO³ in orbit.\n\n\n\n\tMars Direct: A plan for a manned Mars mission created by NASA engineers Robert Zubrin and David Baker in 1990, later expanded upon in Zubrin's 1996 book The Case for Mars. The \"Mars Habitat Unit\", which would carry astronauts to Mars to join the previously-launched \"Earth Return Vehicle\", would have had artificial gravity generated during flight by tying the spent upper stage of the booster to the Habitat Unit, and setting them both rotating about a common axis.[14]\n\tThe proposed Tempo3 mission rotates two halves of a spacecraft connected by a tether to test the feasibility of simulating gravity on a manned mission to Mars.[15]\n\tThe Mars Gravity Biosatellite was a proposed mission meant to study the effect of artificial gravity on mammals. An artificial gravity field of 0.38 g (equivalent to Mars's surface gravity) was to be produced by rotation (32 rpm, radius of ca. 30 cm). Fifteen mice would have orbited Earth (Low Earth orbit) for five weeks and then land alive.[16] However, the program was canceled on 24 June 2009, due to lack of funding and shifting priorities at NASA.[17]\n\n\nIssues with implementation[edit]\n\nSome of the reasons that artificial gravity remains unused today in spaceflight trace back to the problems inherent in implementation. One of the realistic methods of creating artificial gravity is a centripetal force pulling a person towards a relative floor. In that model, however, issues arise in the size of the spacecraft. As expressed by John Page and Matthew Francis, the smaller a spacecraft, the more rapid the rotation that is required. As such, to simulate gravity, it would be more ideal to utilize a larger spacecraft that rotates very slowly. The requirements on size in comparison to rotation are due to the different magnitude of forces the body can experience if the rotation is too tight. Additionally, questions remain as to what the best way to initially set the rotating motion in place without disturbing the stability of the whole spacecraft's orbit. At the moment, there is not a ship massive enough to meet the rotation requirements, and the costs associated with building, maintaining, and launching such a craft are extensive.[3]\n\nIn general, with the limited health effects present in shorter spaceflights, as well as the high cost of research, application of artificial gravity is often stunted and sporadic.[1][10]\n\n\nIn science fiction[edit]\n\nMain article: Artificial gravity (fiction) § Rotational gravity\n\nSeveral science fiction novels, films and series have featured artificial gravity production. In the movie 2001: A Space Odyssey, a rotating centrifuge in the Discovery spacecraft provides artificial gravity. \nIn the novel The Martian, the Hermes spacecraft achieves artificial gravity by design; it employs a ringed structure, at whose periphery forces around 40% of Earth's gravity are experienced, similar to Mars's gravity. The movie Interstellar features a spacecraft called the Endurance that can rotate on its center axis to create artificial gravity, controlled by retro thrusters on the ship.\n\n\nCentrifuges[edit]\n\nMain articles: Centrifuge, g-force, and High-G training\n\nHigh-G training is done by aviators and astronauts who are subject to high levels of acceleration ('G') in large-radius centrifuges. It is designed to prevent a g-induced loss Of consciousness (abbreviated G-LOC), a situation when g-forces move the blood away from the brain to the extent that consciousness is lost. Incidents of acceleration-induced loss of consciousness have caused fatal accidents in aircraft capable of sustaining high-g for considerable periods.\n\nIn amusement parks, pendulum rides and centrifuges provide rotational force. Roller coasters also do, whenever they go over dips, humps, or loops. When going over a hill, time in which zero or negative gravity is felt is called air time, or \"airtime\", which can be divided into \"floater air time\" (for zero gravity) and \"ejector air time\" (for negative gravity).[original research?]\n\n\nLinear acceleration[edit]\n\nFurther information: Equivalence principle\n\nLinear acceleration, even at a low level, can provide sufficient g-force to provide useful benefits. A spacecraft under constant acceleration in a straight line would give the appearance of a gravitational pull in the direction opposite of the acceleration. This \"pull\" that would cause a loose object to \"fall\" towards the hull of the spacecraft is actually a manifestation of the inertia of the objects inside the spacecraft, in accordance with Newton's first law. \nFurther, the \"gravity\" felt by an object pressed against the hull of the spacecraft is simply the reaction force of the object on the hull reacting to the acceleration force of the hull on the object, in accordance with Newton's Third Law and somewhat similar to the effect on an object pressed against the hull of a spacecraft rotating as outlined above. Unlike an artificial gravity based on rotation, linear acceleration gives the appearance of a gravity field which is both uniform throughout the spacecraft and without the disadvantage of additional fictitious forces.\n\nSome chemical reaction rockets can at least temporarily provide enough acceleration to overcome Earth's gravity and could thus provide linear acceleration to emulate Earth's g-force. However, since all such rockets provide this acceleration by expelling reaction mass such an acceleration would only be temporary, until the limited supply of rocket fuel had been spent.\n\nNevertheless, constant linear acceleration is desirable since in addition to providing artificial gravity it could theoretically provide relatively short flight times around the solar system. For example, if a propulsion technique able to support 1g of acceleration continuously were available, a spaceship accelerating (and then decelerating for the second half of the journey) at 1g would reach Mars within a few days.[18] Similarly, a hypothetical space travel using constant acceleration of 1g for one year would reach relativistic speeds and allow for a round trip to the nearest star, Proxima Centauri.\n\nAs such, low-impulse but long-term linear acceleration has been proposed for various interplanetary missions. For example, even heavy (100 ton) cargo payloads to Mars could be transported to Mars in 27 months and retain approximately 55 percent of the LEO vehicle mass upon arrival into a Mars orbit, providing a low-gravity gradient to the spacecraft during the entire journey.[19]\n\nA propulsion system with a very high specific impulse (that is, good efficiency in the use of reaction mass that must be carried along and used for propulsion on the journey) could accelerate more slowly producing useful levels of artificial gravity for long periods of time. A variety of electric propulsion systems provide examples. Two examples of this long-duration, low-thrust, high-impulse propulsion that have either been practically used on spacecraft or are planned in for near-term in-space use are Hall effect thrusters and Variable Specific Impulse Magnetoplasma Rockets (VASIMR). Both provide very high specific impulse but relatively low thrust, compared to the more typical chemical reaction rockets. They are thus ideally suited for long-duration firings which would provide limited amounts of, but long-term, milli-g levels of artificial gravity in spacecraft.[citation needed]\n\nIn a number of science fiction plots, acceleration is used to produce artificial gravity for interstellar spacecraft, propelled by as yet theoretical or hypothetical means.\n\nThis effect of linear acceleration is well understood, and is routinely used for 0g cryogenic fluid management for post-launch (subsequent) in-space firings of upper stage rockets.[20]\n\nRoller coasters, especially launched roller coasters or those that rely on electromagnetic propulsion, can provide linear acceleration \"gravity\", and so can relatively high acceleration vehicles, such as sports cars. Linear acceleration can be used to provide air-time on roller coasters and other thrill rides.\n\n\nWeightlessness/levitation[edit]\n\nFurther information: Anti-gravity\n\n\t\n\tThis section may stray from the topic of the article. Please help improve this section or discuss this issue on the talk page.  (May 2019)\n\n\n\nDiamagnetism[edit]\n\n  \nA live frog levitates inside a 32 mm diameter vertical bore of a Bitter solenoid in a magnetic field of about 16 teslas.\n\n\n\nA similar effect to gravity can be created through diamagnetism. It requires magnets with extremely powerful magnetic fields. Such devices have been able to levitate at most a small mouse,[21] producing a 1 g field to cancel that of the Earth's. \n\nSufficiently powerful magnets require either expensive cryogenics to keep them superconductive or several megawatts of power.[22]\n\nWith such extremely strong magnetic fields, safety for use with humans is unclear.[citation needed] In addition, it would involve avoiding any ferromagnetic or paramagnetic materials near the strong magnetic field that is required for diamagnetism to be evident.\n\nFacilities using diamagnetism may prove workable for laboratories simulating low gravity conditions here on Earth.[original research?] A mouse has been levitated against Earth's gravity, creating a condition similar to microgravity. Lower forces may also be generated to simulate a condition similar to lunar or Martian gravity with small model organisms.\n\n\nParabolic flight[edit]\n\nMain article: Vomit Comet\n\nWeightless Wonder is the nickname for the NASA aircraft that flies parabolic trajectories and briefly provides a nearly weightless environment in which to train astronauts, conduct research, and film motion pictures. The parabolic trajectory creates a vertical linear acceleration which matches that of gravity, giving zero-g for a short time, usually 20–30 seconds, followed by approximately 1.8g for a similar period. The nickname Vomit Comet is also used to refer to motion sickness that is often experienced by the aircraft passengers during these parabolic trajectories. Such reduced gravity aircraft are nowadays operated by several organizations worldwide.\n\n\nNeutral buoyancy[edit]\n\nMain article: Neutral Buoyancy Laboratory\n\nA Neutral Buoyancy Laboratory (NBL) is an astronaut training facility, such as the Sonny Carter Training Facility at the NASA Johnson Space Center in Houston, Texas.[23] The NBL is a large indoor pool of water, the largest in the world,[24] in which astronauts may perform simulated EVA tasks in preparation for space missions. The NBL contains full-sized mock-ups of the Space Shuttle cargo bay, flight payloads, and the International Space Station (ISS).[25]\n\nThe principle of neutral buoyancy is used to simulate the weightless environment of space.[23] The suited astronauts are lowered into the pool using an overhead crane and their weight is adjusted by support divers so that they experience no buoyant force and no rotational moment about their center of mass.[23] The suits worn in the NBL are down-rated from fully flight-rated EMU suits like those in use on the space shuttle and International Space Station.\n\nThe NBL tank is 202 feet (62 m) in length, 102 feet (31 m) wide, and 40 feet 6 inches (12.34 m) deep, and contains 6.2 million gallons (23.5 million litres) of water.[25][26] Divers breathe nitrox while working in the tank.[27][28]\n\nNeutral buoyancy in a pool is not weightlessness, since the balance organs in the inner ear still sense the up-down direction of gravity. Also, there is a significant amount of drag presented by water.[29] Generally, drag effects are minimized by doing tasks slowly in the water. Another difference between neutral buoyancy simulation in a pool and actual EVA during spaceflight is that the temperature of the pool and the lighting conditions are maintained constant.\n\n\nSpeculative or fictional mechanisms[edit]\n\nMain articles: Artificial gravity (fiction), Gravitational shielding, and Anti-gravity\n\nIn science fiction, artificial gravity (or cancellation of gravity) or \"paragravity\"[30][31] is sometimes present in spacecraft that are neither rotating nor accelerating. At present, there is no confirmed technique that can simulate gravity other than actual mass or acceleration. There have been many claims over the years of such a device. Eugene Podkletnov, a Russian engineer, has claimed since the early 1990s to have made such a device consisting of a spinning superconductor producing a powerful \"gravitomagnetic field\", but there has been no verification or even negative results from third parties. In 2006, a research group funded by ESA claimed to have created a similar device that demonstrated positive results for the production of gravitomagnetism, although it produced only 0.0001g.[32] This result has not been replicated.\n\n\nSee also[edit]\n\n\n\tNon-inertial reference frame\n\tAnti-gravity\n\tGravitational shielding\n\tArtificial gravity in fiction\n\tCoriolis effect\n\tCentrifuge Accommodations Module\n\tFictitious force\n\tRotating wheel space station\n\tSpace habitat\n\tStanford torus\n\n\n\n\nReferences[edit]\n\n\n\t^ a b c d e https://iaaweb.org/iaa/Scientific%20Activity/Study%20Groups/SG%20Commission%202/sg22/sg22finalreportr.pdf\n\n\t^ Strauss S (July 2008). \"Space medicine at the NASA-JSC, neutral buoyancy laboratory\". Aviat Space Environ Med. 79 (7): 732–3. PMID 18619137.\n\n\t^ a b c \"Why Don't We Have Artificial Gravity?\". popularmechanics.com. May 3, 2013. Retrieved April 4, 2018.\n\n\n\t^ Hecht, H.; Brown, E. L.; Young, L. R.;  et al. (June 2–7, 2002). \"Adapting to artificial gravity (AG) at high rotational speeds\". Life in Space for Life on Earth. Proceedings of \"Life in space for life on Earth\". 8th European Symposium on Life Sciences Research in Space. 23rd Annual International Gravitational Physiology Meeting. 23: 151. Bibcode:2002ESASP.501..151H.\n\n\n\t^ Gatland, Kenneth (1976). Manned Spacecraft, Second Revision. New York, NY, USA: MacMillan. pp. 180–182. ISBN 978-0-02-542820-1.\n\n\n\t^ Clément G, Bukley A (2007) Artificial Gravity. Springer: New York\n\n\t^ a b \"Artificial Gravity as a Countermeasure for Mitigating Physiological Deconditioning During Long-Duration Space Missions\". June 17, 2015. Retrieved April 4, 2018.\n\n\n\t^ \"Weightlessness Obstacle to Space Survival\". The Science News-Letter. 86 (7): 103. April 4, 1964. JSTOR 3947769.\n\n\n\t^ \"Astronaut Peggy Whitson Sets NASA Record For Most Days In Space\". npr.org. Retrieved April 4, 2018.\n\n\n\t^ a b c David, Leonard (April 4, 1992). \"Artificial Gravity and Space Travel\". BioScience. 42 (3): 155–159. doi:10.2307/1311819. JSTOR 1311819.\n\n\n\t^ Craig H. Williams; Leonard A. Dudzinski; Stanley K. Borowski; Albert J. Juhasz (March 2005). \"Realizing \"2001: A Space Odyssey\": Piloted Spherical Torus Nuclear Fusion Propulsion\" (PDF). Cleveland, Ohio: NASA. Retrieved September 28, 2011.\n\n\n\t^ a b NAUTILUS – X:  Multi-Mission Space Exploration Vehicle Archived March 4, 2011, at the Wayback Machine, Mark L. Holderman, Future in Space Operations (FISO) Colloquium, 2011-01-26. Retrieved 2011-01-31\n\n\t^ \nNASA NAUTILUS-X: multi-mission exploration vehicle includes centrifuge, which would be tested at ISS Archived February 25, 2011, at the Wayback Machine, RLV and Space Transport News, 2011-01-28. Retrieved 2011-01-31\n\n\t^ \"NSS Review: The Case for Mars\". www.nss.org. Retrieved April 4, 2018.\n\n\n\t^ http://members.marssociety.org/TMQ/TMQ-V1-I1.pdf pg15-Tom Hill\n\n\t^ https://smartech.gatech.edu/bitstream/handle/1853/26717/IAC-07-A1.9.-A2.7.05.pdf;jsessionid=4843BF9FDBB666BB08C17774A914FE01.smartech?sequence=1\n\n\t^ \"The Mars Gravity Biosatellite Program Is Closing Down\". www.spaceref.com. Retrieved April 4, 2018.\n\n\n\t^ Clément, Gilles; Bukley, Angelia P. (2007). Artificial Gravity. Springer New York. p. 35. ISBN 978-0-387-70712-9.\n Extract of page 35\n\n\t^ VASIMR VX-200 Performance and Near-term SEP Capability for Unmanned Mars Flight Archived March 11, 2011, at the Wayback Machine, Tim Glover, Future in Space Operations (FISO) Colloquium, pp. 22, 25, 2011-01-19. Retrieved 2011-02-01\n\n\t^ Jon Goff;  et al. (2009). \"Realistic Near-Term Propellant Depots\" (PDF). American Institute of Aeronautics and Astronautics. Retrieved February 7, 2011. Developing techniques for manipulating fluids in microgravity, which typically fall into the category known as settled propellant handling. Research for cryogenic upper stages dating back to the Saturn S-IVB and Centaur found that providing a slight acceleration (as little as 10−4 to 10−5 g of acceleration) to the tank can make the propellants assume a desired configuration, which allows many of the main cryogenic fluid handling tasks to be performed in a similar fashion to terrestrial operations. The simplest and most mature settling technique is to apply thrust to the spacecraft, forcing the liquid to settle against one end of the tank.\n\n\n\t^ \"U.S. scientists levitate mice to study low gravity\". Reuters. September 11, 2009.\n\n\n\t^ \"20 tesla Bitter solenoid – Archived link\". March 20, 2007. Archived from the original on March 20, 2007. Retrieved August 6, 2013.\n\n\n\t^ a b c Strauss, S. (July 2008). \"Space medicine at the NASA-JSC, neutral buoyancy laboratory\". Aviat Space Environ Med. 79 (7): 732–3. PMID 18619137.\n\n\n\t^ \"Behind the scenes training\". NASA. May 30, 2003. Retrieved March 22, 2011.\n\n\n\t^ a b Strauss, S.; Krog, R.L.; Feiveson, A.H. (May 2005). \"Extravehicular mobility unit training and astronaut injuries\". Aviat Space Environ Med. 76 (5): 469–74. PMID 15892545. Retrieved August 27, 2008.\n\n\n\t^ \"NBL Characteristics\". About the NBL. NASA. June 23, 2005. Archived from the original on June 26, 2007.\n\n\n\t^ Fitzpatrick DT, Conkin J (2003). \"Improved pulmonary function in working divers breathing nitrox at shallow depths\". Undersea and Hyperbaric Medicine. 30 (Supplement). Retrieved August 27, 2008.\n\n\n\t^ Fitzpatrick DT, Conkin J (July 2003). \"Improved pulmonary function in working divers breathing nitrox at shallow depths\". Aviat Space Environ Med. 74 (7): 763–7. PMID 12862332. Retrieved August 27, 2008.\n\n\n\t^ Pendergast D, Mollendorf J, Zamparo P, Termin A, Bushnell D, Paschke D (2005). \"The influence of drag on human locomotion in water\". Undersea and Hyperbaric Medicine. 32 (1): 45–57. PMID 15796314. Retrieved August 27, 2008.\n\n\n\t^ Collision Orbit, 1942 by Jack Williamson\n\n\t^ Pale Blue Dot: A Vision of the Human Future in Space by Carl Sagan, Chapter 19\n\n\t^ \"Toward a new test of general relativity?\". Esa.int. Retrieved August 6, 2013.\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Artificial gravity.\n\n\n\tList of peer review papers on artificial gravity\n\tTEDx talk about artificial gravity\n\tRevolving artificial gravity calculator\n\tOverview of artificial gravity in Sci-Fi and Space Science\n\tNASA's Java simulation of artificial gravity\n\tVariable Gravity Research Facility (xGRF), concept with tethered rotating satellites, perhaps a Bigelow expandable module and a spent upper stage as a counterweight\n\n\n\t\tv\n\tt\n\te\n\n\nSpace medicine\n\n\tMain areas\t\n\tArtificial gravity\n\tAstronautical hygiene\n\tBioastronautics\n\tNeuroscience in space\n\tSpace exposure\n\tSpace food\n\tSpace nursing\n\tSpace weather\n\tWeightlessness\n\n\n\n\n\tIllness and injuries\t\n\tAsthenization\n\tEbullism\n\tIllness and injuries during spaceflight\n\tMedical treatment during spaceflight\n\tSpace adaptation syndrome\n\tSpace and survival\n\tSpaceflight osteopenia\n\n\n\n\n\tOrganizations\t\n\tAerospace Medical Association\n\tNational Space Biomedical Research Institute\n\tRubicon Foundation\n\tSpace Nursing Society\n\n\n\n\n\tOther topics\t\n\tAdverse health effects from lunar dust exposure\n\tCardiac rhythm problems during space flight\n\tCentral nervous system effects from radiation exposure during spaceflight\n\tEffect of spaceflight on the human body\n\tEffects of sleep deprivation in space\n\tEpidemiology data for low-linear energy transfer radiation\n\tSleep in space\n\tHealth threat from cosmic rays\n\tIntervertebral disc damage and spaceflight\n\tList of microorganisms tested in outer space\n\tPsychological and sociological effects of spaceflight\n\tRadiobiology evidence for protons and HZE nuclei\n\tReduced muscle mass, strength and performance in space\n\tRenal stone formation in space\n\tSpaceflight radiation carcinogenesis\n\tTeam composition and cohesion in spaceflight missions\n\tVisual impairment due to intracranial pressure\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Artificial_gravity&oldid=916677588\"\n\n\t\t\n\t\tCategories: \tFictional technology\n\tGravity\n\tSpace colonization\n\tScientific speculation\n\tSpace medicine\n\n\nHidden categories: \tWebarchive template wayback links\n\tArticles needing additional references from August 2017\n\tAll articles needing additional references\n\tArticles that may contain original research from May 2018\n\tArticles with multiple maintenance issues\n\tUse mdy dates from June 2012\n\tAll articles that may contain original research\n\tArticles that may contain original research from February 2016\n\tArticles that may contain original research from January 2016\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from February 2011\n\tWikipedia articles that may have off-topic sections from May 2019\n\tAll articles that may have off-topic sections\n\tArticles with unsourced statements from January 2016\n\tArticles that may contain original research from May 2016\n\tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tEspañol\n\tFrançais\n\t한국어\n\tहिन्दी\n\tעברית\n\tLietuvių\n\tBahasa Melayu\n\tPolski\n\tPortuguês\n\tРусский\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSvenska\n\tతెలుగు\n\tTürkçe\n\tاردو\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 20 September 2019, at 02:24 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "13", "dc:title": "Artificial gravity - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Gemini_11_Agena.jpg/1200px-Gemini_11_Agena.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-artificial_gravity", "title": "Artificial gravity - Wikipedia"}}