{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAstronomical unit - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tAstronomical unit\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about the unit of length. For constants, see astronomical constant. For units in astronomy, see astronomical system of units.\n\nMean distance between Earth and the Sun, common length reference in astronomy\n\n\n\n\n\n\tAstronomical unit\n\tThe grey line indicates the Earth–Sun distance, which on average is about 1 astronomical unit.\n\n\tGeneral information\n\tUnit system\tAstronomical system of units\n(Accepted for use with the SI)\n\tUnit of\tlength\n\tSymbol\tau, ua, or AU \n\tConversions\n     \n\t1 au, ua, or AU in ...\t... is equal to ...\n\t\n\n\t   metric (SI) units\t   149597870700 m\n\t   imperial & US units\t   9.2956×107 mi\n\t   astronomical units\t   4.8481×10−6 pc\n   1.5813×10−5 ly\n\n\nThe astronomical unit (symbol: au,[1][2][3] ua,[4] or AU) is a unit of length, roughly the distance from Earth to the Sun. However, that distance varies as Earth orbits the Sun, from a maximum (aphelion) to a minimum (perihelion) and back again once a year. Originally conceived as the average of Earth's aphelion and perihelion, since 2012 it has been defined as exactly 149,597,870,700 metres, or about 150 million kilometres (93 million miles).[5] The astronomical unit is used primarily for measuring distances within the Solar System or around other stars. It is also a fundamental component in the definition of another unit of astronomical length, the parsec.\n\n\nContents\n\n\n\t1 History of symbol usage\n\t2 Development of unit definition\n\t3 Usage and significance\n\t4 History\n\t5 Developments\n\t6 Examples\n\t7 See also\n\t8 References\n\t9 Further reading\n\t10 External links\n\n\n\n\n\nHistory of symbol usage[edit]\n\nA variety of unit symbols and abbreviations have been in use for the astronomical unit. In a 1976 resolution, the International Astronomical Union (IAU) had used the symbol A to denote a length equal to the astronomical unit.[6] In the astronomical literature, the symbol AU was (and remains) common. In 2006, the International Bureau of Weights and Measures (BIPM) had recommended ua as the symbol for the unit.[7] In the non-normative Annex C to ISO 80000-3 (2006), the symbol of the astronomical unit is \"ua\".\n\nIn 2012, the IAU, noting \"that various symbols are presently in use for the astronomical unit\", recommended the use of the symbol \"au\",[1] as did the American Astronomical Society (AAS) in the manuscript preparation guidelines for its principal journals.[3] In the 2014 revision and 2019 edition of the SI Brochure, the BIPM used the unit symbol \"au\".[8][9]\n\n\nDevelopment of unit definition[edit]\n\nSee also: Earth's orbit\n\nEarth's orbit around the Sun is an ellipse. The semi-major axis of this elliptic orbit is defined to be half of the straight line segment that joins the perihelion and aphelion. The centre of the Sun lies on this straight line segment, but not at its midpoint. Because ellipses are well-understood shapes, measuring the points of its extremes defined the exact shape mathematically, and made possible calculations for the entire orbit as well as predictions based on observation. In addition, it mapped out exactly the largest straight-line distance that Earth traverses over the course of a year, defining times and places for observing the largest parallax (apparent shifts of position) in nearby stars. Knowing Earth's shift and a star's shift enabled the star's distance to be calculated. But all measurements are subject to some degree of error or uncertainty, and the uncertainties in the length of the astronomical unit only increased uncertainties in the stellar distances. Improvements in precision have always been a key to improving astronomical understanding. Throughout the twentieth century, measurements became increasingly precise and sophisticated, and ever more dependent on accurate observation of the effects described by Einstein's theory of relativity and upon the mathematical tools it used.\n\nImproving measurements were continually checked and cross-checked by means of improved understanding of the laws of celestial mechanics, which govern the motions of objects in space. The expected positions and distances of objects at an established time are calculated (in au) from these laws, and assembled into a collection of data called an ephemeris. NASA's Jet Propulsion Laboratory HORIZONS System provides one of several ephemeris computation services.[10]\n\nIn 1976, in order to establish a yet more precise measure for the astronomical unit, the IAU formally adopted a new definition. Although directly based on the then-best available observational measurements, the definition was recast in terms of the then-best mathematical derivations from celestial mechanics and planetary ephemerides. It stated that \"the astronomical unit of length is that length (A) for which the Gaussian gravitational constant (k) takes the value 0.01720209895 when the units of measurement are the astronomical units of length, mass and time\".[6][11][12] Equivalently, by this definition, one au is \"the radius of an unperturbed circular Newtonian orbit about the sun of a particle having infinitesimal mass, moving with an angular frequency of 0.01720209895 radians per day\";[13] or alternatively that length for which the heliocentric gravitational constant (the product GM☉) is equal to (0.01720209895)2 au3/d2, when the length is used to describe the positions of objects in the Solar System.\n\nSubsequent explorations of the Solar System by space probes made it possible to obtain precise measurements of the relative positions of the inner planets and other objects by means of radar and telemetry. As with all radar measurements, these rely on measuring the time taken for photons to be reflected from an object. Because all photons move at the speed of light in vacuum, a fundamental constant of the universe, the distance of an object from the probe is calculated as the product of the speed of light and the measured time. However, for precision the calculations require adjustment for things such as the motions of the probe and object while the photons are transiting. In addition, the measurement of the time itself must be translated to a standard scale that accounts for relativistic time dilation. Comparison of the ephemeris positions with time measurements expressed in the TDB scale leads to a value for the speed of light in astronomical units per day (of 86,400 seconds). By 2009, the IAU had updated its standard measures to reflect improvements, and calculated the speed of light at 173.1446326847(69) au/d (TDB).[14]\n\nIn 1983, the International Committee for Weights and Measures (CIPM) modified the International System of Units (SI, or \"modern\" metric system) to make the metre defined as the distance travelled in a vacuum by light in 1/299792458 second. This replaced the previous definition, valid between 1960 and 1983, which was that the metre equalled a certain number of wavelengths of a certain emission line of krypton-86. (The reason for the change was an improved method of measuring the speed of light.) The speed of light could then be expressed exactly as c0 = 299,792,458 m/s, a standard also adopted by the IERS numerical standards.[15] From this definition and the 2009 IAU standard, the time for light to traverse an astronomical unit is found to be τA = 499.0047838061±0.00000001 s, which is slightly more than 8 minutes 19 seconds. By multiplication, the best IAU 2009 estimate was A = c0τA = 149597870700±3 m,[16] based on a comparison of JPL and IAA–RAS ephemerides.[17][18][19]\n\nIn 2006, the BIPM reported a value of the astronomical unit as 1.49597870691(6)×1011 m.[7] In the 2014 revision of the SI Brochure, the BIPM recognised the IAU's 2012 redefinition of the astronomical unit as 149,597,870,700 m.[8] or an increase of 9 metres.\n\nThis estimate was still derived from observation and measurements subject to error, and based on techniques that did not yet standardize all relativistic effects, and thus were not constant for all observers. In 2012, finding that the equalization of relativity alone would make the definition overly complex, the IAU simply used the 2009 estimate to redefine the astronomical unit as a conventional unit of length directly tied to the metre (exactly 149,597,870,700 m).[16][20] The new definition also recognizes as a consequence that the astronomical unit is now to play a role of reduced importance, limited in its use to that of a convenience in some applications.[16]\n\n\n\t\t1 astronomical unit  \n\t= 149597870700 metres (exactly)\n\n\t≈ 92.955807 million miles\n\n\t≈ 499.00478384 light-seconds\n\n\t≈ 4.8481368 millionths (4.8481368×10−6) of a parsec\n\n\t≈ 15.812507 millionths (15.812507×10−6) of a light-year\n\n\n\n\n\nThis definition makes the speed of light, defined as exactly 299792458 m/s, equal to exactly 299792458 × 86400 ÷ 149597870700 or about 173.144632674240 au/d, some 60 parts per trillion less than the 2009 estimate.\n\n\nUsage and significance[edit]\n\nWith the definitions used before 2012, the astronomical unit was dependent on the heliocentric gravitational constant, that is the product of the gravitational constant G and the solar mass M☉. Neither G nor M☉ can be measured to high accuracy separately, but the value of their product is known very precisely from observing the relative positions of planets (Kepler's Third Law expressed in terms of Newtonian gravitation). Only the product is required to calculate planetary positions for an ephemeris, so ephemerides are calculated in astronomical units and not in SI units.\n\nThe calculation of ephemerides also requires a consideration of the effects of general relativity. In particular, time intervals measured on Earth's surface (Terrestrial Time, TT) are not constant when compared to the motions of the planets: the terrestrial second (TT) appears to be longer during the Northern Hemisphere winter and shorter during the Northern Hemisphere summer when compared to the \"planetary second\" (conventionally measured in Barycentric Dynamical Time, TDB). This is because the distance between Earth and the Sun is not fixed (it varies between 0.9832898912 and 1.0167103335 au) and, when Earth is closer to the Sun (perihelion), the Sun's gravitational field is stronger and Earth is moving faster along its orbital path. As the metre is defined in terms of the second and the speed of light is constant for all observers, the terrestrial metre appears to change in length compared to the \"planetary metre\" on a periodic basis.\n\nThe metre is defined to be a unit of proper length, but the SI definition does not specify the metric tensor to be used in determining it. Indeed, the International Committee for Weights and Measures (CIPM) notes that \"its definition applies only within a spatial extent sufficiently small that the effects of the non-uniformity of the gravitational field can be ignored\".[21] As such, the metre is undefined for the purposes of measuring distances within the Solar System. The 1976 definition of the astronomical unit was incomplete because it did not specify the frame of reference in which time is to be measured, but proved practical for the calculation of ephemerides: a fuller definition that is consistent with general relativity was proposed,[22] and \"vigorous debate\" ensued[23] until August 2012 when the IAU adopted the current definition of 1 astronomical unit = 149597870700 metres.\n\nThe astronomical unit is typically used for stellar system scale distances, such as the size of a protostellar disk or the heliocentric distance of an asteroid, whereas other units are used for other distances in astronomy. The astronomical unit is too small to be convenient for interstellar distances, where the parsec and light-year are widely used. The parsec (parallax arcsecond) is defined in terms of the astronomical unit, being the distance of an object with a parallax of 1 arcsecond. The light-year is often used in popular works, but is not an approved non-SI unit and is rarely used by professional astronomers.[24]\n\nWhen simulating a numerical model of the Solar System, the astronomical unit provides an appropriate scale that minimizes (overflow, underflow and truncation) errors in floating point calculations.\n\n\nHistory[edit]\n\nThe book On the Sizes and Distances of the Sun and Moon, which has long been ascribed to Aristarchus, says that he calculated the distance to the Sun to be between 18 and 20 times the distance to the Moon, whereas the true ratio is about 389.174. The latter estimate was based on the angle between the half-moon and the Sun, which he estimated as 87° (the true value being close to 89.853°). Depending on the distance that Van Helden assumes Aristarchus used for the distance to the Moon, his calculated distance to the Sun would fall between 380 and 1,520 Earth radii.[25]\n\nAccording to Eusebius of Caesarea in the Praeparatio Evangelica (Book XV, Chapter 53), Eratosthenes found the distance to the Sun to be \"σταδιων μυριαδας τετρακοσιας και οκτωκισμυριας\" (literally \"of stadia myriads 400 and 80,000\") but with the additional note that in the Greek text the grammatical agreement is between myriads (not stadia) on the one hand and both 400 and 80,000 on the other, as in Greek, unlike English, all three (or all four if one were to include stadia) words are inflected. This has been translated either as 4,080,000 stadia (1903 translation by Edwin Hamilton Gifford), or as 804,000,000 stadia (edition of des Places\", dated 1974–1991). Using the Greek stadium of 185 to 190 metres,[26][27] the former translation comes to 754,800 km to 775,200 km, which is far too low, whereas the second translation comes to 148.7 to 152.8 million kilometres (accurate within 2%).[28] Hipparchus also gave an estimate of the distance of Earth from the Sun, quoted by Pappus as equal to 490 Earth radii. According to the conjectural reconstructions of Noel Swerdlow and G. J. Toomer, this was derived from his assumption of a \"least perceptible\" solar parallax of 7 arcminutes.[29]\n\nA Chinese mathematical treatise, the Zhoubi Suanjing (c. 1st century BCE), shows how the distance to the Sun can be computed geometrically, using the different lengths of the noontime shadows observed at three places 1,000 li apart and the assumption that Earth is flat.[30]\n\n\n\tDistance to the Sun\nestimated by\n\tEstimate\n\tIn au\n\n\tSolar\nparallax\n\tEarth\nradii\n\n\tAristarchus (3rd century BCE)\n(in On the Sizes and Distances)  \n\t–\n\t380–1,520\n\t0.016–0.065\n\n\tArchimedes (3rd century BCE)\n(in The Sand Reckoner)\n\t40″\n\t10,000\n\t0.426\n\n\tHipparchus (2nd century BCE)\n\t7'\n\t490\n\t0.021\n\n\tPosidonius (1st century BCE)\n(quoted by coeval Cleomedes)\n\t–\n\t10,000\n\t0.426\n\n\tPtolemy (2nd century)\n\t2' 50″\n\t1,210\n\t0.052\n\n\tGodefroy Wendelin (1635)\n\t15″\n\t14,000\n\t0.597\n\n\tJeremiah Horrocks (1639)\n\t15″\n\t14,000\n\t0.597\n\n\tChristiaan Huygens (1659)\n\t8.6″\n\t24,000\n\t1.023\n\n\tCassini & Richer (1672)\n\t9½″\n\t21,700\n\t0.925\n\n\tJérôme Lalande (1771)\n\t8.6″\n\t24,000\n\t1.023\n\n\tSimon Newcomb (1895)\n\t8.80″\n\t23,440\n\t0.9994\n\n\tArthur Hinks (1909)\n\t8.807″\n\t23,420\n\t0.9985\n\n\tH. Spencer Jones (1941)\n\t8.790″\n\t23,466\n\t1.0005\n\n\tmodern astronomy\n\t8.794143″\n\t23,455\n\t1.0000\n\n\n\nIn the 2nd century CE, Ptolemy estimated the mean distance of the Sun as 1,210 times Earth's radius.[31][32] To determine this value, Ptolemy started by measuring the Moon's parallax, finding what amounted to a horizontal lunar parallax of 1° 26', which was much too large. He then derived a maximum lunar distance of 64+1/6 Earth radii. Because of cancelling errors in his parallax figure, his theory of the Moon's orbit, and other factors, this figure was approximately correct.[33][34] He then measured the apparent sizes of the Sun and the Moon and concluded that the apparent diameter of the Sun was equal to the apparent diameter of the Moon at the Moon's greatest distance, and from records of lunar eclipses, he estimated this apparent diameter, as well as the apparent diameter of the shadow cone of Earth traversed by the Moon during a lunar eclipse. Given these data, the distance of the Sun from Earth can be trigonometrically computed to be 1210 Earth radii. This gives a ratio of solar to lunar distance of approximately 19, matching Aristarchus's figure. Although Ptolemy's procedure is theoretically workable, it is very sensitive to small changes in the data, so much so that changing a measurement by a few per cent can make the solar distance infinite.[33]\n\nAfter Greek astronomy was transmitted to the medieval Islamic world, astronomers made some changes to Ptolemy's cosmological model, but did not greatly change his estimate of the Earth–Sun distance. For example, in his introduction to Ptolemaic astronomy, al-Farghānī gave a mean solar distance of 1,170 Earth radii, whereas in his zij, al-Battānī used a mean solar distance of 1,108 Earth radii. Subsequent astronomers, such as al-Bīrūnī, used similar values.[35] Later in Europe, Copernicus and Tycho Brahe also used comparable figures (1,142 and 1,150 Earth radii), and so Ptolemy's approximate Earth–Sun distance survived through the 16th century.[36]\n\nJohannes Kepler was the first to realize that Ptolemy's estimate must be significantly too low (according to Kepler, at least by a factor of three) in his Rudolphine Tables (1627). Kepler's laws of planetary motion allowed astronomers to calculate the relative distances of the planets from the Sun, and rekindled interest in measuring the absolute value for Earth (which could then be applied to the other planets). The invention of the telescope allowed far more accurate measurements of angles than is possible with the naked eye. Flemish astronomer Godefroy Wendelin repeated Aristarchus' measurements in 1635, and found that Ptolemy's value was too low by a factor of at least eleven.\n\nA somewhat more accurate estimate can be obtained by observing the transit of Venus.[37] By measuring the transit in two different locations, one can accurately calculate the parallax of Venus and from the relative distance of Earth and Venus from the Sun, the solar parallax α (which cannot be measured directly due to the brightness of the Sun[38]). Jeremiah Horrocks had attempted to produce an estimate based on his observation of the 1639 transit (published in 1662), giving a solar parallax of 15 arcseconds, similar to Wendelin's figure. The solar parallax is related to the Earth–Sun distance as measured in Earth radii by\n\n\n\t\n  \n    \n      \n        A\n        =\n        cot\n        ⁡\n        α\n        ≈\n        1\n        \n        \n          \n            radian\n          \n        \n        \n          /\n        \n        α\n        .\n      \n    \n    {\\displaystyle A=\\cot \\alpha \\approx 1\\,{\\textrm {radian}}/\\alpha .}\n  \n\n\n\nThe smaller the solar parallax, the greater the distance between the Sun and Earth: a solar parallax of 15\" is equivalent to an Earth–Sun distance of 13,750 Earth radii.\n\nChristiaan Huygens believed that the distance was even greater: by comparing the apparent sizes of Venus and Mars, he estimated a value of about 24,000 Earth radii,[39] equivalent to a solar parallax of 8.6\". Although Huygens' estimate is remarkably close to modern values, it is often discounted by historians of astronomy because of the many unproven (and incorrect) assumptions he had to make for his method to work; the accuracy of his value seems to be based more on luck than good measurement, with his various errors cancelling each other out.\n\n\n  \nTransits of Venus across the face of the Sun were, for a long time, the best method of measuring the astronomical unit, despite the difficulties (here, the so-called \"black drop effect\") and the rarity of observations.\n\n\n\nJean Richer and Giovanni Domenico Cassini measured the parallax of Mars between Paris and Cayenne in French Guiana when Mars was at its closest to Earth in 1672. They arrived at a figure for the solar parallax of 9+1/2\", equivalent to an Earth–Sun distance of about 22,000 Earth radii. They were also the first astronomers to have access to an accurate and reliable value for the radius of Earth, which had been measured by their colleague Jean Picard in 1669 as 3,269,000 toises. Another colleague, Ole Rømer, discovered the finite speed of light in 1676: the speed was so great that it was usually quoted as the time required for light to travel from the Sun to the Earth, or \"light time per unit distance\", a convention that is still followed by astronomers today.\n\nA better method for observing Venus transits was devised by James Gregory and published in his Optica Promata (1663). It was strongly advocated by Edmond Halley[40] and was applied to the transits of Venus observed in 1761 and 1769, and then again in 1874 and 1882. Transits of Venus occur in pairs, but less than one pair every century, and observing the transits in 1761 and 1769 was an unprecedented international scientific operation including observations by James Cook and Charles Green from Tahiti. Despite the Seven Years' War, dozens of astronomers were dispatched to observing points around the world at great expense and personal danger: several of them died in the endeavour.[41] The various results were collated by Jérôme Lalande to give a figure for the solar parallax of 8.6″.\n\n\n\tDate\n\tMethod\n\tA/Gm\n\tUncertainty\n\n\t1895\n\taberration\n\t149.25\n\t0.12\n\n\t1941\n\tparallax\n\t149.674\n\t0.016\n\n\t1964\n\tradar\n\t149.5981\n\t0.001\n\n\t1976\n\ttelemetry\n\t149.597 870\n\t0.000 001\n\n\t2009\n\ttelemetry\n\t149.597 870 700\n\t0.000 000 003\n\n\n\nAnother method involved determining the constant of aberration. Simon Newcomb gave great weight to this method when deriving his widely accepted value of 8.80″ for the solar parallax (close to the modern value of 8.794143″), although Newcomb also used data from the transits of Venus. Newcomb also collaborated with A. A. Michelson to measure the speed of light with Earth-based equipment; combined with the constant of aberration (which is related to the light time per unit distance), this gave the first direct measurement of the Earth–Sun distance in kilometres. Newcomb's value for the solar parallax (and for the constant of aberration and the Gaussian gravitational constant) were incorporated into the first international system of astronomical constants in 1896,[42] which remained in place for the calculation of ephemerides until 1964.[43] The name \"astronomical unit\" appears first to have been used in 1903.[44][failed verification]\n\nThe discovery of the near-Earth asteroid 433 Eros and its passage near Earth in 1900–1901 allowed a considerable improvement in parallax measurement.[45] Another international project to measure the parallax of 433 Eros was undertaken in 1930–1931.[38][46]\n\nDirect radar measurements of the distances to Venus and Mars became available in the early 1960s. Along with improved measurements of the speed of light, these showed that Newcomb's values for the solar parallax and the constant of aberration were inconsistent with one another.[47]\n\n\nDevelopments[edit]\n\n  \nThe astronomical unit is used as the baseline of the triangle to measure stellar parallaxes (distances in the image are not to scale)\n\n\n\nThe unit distance A (the value of the astronomical unit in metres) can be expressed in terms of other astronomical constants:\n\n\n\t\n  \n    \n      \n        \n          A\n          \n            3\n          \n        \n        =\n        \n          \n            \n              G\n              \n                M\n                \n                  ⊙\n                \n              \n              \n                D\n                \n                  2\n                \n              \n            \n            \n              k\n              \n                2\n              \n            \n          \n        \n      \n    \n    {\\displaystyle A^{3}={\\frac {GM_{\\odot }D^{2}}{k^{2}}}}\n  \n\n\n\nwhere G is the Newtonian gravitational constant, M☉ is the solar mass, k is the numerical value of Gaussian gravitational constant and D is the time period of one day.\nThe Sun is constantly losing mass by radiating away energy,[48] so the orbits of the planets are steadily expanding outward from the Sun. This has led to calls to abandon the astronomical unit as a unit of measurement.[49]\n\nAs the speed of light has an exact defined value in SI units and the Gaussian gravitational constant k is fixed in the astronomical system of units, measuring the light time per unit distance is exactly equivalent to measuring the product GM☉ in SI units. Hence, it is possible to construct ephemerides entirely in SI units, which is increasingly becoming the norm.\n\nA 2004 analysis of radiometric measurements in the inner Solar System suggested that the secular increase in the unit distance was much larger than can be accounted for by solar radiation, +15±4 metres per century.[50][51]\n\nThe measurements of the secular variations of the astronomical unit are not confirmed by other authors and are quite controversial.\nFurthermore, since 2010, the astronomical unit has not been estimated by the planetary ephemerides.[52]\n\n\nExamples[edit]\n\nThe following table contains some distances given in astronomical units. It includes some examples with distances that are normally not given in astronomical units, because they are either too short or far too long. Distances normally change over time. Examples are listed by increasing distance.\n\n\n\tObject\n\tLength or distance (au)\n\tRange\n\tComment and reference point\n\tRefs\n\n\tLight-second\n\t0.002 \n\t–\n\tdistance light travels in one second\n\t–\n\n\tLunar distance\n\t0.0026\n\t–\n\taverage distance from Earth (which the Apollo missions took about 3 days to travel)\n\t–\n\n\tSolar radius\n\t0.005 \n\t–\n\tradius of the Sun (695500 km, 432450 mi, a hundred times the radius of Earth or ten times the average radius of Jupiter)\n\t–\n\n\tLight-minute\n\t0.12  \n\t–\n\tdistance light travels in one minute\n\t–\n\n\tMercury\n\t0.39  \n\t–\n\taverage distance from the Sun\n\t–\n\n\tVenus\n\t0.72  \n\t–\n\taverage distance from the Sun\n\t–\n\n\tEarth\n\t1.00  \n\t–\n\taverage distance of Earth's orbit from the Sun (sunlight travels for 8 minutes and 19 seconds before reaching Earth)\n\t–\n\n\tMars\n\t1.52  \n\t–\n\taverage distance from the Sun\n\t–\n\n\tLight-hour\n\t7.2   \n\t–\n\tdistance light travels in one hour\n\t–\n\n\tKuiper belt\n\t30     \n\t–\n\tInner edge begins at roughly 30 au\n\t[53]\n\n\tEris\n\t67.8  \n\t–\n\taverage distance from the Sun\n\t–\n\n\tLight-day\n\t173     \n\t–\n\tdistance light travels in one day\n\t–\n\n\tLight-year\n\t63241     \n\t–\n\tdistance light travels in one Julian year (365.25 days)\n\t–\n\n\tOort cloud\n\t75000     \n\t± 25000\n\tdistance of the outer limit of Oort cloud from the Sun (estimated, corresponds to 1.2 light-years)\n\t–\n\n\tParsec\n\t206265     \n\t–\n\tone parsec (The parsec is defined in terms of the astronomical unit, is used to measure distances beyond the scope of the Solar System and is about 3.26 light-years.)\n\t[54]\n\n\tProxima Centauri\n\t268000     \n\t± 126\n\tdistance to the nearest star to the Solar System\n\t–\n\n\tGalactic Centre\n\t1700000000     \n\t–\n\tdistance from the Sun to the centre of the Milky Way\n\t–\n\n\tNote: figures in this table are generally rounded, estimates, often rough estimates, and may considerably differ from other sources. Table also includes other units of length for comparison.\n\n\n\nSee also[edit]\n\n\tOrders of magnitude (length)\n\tGigametre\n\n\nReferences[edit]\n\n\n\t^ a b RESOLUTION B2 on the re-definition of the astronomical unit of length (PDF), Beijing, China: International Astronomical Union, 31 August 2012, The XXVIII General Assembly of International Astronomical Union … recommends … 5. that the unique symbol \"au\" be used for the astronomical unit.\n\n\t^ \"Monthly Notices of the Royal Astronomical Society: Instructions for Authors\". Oxford Journals. Retrieved 20 March 2015. The units of length/distance are Å, nm, µm, mm, cm, m, km, au, light-year, pc.\n\n\n\t^ a b \"Manuscript Preparation: AJ & ApJ Author Instructions\". American Astronomical Society. Retrieved 29 October 2016. Use standard abbreviations for ... natural units (e.g., au, pc, cm).\n\n\n\t^ ISO 80000-3, Quantities and units – Space and time\n\n\t^ RESOLUTION B2 on the re-definition of the astronomical unit of length (PDF), Beijing: International Astronomical Union, 31 August 2012, The XXVIII General Assembly of International Astronomical Union recommends [adopted] that the astronomical unit be re-defined to be a conventional unit of length equal to exactly 149,597,870,700 metres, in agreement with the value adopted in IAU 2009 Resolution B2\n\n\n\t^ a b Resolution No. 10 of the XVIth General Assembly of the International Astronomical Union, Grenoble, 1976\n\n\t^ a b Bureau International des Poids et Mesures (2006), The International System of Units (SI) (PDF) (8th ed.), Organisation Intergouvernementale de la Convention du Mètre, p. 126\n\n\n\t^ a b \"SI Brochure: The International System of Units (SI) [8th edition, 2006; updated in 2014]\". BIPM. 2014. Retrieved 3 January 2015.\n\n\n\t^ \"SI Brochure: The International System of Units (SI) [9th edition, 2019]\" (PDF). BIPM. 2019. p. 145. Retrieved 1 July 2019.\n\n\n\t^ \"HORIZONS System\", Solar system dynamics, NASA: Jet Propulsion Laboratory, 4 January 2005, retrieved 16 January 2012\n\n\n\t^ H. Hussmann; F. Sohl; J. Oberst (2009), \"§ 4.2.2.1.3: Astronomical units\",  in Joachim E Trümper (ed.), Astronomy, astrophysics, and cosmology – Volume VI/4B Solar System, Springer, p. 4, ISBN 978-3-540-88054-7\n\n\n\t^ Gareth V Williams (1997), \"Astronomical unit\",  in James H. Shirley; Rhodes Whitmore Fairbridge (eds.), Encyclopedia of planetary sciences, Springer, p. 48, ISBN 978-0-412-06951-2\n\n\n\t^ International Bureau of Weights and Measures (2006), The International System of Units (SI) (PDF) (8th ed.), p. 126, ISBN 92-822-2213-6, archived (PDF) from the original on 14 August 2017\n\n\n\t^ \"Selected Astronomical Constants\" (PDF). The Astronomical Almanac Online. USNO–UKHO. 2009. p. K6. Archived from the original (PDF) on 26 July 2014.\n\n\n\t^ Gérard Petit; Brian Luzum, eds. (2010), \"Table 1.1: IERS numerical standards\" (PDF), IERS technical note no. 36: General definitions and numerical standards, International Earth Rotation and Reference Systems Service\n For complete document see Gérard Petit; Brian Luzum, eds. (2010), IERS Conventions (2010): IERS technical note no. 36, International Earth Rotation and Reference Systems Service, ISBN 978-3-89888-989-6\n\n\n\t^ a b c Capitaine, Nicole; Klioner, Sergei; McCarthy, Dennis (2012), \"IAU Joint Discussion 7: Space-Time Reference Systems for Future Research at IAU General Assembly – The re-definition of the astronomical unit of length:reasons and consequences\" (PDF), IAU Joint Discussion 7: Space-Time Reference Systems for Future Research at IAU General Assembly, Beijing, China, 7: 40, Bibcode:2012IAUJD...7E..40C, retrieved 16 May 2013\n\n\n\t^ IAU WG on NSFA Current Best Estimates, archived from the original on 8 December 2009, retrieved 25 September 2009\n\n\n\t^ Pitjeva, E.V.; Standish, E.M. (2009), \"Proposals for the masses of the three largest asteroids, the Moon-Earth mass ratio and the Astronomical Unit\", Celestial Mechanics and Dynamical Astronomy, 103 (4): 365–72, Bibcode:2009CeMDA.103..365P, doi:10.1007/s10569-009-9203-8\n\n\n\t^ \"The Final Session of the General Assembly\" (PDF), Estrella d'Alva, p. 1, 14 August 2009, archived from the original (PDF) on 6 July 2011\n\n\n\t^ Geoff Brumfiel (14 September 2012), \"The astronomical unit gets fixed: Earth–Sun distance changes from slippery equation to single number\", Nature, doi:10.1038/nature.2012.11416, retrieved 14 September 2012\n\n\n\t^ International Bureau of Weights and Measures (2006), The International System of Units (SI) (PDF) (8th ed.), pp. 166–67, ISBN 92-822-2213-6, archived (PDF) from the original on 14 August 2017\n\n\n\t^ Huang, T.-Y.; Han, C.-H.; Yi, Z.-H.; Xu, B.-X. (1995), \"What is the astronomical unit of length?\", Astronomy and Astrophysics, 298: 629–33, Bibcode:1995A&A...298..629H\n\n\n\t^ Richard Dodd (2011), \"§ 6.2.3: Astronomical unit: Definition of the astronomical unit, future versions\", Using SI Units in Astronomy, Cambridge University Press, p. 76, ISBN 978-0-521-76917-4\n and also p. 91, Summary and recommendations.\n\n\t^ Richard Dodd (2011), \"§ 6.2.8: Light year\", Using SI Units in Astronomy, p. 82, ISBN 978-0-521-76917-4\n\n\n\t^ Van Helden, Albert (1985), Measuring the Universe: Cosmic Dimensions from Aristarchus to Halley, Chicago: University of Chicago Press, pp. 5–9, ISBN 978-0-226-84882-2\n\n\n\t^ Engels, Donald (1985), \"The Length of Eratosthenes' Stade\", The American Journal of Philology, 106 (3): 298–311, doi:10.2307/295030, JSTOR 295030\n\n\n\t^ Gulbekian, Edward (1987), \"The origin and value of the stadion unit used by Eratosthenes in the third century B.C.\", Archive for History of Exact Sciences, 37 (4): 359–63, doi:10.1007/BF00417008 (inactive 11 September 2019)\n\n\n\t^ Rawlins, D. (March 2008), \"Eratosthenes' Too-Big Earth & Too-Tiny Universe\" (PDF), DIO, 14: 3–12, Bibcode:2008DIO....14....3R\n\n\n\t^ Toomer, G.J. (1974), \"Hipparchus on the distances of the sun and moon\", Archive for History of Exact Sciences, 14 (2): 126–42, Bibcode:1974AHES...14..126T, doi:10.1007/BF00329826\n\n\n\t^ Lloyd, G.E.R. (1996), Adversaries and Authorities: Investigations into Ancient Greek and Chinese Science, Cambridge University Press, pp. 59–60, ISBN 978-0-521-55695-8\n\n\n\t^ Goldstein, Bernard R. (1967), \"The Arabic Version of Ptolemy's Planetary Hypotheses\", Trans. Am. Phil. Soc., 57 (4): 9–12, doi:10.2307/1006040, JSTOR 1006040\n\n\n\t^ van Helden, Albert (1985), Measuring the Universe: Cosmic Dimensions from Aristarchus to Halley, Chicago: University of Chicago Press, pp. 15–27, ISBN 978-0-226-84882-2\n\n\n\t^ a b pp. 16–19, van Helden 1985\n\n\t^ p. 251, Ptolemy's Almagest,\ntranslated and annotated by G.J. Toomer, London: Duckworth, 1984, \nISBN 0-7156-1588-2\n\n\t^ pp. 29–33, van Helden 1985\n\n\t^ pp. 41–53, van Helden 1985\n\n\t^ An extended historical discussion of this method is provided by Trudy E Bell, \"Quest for the astronomical unit\" (PDF), The Bent of Tau Beta Pi, Summer 2004, p. 20, archived from the original (PDF) on 24 March 2012, retrieved 16 January 2012\n\n\n\t^ a b Weaver, Harold F. (March 1943), \"The Solar Parallax\", Astronomical Society of the Pacific Leaflets, 4 (169): 144–51, Bibcode:1943ASPL....4..144W\n\n\n\t^ Goldstein, Jr., S.J. (1985), \"Christiaan Huygens' Measurement of the Distance to the Sun\", Observatory, 105: 32–33, Bibcode:1985Obs...105...32G\n\n\n\t^ Halley, E. (1716), \"A new Method of determining the Parallax of the Sun, or his Distance from the Earth\", Philosophical Transactions of the Royal Society, 29 (338–350): 454–64, doi:10.1098/rstl.1714.0056, archived from the original on 19 November 2009\n\n\n\t^ Pogge, Richard (May 2004), How Far to the Sun? The Venus Transits of 1761 & 1769, Ohio State University, retrieved 15 November 2009\n\n\n\t^ Conférence internationale des étoiles fondamentales, Paris, 18–21 May 1896\n\n\t^ Resolution No. 4 of the XIIth General Assembly of the International Astronomical Union, Hamburg, 1964\n\n\t^ \"astronomical unit\", Merriam-Webster's Online Dictionary\n\n\t^ Hinks, Arthur R. (1909), \"Solar Parallax Papers No. 7: The General Solution from the Photographic Right Ascensions of Eros, at the Opposition of 1900\", Monthly Notices of the Royal Astronomical Society, 69 (7): 544–67, Bibcode:1909MNRAS..69..544H, doi:10.1093/mnras/69.7.544\n\n\n\t^ Spencer Jones, H. (1941), \"The Solar Parallax and the Mass of the Moon from Observations of Eros at the Opposition of 1931\", Mem. R. Astron. Soc., 66: 11–66\n\n\n\t^ Mikhailov, A.A. (1964), \"The Constant of Aberration and the Solar Parallax\", Sov. Astron., 7 (6): 737–39, Bibcode:1964SvA.....7..737M\n\n\n\t^ Noerdlinger, Peter D. (2008), \"Solar Mass Loss, the Astronomical Unit, and the Scale of the Solar System\", Celestial Mechanics and Dynamical Astronomy, 0801: 3807, arXiv:0801.3807, Bibcode:2008arXiv0801.3807N\n\n\n\t^ \"AU may need to be redefined\", New Scientist, 6 February 2008\n\n\n\t^ Krasinsky, G.A.; Brumberg, V.A. (2004), \"Secular increase of astronomical unit from analysis of the major planet motions, and its interpretation\", Celestial Mechanics and Dynamical Astronomy, 90 (3–4): 267–88, Bibcode:2004CeMDA..90..267K, doi:10.1007/s10569-004-0633-z\n\n\n\t^ John D. Anderson & Michael Martin Nieto (2009), \"Astrometric Solar-System Anomalies;§ 2: Increase in the astronomical unit\", American Astronomical Society, 261: 189–97, arXiv:0907.2469, Bibcode:2009IAU...261.0702A, doi:10.1017/s1743921309990378.\n\n\n\t^ Fienga, A.;  et al. (2011), \"The INPOP10a planetary ephemeris and its applications in fundamental physics\", Celestial Mechanics and Dynamical Astronomy, 111 (3): 363, arXiv:1108.5546, Bibcode:2011CeMDA.111..363F, doi:10.1007/s10569-011-9377-8\n\n\n\t^ Alan Stern; Colwell, Joshua E. (1997), \"Collisional Erosion in the Primordial Edgeworth-Kuiper Belt and the Generation of the 30–50 au Kuiper Gap\", The Astrophysical Journal, 490 (2): 879–82, Bibcode:1997ApJ...490..879S, doi:10.1086/304912.\n\n\n\t^ http://www.iau.org, Measuring the Universe – The IAU and astronomical units\n\n\n\n\n\nFurther reading[edit]\n\n\tWilliams, D.; Davies, R. D. (1968), \"A radio method for determining the astronomical unit\", Monthly Notices of the Royal Astronomical Society, 140 (4): 537, Bibcode:1968MNRAS.140..537W, doi:10.1093/mnras/140.4.537\n\n\n\nExternal links[edit]\n\n\tThe IAU and astronomical units\n\tRecommendations concerning Units (HTML version of the IAU Style Manual)\n\tChasing Venus, Observing the Transits of Venus\n\tTransit of Venus\n\n\n\t\tv\n\tt\n\te\n\n\nUnits of length used in Astronomy\n\n\t\n\tAstronomical system of units\n\n\n\n\n\t\n\tEarth radius (R⊕ or RE)\n\tLight-second (ls)\n\tSolar radius (R☉)\n\tgigametre (Gm)\n\tAstronomical unit (au)\n\tterametre (Tm)\n\tlight-year (ly)\n\tparsec (pc)\n\tkiloparsec (kpc)\n\tmegaparsec (Mpc)\n\tgigaparsec (Gpc)\n\n\n\n\n\t\n\tSee also\n\tCosmic distance ladder\n\tOrders of magnitude (length)\n\tConversion of units\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSI units\n\n\tBase units\t\n\tampere\n\tcandela\n\tkelvin\n\tkilogram\n\tmetre\n\tmole\n\tsecond\n\n\n\n\t\n\n\tDerived units \nwith special names\t\n\tbecquerel\n\tcoulomb\n\tdegree Celsius\n\tfarad\n\tgray\n\thenry\n\thertz\n\tjoule\n\tkatal\n\tlumen\n\tlux\n\tnewton\n\tohm\n\tpascal\n\tradian\n\tsiemens\n\tsievert\n\tsteradian\n\ttesla\n\tvolt\n\twatt\n\tweber\n\n\n\n\n\tOther accepted units\t\n\tastronomical unit\n\tdalton\n\tday\n\tdecibel\n\tdegree of arc\n\telectronvolt\n\thectare\n\thour\n\tlitre\n\tminute\n\tminute and second of arc\n\tneper\n\ttonne\n\n\n\n\n\tSee also\t\n\tConversion of units\n\tMetric prefixes\n\t2005–2019 definition\n\t2019 redefinition\n\tSystems of measurement\n\n\n\n\n\t\n\t Book\n\t Category\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Astronomical_unit&oldid=918914848\"\n\n\t\t\n\t\tCategories: \tCelestial mechanics\n\tUnits of measurement in astronomy\n\tUnits of length\n\n\nHidden categories: \tPages with DOIs inactive as of 2019 September\n\tArticles with short description\n\tUse dmy dates from September 2019\n\tUse British English from October 2015\n\tAll articles with failed verification\n\tArticles with failed verification from June 2019\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tالعربية\n\tAragonés\n\tAsturianu\n\tAvañe'ẽ\n\tAzərbaycanca\n\tتۆرکجه\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBosanski\n\tBrezhoneg\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGaelg\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tJawa\n\tಕನ್ನಡ\n\tქართული\n\tҚазақша\n\tKiswahili\n\tLatina\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tLimburgs\n\tLingua Franca Nova\n\tLumbaart\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tMirandés\n\tМонгол\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tPiemontèis\n\tPlattdüütsch\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tСаха тыла\n\tSardu\n\tScots\n\tSeeltersk\n\tSicilianu\n\tSimple English\n\tسنڌي\n\tSlovenčina\n\tSlovenščina\n\tSoomaaliga\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tTaqbaylit\n\tТатарча/tatarça\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\tWinaray\n\tייִדיש\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 30 September 2019, at 21:37 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "7", "dc:title": "Astronomical unit - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Astronomical_unit.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-astronomical_unit", "title": "Astronomical unit - Wikipedia"}}