{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAstronomy - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\n\n\tAstronomy\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about the scientific study of celestial objects. For other uses, see Astronomy (disambiguation).\n\nNot to be confused with astrology, the pseudoscience.\n\nScientific study of celestial objects and phenomena\n\n\n\n\n  \nA giant Hubble mosaic of the Crab Nebula, a supernova remnant\n\n\n\n  \nThe Milky Way as viewed from La Silla Observatory\n\n\n\nAstronomy (from Greek: ἀστρονομία) is a natural science that studies celestial objects and phenomena. It uses mathematics, physics, and chemistry in order to explain their origin and evolution. Objects of interest include planets, moons, stars, nebulae, galaxies, and comets. Relevant phenomena include supernova explosions, gamma ray bursts, quasars, blazars, pulsars, and cosmic microwave background radiation. More generally, astronomy studies everything that originates outside Earth's atmosphere. Cosmology is a branch of astronomy. It studies the Universe as a whole.[1]\n\nAstronomy is one of the oldest natural sciences. The early civilizations in recorded history made methodical observations of the night sky. These include the Babylonians, Greeks, Indians, Egyptians, Nubians, Iranians, Chinese, Maya, and many ancient indigenous peoples of the Americas. In the past, astronomy included disciplines as diverse as astrometry, celestial navigation, observational astronomy, and the making of calendars. Nowadays, professional astronomy is often said to be the same as astrophysics.[2]\n\nProfessional astronomy is split into observational and theoretical branches. Observational astronomy is focused on acquiring data from observations of astronomical objects. This data is then analyzed using basic principles of physics. Theoretical astronomy is oriented toward the development of computer or analytical models to describe astronomical objects and phenomena. These two fields complement each other. Theoretical astronomy seeks to explain observational results and observations are used to confirm theoretical results.\n\nAmateurs play an active role in astronomy. It is one of the few sciences in which this is the case. This is especially true for the discovery and observation of transient events. Amateur astronomers have helped with many important discoveries, such as finding new comets.\n\n\nContents\n\n\n\t1 Etymology\n\t1.1 Use of terms \"astronomy\" and \"astrophysics\"\n\n\n\n\t2 History\n\t2.1 Ancient times\n\t2.2 Middle Ages\n\t2.3 Scientific revolution\n\n\n\n\t3 Observational astronomy\n\t3.1 Radio astronomy\n\t3.2 Infrared astronomy\n\t3.3 Optical astronomy\n\t3.4 Ultraviolet astronomy\n\t3.5 X-ray astronomy\n\t3.6 Gamma-ray astronomy\n\t3.7 Fields not based on the electromagnetic spectrum\n\t3.8 Astrometry and celestial mechanics\n\n\n\n\t4 Theoretical astronomy\n\t5 Specific subfields\n\t5.1 Astrophysics\n\t5.2 Astrochemistry\n\t5.3 Astrobiology\n\t5.4 Physical cosmology\n\t5.5 Extragalactic astronomy\n\t5.6 Galactic astronomy\n\t5.7 Stellar astronomy\n\t5.8 Solar astronomy\n\t5.9 Planetary science\n\n\n\n\t6 Interdisciplinary studies\n\t7 Amateur astronomy\n\t8 Unsolved problems in astronomy\n\t9 See also\n\t10 References\n\t11 Bibliography\n\t12 External links\n\n\n\n\n\nEtymology[edit]\n\n  \n19th-century, Australia (1873)\n\n\n\n  \n19th-century Quito Astronomical Observatory is located 12 minutes south of the Equator in Quito, Ecuador.[3]\n\n\n\nAstronomy (from the Greek ἀστρονομία from ἄστρον astron, \"star\" and -νομία -nomia from νόμος nomos, \"law\" or \"culture\") means \"law of the stars\" (or \"culture of the stars\" depending on the translation). Astronomy should not be confused with astrology, the belief system which claims that human affairs are correlated with the positions of celestial objects.[4] Although the two fields share a common origin, they are now entirely distinct.[5]\n\n\nUse of terms \"astronomy\" and \"astrophysics\"[edit]\n\nGenerally, both of the terms \"astronomy\" and \"astrophysics\" may be used to refer to the same subject.[6][7][8] Based on strict dictionary definitions, \"astronomy\" refers to \"the study of objects and matter outside the Earth's atmosphere and of their physical and chemical properties,\"[9] while \"astrophysics\" refers to the branch of astronomy dealing with \"the behavior, physical properties, and dynamic processes of celestial objects and phenomena.\"[10] In some cases, as in the introduction of the introductory textbook The Physical Universe by Frank Shu, \"astronomy\" may be used to describe the qualitative study of the subject, whereas \"astrophysics\" is used to describe the physics-oriented version of the subject.[11] However, since most modern astronomical research deals with subjects related to physics, modern astronomy could actually be called astrophysics.[6] Some fields, such as astrometry, are purely astronomy rather than also astrophysics. Various departments in which scientists carry out research on this subject may use \"astronomy\" and \"astrophysics\", partly depending on whether the department is historically affiliated with a physics department,[7] and many professional astronomers have physics rather than astronomy degrees.[8] Some titles of the leading scientific journals in this field include The Astronomical Journal, The Astrophysical Journal, and Astronomy and Astrophysics.\n\n\nHistory[edit]\n\n  \nA celestial map from the 17th century, by the Dutch cartographer Frederik de Wit\n\n\n\nMain article: History of astronomy\n\nFurther information: Archaeoastronomy and List of astronomers\n\nAncient times[edit]\n\nIn early historic times, astronomy only consisted of the observation and predictions of the motions of objects visible to the naked eye. In some locations, early cultures assembled massive artifacts that possibly had some astronomical purpose. In addition to their ceremonial uses, these observatories could be employed to determine the seasons, an important factor in knowing when to plant crops and in understanding the length of the year.[12]\n\nBefore tools such as the telescope were invented, early study of the stars was conducted using the naked eye. As civilizations developed, most notably in Mesopotamia, Greece, Persia, India, China, Egypt, and Central America, astronomical observatories were assembled and ideas on the nature of the Universe began to develop. Most early astronomy consisted of mapping the positions of the stars and planets, a science now referred to as astrometry. From these observations, early ideas about the motions of the planets were formed, and the nature of the Sun, Moon and the Earth in the Universe were explored philosophically. The Earth was believed to be the center of the Universe with the Sun, the Moon and the stars rotating around it. This is known as the geocentric model of the Universe, or the Ptolemaic system, named after Ptolemy.[13]\n\nA particularly important early development was the beginning of mathematical and scientific astronomy, which began among the Babylonians, who laid the foundations for the later astronomical traditions that developed in many other civilizations.[14] The Babylonians discovered that lunar eclipses recurred in a repeating cycle known as a saros.[15]\n\n\n  \nGreek equatorial sundial, Alexandria on the Oxus, present-day Afghanistan 3rd–2nd century BCE\n\n\n\nFollowing the Babylonians, significant advances in astronomy were made in ancient Greece and the Hellenistic world. Greek astronomy is characterized from the start by seeking a rational, physical explanation for celestial phenomena.[16] In the 3rd century BC, Aristarchus of Samos estimated the size and distance of the Moon and Sun, and he proposed a model of the Solar System where the Earth and planets rotated around the Sun, now called the heliocentric model.[17] In the 2nd century BC, Hipparchus discovered precession, calculated the size and distance of the Moon and invented the earliest known astronomical devices such as the astrolabe.[18] Hipparchus also created a comprehensive catalog of 1020 stars, and most of the constellations of the northern hemisphere derive from Greek astronomy.[19] The Antikythera mechanism (c. 150–80 BC) was an early analog computer designed to calculate the location of the Sun, Moon, and planets for a given date. Technological artifacts of similar complexity did not reappear until the 14th century, when mechanical astronomical clocks appeared in Europe.[20]\n\n\nMiddle Ages[edit]\n\nMedieval Europe housed a number of important astronomers. Richard of Wallingford (1292–1336) made major contributions to astronomy and horology, including the invention of the first astronomical clock, the Rectangulus which allowed for the measurement of angles between planets and other astronomical bodies, as well as an equatorium called the Albion which could be used for astronomical calculations such as lunar, solar and planetary longitudes and could predict eclipses. Nicole Oresme (1320–1382) and Jean Buridan (1300–1361) first discussed evidence for the rotation of the Earth, furthermore, Buridan also developed the theory of impetus (predecessor of the modern scientific theory of inertia) which was able to show planets were capable of motion without the intervention of angels.[21] Georg von Peuerbach (1423–1461) and Regiomontanus (1436–1476) helped make astronomical progress instrumental to Copernicus's development of the heliocentric model decades later.\n\nAstronomy flourished in the Islamic world and other parts of the world. This led to the emergence of the first astronomical observatories in the Muslim world by the early 9th century.[22][23][24] In 964, the Andromeda Galaxy, the largest galaxy in the Local Group,  was described by the Persian Muslim astronomer Abd al-Rahman al-Sufi in his Book of Fixed Stars.[25] The SN 1006 supernova, the brightest apparent magnitude stellar event in recorded history, was observed by the Egyptian Arabic astronomer Ali ibn Ridwan and Chinese astronomers in 1006. Some of the prominent Islamic (mostly Persian and Arab) astronomers who made significant contributions to the science include Al-Battani, Thebit, Abd al-Rahman al-Sufi, Biruni, Abū Ishāq Ibrāhīm al-Zarqālī, Al-Birjandi, and the astronomers of the Maragheh and Samarkand observatories. Astronomers during that time introduced many Arabic names now used for individual stars.[26][27] It is also believed that the ruins at Great Zimbabwe and Timbuktu[28] may have housed astronomical observatories.[29] Europeans had previously believed that there had been no astronomical observation in sub-Saharan Africa during the pre-colonial Middle Ages, but modern discoveries show otherwise.[30][31][32][33]\n\nFor over six centuries (from the recovery of ancient learning during the late Middle Ages into the Enlightenment), the Roman Catholic Church gave more financial and social support to the study of astronomy than probably all other institutions. Among the Church's motives was finding the date for Easter.[34]\n\n\nScientific revolution[edit]\n\n  \nGalileo's sketches and observations of the Moon revealed that the surface was mountainous.\n\n\n\n  \nAn astronomical chart from an early scientific manuscript, c. 1000\n\n\n\nDuring the Renaissance, Nicolaus Copernicus proposed a heliocentric model of the solar system. His work was defended by Galileo Galilei and expanded upon by Johannes Kepler. Kepler was the first to devise a system that correctly described the details of the motion of the planets around the Sun. However, Kepler did not succeed in formulating a theory behind the laws he wrote down.[35] It was Isaac Newton, with his invention of celestial dynamics and his law of gravitation, who finally explained the motions of the planets. Newton also developed the reflecting telescope.[36]\n\nImprovements in the size and quality of the telescope led to further discoveries. The English astronomer John Flamsteed catalogued over 3000 stars,[37] More extensive star catalogues were produced by Nicolas Louis de Lacaille. The astronomer William Herschel made a detailed catalog of nebulosity and clusters, and in 1781 discovered the planet Uranus, the first new planet found.[38] The distance to a star was announced in 1838 when the parallax of 61 Cygni was measured by Friedrich Bessel.[39]\n\nDuring the 18–19th centuries, the study of the three-body problem by Leonhard Euler, Alexis Claude Clairaut, and Jean le Rond d'Alembert led to more accurate predictions about the motions of the Moon and planets. This work was further refined by Joseph-Louis Lagrange and Pierre Simon Laplace, allowing the masses of the planets and moons to be estimated from their perturbations.[40]\n\nSignificant advances in astronomy came about with the introduction of new technology, including the spectroscope and photography. Joseph von Fraunhofer discovered about 600 bands in the spectrum of the Sun in 1814–15, which, in 1859, Gustav Kirchhoff ascribed to the presence of different elements. Stars were proven to be similar to the Earth's own Sun, but with a wide range of temperatures, masses, and sizes.[26]\n\nThe existence of the Earth's galaxy, the Milky Way, as its own group of stars was only proved in the 20th century, along with the existence of \"external\" galaxies. The observed recession of those galaxies led to the discovery of the expansion of the Universe.[41] Theoretical astronomy led to speculations on the existence of objects such as black holes and neutron stars, which have been used to explain such observed phenomena as quasars, pulsars, blazars, and radio galaxies. Physical cosmology made huge advances during the 20th century. In the early 1900s the model of the Big Bang theory was formulated, heavily evidenced by cosmic microwave background radiation, Hubble's law, and the cosmological abundances of elements. Space telescopes have enabled measurements in parts of the electromagnetic spectrum normally blocked or blurred by the atmosphere.[citation needed] In February 2016, it was revealed that the LIGO project had detected evidence of gravitational waves in the previous September.[42][43]\n\n\nObservational astronomy[edit]\n\nMain article: Observational astronomy\n\nThe main source of information about celestial bodies and other objects is visible light, or more generally electromagnetic radiation.[44] Observational astronomy may be categorized according to the corresponding region of the electromagnetic spectrum on which the observations are made. Some parts of the spectrum can be observed from the Earth's surface, while other parts are only observable from either high altitudes or outside the Earth's atmosphere. Specific information on these subfields is given below.\n\n\nRadio astronomy[edit]\n\n  \nThe Very Large Array in New Mexico, an example of a radio telescope\n\n\n\nMain article: Radio astronomy\n\nRadio astronomy uses radiation with wavelengths greater than approximately one millimeter, outside the visible range.[45] Radio astronomy is different from most other forms of observational astronomy in that the observed radio waves can be treated as waves rather than as discrete photons. Hence, it is relatively easier to measure both the amplitude and phase of radio waves, whereas this is not as easily done at shorter wavelengths.[45]\n\nAlthough some radio waves are emitted directly by astronomical objects, a product of thermal emission, most of the radio emission that is observed is the result of synchrotron radiation, which is produced when electrons orbit magnetic fields.[45] Additionally, a number of spectral lines produced by interstellar gas, notably the hydrogen spectral line at 21 cm, are observable at radio wavelengths.[11][45]\n\nA wide variety of other objects are observable at radio wavelengths, including supernovae, interstellar gas, pulsars, and active galactic nuclei.[11][45]\n\n\nInfrared astronomy[edit]\n\n  \nALMA Observatory is one of the highest observatory sites on Earth. Atacama, Chile.[46]\n\n\n\nMain article: Infrared astronomy\n\nInfrared astronomy is founded on the detection and analysis of infrared radiation, wavelengths longer than red light and outside the range of our vision. The infrared spectrum is useful for studying objects that are too cold to radiate visible light, such as planets, circumstellar disks or nebulae whose light is blocked by dust. The longer wavelengths of infrared can penetrate clouds of dust that block visible light, allowing the observation of young stars embedded in molecular clouds and the cores of galaxies. Observations from the Wide-field Infrared Survey Explorer (WISE) have been particularly effective at unveiling numerous Galactic protostars and their host star clusters.[47][48]\nWith the exception of infrared wavelengths close to visible light, such radiation is heavily absorbed by the atmosphere, or masked, as the atmosphere itself produces significant infrared emission. Consequently, infrared observatories have to be located in high, dry places on Earth or in space.[49] Some molecules radiate strongly in the infrared. This allows the study of the chemistry of space; more specifically it can detect water in comets.[50]\n\n\nOptical astronomy[edit]\n\n  \nThe Subaru Telescope (left) and Keck Observatory (center) on Mauna Kea, both examples of an observatory that operates at near-infrared and visible wavelengths. The NASA Infrared Telescope Facility (right) is an example of a telescope that operates only at near-infrared wavelengths.\n\n\n\nMain article: Optical astronomy\n\nHistorically, optical astronomy, also called visible light astronomy, is the oldest form of astronomy.[51] Images of observations were originally drawn by hand. In the late 19th century and most of the 20th century, images were made using photographic equipment. Modern images are made using digital detectors, particularly using charge-coupled devices (CCDs) and recorded on modern medium. Although visible light itself extends from approximately 4000 Å to 7000 Å (400 nm to 700 nm),[51] that same equipment can be used to observe some near-ultraviolet and near-infrared radiation.\n\n\nUltraviolet astronomy[edit]\n\nMain article: Ultraviolet astronomy\n\nUltraviolet astronomy employs ultraviolet wavelengths between approximately 100 and 3200 Å (10 to 320 nm).[45] Light at those wavelengths is absorbed by the Earth's atmosphere, requiring observations at these wavelengths to be performed from the upper atmosphere or from space. Ultraviolet astronomy is best suited to the study of thermal radiation and spectral emission lines from hot blue stars (OB stars) that are very bright in this wave band. This includes the blue stars in other galaxies, which have been the targets of several ultraviolet surveys. Other objects commonly observed in ultraviolet light include planetary nebulae, supernova remnants, and active galactic nuclei.[45] However, as ultraviolet light is easily absorbed by interstellar dust, an adjustment of ultraviolet measurements is necessary.[45]\n\n\nX-ray astronomy[edit]\n\nMain article: X-ray astronomy\n\n  \nX-ray jet made from a supermassive black hole found by NASA's Chandra X-ray Observatory, made visible by light from the early Universe\n\n\n\nX-ray astronomy uses X-ray wavelengths. Typically, X-ray radiation is produced by synchrotron emission (the result of electrons orbiting magnetic field lines), thermal emission from thin gases above 107 (10 million) kelvins, and thermal emission from thick gases above 107 Kelvin.[45] Since X-rays are absorbed by the Earth's atmosphere, all X-ray observations must be performed from high-altitude balloons, rockets, or X-ray astronomy satellites. Notable X-ray sources include X-ray binaries, pulsars, supernova remnants, elliptical galaxies, clusters of galaxies, and active galactic nuclei.[45]\n\n\nGamma-ray astronomy[edit]\n\nMain article: Gamma ray astronomy\n\nGamma ray astronomy observes astronomical objects at the shortest wavelengths of the electromagnetic spectrum. Gamma rays may be observed directly by satellites such as the Compton Gamma Ray Observatory or by specialized telescopes called atmospheric Cherenkov telescopes.[45] The Cherenkov telescopes do not detect the gamma rays directly but instead detect the flashes of visible light produced when gamma rays are absorbed by the Earth's atmosphere.[52]\n\nMost gamma-ray emitting sources are actually gamma-ray bursts, objects which only produce gamma radiation for a few milliseconds to thousands of seconds before fading away. Only 10% of gamma-ray sources are non-transient sources. These steady gamma-ray emitters include pulsars, neutron stars, and black hole candidates such as active galactic nuclei.[45]\n\n\nFields not based on the electromagnetic spectrum[edit]\n\nIn addition to electromagnetic radiation, a few other events originating from great distances may be observed from the Earth.\n\nIn neutrino astronomy, astronomers use heavily shielded underground facilities such as SAGE, GALLEX, and Kamioka II/III for the detection of neutrinos. The vast majority of the neutrinos streaming through the Earth originate from the Sun, but 24 neutrinos were also detected from supernova 1987A.[45] Cosmic rays, which consist of very high energy particles (atomic nuclei) that can decay or be absorbed when they enter the Earth's atmosphere, result in a cascade of secondary particles which can be detected by current observatories.[53] Some future neutrino detectors may also be sensitive to the particles produced when cosmic rays hit the Earth's atmosphere.[45]\n\nGravitational-wave astronomy is an emerging field of astronomy that employs gravitational-wave detectors to collect observational data about distant massive objects. A few observatories have been constructed, such as the Laser Interferometer Gravitational Observatory LIGO. LIGO made its first detection on 14 September 2015, observing gravitational waves from a binary black hole.[54] A second gravitational wave was detected on 26 December 2015 and additional observations should continue but gravitational waves require extremely sensitive instruments.[55][56]\n\nThe combination of observations made using electromagnetic radiation, neutrinos or gravitational waves and other complementary information, is known as multi-messenger astronomy.[57][58]\n\n\nAstrometry and celestial mechanics[edit]\n\nMain articles: Astrometry and Celestial mechanics\n\n  \nStar cluster Pismis 24 with a nebula\n\n\n\nOne of the oldest fields in astronomy, and in all of science, is the measurement of the positions of celestial objects. Historically, accurate knowledge of the positions of the Sun, Moon, planets and stars has been essential in celestial navigation (the use of celestial objects to guide navigation) and in the making of calendars.\n\nCareful measurement of the positions of the planets has led to a solid understanding of gravitational perturbations, and an ability to determine past and future positions of the planets with great accuracy, a field known as celestial mechanics. More recently the tracking of near-Earth objects will allow for predictions of close encounters or potential collisions of the Earth with those objects.[59]\n\nThe measurement of stellar parallax of nearby stars provides a fundamental baseline in the cosmic distance ladder that is used to measure the scale of the Universe. Parallax measurements of nearby stars provide an absolute baseline for the properties of more distant stars, as their properties can be compared. Measurements of the radial velocity and proper motion of stars allows astronomers to plot the movement of these systems through the Milky Way galaxy. Astrometric results are the basis used to calculate the distribution of speculated dark matter in the galaxy.[60]\n\nDuring the 1990s, the measurement of the stellar wobble of nearby stars was used to detect large extrasolar planets orbiting those stars.[61]\n\n\nTheoretical astronomy[edit]\n\n\tNucleosynthesis\n\t\n\t\n\tStellar nucleosynthesis\n\tBig Bang nucleosynthesis\n\tSupernova nucleosynthesis\n\tCosmic ray spallation\n\n\n\t\nRelated topics\n\t\n\tAstrophysics\n\tNuclear fusion\n\tR-process\n\tS-process\n\n\n\tNuclear fission\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nMain article: Theoretical astronomy\n\nTheoretical astronomers use several tools including analytical models and computational numerical simulations; each has its particular advantages. Analytical models of a process are generally better for giving broader insight into the heart of what is going on. Numerical models reveal the existence of phenomena and effects otherwise unobserved.[62][63]\n\nTheorists in astronomy endeavor to create theoretical models and from the results predict observational consequences of those models. The observation of a phenomenon predicted by a model allows astronomers to select between several alternate or conflicting models as the one best able to describe the phenomena.\n\nTheorists also try to generate or modify models to take into account new data. In the case of an inconsistency between the data and model's results, the general tendency is to try to make minimal modifications to the model so that it produces results that fit the data. In some cases, a large amount of inconsistent data over time may lead to total abandonment of a model.\n\nPhenomena modeled by theoretical astronomers include: stellar dynamics and evolution; galaxy formation; large-scale distribution of matter in the Universe; origin of cosmic rays; general relativity and physical cosmology, including string cosmology and astroparticle physics. Astrophysical relativity serves as a tool to gauge the properties of large scale structures for which gravitation plays a significant role in physical phenomena investigated and as the basis for black hole (astro)physics and the study of gravitational waves.\n\nSome widely accepted and studied theories and models in astronomy, now included in the Lambda-CDM model are the Big Bang, Cosmic inflation, dark matter, and fundamental theories of physics.\n\nA few examples of this process:\n\n\n\tPhysical process\n\tExperimental tool\n\tTheoretical model\n\tExplains/predicts\n\n\tGravitation\n\tRadio telescopes\n\tSelf-gravitating system\n\tEmergence of a star system\n\n\tNuclear fusion\n\tSpectroscopy\n\tStellar evolution\n\tHow the stars shine and how metals formed\n\n\tThe Big Bang\n\tHubble Space Telescope, COBE\n\tExpanding universe\n\tAge of the Universe\n\n\tQuantum fluctuations\n\t\n\tCosmic inflation\n\tFlatness problem\n\n\tGravitational collapse\n\tX-ray astronomy\n\tGeneral relativity\n\tBlack holes at the center of Andromeda Galaxy\n\n\tCNO cycle in stars\n\t\n\t\n\tThe dominant source of energy for massive star.\n\n\n\nDark matter and dark energy are the current leading topics in astronomy,[64] as their discovery and controversy originated during the study of the galaxies.\n\n\nSpecific subfields[edit]\n\nAstrophysics[edit]\n\nAstrophysics is the branch of astronomy that employs the principles of physics and chemistry \"to ascertain the nature of the astronomical objects, rather than their positions or motions in space\".[65][66] Among the objects studied are the Sun, other stars, galaxies, extrasolar planets, the interstellar medium and the cosmic microwave background.[67][68] Their emissions are examined across all parts of the electromagnetic spectrum, and the properties examined include luminosity, density, temperature, and chemical composition. Because astrophysics is a very broad subject, astrophysicists typically apply many disciplines of physics, including mechanics, electromagnetism, statistical mechanics, thermodynamics, quantum mechanics, relativity, nuclear and particle physics, and atomic and molecular physics.\n\nIn practice, modern astronomical research often involves a substantial amount of work in the realms of theoretical and observational physics. Some areas of study for astrophysicists include their attempts to determine the properties of dark matter, dark energy, and black holes; whether or not time travel is possible, wormholes can form, or the multiverse exists; and the origin and ultimate fate of the universe.[67] Topics also studied by theoretical astrophysicists include Solar System formation and evolution; stellar dynamics and evolution; galaxy formation and evolution; magnetohydrodynamics; large-scale structure of matter in the universe; origin of cosmic rays; general relativity and physical cosmology, including string cosmology and astroparticle physics.\n\n\nAstrochemistry[edit]\n\nAstrochemistry is the study of the abundance and reactions of molecules in the Universe, and their interaction with radiation.[69] The discipline is an overlap of astronomy and chemistry.  The word \"astrochemistry\" may be applied to both the Solar System and the interstellar medium. The study of the abundance of elements and isotope ratios in Solar System objects, such as meteorites, is also called cosmochemistry, while the study of interstellar atoms and molecules and their interaction with radiation is sometimes called molecular astrophysics. The formation, atomic and chemical composition, evolution and fate of molecular gas clouds is of special interest, because it is from these clouds that solar systems form.\n\nStudies in this field contribute to the understanding of the formation of the Solar System, Earth's origin and geology, abiogenesis, and the origin of climate and oceans.\n\n\nAstrobiology[edit]\n\nAstrobiology is an interdisciplinary scientific field concerned with the origins, early evolution, distribution, and future of life in the universe. Astrobiology considers the question of whether extraterrestrial life exists, and how humans can detect it if it does.[70] The term exobiology is similar.[71]\n\nAstrobiology makes use of molecular biology, biophysics, biochemistry, chemistry, astronomy, physical cosmology, exoplanetology and geology to investigate the possibility of life on other worlds and help recognize biospheres that might be different from that on Earth.[72] The origin and early evolution of life is an inseparable part of the discipline of astrobiology.[73] Astrobiology concerns itself with interpretation of existing scientific data, and although speculation is entertained to give context, astrobiology concerns itself primarily with hypotheses that fit firmly into existing scientific theories.\n\nThis interdisciplinary field encompasses research on the origin of planetary systems, origins of organic compounds in space, rock-water-carbon interactions, abiogenesis on Earth, planetary habitability, research on biosignatures for life detection, and studies on the potential for life to adapt to challenges on Earth and in outer space.[74][75][76]\n\n\nPhysical cosmology[edit]\n\nUniverse events since the Big Bang 13.8 billion years ago\n\nNature timeline\nThis box: \tview\n\ttalk\n\tedit\n\n\n\n-13 —\n–\n-12 —\n–\n-11 —\n–\n-10 —\n–\n-9 —\n–\n-8 —\n–\n-7 —\n–\n-6 —\n–\n-5 —\n–\n-4 —\n–\n-3 —\n–\n-2 —\n–\n-1 —\n–\n0 —\n\n\nReionization\n\nMatter-dominated\nera\n\naccelerated expansion\n\nwater\n\nSingle-celled life\n\nphotosynthesis\n\nMulticellular\nlife\n\nVertebrates\n\nDark Ages\n\n\n←\nUniverse (−13.80)\n\n←\nEarliest stars\n\n←\nEarliest galaxy\n\n←\nEarliest quasar/sbh\n\n←\nOmega Centauri\n\n←\nAndromeda Galaxy\n\n←\nMilky Way spirals\n\n\n\n←\nAlpha Centauri\n\n\n\n←\nEarth/SolarSystem\n\n\n\n←\nEarliest life\n\n←\nEarliest oxygen\n\n←\nAtmospheric oxygen\n\n←\nSexual reproduction\n\n←\nEarliest plants\n\n←\nCambrian explosion\n\n←\nEarliest mammals\n\n←\nEarliest apes\n\nL\ni\nf\ne\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(billion years ago)\n\n(See also: Human timeline, and Life timeline.)\n\n\n\nMain article: Physical cosmology\n\nCosmology (from the Greek κόσμος (kosmos) \"world, universe\" and λόγος (logos) \"word, study\" or literally \"logic\") could be considered the study of the Universe as a whole.\n\n\n  \nHubble Extreme Deep Field\n\n\n\nObservations of the large-scale structure of the Universe, a branch known as physical cosmology, have provided a deep understanding of the formation and evolution of the cosmos. Fundamental to modern cosmology is the well-accepted theory of the Big Bang, wherein our Universe began at a single point in time, and thereafter expanded over the course of 13.8 billion years[77] to its present condition.[78] The concept of the Big Bang can be traced back to the discovery of the microwave background radiation in 1965.[78]\n\nIn the course of this expansion, the Universe underwent several evolutionary stages. In the very early moments, it is theorized that the Universe experienced a very rapid cosmic inflation, which homogenized the starting conditions. Thereafter, nucleosynthesis produced the elemental abundance of the early Universe.[78] (See also nucleocosmochronology.)\n\nWhen the first neutral atoms formed from a sea of primordial ions, space became transparent to radiation, releasing the energy viewed today as the microwave background radiation. The expanding Universe then underwent a Dark Age due to the lack of stellar energy sources.[79]\n\nA hierarchical structure of matter began to form from minute variations in the mass density of space. Matter accumulated in the densest regions, forming clouds of gas and the earliest stars, the Population III stars. These massive stars triggered the reionization process and are believed to have created many of the heavy elements in the early Universe, which, through nuclear decay, create lighter elements, allowing the cycle of nucleosynthesis to continue longer.[80]\n\nGravitational aggregations clustered into filaments, leaving voids in the gaps. Gradually, organizations of gas and dust merged to form the first primitive galaxies. Over time, these pulled in more matter, and were often organized into groups and clusters of galaxies, then into larger-scale superclusters.[81]\n\nVarious fields of physics are crucial to studying the universe. Interdisciplinary studies involve the fields of quantum mechanics, particle physics, plasma physics, condensed matter physics, statistical mechanics, optics, and nuclear physics.\n\nFundamental to the structure of the Universe is the existence of dark matter and dark energy. These are now thought to be its dominant components, forming 96% of the mass of the Universe. For this reason, much effort is expended in trying to understand the physics of these components.[82]\n\n\nExtragalactic astronomy[edit]\n\n  \nThis image shows several blue, loop-shaped objects that are multiple images of the same galaxy, duplicated by the gravitational lens effect of the cluster of yellow galaxies near the middle of the photograph. The lens is produced by the cluster's gravitational field that bends light to magnify and distort the image of a more distant object.\n\n\n\nMain article: Extragalactic astronomy\n\nThe study of objects outside our galaxy is a branch of astronomy concerned with the formation and evolution of Galaxies, their morphology (description) and classification, the observation of active galaxies, and at a larger scale, the groups and clusters of galaxies. Finally, the latter is important for the understanding of the large-scale structure of the cosmos.\n\nMost galaxies are organized into distinct shapes that allow for classification schemes. They are commonly divided into spiral, elliptical and Irregular galaxies.[83]\n\nAs the name suggests, an elliptical galaxy has the cross-sectional shape of an ellipse. The stars move along random orbits with no preferred direction. These galaxies contain little or no interstellar dust, few star-forming regions, and generally older stars. Elliptical galaxies are more commonly found at the core of galactic clusters, and may have been formed through mergers of large galaxies.\n\nA spiral galaxy is organized into a flat, rotating disk, usually with a prominent bulge or bar at the center, and trailing bright arms that spiral outward. The arms are dusty regions of star formation within which massive young stars produce a blue tint. Spiral galaxies are typically surrounded by a halo of older stars. Both the Milky Way and one of our nearest galaxy neighbors, the Andromeda Galaxy, are spiral galaxies.\n\nIrregular galaxies are chaotic in appearance, and are neither spiral nor elliptical. About a quarter of all galaxies are irregular, and the peculiar shapes of such galaxies may be the result of gravitational interaction.\n\nAn active galaxy is a formation that emits a significant amount of its energy from a source other than its stars, dust and gas. It is powered by a compact region at the core, thought to be a super-massive black hole that is emitting radiation from in-falling material.\n\nA radio galaxy is an active galaxy that is very luminous in the radio portion of the spectrum, and is emitting immense plumes or lobes of gas. Active galaxies that emit shorter frequency, high-energy radiation include Seyfert galaxies, Quasars, and Blazars. Quasars are believed to be the most consistently luminous objects in the known universe.[84]\n\nThe large-scale structure of the cosmos is represented by groups and clusters of galaxies. This structure is organized into a hierarchy of groupings, with the largest being the superclusters. The collective matter is formed into filaments and walls, leaving large voids between.[85]\n\n\nGalactic astronomy[edit]\n\n  \nObserved structure of the Milky Way's spiral arms\n\n\n\nMain article: Galactic astronomy\n\nThe Solar System orbits within the Milky Way, a barred spiral galaxy that is a prominent member of the Local Group of galaxies. It is a rotating mass of gas, dust, stars and other objects, held together by mutual gravitational attraction. As the Earth is located within the dusty outer arms, there are large portions of the Milky Way that are obscured from view.\n\nIn the center of the Milky Way is the core, a bar-shaped bulge with what is believed to be a supermassive black hole at its center. This is surrounded by four primary arms that spiral from the core. This is a region of active star formation that contains many younger, population I stars. The disk is surrounded by a spheroid halo of older, population II stars, as well as relatively dense concentrations of stars known as globular clusters.[86]\n\nBetween the stars lies the interstellar medium, a region of sparse matter. In the densest regions, molecular clouds of molecular hydrogen and other elements create star-forming regions. These begin as a compact pre-stellar core or dark nebulae, which concentrate and collapse (in volumes determined by the Jeans length) to form compact protostars.[87]\n\nAs the more massive stars appear, they transform the cloud into an H II region (ionized atomic hydrogen) of glowing gas and plasma. The stellar wind and supernova explosions from these stars eventually cause the cloud to disperse, often leaving behind one or more young open clusters of stars. These clusters gradually disperse, and the stars join the population of the Milky Way.[88]\n\nKinematic studies of matter in the Milky Way and other galaxies have demonstrated that there is more mass than can be accounted for by visible matter. A dark matter halo appears to dominate the mass, although the nature of this dark matter remains undetermined.[89]\n\n\nStellar astronomy[edit]\n\n  \nMz 3, often referred to as the Ant planetary nebula. Ejecting gas from the dying central star shows symmetrical patterns unlike the chaotic patterns of ordinary explosions.\n\n\n\nMain article: Star\n\nThe study of stars and stellar evolution is fundamental to our understanding of the Universe. The astrophysics of stars has been determined through observation and theoretical understanding; and from computer simulations of the interior.[90] Star formation occurs in dense regions of dust and gas, known as giant molecular clouds. When destabilized, cloud fragments can collapse under the influence of gravity, to form a protostar. A sufficiently dense, and hot, core region will trigger nuclear fusion, thus creating a main-sequence star.[87]\n\nAlmost all elements heavier than hydrogen and helium were created inside the cores of stars.[90]\n\nThe characteristics of the resulting star depend primarily upon its starting mass. The more massive the star, the greater its luminosity, and the more rapidly it fuses its hydrogen fuel into helium in its core. Over time, this hydrogen fuel is completely converted into helium, and the star begins to evolve. The fusion of helium requires a higher core temperature. A star with a high enough core temperature will push its outer layers outward while increasing its core density. The resulting red giant formed by the expanding outer layers enjoys a brief life span, before the helium fuel in the core is in turn consumed. Very massive stars can also undergo a series of evolutionary phases, as they fuse increasingly heavier elements.[91]\n\nThe final fate of the star depends on its mass, with stars of mass greater than about eight times the Sun becoming core collapse supernovae;[92] while smaller stars blow off their outer layers and leave behind the inert core in the form of a white dwarf. The ejection of the outer layers forms a planetary nebula.[93] The remnant of a supernova is a dense neutron star, or, if the stellar mass was at least three times that of the Sun, a black hole.[94] Closely orbiting binary stars can follow more complex evolutionary paths, such as mass transfer onto a white dwarf companion that can potentially cause a supernova.[95] Planetary nebulae and supernovae distribute the  \"metals\" produced in the star by fusion to the interstellar medium; without them, all new stars (and their planetary systems) would be formed from hydrogen and helium alone.[96]\n\n\nSee also: Solar astronomy\n\nSolar astronomy[edit]\n\n  \nAn ultraviolet image of the Sun's active photosphere as viewed by the TRACE space telescope. NASA photo\n\n\n\n  \nSolar observatory Lomnický štít (Slovakia) built in 1962\n\n\n\nMain article: Sun\n\nSee also: Solar telescope\n\nAt a distance of about eight light-minutes, the most frequently studied star is the Sun, a typical main-sequence dwarf star of stellar class G2 V, and about 4.6 billion years (Gyr) old. The Sun is not considered a variable star, but it does undergo periodic changes in activity known as the sunspot cycle. This is an 11-year oscillation in sunspot number. Sunspots are regions of lower-than- average temperatures that are associated with intense magnetic activity.[97]\n\nThe Sun has steadily increased in luminosity by 40% since it first became a main-sequence star. The Sun has also undergone periodic changes in luminosity that can have a significant impact on the Earth.[98] The Maunder minimum, for example, is believed to have caused the Little Ice Age phenomenon during the Middle Ages.[99]\n\nThe visible outer surface of the Sun is called the photosphere. Above this layer is a thin region known as the chromosphere. This is surrounded by a transition region of rapidly increasing temperatures, and finally by the super-heated corona.\n\nAt the center of the Sun is the core region, a volume of sufficient temperature and pressure for nuclear fusion to occur. Above the core is the radiation zone, where the plasma conveys the energy flux by means of radiation. Above that is the convection zone where the gas material transports energy primarily through physical displacement of the gas known as convection. It is believed that the movement of mass within the convection zone creates the magnetic activity that generates sunspots.[97]\n\nA solar wind of plasma particles constantly streams outward from the Sun until, at the outermost limit of the Solar System, it reaches the heliopause. As the solar wind passes the Earth, it interacts with the Earth's magnetic field (magnetosphere) and deflects the solar wind, but traps some creating the Van Allen radiation belts that envelop the Earth. The aurora are created when solar wind particles are guided by the magnetic flux lines into the Earth's polar regions where the lines the descend into the atmosphere.[100]\n\n\nPlanetary science[edit]\n\n  \nThe black spot at the top is a dust devil climbing a crater wall on Mars. This moving, swirling column of Martian atmosphere (comparable to a terrestrial tornado) created the long, dark streak.\n\n\n\nMain articles: Planetary science and Planetary geology\n\nPlanetary science is the study of the assemblage of planets, moons, dwarf planets, comets, asteroids, and other bodies orbiting the Sun, as well as extrasolar planets. The Solar System has been relatively well-studied, initially through telescopes and then later by spacecraft. This has provided a good overall understanding of the formation and evolution of the Sun's planetary system, although many new discoveries are still being made.[101]\n\nThe Solar System is subdivided into the inner planets, the asteroid belt, and the outer planets. The inner terrestrial planets consist of Mercury, Venus, Earth, and Mars. The outer gas giant planets are Jupiter, Saturn, Uranus, and Neptune.[102] Beyond Neptune lies the Kuiper belt, and finally the Oort Cloud, which may extend as far as a light-year.\n\nThe planets were formed 4.6 billion years ago in the protoplanetary disk that surrounded the early Sun. Through a process that included gravitational attraction, collision, and accretion, the disk formed clumps of matter that, with time, became protoplanets. The radiation pressure of the solar wind then expelled most of the unaccreted matter, and only those planets with sufficient mass retained their gaseous atmosphere. The planets continued to sweep up, or eject, the remaining matter during a period of intense bombardment, evidenced by the many impact craters on the Moon. During this period, some of the protoplanets may have collided and one such collision may have formed the Moon.[103]\n\nOnce a planet reaches sufficient mass, the materials of different densities segregate within, during planetary differentiation. This process can form a stony or metallic core, surrounded by a mantle and an outer crust. The core may include solid and liquid regions, and some planetary cores generate their own magnetic field, which can protect their atmospheres from solar wind stripping.[104]\n\nA planet or moon's interior heat is produced from the collisions that created the body, by the decay of radioactive materials (e.g. uranium, thorium, and 26Al), or tidal heating caused by interactions with other bodies. Some planets and moons accumulate enough heat to drive geologic processes such as volcanism and tectonics. Those that accumulate or retain an atmosphere can also undergo surface erosion from wind or water. Smaller bodies, without tidal heating, cool more quickly; and their geological activity ceases with the exception of impact cratering.[105]\n\n\nInterdisciplinary studies[edit]\n\nAstronomy and astrophysics have developed significant interdisciplinary links with other major scientific fields. Archaeoastronomy is the study of ancient or traditional astronomies in their cultural context, utilizing archaeological and anthropological evidence. Astrobiology is the study of the advent and evolution of biological systems in the Universe, with particular emphasis on the possibility of non-terrestrial life. Astrostatistics is the application of statistics to astrophysics to the analysis of vast amount of observational astrophysical data.\n\nThe study of chemicals found in space, including their formation, interaction and destruction, is called astrochemistry. These substances are usually found in molecular clouds, although they may also appear in low temperature stars, brown dwarfs and planets. Cosmochemistry is the study of the chemicals found within the Solar System, including the origins of the elements and variations in the isotope ratios. Both of these fields represent an overlap of the disciplines of astronomy and chemistry. As \"forensic astronomy\", finally, methods from astronomy have been used to solve problems of law and history.\n\n\nAmateur astronomy[edit]\n\n  \nAmateur astronomers can build their own equipment, and hold star parties and gatherings, such as Stellafane.\n\n\n\nAstronomy is one of the sciences to which amateurs can contribute the most.[106]\n\n\nMain article: Amateur astronomy\n\nCollectively, amateur astronomers observe a variety of celestial objects and phenomena sometimes with equipment that they build themselves. Common targets of amateur astronomers include the Sun, the Moon, planets, stars, comets, meteor showers, and a variety of deep-sky objects such as star clusters, galaxies, and nebulae. Astronomy clubs are located throughout the world and many have programs to help their members set up and complete observational programs including those to observe all the objects in the Messier (110 objects) or Herschel 400 catalogues of points of interest in the night sky. One branch of amateur astronomy, amateur astrophotography, involves the taking of photos of the night sky. Many amateurs like to specialize in the observation of particular objects, types of objects, or types of events which interest them.[107][108]\n\nMost amateurs work at visible wavelengths, but a small minority experiment with wavelengths outside the visible spectrum. This includes the use of infrared filters on conventional telescopes, and also the use of radio telescopes. The pioneer of amateur radio astronomy was Karl Jansky, who started observing the sky at radio wavelengths in the 1930s. A number of amateur astronomers use either homemade telescopes or use radio telescopes which were originally built for astronomy research but which are now available to amateurs (e.g. the One-Mile Telescope).[109][110]\n\nAmateur astronomers continue to make scientific contributions to the field of astronomy and it is one of the few scientific disciplines where amateurs can still make significant contributions. Amateurs can make occultation measurements that are used to refine the orbits of minor planets. They can also discover comets, and perform regular observations of variable stars. Improvements in digital technology have allowed amateurs to make impressive advances in the field of astrophotography.[111][112][113]\n\n\nUnsolved problems in astronomy[edit]\n\nMain article: List of unsolved problems in astronomy\n\nAlthough the scientific discipline of astronomy has made tremendous strides in understanding the nature of the Universe and its contents, there remain some important unanswered questions. Answers to these may require the construction of new ground- and space-based instruments, and possibly new developments in theoretical and experimental physics.\n\n\n\tWhat is the origin of the stellar mass spectrum? That is, why do astronomers observe the same distribution of stellar masses—the initial mass function—apparently regardless of the initial conditions?[114] A deeper understanding of the formation of stars and planets is needed.\n\tIs there other life in the Universe? Especially, is there other intelligent life? If so, what is the explanation for the Fermi paradox? The existence of life elsewhere has important scientific and philosophical implications.[115][116] Is the Solar System normal or atypical?\n\tWhat is the nature of dark matter and dark energy? These dominate the evolution and fate of the cosmos, yet their true nature remains unknown.[117]\n\tWhat will be the ultimate fate of the universe?[118]\n\tHow did the first galaxies form?[119] How did supermassive black holes form?[120]\n\tWhat is creating the ultra-high-energy cosmic rays?[121]\n\tWhy is the abundance of lithium in the cosmos four times lower than predicted by the standard Big Bang model?[122]\n\tWhat really happens beyond the event horizon?[123]\n\n\nSee also[edit]\n\nMain articles: Outline of astronomy and Glossary of astronomy\n\n\t\t\tBook: Astronomy\n\n\n\n\n\n\tAirmass\n\tAstronomical acronyms\n\tAstronomical instruments\n\tCosmogony\n\tInternational Year of Astronomy\n\tList of astronomy acronyms\n\tList of Russian astronomers and astrophysicists\n\tOutline of space science\n\tScience tourism\n\tSpace exploration\n\tStarlight\n\tStellar collision\n\tUniverse: The Infinite Frontier (television series)\n\n\n\n\nReferences[edit]\n\n\n\t^ Unsöld, Albrecht; Baschek, Bodo (2001). Classical Astronomy and the Solar System – Introduction. p. 1.\n\n\t^ Unsöld, Albrecht; Baschek, Bodo (2001). Classical Astronomy and the Solar System. pp. 6–9.\n\n\n\t^ http://oaq.epn.edu.ec/  Official Web Site of one of the oldest Observatories in South America, the  Quito Astronomical Observatory\n\n\t^ Losev A., (2012), 'Astronomy' or 'astrology': a brief history of an apparent confusion, Journal of Astronomical History and Heritage, Vol. 15, No. 1, pp. 42–46 .\n\n\t^ Unsöld, Albrecht; Baschek, Bodo (2001). The New Cosmos: An Introduction to Astronomy and Astrophysics. Translated by Brewer, W.D. Berlin, New York: Springer. ISBN 978-3-540-67877-9.\n\n\n\t^ a b Scharringhausen, B. \"Curious About Astronomy: What is the difference between astronomy and astrophysics?\". Archived from the original on 9 June 2007. Retrieved 17 November 2016.\n\n\n\t^ a b Odenwald, Sten. \"Archive of Astronomy Questions and Answers: What is the difference between astronomy and astrophysics?\". astronomycafe.net. The Astronomy Cafe. Archived from the original on 8 July 2007. Retrieved 20 June 2007.\n\n\n\t^ a b \"Penn State Erie-School of Science-Astronomy and Astrophysics\". Archived from the original on 1 November 2007. Retrieved 20 June 2007.\n\n\n\t^ \"Merriam-Webster Online\". Results for \"astronomy\". Archived from the original on 17 June 2007. Retrieved 20 June 2007.\n\n\n\t^ \"Merriam-Webster Online\". Results for \"astrophysics\". Retrieved 20 June 2007.\n\n\n\t^ a b c Shu, F.H. (1983). The Physical Universe. Mill Valley, California: University Science Books. ISBN 978-0-935702-05-7.\n\n\n\t^ Forbes, 1909\n\n\t^ DeWitt, Richard (2010). \"The Ptolemaic System\". Worldviews: An Introduction to the History and Philosophy of Science. Chichester, England: Wiley. p. 113. ISBN 978-1-4051-9563-8.\n\n\n\t^ Aaboe, A. (1974). \"Scientific Astronomy in Antiquity\". Philosophical Transactions of the Royal Society. 276 (1257): 21–42. Bibcode:1974RSPTA.276...21A. doi:10.1098/rsta.1974.0007. JSTOR 74272.\n\n\n\t^ \"Eclipses and the Saros\". NASA. Archived from the original on 30 October 2007. Retrieved 28 October 2007.\n\n\n\t^ Krafft, Fritz (2009). \"Astronomy\".  In Cancik, Hubert; Schneider, Helmuth (eds.). Brill's New Pauly.\n\n\n\t^ Berrgren, J.L.; Nathan Sidoli (May 2007). \"Aristarchus's On the Sizes and Distances of the Sun and the Moon: Greek and Arabic Texts\". Archive for History of Exact Sciences. 61 (3): 213–54. doi:10.1007/s00407-006-0118-4.\n\n\n\t^ \"Hipparchus of Rhodes\". School of Mathematics and Statistics, University of St Andrews, Scotland. Archived from the original on 23 October 2007. Retrieved 28 October 2007.\n\n\n\t^ Thurston, H. (1996). Early Astronomy. Springer Science & Business Media. p. 2. ISBN 978-0-387-94822-5.\n\n\n\t^ Marchant, Jo (2006). \"In search of lost time\". Nature. 444 (7119): 534–38. Bibcode:2006Natur.444..534M. doi:10.1038/444534a. PMID 17136067.\n\n\n\t^ Hannam, James. God's philosophers: how the medieval world laid the foundations of modern science. Icon Books Ltd, 2009, 180\n\n\t^ Kennedy, Edward S. (1962). \"Review: The Observatory in Islam and Its Place in the General History of the Observatory by Aydin Sayili\". Isis. 53 (2): 237–39. doi:10.1086/349558.\n\n\n\t^ Micheau, Françoise.  Rashed, Roshdi; Morelon, Régis (eds.). \"The Scientific Institutions in the Medieval Near East\". Encyclopedia of the History of Arabic Science. 3: 992–93.\n\n\n\t^ Nas, Peter J (1993). Urban Symbolism. Brill Academic Publishers. p. 350. ISBN 978-90-04-09855-8.\n\n\n\t^ Kepple, George Robert; Glen W. Sanner (1998). The Night Sky Observer's Guide. 1. Willmann-Bell, Inc. p. 18. ISBN 978-0-943396-58-3.\n\n\n\t^ a b Berry, Arthur (1961). A Short History of Astronomy From Earliest Times Through the 19th Century. New York: Dover Publications, Inc. ISBN 978-0-486-20210-5.\n\n\n\t^ Hoskin, Michael, ed. (1999). The Cambridge Concise History of Astronomy. Cambridge University Press. ISBN 978-0-521-57600-0.\n\n\n\t^ McKissack, Pat; McKissack, Frederick (1995). The royal kingdoms of Ghana, Mali, and Songhay: life in medieval Africa. H. Holt. ISBN 978-0-8050-4259-7.\n\n\n\t^ Clark, Stuart; Carrington, Damian (2002). \"Eclipse brings claim of medieval African observatory\". New Scientist. Retrieved 3 February 2010.\n\n\n\t^ \"Cosmic Africa explores Africa's astronomy\". Science in Africa. Archived from the original on 3 December 2003. Retrieved 3 February 2002.\n\n\n\t^ Holbrook, Jarita C.; Medupe, R. Thebe; Urama, Johnson O. (2008). African Cultural Astronomy. Springer. ISBN 978-1-4020-6638-2.\n\n\n\t^ \"Africans studied astronomy in medieval times\". The Royal Society. 30 January 2006. Archived from the original on 9 June 2008. Retrieved 3 February 2010.\n\n\n\t^ Stenger, Richard \"Star sheds light on African 'Stonehenge'\". CNN. 5 December 2002. Archived from the original on 12 May 2011.\n. CNN. 5 December 2002. Retrieved on 30 December 2011.\n\n\t^ J.L. Heilbron, The Sun in the Church: Cathedrals as Solar Observatories (1999) p.3\n\n\t^ Forbes, 1909, pp. 49–58\n\n\t^ Forbes, 1909, pp. 58–64\n\n\t^ Chambers, Robert (1864) Chambers Book of Days\n\n\t^ Forbes, 1909, pp. 79–81\n\n\t^ Forbes, 1909, pp. 147–50\n\n\t^ Forbes, 1909, pp. 74–76\n\n\t^ Belkora, Leila (2003). Minding the heavens: the story of our discovery of the Milky Way. CRC Press. pp. 1–14. ISBN 978-0-7503-0730-7.\n\n\n\t^ Castelvecchi, Davide; Witze, Witze (11 February 2016). \"Einstein's gravitational waves found at last\". Nature News. doi:10.1038/nature.2016.19361. Retrieved 11 February 2016.\n\n\n\t^ B.P. Abbott (LIGO Scientific Collaboration and Virgo Collaboration) et al. (2016). \"Observation of Gravitational Waves from a Binary Black Hole Merger\". Physical Review Letters. 116 (6): 061102. arXiv:1602.03837. Bibcode:2016PhRvL.116f1102A. doi:10.1103/PhysRevLett.116.061102. PMID 26918975.CS1 maint: uses authors parameter (link)\n\n\n\t^ \"Electromagnetic Spectrum\". NASA. Archived from the original on 5 September 2006. Retrieved 17 November 2016.\n\n\n\t^ a b c d e f g h i j k l m n Cox, A.N., ed. (2000). Allen's Astrophysical Quantities. New York: Springer-Verlag. p. 124. ISBN 978-0-387-98746-0.\n\n\n\t^ \"In Search of Space\". Picture of the Week. European Southern Observatory. Retrieved 5 August 2014.\n\n\n\t^ \"Wide-field Infrared Survey Explorer Mission\". NASA University of California, Berkeley. 30 September 2014. Retrieved 17 November 2016.\n\n\n\t^ Majaess, D. (2013). Discovering protostars and their host clusters via WISE, ApSS, 344, 1 (VizieR catalog)\n\n\t^ Staff (11 September 2003). \"Why infrared astronomy is a hot topic\". ESA. Retrieved 11 August 2008.\n\n\n\t^ \"Infrared Spectroscopy – An Overview\". NASA California Institute of Technology. Archived from the original on 5 October 2008. Retrieved 11 August 2008.\n\n\n\t^ a b Moore, P. (1997). Philip's Atlas of the Universe. Great Britain: George Philis Limited. ISBN 978-0-540-07465-5.\n\n\n\t^ Penston, Margaret J. (14 August 2002). \"The electromagnetic spectrum\". Particle Physics and Astronomy Research Council. Archived from the original on 8 September 2012. Retrieved 17 November 2016.\n\n\n\t^ Gaisser, Thomas K. (1990). Cosmic Rays and Particle Physics. Cambridge University Press. pp. 1–2. ISBN 978-0-521-33931-5.\n\n\n\t^ Abbott, Benjamin P.;  et al. (LIGO Scientific Collaboration and Virgo Collaboration) (2016). \"Observation of Gravitational Waves from a Binary Black Hole Merger\". Phys. Rev. Lett. 116 (6): 061102. arXiv:1602.03837. Bibcode:2016PhRvL.116f1102A. doi:10.1103/PhysRevLett.116.061102. PMID 26918975.\n\n\n\t^ Tammann, G.A.; Thielemann, F.K.; Trautmann, D. (2003). \"Opening new windows in observing the Universe\". Europhysics News. Archived from the original on 6 September 2012. Retrieved 17 November 2016.\n\n\n\t^ LIGO Scientific Collaboration and Virgo Collaboration; Abbott, B.P.; Abbott, R.; Abbott, T.D.; Abernathy, M. R.; Acernese, F.; Ackley, K.; Adams, C.; Adams, T. (15 June 2016). \"GW151226: Observation of Gravitational Waves from a 22-Solar-Mass Binary Black Hole Coalescence\". Physical Review Letters. 116 (24): 241103. arXiv:1606.04855. Bibcode:2016PhRvL.116x1103A. doi:10.1103/PhysRevLett.116.241103. PMID 27367379.\n\n\n\t^ \"Planning for a bright tomorrow: Prospects for gravitational-wave astronomy with Advanced LIGO and Advanced Virgo\". LIGO Scientific Collaboration. Retrieved 31 December 2015.\n\n\n\t^ Xing, Zhizhong; Zhou, Shun (2011). Neutrinos in Particle Physics, Astronomy and Cosmology. Springer. p. 313. ISBN 978-3-642-17560-2.\n\n\n\t^ Calvert, James B. (28 March 2003). \"Celestial Mechanics\". University of Denver. Archived from the original on 7 September 2006. Retrieved 21 August 2006.\n\n\n\t^ \"Hall of Precision Astrometry\". University of Virginia Department of Astronomy. Archived from the original on 26 August 2006. Retrieved 17 November 2016.\n\n\n\t^ Wolszczan, A.; Frail, D. A. (1992). \"A planetary system around the millisecond pulsar PSR1257+12\". Nature. 355 (6356): 145–47. Bibcode:1992Natur.355..145W. doi:10.1038/355145a0.\n\n\n\t^ Roth, H. (1932). \"A Slowly Contracting or Expanding Fluid Sphere and its Stability\". Physical Review. 39 (3): 525–29. Bibcode:1932PhRv...39..525R. doi:10.1103/PhysRev.39.525.\n\n\n\t^ Eddington, A.S. (1926). Internal Constitution of the Stars. Cambridge University Press. ISBN 978-0-521-33708-3.\n\n\n\t^ \"Dark matter\". NASA. 2010. Archived from the original on 30 October 2009. Retrieved 2 November 2009. third paragraph, \"There is currently much ongoing research by scientists attempting to discover exactly what this dark matter is\"\n\n\n\t^ Keeler, James E. (November 1897), \"The Importance of Astrophysical Research and the Relation of Astrophysics to the Other Physical Sciences\", The Astrophysical Journal, 6 (4): 271–88, Bibcode:1897ApJ.....6..271K, doi:10.1086/140401, [Astrophysics] is closely allied on the one hand to astronomy, of which it may properly be classed as a branch, and on the other hand to chemistry and physics.… It seeks to ascertain the nature of the heavenly bodies, rather than their positions or motions in space—what they are, rather than where they are.… That which is perhaps most characteristic of astrophysics is the special prominence which it gives to the study of radiation.\n\n\n\t^ \"astrophysics\". Merriam-Webster, Incorporated. Archived from the original on 10 June 2011. Retrieved 22 May 2011.\n\n\n\t^ a b \"Focus Areas – NASA Science\". nasa.gov.\n\n\n\t^ \"astronomy\". Encyclopædia Britannica.\n\n\n\t^ \"Astrochemistry\". www.cfa.harvard.edu/. 15 July 2013. Archived from the original on 20 November 2016. Retrieved 20 November 2016.\n\n\n\t^ \"About Astrobiology\". NASA Astrobiology Institute. NASA. 21 January 2008. Archived from the original on 11 October 2008. Retrieved 20 October 2008.\n\n\n\t^ Mirriam Webster Dictionary entry \"Exobiology\" (accessed 11 April 2013)\n\n\t^ Ward, P.D.; Brownlee, D. (2004). The life and death of planet Earth. New York: Owl Books. ISBN 978-0-8050-7512-0.\n\n\n\t^ \"Origins of Life and Evolution of Biospheres\". Journal: Origins of Life and Evolution of Biospheres. Retrieved 6 April 2015.\n\n\n\t^ \"Release of the First Roadmap for European Astrobiology\". European Science Foundation. Astrobiology Web. 29 March 2016. Retrieved 2 April 2016.\n\n\n\t^ Corum, Jonathan (18 December 2015). \"Mapping Saturn's Moons\". The New York Times. Retrieved 18 December 2015.\n\n\n\t^ Cockell, Charles S. (4 October 2012). \"How the search for aliens can help sustain life on Earth\". CNN News. Retrieved 8 October 2012.\n\n\n\t^ \"Cosmic Detectives\". The European Space Agency (ESA). 2 April 2013. Retrieved 15 April 2013.\n\n\n\t^ a b c Dodelson, Scott (2003). Modern cosmology. Academic Press. pp. 1–22. ISBN 978-0-12-219141-1.\n\n\n\t^ Hinshaw, Gary (13 July 2006). \"Cosmology 101: The Study of the Universe\". NASA WMAP. Archived from the original on 13 August 2006. Retrieved 10 August 2006.\n\n\n\t^ Dodelson, 2003, pp. 216–61\n\n\t^ \"Galaxy Clusters and Large-Scale Structure\". University of Cambridge. Archived from the original on 10 October 2006. Retrieved 8 September 2006.\n\n\n\t^ Preuss, Paul. \"Dark Energy Fills the Cosmos\". U.S. Department of Energy, Berkeley Lab. Archived from the original on 11 August 2006. Retrieved 8 September 2006.\n\n\n\t^ Keel, Bill (1 August 2006). \"Galaxy Classification\". University of Alabama. Archived from the original on 1 September 2006. Retrieved 8 September 2006.\n\n\n\t^ \"Active Galaxies and Quasars\". NASA. Archived from the original on 31 August 2006. Retrieved 17 November 2016.\n\n\n\t^ Zeilik, Michael (2002). Astronomy: The Evolving Universe (8th ed.). Wiley. ISBN 978-0-521-80090-7.\n\n\n\t^ Ott, Thomas (24 August 2006). \"The Galactic Centre\". Max-Planck-Institut für extraterrestrische Physik. Archived from the original on 4 September 2006. Retrieved 17 November 2016.\n\n\n\t^ a b Smith, Michael David (2004). \"Cloud formation, Evolution and Destruction\". The Origin of Stars. Imperial College Press. pp. 53–86. ISBN 978-1-86094-501-4.\n\n\n\t^ Smith, Michael David (2004). \"Massive stars\". The Origin of Stars. Imperial College Press. pp. 185–99. ISBN 978-1-86094-501-4.\n\n\n\t^ Van den Bergh, Sidney (1999). \"The Early History of Dark Matter\". Publications of the Astronomical Society of the Pacific. 111 (760): 657–60. arXiv:astro-ph/9904251. Bibcode:1999PASP..111..657V. doi:10.1086/316369.\n\n\n\t^ a b Harpaz, 1994, pp. 7–18\n\n\t^ Harpaz, 1994\n\n\t^ Harpaz, 1994, pp. 173–78\n\n\t^ Harpaz, 1994, pp. 111–18\n\n\t^ Audouze, Jean; Israel, Guy, eds. (1994). The Cambridge Atlas of Astronomy (3rd ed.). Cambridge University Press. ISBN 978-0-521-43438-6.\n\n\n\t^ Harpaz, 1994, pp. 189–210\n\n\t^ Harpaz, 1994, pp. 245–56\n\n\t^ a b Johansson, Sverker (27 July 2003). \"The Solar FAQ\". Talk.Origins Archive. Archived from the original on 7 September 2006. Retrieved 11 August 2006.\n\n\n\t^ Lerner, K. Lee; Lerner, Brenda Wilmoth (2006). \"Environmental issues : essential primary sources\". Thomson Gale. Archived from the original on 10 July 2012. Retrieved 17 November 2016.\n\n\n\t^ Pogge, Richard W. (1997). \"The Once & Future Sun\". New Vistas in Astronomy. Archived from the original (lecture notes) on 27 May 2005. Retrieved 3 February 2010.\n\n\n\t^ Stern, D.P.; Peredo, M. (28 September 2004). \"The Exploration of the Earth's Magnetosphere\". NASA. Archived from the original on 24 August 2006. Retrieved 22 August 2006.\n\n\n\t^ Bell III, J. F.; Campbell, B.A.; Robinson, M.S. (2004). Remote Sensing for the Earth Sciences: Manual of Remote Sensing (3rd ed.). John Wiley & Sons. Archived from the original on 11 August 2006. Retrieved 17 November 2016.\n\n\n\t^ Grayzeck, E.; Williams, D.R. (11 May 2006). \"Lunar and Planetary Science\". NASA. Archived from the original on 20 August 2006. Retrieved 21 August 2006.\n\n\n\t^ Montmerle, Thierry; Augereau, Jean-Charles; Chaussidon, Marc;  et al. (2006). \"Solar System Formation and Early Evolution: the First 100 Million Years\". Earth, Moon, and Planets. 98 (1–4): 39–95. Bibcode:2006EM&P...98...39M. doi:10.1007/s11038-006-9087-5.\n\n\n\t^ Montmerle, 2006, pp. 87–90\n\n\t^ Beatty, J.K.; Petersen, C.C.; Chaikin, A., eds. (1999). The New Solar System. Cambridge press. p. 70edition = 4th. ISBN 978-0-521-64587-4.\n\n\n\t^ Mims III, Forrest M. (1999). \"Amateur Science—Strong Tradition, Bright Future\". Science. 284 (5411): 55–56. Bibcode:1999Sci...284...55M. doi:10.1126/science.284.5411.55. Astronomy has traditionally been among the most fertile fields for serious amateurs [...]\n\n\n\t^ \"The American Meteor Society\". Archived from the original on 22 August 2006. Retrieved 24 August 2006.\n\n\n\t^ Lodriguss, Jerry. \"Catching the Light: Astrophotography\". Archived from the original on 1 September 2006. Retrieved 24 August 2006.\n\n\n\t^ Ghigo, F. (7 February 2006). \"Karl Jansky and the Discovery of Cosmic Radio Waves\". National Radio Astronomy Observatory. Archived from the original on 31 August 2006. Retrieved 24 August 2006.\n\n\n\t^ \"Cambridge Amateur Radio Astronomers\". Retrieved 24 August 2006.\n\n\n\t^ \"The International Occultation Timing Association\". Archived from the original on 21 August 2006. Retrieved 24 August 2006.\n\n\n\t^ \"Edgar Wilson Award\". IAU Central Bureau for Astronomical Telegrams. Archived from the original on 24 October 2010. Retrieved 24 October 2010.\n\n\n\t^ \"American Association of Variable Star Observers\". AAVSO. Archived from the original on 2 February 2010. Retrieved 3 February 2010.\n\n\n\t^ Kroupa, Pavel (2002). \"The Initial Mass Function of Stars: Evidence for Uniformity in Variable Systems\". Science. 295 (5552): 82–91. arXiv:astro-ph/0201098. Bibcode:2002Sci...295...82K. doi:10.1126/science.1067524. PMID 11778039.\n\n\n\t^ \"Rare Earth: Complex Life Elsewhere in the Universe?\". Astrobiology Magazine. 15 July 2002. Archived from the original on 28 June 2011. Retrieved 12 August 2006.\n\n\n\t^ Sagan, Carl. \"The Quest for Extraterrestrial Intelligence\". Cosmic Search Magazine. Archived from the original on 18 August 2006. Retrieved 12 August 2006.\n\n\n\t^ \"11 Physics Questions for the New Century\". Pacific Northwest National Laboratory. Archived from the original on 3 February 2006. Retrieved 12 August 2006.\n\n\n\t^ Hinshaw, Gary (15 December 2005). \"What is the Ultimate Fate of the Universe?\". NASA WMAP. Archived from the original on 29 May 2007. Retrieved 28 May 2007.\n\n\n\t^ \"FAQ – How did galaxies form?\". NASA. Archived from the original on 16 December 2015. Retrieved 28 July 2015.\n\n\n\t^ \"Supermassive Black Hole\". Swinburne University. Retrieved 28 July 2015.\n\n\n\t^ Hillas, A.M. (September 1984). \"The Origin of Ultra-High-Energy Cosmic Rays\". Annual Review of Astronomy and Astrophysics. 22: 425–44. Bibcode:1984ARA&A..22..425H. doi:10.1146/annurev.aa.22.090184.002233. This poses a challenge to these models, because [...]\n\n\n\t^ Howk, J. Christopher; Lehner, Nicolas; Fields, Brian D.; Mathews, Grant J. (6 September 2012). \"Observation of interstellar lithium in the low-metallicity Small Magellanic Cloud\". Nature. 489 (7414): 121–23. arXiv:1207.3081. Bibcode:2012Natur.489..121H. doi:10.1038/nature11407. PMID 22955622.\n\n\n\t^ Orwig, Jessica (15 December 2014). \"What Happens When You Enter A Black Hole?\". Business Insider International. Retrieved 17 November 2016.\n\n\n\n\n\n\nBibliography[edit]\n\n\tForbes, George (1909). History of Astronomy. London: Plain Label Books. ISBN 978-1-60303-159-2.\n\n\tHarpaz, Amos (1994). Stellar Evolution. A K Peters, Ltd. ISBN 978-1-56881-012-6.\n\n\tUnsöld, A.; Baschek, B. (2001). The New Cosmos: An Introduction to Astronomy and Astrophysics. Springer. ISBN 978-3-540-67877-9.\n\n\n\nExternal links[edit]\n\nAstronomyat Wikipedia's sister projects\n\tDefinitions from Wiktionary\n            \n\tMedia from Wikimedia Commons\n            \n\tNews from Wikinews\n            \n\tQuotations from Wikiquote\n            \n\tTexts from Wikisource\n            \n\tTextbooks from Wikibooks\n            \n\tTravel guide from Wikivoyage\n            \n\tResources from Wikiversity\n            \n\n\n\n\n\tNASA/IPAC Extragalactic Database (NED) (NED-Distances)\n\tInternational Year of Astronomy 2009 IYA2009 Main website\n\tCosmic Journey: A History of Scientific Cosmology from the American Institute of Physics\n\tSouthern Hemisphere Astronomy\n\tCelestia Motherlode Educational site for Astronomical journeys through space\n\tKroto, Harry, Astrophysical Chemistry Lecture Series.\n\tCore books and Core journals in Astronomy, from the Smithsonian/NASA Astrophysics Data System\n\tA Journey with Fred Hoyle by Wickramasinghe, Chandra.\n\tAstronomy books from the History of Science Collection at Linda Hall Library\n\n\n\t\tv\n\tt\n\te\n\n\nAstronomy\n\n\t\n\tOutline\n\tHistory\n\tTimeline\n\n\n\tAstronomer\n\tAstronomical symbols\n\tGlossary\n\n\n\n\n\tAstronomy by\t\n\tManner\t\n\tAmateur\n\tObservational\n\tSidewalk\n\n\n\n\n\tCelestial subject\t\n\tGalactic / Extragalactic\n\tLocal system\n\tSolar\n\n\n\n\n\n\n\tMethod\t\n\tRadio\n\tSubmillimetre\n\tInfrared (Far-infrared)\n\tVisible-light (optical)\n\tUltraviolet\n\tX-ray\n\tGamma-ray\n\n\n\tNeutrino\n\tCosmic rays\n\tGravitational radiation\n\tHigh-energy\n\tSpherical\n\tMulti-messenger\n\n\n\n\n\tCulture\t\n\tAustralian Aboriginal\n\tBabylonian\n\tChechen (Nakh)\n\tChinese\n\tEgyptian\n\tGreek\n\tHebrew\n\tIndian\n\tInuit\n\tMedieval Islamic\n\tSerbian\n\tfolk astronomy\n\n\n\tTibetan\n\n\n\n\n\n\n\n\tOptical\ntelescopes\t\n\tList\n\tCategory\n\tExtremely large telescope\n\n\n\tGran Telescopio Canarias\n\tHubble Space Telescope\n\tKeck Observatory\n\tLarge Binocular Telescope\n\tSouthern African Large Telescope\n\tVery Large Telescope\n\n\n\n\n\tRelated topics\t\n\tArchaeoastronomy\n\tAstrobiology\n\tAstrochemistry\n\tAstrophysics\n\tAstrology and astronomy\n\tAstrometry\n\tAstroparticle physics\n\tPhotometry\n\tPhysical cosmology\n\tList of astronomers\n\tFrench\n\tMuslim\n\tRussian\n\tWomen\n\n\n\n\n\n\n\tPortals\t\n\tAstronomy\n\tSolar System\n\tPhysics\n\tSpaceflight\n\tStars\n\n\n\n\n\t\n\t Category\n\t Commons\n\t Portal\n\t WikiProject\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nMajor subfields of astronomy\n\n\t\n\tAstrobiology\n\tAstrochemistry\n\tAstrometry\n\tastrophysics\n\tCosmochemistry\n\tCosmology\n\tExtragalactic astronomy\n\tGalactic astronomy\n\tOrbital mechanics\n\tPhysical cosmology\n\tPlanetary geology\n\tPlanetary science\n\tSolar astronomy\n\tStellar astronomy\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNatural science\n\n\t\n\tPhysical science\n\tSpace science\n\tEarth science\n\tLife sciences\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nThe Solar System\n\n\t\n\n\tThe Sun\n\tMercury\n\tVenus\n\tEarth\n\tMars\n\tCeres\n\tJupiter\n\tSaturn\n\tUranus\n\tNeptune\n\tPluto\n\tHaumea\n\tMakemake\n\tEris\n\n\n\n\t\t\n\n\tPlanets\t\n\tTerrestrial planets\n\tMercury\n\tVenus\n\tEarth\n\tMars\n\n\n\n\n\tGiant planets\n\tJupiter\n\tSaturn\n\tUranus\n\tNeptune\n\n\n\n\n\tDwarf planets\n\tCeres\n\tPluto\n\tHaumea\n\tMakemake\n\tEris\n\n\n\n\n\n\n\tRings\t\n\tJovian\n\tSaturnian (Rhean)\n\tCharikloan\n\tChironean\n\tUranian\n\tNeptunian\n\tHaumean\n\n\n\n\n\tMoons\t\n\tTerrestrial\n\tMoon\n\tother near-Earth objects\n\n\n\tMartian\n\tPhobos\n\tDeimos\n\n\n\tJovian\n\tGanymede\n\tCallisto\n\tIo\n\tEuropa\n\tall 79\n\n\n\tSaturnian\n\tTitan\n\tRhea\n\tIapetus\n\tDione\n\tTethys\n\tEnceladus\n\tMimas\n\tHyperion\n\tPhoebe\n\tall 62\n\n\n\tUranian\n\tTitania\n\tOberon\n\tUmbriel\n\tAriel\n\tMiranda\n\tall 27\n\n\n\tNeptunian\n\tTriton\n\tProteus\n\tNereid\n\tall 14\n\n\n\tPlutonian\n\tCharon\n\tNix\n\tHydra\n\tKerberos\n\tStyx\n\n\n\tEridian\n\tDysnomia\n\n\n\tHaumean\n\tHiʻiaka\n\tNamaka\n\n\n\tMakemakean\n\tS/2015 (136472) 1\n\n\n\n\n\n\n\tExploration \n (outline)\t\n\tColonization\n\tDiscovery\n\tastronomy\n\ttimeline\n\n\n\tHuman spaceflight\n\tspace stations\n\tlist\n\n\n\tSpace probes\n\ttimeline\n\tlist\n\n\n\n\n\tMercury\n\tVenus\n\tMoon\n\tmining\n\n\n\tMars\n\tCeres\n\tAsteroids\n\tmining\n\n\n\tComets\n\tJupiter\n\tSaturn\n\tUranus\n\tNeptune\n\tPluto\n\tDeep space\n\n\n\n\n\tHypothetical\nobjects\t\n\tFifth giant\n\tNemesis\n\tPhaeton\n\tPlanet Nine\n\tPlanet V\n\tPlanet X\n\tTheia\n\tTyche\n\tVulcan\n\tVulcanoids\n\tSubsatellites\n\n\n\n\n\tLists\t\n\tComets\n\tDwarf planets (possible)\n\tGravitationally rounded objects\n\tMinor planets\n\tnames\n\n\n\tNatural satellites\n\tSolar System models\n\tSolar System objects\n\tby size\n\tby discovery date\n\n\n\n\n\n\n\n\n\n\t\n\n\tSmall Solar\nSystem bodies\t\n\tComets\n\tDamocloids\n\tMeteoroids\n\tMinor planets\n\tmoons\n\n\n\tPlanetesimal\n\n\n\tMercury-crossers\n\tVenus-crossers\n\tVenus trojans\n\tNear-Earth objects\n\tEarth-crossers\n\tEarth trojans\n\tMars-crossers\n\tMars trojans\n\n\n\tAsteroid belt\n\tAsteroids\n\tCeres\n\tPallas\n\tJuno\n\tVesta\n\tfirst 1000\n\tfamilies\n\texceptional\n\n\n\tKirkwood gap\n\tMain-belt comets\n\n\n\tJupiter-crossers\n\tJupiter trojans\n\tCentaurs\n\tSaturn-crossers\n\tUranus-crossers\n\tUranus trojans\n\tNeptune-crossers\n\tNeptune trojans\n\tCis-Neptunian objects\n\tTrans-Neptunian objects\n\n\n\tPlutoids\n\tKuiper belt\n\tCubewanos\n\tPlutinos\n\n\n\tDetached objects\n\tHills cloud\n\tOort cloud\n\tScattered disc\n\tSednoids\n\n\n\n\n\tFormation\nand evolution\t\n\tAccretion\n\tAccretion disk\n\tAsteroid belt\n\tCircumplanetary disk\n\tCircumstellar disc\n\tCircumstellar envelope\n\tCosmic dust\n\tDebris disk\n\tDetached object\n\tDisrupted planet\n\tExcretion disk\n\tExoplanetary Circumstellar Environments and Disk Explorer\n\tExozodiacal dust\n\tExtraterrestrial materials\n\tExtraterrestrial sample curation\n\tGiant-impact hypothesis\n\tGravitational collapse\n\tHills cloud\n\tInterplanetary dust cloud\n\tInterplanetary medium\n\tInterplanetary space\n\tInterstellar cloud\n\tInterstellar dust\n\tInterstellar medium\n\tInterstellar space\n\tKuiper belt\n\tList of interstellar and circumstellar molecules\n\tMerging stars\n\tMolecular cloud\n\tNebular hypothesis\n\tOort cloud\n\tOuter space\n\tPlanetary migration\n\tPlanetary system\n\tPlanetesimal\n\tPlanet formation\n\tProtoplanetary disk\n\tRing system\n\tRubble pile\n\tSample-return mission\n\tScattered disc\n\tStar formation\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tOutline of the Solar System\n\t Solar System portal\n\t Astronomy portal\n\t Earth Sciences portal\n\n\nSolar System →  Local Interstellar Cloud →  Local Bubble →  Gould Belt →  Orion Arm → Milky Way →  Milky Way subgroup → Local Group →  Local Sheet →  Virgo Supercluster →  Laniakea Supercluster →  Observable universe →  Universe\nEach arrow (→) may be read as \"within\" or \"part of\".\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nGlossaries of science and engineering\n\n\t\n\tAerospace engineering\n\tArchaeology\n\tArchitecture\n\tArtificial intelligence\n\tAstronomy\n\tBiology\n\tBotany\n\tCalculus\n\tChemistry\n\tCivil engineering\n\tClinical research\n\tComputer science\n\tEcology\n\tEconomics\n\tElectrical and electronics engineering\n\tEngineering\n\tEntomology\n\tEnvironmental science\n\tGenetics\n\tGeography\n\tGeology\n\tMachine vision\n\tMathematics\n\tMechanical engineering\n\tMedicine\n\tMeteorology\n\tPhysics\n\tProbability and statistics\n\tPsychiatry\n\tRobotics\n\tSpeciation\n\tStructural engineering\n\n\n\n\n\n\n\n\tAstronomy portal\n\tSpace portal\n\n\n\n\tAuthority control \t\n\tGND: 4003311-9\n\tHDS: 8255\n\tLCCN: sh85009003\n\tNARA: 10637421\n\tNDL: 00572840\n\tNKC: ph114088\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Astronomy&oldid=916396469\"\n\n\t\t\n\t\tCategories: \tAstronomy\n\tPhysical sciences\n\n\nHidden categories: \tCS1 maint: uses authors parameter\n\tWikipedia indefinitely move-protected pages\n\tArticles with short description\n\tGood articles\n\tArticles containing Greek-language text\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from March 2018\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with HDS identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NARA identifiers\n\tWikipedia articles with NDL identifiers\n\tWikipedia articles with NKC identifiers\n\tUse dmy dates from April 2019\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\tWikibooks\n\tWikinews\n\tWikiquote\n\tWikiversity\n\tWikivoyage\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tአማርኛ\n\tÆnglisc\n\tالعربية\n\tAragonés\n\tܐܪܡܝܐ\n\tArmãneashti\n\tArpetan\n\tঅসমীয়া\n\tAsturianu\n\tAvañe'ẽ\n\tАвар\n\tAymar aru\n\tAzərbaycanca\n\tتۆرکجه\n\tBamanankan\n\tবাংলা\n\tBanjar\n\tBân-lâm-gú\n\tBasa Banyumasan\n\tБашҡортса\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tभोजपुरी\n\tBislama\n\tБългарски\n\tBoarisch\n\tBosanski\n\tBrezhoneg\n\tБуряад\n\tCatalà\n\tЧӑвашла\n\tCebuano\n\tČeština\n\tChiShona\n\tCorsu\n\tCymraeg\n\tDansk\n\tDeutsch\n\tދިވެހިބަސް\n\tDolnoserbski\n\tEesti\n\tΕλληνικά\n\tEmiliàn e rumagnòl\n\tEspañol\n\tEsperanto\n\tEstremeñu\n\tEuskara\n\tفارسی\n\tFiji Hindi\n\tFøroyskt\n\tFrançais\n\tFrysk\n\tFurlan\n\tGaeilge\n\tGaelg\n\tGàidhlig\n\tGalego\n\t贛語\n\tગુજરાતી\n\t客家語/Hak-kâ-ngî\n\t한국어\n\tHawaiʻi\n\tՀայերեն\n\tԱրեւմտահայերէն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tIlokano\n\tBahasa Indonesia\n\tInterlingua\n\tInterlingue\n\tᐃᓄᒃᑎᑐᑦ/inuktitut\n\tИрон\n\tIsiXhosa\n\tÍslenska\n\tItaliano\n\tעברית\n\tJawa\n\tKalaallisut\n\tಕನ್ನಡ\n\tKapampangan\n\tКъарачай-малкъар\n\tქართული\n\tKaszëbsczi\n\tҚазақша\n\tKernowek\n\tKiswahili\n\tKreyòl ayisyen\n\tKurdî\n\tКыргызча\n\tLadino\n\tЛакку\n\tລາວ\n\tLatina\n\tLatviešu\n\tLëtzebuergesch\n\tЛезги\n\tLietuvių\n\tLigure\n\tLimburgs\n\tLingála\n\tLingua Franca Nova\n\tLivvinkarjala\n\tLa .lojban.\n\tLuganda\n\tLumbaart\n\tMagyar\n\tМакедонски\n\tMalagasy\n\tമലയാളം\n\tMalti\n\tमराठी\n\tმარგალური\n\tمصرى\n\tBahasa Melayu\n\tMinangkabau\n\tMìng-dĕ̤ng-ngṳ̄\n\tMirandés\n\tМонгол\n\tမြန်မာဘာသာ\n\tNāhuatl\n\tNederlands\n\tNedersaksies\n\tनेपाली\n\tनेपाल भाषा\n\t日本語\n\tNapulitano\n\tНохчийн\n\tNordfriisk\n\tNorfuk / Pitkern\n\tNorsk\n\tNorsk nynorsk\n\tNouormand\n\tNovial\n\tOccitan\n\tОлык марий\n\tOromoo\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tپښتو\n\tPatois\n\tភាសាខ្មែរ\n\tPicard\n\tPiemontèis\n\tTok Pisin\n\tPlattdüütsch\n\tPolski\n\tPortuguês\n\tQaraqalpaqsha\n\tRomână\n\tRomani čhib\n\tRumantsch\n\tRuna Simi\n\tРусиньскый\n\tРусский\n\tСаха тыла\n\tGagana Samoa\n\tसंस्कृतम्\n\tSängö\n\tSardu\n\tScots\n\tSeeltersk\n\tSesotho sa Leboa\n\tShqip\n\tSicilianu\n\tසිංහල\n\tSimple English\n\tسنڌي\n\tSlovenčina\n\tSlovenščina\n\tŚlůnski\n\tSoomaaliga\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tTaqbaylit\n\tТатарча/tatarça\n\tతెలుగు\n\tTetun\n\tไทย\n\tትግርኛ\n\tТоҷикӣ\n\tತುಳು\n\tTürkçe\n\tTürkmençe\n\tThuɔŋjäŋ\n\tУкраїнська\n\tاردو\n\tئۇيغۇرچە / Uyghurche\n\tVahcuengh\n\tVèneto\n\tTiếng Việt\n\tVolapük\n\tVõro\n\tWalon\n\t文言\n\tWest-Vlams\n\tWinaray\n\tWolof\n\t吴语\n\tXitsonga\n\tייִדיש\n\tYorùbá\n\t粵語\n\tZazaki\n\tZeêuws\n\tŽemaitėška\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 18 September 2019, at 18:10 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "16", "dc:title": "Astronomy - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Crab_Nebula.jpg/1200px-Crab_Nebula.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-astronomy", "title": "Astronomy - Wikipedia"}}