{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAttitude change - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tAttitude change\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tAttitudes are associated beliefs and behaviors towards some object.[1] They are not stable, and because of the communication and behavior of other people, are subject to change by social influences, as well as by the individual's motivation to maintain cognitive consistency when cognitive dissonance occurs—when two attitudes or attitude and behavior conflict. Attitudes and attitude objects are functions of affective and cognitive components. It has been suggested that the inter-structural composition of an associative network can be altered by the activation of a single node. Thus, by activating an affective or emotional node, attitude change may be possible, though affective and cognitive components tend to be intertwined.[2]\n\n\nContents\n\n\n\t1 Bases\n\t1.1 Compliance\n\t1.2 Identification\n\t1.3 Internalization\n\n\n\n\t2 Emotion-based\n\t3 Dual models: depth of processing\n\t3.1 Heuristic-systematic model of information processing\n\t3.1.1 Systematic processing\n\t3.1.2 Heuristic processing\n\n\n\n\t3.2 Elaboration likelihood model\n\n\n\n\t4 Cognitive dissonance theory\n\t5 Sorts of studies\n\t5.1 Belief rationalization\n\t5.2 Comparative processing\n\n\n\n\t6 See also\n\t7 References\n\n\n\n\n\nBases[edit]\n\nThere are three bases for attitude change:  compliance, identification, and internalization. These three processes represent the different levels of attitude change.[3]\n\n\nCompliance[edit]\n\n  \nOne of the pairs of cards used in the experiment. The card on the left has the reference line and the one on the right shows the three comparison lines.\n\n\n\nCompliance refers to a change in behavior based on consequences, such as an individual's hopes to gain rewards or avoid punishment from another group or person. The individual does not necessarily experience changes in beliefs or evaluations of an attitude object, but rather is influenced by the social outcomes of adopting a change in behavior.[3] \nThe individual is also often aware that he or she is being urged to respond in a certain way.\n\nCompliance was demonstrated through a series of laboratory experiments known as the Asch experiments. Experiments led by Solomon Asch of Swarthmore College asked groups of students to participate in a \"vision test\". In reality, all but one of the participants were confederates of the experimenter, and the study was really about how the remaining student would react to the confederates' behavior. Participants were asked to pick, out of three line options, the line that is the same length as a sample and were asked to give the answer out loud. Unbeknown to the participants, Asch had placed a number of confederates to deliberately give the wrong answer before the participant. The results showed that 75% of responses were in line with majority influence and were the same answers the confederates picked.[4] Variations in the experiments showed that compliance rates increased as the number of confederates increased, and the plateau was reached with around 15 confederates. The likelihood of compliance dropped with minority opposition, even if only one confederate gave the correct answer. The basis for compliance is founded on the fundamental idea that people want to be accurate and right.[5]\n\n\nIdentification[edit]\n\nIdentification explains one's change of beliefs and affect in order to be similar to someone one admires or likes. In this case, the individual adopts the new attitude, not due to the specific content of the attitude object, but because it is associated with the desired relationship. Often, children's attitudes on race, or their political party affiliations are adopted from their parents' attitudes and beliefs.[3]\n\n\nInternalization[edit]\n\nInternalization refers to the change in beliefs and affect when one finds the content of the attitude to be intrinsically rewarding, and thus leads to actual change in beliefs or evaluations of an attitude object. The new attitude or behavior is consistent with the individual's value system, and tends to be merged with the individual's existing values and beliefs. Therefore, behaviors adopted through internalization are due to the content of the attitude object.[3]\n\nThe expectancy-value theory is based on internalization of attitude change. This model states that the behavior towards some object is a function of an individual's intent, which is a function of one's overall attitude towards the action.\n\n\nEmotion-based[edit]\n\nEmotion plays a major role in persuasion, social influence, and attitude change. Much of attitude research has emphasised the importance of affective or emotion components.[6] Emotion works hand-in-hand with the cognitive process, or the way we think, about an issue or situation. Emotional appeals are commonly found in advertising, health campaigns and political messages. Recent examples include no-smoking health campaigns (see tobacco advertising) and political campaigns emphasizing the fear of terrorism. Attitude change based on emotions can be seen vividly in serial killers who are faced with major stress.[7] There is considerable empirical support for the idea that emotions in the form of fear arousal,[8][9] empathy,[10] or a positive mood[11] can enhance attitude change under certain conditions.[12]\n\nImportant factors that influence the impact of emotional appeals include self-efficacy, attitude accessibility, issue involvement, and message/source features. Attitudes that are central to one's being are highly resistant to change while others that are less fixed may change with new experiences or information. A new attitude (e.g. to time-keeping or absenteeism or quality) may challenge existing beliefs or norms so creating a feeling of psychological discomfort known as cognitive dissonance. It is difficult to measure attitude change since attitudes may only be inferred and there might be significant divergence between those publicly declared and privately held.  Self-efficacy is a perception of one's own human agency; in other words, it is the perception of our own ability to deal with a situation.[13] It is an important variable in emotional appeal messages because it dictates a person's ability to deal with both the emotion and the situation. For example, if a person is not self-efficacious about their ability to impact the global environment, they are not likely to change their attitude or behaviour about global warming.\n\nAffective forecasting, otherwise known as intuition or the prediction of emotion, also impacts attitude change. Research suggests that predicting emotions is an important component of decision making, in addition to the cognitive processes.[14] How we feel about an outcome may override purely cognitive rationales.\nIn terms of research methodology, the challenge for researchers is measuring emotion and subsequent impacts on attitude. Since we cannot see into the brain, various models and measurement tools have been constructed to obtain emotion and attitude information. Measures may include the use of physiological cues like facial expressions, vocal changes, and other body rate measures.[6] For instance, fear is associated with raised eyebrows, increased heart rate and increased body tension.[15] Other methods include concept or network mapping, and using primes or word cues.[16]\n\n\nDual models: depth of processing[edit]\n\nMany dual process models are used to explain the affective (emotional) and cognitive processing and interpretations of messages, as well as the different depths of attitude change. These include the heuristic-systematic model of information processing and the elaboration likelihood model.\n\n\nHeuristic-systematic model of information processing[edit]\n\nMain article: Heuristic-systematic model of information processing\n\nThe heuristic-systematic model of information processing describes two depths in the processing of attitude change, systematic processing and heuristic processing. In this model[17] information is either processed in a high-involvement and high-effort systematic way, or information is processed through shortcuts known as heuristics. For example, emotions are affect-based heuristics, in which feelings and gut-feeling reactions are often used as shortcuts.\n\n\nSystematic processing[edit]\n\nSystematic processing occurs when individuals are motivated and have high cognition to process a message.[18] Individuals using systematic processing are motivated to pay attention and have the cognitive ability to think deeply about a message; they are persuaded by the content of the message, such as the strength or logic of the argument. Motivation can be determined by many factors, such as how personally relevant the topic is, and cognitive ability can be determined by how knowledgeable an individual is on the message topic, or whether or not there is a distraction in the room. Individuals who receive a message through systematic processing usually internalize the message, resulting in a longer and more stable attitude change.\n\nAccording to the heuristic-systematic model of information processing, people are motivated to use systematic processing when they want to achieve a \"desired level of confidence\" in their judgments.[19] There are factors that have been found to increase the use of systematic processing; these factors are associated with either decreasing an individual's actual confidence or increasing an individual's perceived confidence. These factors may include framing persuasive messages in an unexpected manner;[20] self-relevancy of the message.\n\nSystematic processing has been shown to be beneficial in social influence settings. Systematic reasoning has been shown to be successful in producing more valid solutions during group discussions and greater solution accuracy. Shestowsky's (1998) research in dyad discussions revealed that the individual in the dyad who had high motivation and high need in cognition had the greater impact on group decisions.[21]\n\n\nHeuristic processing[edit]\n\nHeuristic processing occurs when individuals have low motivation and/or low cognitive ability to process a message.[18] Instead of focusing on the argument of the message, recipients using heuristic processing focus on more readily accessible information and other unrelated cues, such as the authority or attractiveness of the speaker. Individuals who process a message through heuristic processing do not internalize the message, and thus any attitude change resulting from the persuasive message is temporary and unstable.\n\nFor example, people are more likely to grant favors if reasons are provided. A study shows that when people said, \"Excuse me, I have five pages to xerox. May I use the copier?\" they received a positive response of 60%.  The statement, \"Excuse me, I have five pages to xerox. I am in a rush. May I use the copier?\" produced a 95% success rate.[22]\n\nHeuristic processing examples include social proof, reciprocity, authority, and liking.\n\n\n\tSocial proof is the means by which we utilize other people's behaviors in order to form our own beliefs. Our attitudes toward following the majority change when a situation appears uncertain or ambiguous to us, when the source is an expert, or when the source is similar to us. In a study conducted by Sherif, he discovered the power of crowds when he worked with experimenters who looked up in the middle of New York City. As the number of the precipitating group increased, the percentage of passers-by who looked up increased as well.[23]\n\tReciprocity is returning a favor. People are more likely to return a favor if they have a positive attitude towards the other party. Reciprocities also develop interdependence and societal bonds.\n\tAuthority  plays a role in attitude change in situations where there are superior-inferior relationships. We are more likely to become obedient to authorities when the authority's expertise is perceived as high and when we anticipate receiving rewards. A famous study that constitutes the difference in attitude change is the Milgram experiment,  where people changed their attitude to \"shocking their partner\" more when they followed authorities whereas the subjects themselves would have not done so otherwise.\n\tLiking has shown that if one likes another party, one is more inclined to carry out a favor. The attitude changes are based on whether an individual likes an idea or person, and if he or she does not like the other party, he/she may not carry out the favor or do so out of obligation. Liking can influence one's opinions through factors such as physical attractiveness, similarities, compliments, contact and cooperation.[24]\n\n\nElaboration likelihood model[edit]\n\nMain article: Elaboration likelihood model\n\nThe elaboration likelihood model is similar in concept to and shares many ideas with other dual processing models, such as the heuristic-systematic model of information processing.[25]  In the elaboration likelihood model, cognitive processing is the central route and affective/emotion processing is often associated with the peripheral route.[26] The central route pertains to an elaborate cognitive processing of information while the peripheral route relies on cues or feelings. The ELM suggests that true attitude change only happens through the central processing route that incorporates both cognitive and affective components as opposed to the more heuristics-based peripheral route. This suggests that motivation through emotion alone will not result in an attitude change.\n\n\nCognitive dissonance theory[edit]\n\nMain article: Cognitive dissonance\n\nCognitive dissonance, a theory originally developed by Festinger (1957), is the idea that people experience a sense of guilt or uneasiness when two linked cognitions are inconsistent, such as when there are two conflicting attitudes about a topic, or inconsistencies between one's attitude and behavior on a certain topic. The basic idea of the Cognitive Dissonance Theory relating to attitude change, is that people are motivated to reduce dissonance which can be achieved through changing their attitudes and beliefs.[27] Cooper & Fazio's (1984) have also added that cognitive dissonance does not arise from any simple cognitive inconsistency, but rather results from freely chosen behavior that may bring about negative consequences.[28] These negative consequences may be threats to the consistency, stability, predictability, competence, moral goodness of the self-concept,[29] or violation of general self-integrity.[30]\n\nResearch has suggested multiple routes that cognitive dissonance can be reduced. Self-affirmation has been shown to reduce dissonance,[30] however it is not always the mode of choice when trying to reduce dissonance. When multiple routes are available, it has been found that people prefer to reduce dissonance by directly altering their attitudes and behaviors rather than through self-affirmation.[31] People who have high levels of self-esteem, who are postulated to possess abilities to reduce dissonance by focusing on positive aspects of the self, have also been found to prefer modifying cognitions, such as attitudes and beliefs, over self-affirmation.[32] A simple example of cognitive dissonance resulting in attitude change would be when a heavy smoker learns that his sister died young from lung cancer due to heavy smoking as well, this individual experiences conflicting cognitions: the desire to smoke, and the knowledge that smoking could lead to death and a desire not to die. In order to reduce dissonance, this smoker could change his behavior (i.e. stop smoking), change his attitude about smoking (i.e. smoking is harmful), or retain his original attitude about smoking and modify his new cognition to be consistent with the first one--\"I also work out so smoking won't be harmful to me\". Thus, attitude change is achieved when individuals experience feelings of uneasiness or guilt due to cognitive dissonance, and actively reduce the dissonance through changing their attitude, beliefs, or behavior relating in order to achieve consistency with the inconsistent cognitions.\n\n\nSorts of studies[edit]\n\nCarl Hovland and his band of persuasion researchers learned a great deal during World War 2 and later at Yale about the process of attitude change.[33]\n\n\n\tHigh-credibility sources lead to more attitude change immediately following the communication act, but a sleeper effect occurs in which the source is forgotten after a period of time.\n\tMild fear appeals lead to more attitude change than strong fear appeals.Propagandists had often used fear appeals. Hoveland's evidence about the effect of such appeals suggested that a source should be cautious in using fear appeals, because strong fear messages may interfere with the intended persuasion attempt.\n\n\nBelief rationalization[edit]\n\nThe process of how people change their own attitudes has been studied for years. Belief rationalization has been recognized as an important aspect to understand this process.[34] The stability of people's past attitudes can be influenced if they hold beliefs that are inconsistent with their own behaviors. The influence of past behavior on current attitudes is stable when little information conflicts with the behavior. Alternatively, people's attitudes may lean more radically toward the prior behavior if the conflict makes it difficult to ignore, and forces them to rationalize their past behavior.[35] For example, if you believe that Greece is a beautiful country and that the people there are very hardworking, then your belief will be stable or even become reinforced when you visit the country and are amazed by its beauty. However, when you interact with local Greeks, you realize they are in actuality not as hard-working as you had imagined. This inconsistency becomes difficult to ignore once it stands out.\n\nAttitudes are often restructured at the time people are asked to report them.[36][37] As a result, inconsistencies between the information that enters into the reconstruction and the original attitudes can produce changes in prior attitudes, whereas consistency between these elements often elicits stability in prior attitudes. Individuals need to resolve the conflict between their own behaviors and the subsequent beliefs. However, people usually align themselves with their attitudes and beliefs instead of their behaviors. More importantly, this process of resolving people's cognitive conflicts that emerges cuts across both self-perception and dissonance even when the associated effect may only be strong in changing prior attitudes\n\n\nComparative processing[edit]\n\nHuman judgment is comparative in nature.[38] Departing from identifying people's need to justify their own beliefs in the context of their own behaviors, psychologists also believe that people have the need to carefully evaluate new messages on the basis of whether these messages support or contradict with prior messages, regardless of whether they can recall the prior messages after they reach a conclusion.[39] This comparative processing mechanism is built on \"information-integration theory\"[40] and \"social judgement theory\".[41] Both of these theories have served to model people's attitude change in judging the new information while they haven't adequately explained the influential factors that motivate people to integrate the information.\n\nMore recent work in the area of persuasion has further explored this \"comparative processing\" from the perspective of focusing on comparing between different sets of information on one single issue or object instead of simply making comparisons among different issues or objects.[42] As previous research demonstrated, analyzing information on one target product may trigger less impact of comparative information than comparing this product with the same product under competing brands.[43][44]\n\nWhen people compare different sets of information on one single issue or object, the effect of people's effort to compare new information with prior information seemed to correlate with the perceived strength of the new, strong information when considered jointly with the initial information. Comparison processes can be enhanced when prior evaluations, associated information, or both are accessible. People will simply construct a current judgment based on the new information or adjust the prior judgment when they are not able to retrieve the information from prior messages. The impact this comparative process can have on people's attitude change is mediated by changes in the strength of new information perceived by receivers. The effects of comparison on judgment change were mediated by changes in the perceived strength of the information. These findings above have wide range of applications in social marketing, political communication, and health promotion. For example, designing an advertisement that is counteractive against an existing attitude towards a behavior or policy is perhaps most effective if the advertisement uses the same format, characters, or music of ads associated with the initial attitudes.\n\n\nSee also[edit]\n\n\tAttitudinal fix\n\tFear appeals\n\tReactance (psychology)\n\tYale attitude change approach\n\n\nReferences[edit]\n\n\n\t^ McGuire, W., Lindzey, G., & Aronson, E. (1985). Attitudes and attitude change. Handbook of social psychology: Special fields and applications, 2, 233–346.\n\n\t^ Eagly, A., & Chaiken, S. (1995). Attitude strength, attitude structure and resistance to change. In R. Petty and J. Kosnik (Eds.), Attitude Strength. (pp. 413–432). Mahwah, NJ: Erlbaum.\n\n\t^ a b c d Kelman, H.C. (1938). Compliance, identification, and internalization: Three processes of attitude change. Journal of Conflict Resolution, 2(1), 51–60.\n\n\t^ Asch, S. E. (1956). Studies of independence and conformity: A minority of one against a unanimous majority. Psychological Monographs, 70 (Whole no. 416).\n\n\t^ Cialdini, Robert B.; Goldstein, Noah J. (2004). \"SOCIAL INFLUENCE: Compliance and Conformity\". Annu. Rev. Psychol. 55: 591–621. doi:10.1146/annurev.psych.55.090902.142015.\n\n\t^ a b Breckler, S. J., & Wiggins, E. C. (1992). On defining attitude and attitude theory: Once more with feeling. In A. R. Pratkanis, S. J. Breckler, & A. G. Greenwald (Eds.) Attitude Structure and Function (pp. 407–427). Hillsdale, NJ: Erlbaum.\n\n\t^ Davis, E. E. (1965). Attitude change: A review and bibliography of selected research. Paris: Unesco.\n\n\t^ Leventhal, 1970\n\n\t^ Maddux & Rogers, 1980\n\n\t^ Shelton & Rogers, 1981\n\n\t^ Janis, Kaye, & Kirschner, 1965\n\n\t^ Leventhal, H. A. (1970)Findings and theory in the study of fear communications.In L. Berkowitz (Ed.), Advances in experimental social psychology (Vol. 5, pp. 120-186). Orlando, FL: Academic Press.\n\n\t^ Bandura, A. (1982). \"Self-efficacy mechanism in human agency\". American Psychologist. 37: 122–147. doi:10.1037/0003-066x.37.2.122.\n\n\n\t^ Loewenstein, G. (2007). Affect regulation and affective forecasting. In Gross, J. J. (Ed.) Handbook of Emotion Regulation (pp. 180–203). New York: Guilford.\n\n\t^ Dillard, J. (1994). Rethinking the study of fear appeals: An emotional perspective. Communication Theory, 4, 295-323.\n\n\t^ Shavelson, R. J., & Stanton, G. C. (1975). Construct validation: Methodology and application to three measures of cognitive structure. Journal of Educational Measurement, 12, 67-85.\n\n\t^ Chaiken, S., Liberman, A. & Eagly, A. H. (1989). Heuristic and systematic information processing within and beyond the persuasion context. In J. S. Uleman & J. A. Bargh. (Eds.), Unintended thought, pp. 212-252. New York: Guilford.\n\n\t^ a b Chaiken, S. (1980). \"Heuristic Versus Systematic Information Processing and the Use of Source Versus Message Cues in Persuasion. Journal of\". Personality & Social Psychology. 39 (5): 752–766. doi:10.1037/0022-3514.39.5.752.\n\n\n\t^ Wood, Wendy (2000). \"Attitude Change: Persuasion and Social Influence\". Annu. Rev. Psychol. 51: 539–570. doi:10.1146/annurev.psych.51.1.539. PMID 10751980.\n\n\n\t^ Smith, SM; Petty, RE. (1996). \"Message framing and persuasion: a message processing analysis\". Pers. Soc. Psychol. Bull. 22: 257–68.\n\n\n\t^ Shestowsky, D; Wegener, DT; Fabrigar, LR. (1998). \"Need for cognition and interpersonal influence: individual differences in impact on dyadic decision\". J. Pers. Soc. Psychol. 74: 1317–28. doi:10.1037/0022-3514.74.5.1317.\n\n\n\t^ Langer, Blank, & Chanowitz (1978)\n\n\t^ Sherif (1936)\n\n\t^ Cialdini, R.B. (2008). Influence: Science and practice (5th edition). New York: Harper Collins.\n\n\n\t^ Albarracin, D., Johnson, B. T., & Zanna, M. P. (20050. Then handbook of attitudes. Mahwah, N.J: Lawrence Erlbaum Associates Publishers.\n\n\t^ Petty, Richard E.; Cacioppo, John T. (1986). \"The elaboration likelihood model of persuasion\" (PDF). Advances in Experimental Social Psychology. 19: 123–205.\n\n\n\t^ Festinger, L. (1957). A theory of cognitive dissonance. Stanford, CA: Stanford University Press.\n\n\t^ Cooper J, Fazio RH. 1984. A new look at dissonance theory. Adv. Exp. Soc. Psychol.17:229–66\n\n\t^ Aronson E. 1992. The return of the repressed:Dissonance theory makes a comeback. Psychol.Inq. 3:303–11\n\n\t^ a b Steele CM. 1988. The psychology of selfaffirmation.Adv. Exp. Soc. Psychol.21:261–302\n\n\t^ Stone J, Wiegand AW, Cooper J, Aronson E.1997. When exemplification fails: hypocrisy and the motive for self-integrity. J.Pers. Soc. Psychol. 72:54–65.\n\n\t^ Gibbons FX, Eggleston TJ, Benthin AC. 1997.Cognitive reactions to smoking relapse: the reciprocal relation between dissonance and self-esteem. J. Pers. Soc. Psychol. 72:184–95\n\n\t^ Rogers, Everett M:A history of communication study\n\n\t^ Albarracin, D., & McNatt, P. S. (2005). Maintenance and decay of past behavior influences: Anchoring attitudes on beliefs following inconsistent actions. Personality and Social Psychology Bulletin, 31, 719-733.\n\n\t^ Festinger, L. (1957). A theory of cognitive dissonance. Evanston, IL: Row, Peterson.\n\n\t^ Erber, M. W., Hodges, S. D., & Wilson, T. D. (1995). Attitude strength, attitude stability, and the effects of analyzing reasons. In R. E. Petty & J. A. Krosnick (Eds.), Attitude strength: Antecedents and consequences. Ohio State University series on attitudes and persuasion (Vol. 4, pp. 433-454. Hillsdale, NJ: Lawrence Erlbaum\n\n\t^ Judd, C. M., & Brauer, M. (1995). Repetition and evaluative extremity. In R. E. Petty & J. A. Krosnick (Eds.), Attitude strength: Antecedents and consequences. Ohio State University series on attitudes and persuasion (Vol. 4, pp. 43-71). Hillsdale, NJ: Lawrence Erlbaum.\n\n\t^ Mussweiler, T. (2003). Comparison processes in social judgment: mechanisms and consequences. Psychological Review, 110(3), 472\n\n\t^ Crano, W. D., & Prislin, R. (2006). Attitudes and persuasion. Annual Review of Psychology, 57, 345–374.\n\n\t^ Anderson, N. H. (1959). A test model of opinion change. Journal of Abnormal and Social Psychology, 59, 371–381.\n\n\t^ Sherif, M., & Hovland, C. I. (1961). Placement of items on controversial issues. In M. Sherif & C. Hovland (Eds.), Social judgment (pp. 99–126). New Haven, CT: Yale University Press.\n\n\t^ Albarracin, D., Wallace, H. M., Hart, W., & Brown, R. D. (2012). How judgments change following comparison of current and prior information. Basic and Applied Social Psychology, 34, 44-55\n\n\t^ Gentner, D., & Markman, A. B. (1997). Structural alignment in analogy and similarity. American Psychologist, 52, 45–56\n\n\t^ Muthukrishnan, A. V., Pham, M. T., & Mungale´, A. (2001). Does greater amount of information always bolster attitudinal resistance? Marketing Letters, 12, 131–144\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Attitude_change&oldid=862883037\"\n\n\t\t\n\t\tCategories: \tHuman behavior\n\tAttitude change\n\tPsychological attitude\n\tChildren's rights\n\tParenting\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\n\n\t\t\t\tAdd links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 7 October 2018, at 09:29 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Attitude change - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-attitude_change", "title": "Attitude change - Wikipedia"}}