{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBand gap - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tBand gap\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about solid state physics. For voltage control circuitry in electronics, see Bandgap voltage reference.\n\nThis article is about the electronic bandgap found in semiconductors. For the photonic band gap, see Photonic crystal.\n\n  \nShowing how electronic band structure comes about by the hypothetical example of a large number of carbon atoms being brought together to form a diamond crystal.  The graph (right) shows the energy levels as a function of the spacing between atoms. When the atoms are far apart (right side of graph) each atom has valence atomic orbitals p and s which have the same energy. However when the atoms come closer together their orbitals begin to overlap. Due to the Pauli Exclusion Principle each atomic orbital splits into N molecular orbitals each with a different energy, where N is the number of atoms in the crystal. Since N is such a large number, adjacent orbitals are extremely close together in energy  so the orbitals can be considered a continuous energy band. a is the atomic spacing in an actual crystal of diamond.  At that spacing the orbitals form two bands, called the valence and conduction bands, with a 5.5 eV band gap between them. Very few electrons have the energy to surmount this wide energy gap and become conduction electrons, so diamond is an insulator.\n\n\n\nIn solid-state physics, a band gap, also called an energy gap or bandgap, is an energy range in a solid where no electron states can exist. In graphs of the electronic band structure of solids, the band gap generally refers to the energy difference (in electron volts) between the top of the valence band and the bottom of the conduction band in insulators and semiconductors.  It is the energy required to promote a valence electron bound to an atom to become a conduction electron, which is free to move within the crystal lattice and serve as a charge carrier to conduct electric current.  It is closely related to the HOMO/LUMO gap in chemistry. If the valence band is completely full and the conduction band is completely empty, then electrons cannot move in the solid; however, if some electrons transfer from the valence to the conduction band, then current can flow (see carrier generation and recombination). Therefore, the band gap is a major factor determining the electrical conductivity of a solid. Substances with large band gaps are generally insulators, those with smaller band gaps are semiconductors, while conductors either have very small band gaps or none, because the valence and conduction bands overlap.\n\n\nContents\n\n\n\t1 In semiconductor physics\n\t1.1 Direct and indirect band gap\n\t1.2 Light Emitting Diodes and Laser Diodes\n\t1.3 Photovoltaic cells\n\t1.4 List of band gaps\n\n\n\n\t2 Optical versus electronic bandgap\n\t3 Band gaps for other quasi-particles\n\t4 Materials\n\t4.1 List of electronics topics\n\n\n\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nIn semiconductor physics[edit]\n\n  \nSemiconductor band structure.\n\n\n\nEvery solid has its own characteristic energy-band structure. This variation in band structure is responsible for the wide range of electrical characteristics observed in various materials.\nIn semiconductors and insulators, electrons are confined to a number of bands of energy, and forbidden from other regions. The term \"band gap\" refers to the energy difference between the top of the valence band and the bottom of the conduction band.  Electrons are able to jump from one band to another. However, in order for an electron to jump from a valence band to a conduction band, it requires a specific minimum amount of energy for the transition. The required energy differs with different materials. Electrons can gain enough energy to jump to the conduction band by absorbing either a phonon (heat) or a photon (light).\n\nA semiconductor is a material with an intermediate-sized but non-zero band gap that behaves as an insulator at absolute zero but allows thermal excitation of electrons into its conduction band at temperatures that are below its melting point. In contrast, a material with a large band gap is an insulator. In conductors, the valence and conduction bands may overlap, so they may not have a band gap.\n\nThe conductivity of intrinsic semiconductors is strongly dependent on the band gap. The only available charge carriers for conduction are the electrons that have enough thermal energy to be excited across the band gap and the electron holes that are left off when such an excitation occurs.\n\nBand-gap engineering is the process of controlling or altering the band gap of a material by controlling the composition of certain semiconductor alloys, such as GaAlAs, InGaAs, and InAlAs. It is also possible to construct layered materials with alternating compositions by techniques like molecular-beam epitaxy. These methods are exploited in the design of heterojunction bipolar transistors (HBTs), laser diodes and solar cells.\n\nThe distinction between semiconductors and insulators is a matter of convention. One approach is to think of semiconductors as a type of insulator with a narrow band gap. Insulators with a larger band gap, usually greater than 4 eV,[1] are not considered semiconductors and generally do not exhibit semiconductive behaviour under practical conditions. Electron mobility also plays a role in determining a material's informal classification.\n\nThe band-gap energy of semiconductors tends to decrease with increasing temperature. When temperature increases, the amplitude of atomic vibrations increase, leading to larger interatomic spacing. The interaction between the lattice phonons and the free electrons and holes will also affect the band gap to a smaller extent.[2] The relationship between band gap energy and temperature can be described by Varshni's empirical expression (named after Y. P. Varshni),\n\n\n\t\n  \n    \n      \n        \n          E\n          \n            g\n          \n        \n        (\n        T\n        )\n        =\n        \n          E\n          \n            g\n          \n        \n        (\n        0\n        )\n        −\n        \n          \n            \n              α\n              \n                T\n                \n                  2\n                \n              \n            \n            \n              T\n              +\n              β\n            \n          \n        \n      \n    \n    {\\displaystyle E_{g}(T)=E_{g}(0)-{\\frac {\\alpha T^{2}}{T+\\beta }}}\n  \n, where Eg(0), α and β are material constants.[3]\n\n\nIn a regular semiconductor crystal, the band gap is fixed owing to continuous energy states. In a quantum dot crystal, the band gap is size dependent and can be altered to produce a range of energies between the valence band and conduction band.[4] It is also known as quantum confinement effect.\n\nBand gaps also depend on pressure. Band gaps can be either direct or indirect, depending on the electronic band structure.\n\n\nDirect and indirect band gap[edit]\n\nMain article: Direct and indirect bandgaps\n\nBased on the band structures, materials have either direct band gap or indirect band gap. If the momentum of the lowest energy state in the conduction band and the highest energy state of the valence band of a material are the same, the material has a direct bandgap. If they are not the same, then the material has an indirect band gap. For materials with a direct band gap, valence electrons can be directly excited into the conduction band by a photon whose energy is larger than the bandgap. In contrast, for materials with an indirect band gap, a photon and phonon must both be involved in a transition from the valence band top to the conduction band bottom. Therefore, direct bandgap materials tend to have stronger light emission and absorption properties. Other things equal, direct bandgap materials tend to be better for photovoltaics (PVs), light-emitting diodes (LEDs), and laser diodes; however, indirect bandgap materials are frequently used in PVs and LEDs when the materials have other favorable properties.\n\n\nLight Emitting Diodes and Laser Diodes[edit]\n\nMain article: Light emitting diode\n\nLEDs and laser diodes usually emit photons with energy close to and slightly larger than the band gap of the semiconductor material from which they are made. Therefore, as the band gap energy increases, the LED or laser color changes from infrared to red, through the rainbow to violet, then to UV.[5]\n\n\nPhotovoltaic cells[edit]\n\nMain article: Solar cell\n\n  \nThe Shockley–Queisser limit gives the maximum possible efficiency of a single-junction solar cell under un-concentrated sunlight, as a function of the semiconductor band gap. If the band gap is too high, most daylight photons cannot be absorbed; if it is too low, then most photons have much more energy than necessary to excite electrons across the band gap, and  the rest is wasted. The semiconductors commonly used in commercial solar cells have band gaps near the peak of this curve, for example silicon (1.1eV) or CdTe (1.5eV). The Shockley–Queisser limit has been exceeded experimentally by combining materials with different band gap energies to make tandem solar cells.\n\n\n\nThe optical band gap (see below) determines what portion of the solar spectrum a photovoltaic cell absorbs.[6] A semiconductor will not absorb photons of energy less than the band gap; and the energy of the electron-hole pair produced by a photon is equal to the bandgap energy. A luminescent solar converter uses a luminescent medium to downconvert photons with energies above the band gap to photon energies closer to the band gap of the semiconductor comprising the solar cell.[7]\n\n\nList of band gaps[edit]\n\nBelow are band gap values for some selected materials. For a comprehensive list of band gaps in semiconductors, see List of semiconductor materials.\n\n\n\tGroup\tMaterial\tSymbol\tBand gap (eV) @ 302K\tReference\n\n\tIII-V\n\tAluminium nitride\n\tAlN\n\t6.0\n\t[8]\n\n\tIV\n\tDiamond\n\tC\n\t5.5\n\t[9]\n\n\tIV\n\tSilicon\n\tSi\n\t1.14\n\t[10]\n\n\tIV\n\tGermanium\n\tGe\n\t0.67\n\t[10]\n\n\tIII–V\n\tGallium nitride\n\tGaN\n\t3.4\n\t[10]\n\n\tIII–V\n\tGallium phosphide\n\tGaP\n\t2.26\n\t[10]\n\n\tIII–V\n\tGallium arsenide\n\tGaAs\n\t1.43\n\t[10]\n\n\tIV–V\n\tSilicon nitride\n\tSi3N4\n\t5\n\t\n\n\tIV–VI\n\tLead(II) sulfide\n\tPbS\n\t0.37\n\t[10]\n\n\tIV–VI\n\tSilicon dioxide\n\tSiO2\n\t9\n\t[11]\n\n\t\n\tCopper oxide\n\tCu2O\n\t2.1\n\t[12]\n\n\n\nOptical versus electronic bandgap[edit]\n\nIn materials with a large exciton binding energy, it is possible for a photon to have just barely enough energy to create an exciton (bound electron–hole pair), but not enough energy to separate the electron and hole (which are electrically attracted to each other). In this situation, there is a distinction between \"optical band gap\" and \"electrical band gap\" (or \"transport gap\"). The optical bandgap is the threshold for photons to be absorbed, while the transport gap is the threshold for creating an electron–hole pair that is not bound together. The optical bandgap is at lower energy than the transport gap.\n\nIn almost all inorganic semiconductors, such as silicon, gallium arsenide, etc., there is very little interaction between electrons and holes (very small exciton binding energy), and therefore the optical and electronic bandgap are essentially identical, and the distinction between them is ignored. However, in some systems, including organic semiconductors and single-walled carbon nanotubes, the distinction may be significant.\n\n\nBand gaps for other quasi-particles[edit]\n\nIn photonics, band gaps or stop bands are ranges of photon frequencies where, if tunneling effects are neglected, no photons can be transmitted through a material. A material exhibiting this behaviour is known as a photonic crystal. The concept of hyperuniformity[13] has broadened the range of photonic band gap materials, beyond photonic crystals. By applying the technique in supersymmetric quantum mechanics, a new class of optical disordered materials has been suggested,[14] which support band gaps perfectly equivalent to those of crystals or quasicrystals.\n\nSimilar physics applies to phonons in a phononic crystal [15].\n\n\nMaterials[edit]\n\n\n\tAluminium gallium arsenide\n\tBoron nitride\n\tIndium gallium arsenide\n\tIndium arsenide\n\tGallium arsenide\n\tGallium nitride\n\tGermanium\n\tMetallic hydrogen\n\n\n\n\nList of electronics topics[edit]\n\n\n\tElectronics\n\tBandgap voltage reference\n\tCondensed matter physics\n\tDirect and indirect bandgaps\n\tElectrical conduction\n\tElectron hole\n\tField-effect transistor\n\tLight-emitting diode\n\tPhotodiode\n\tPhotoresistor\n\tPhotovoltaics\n\tSolar cell\n\tSolid state physics\n\tSemiconductor\n\tSemiconductor devices\n\tStrongly correlated material\n\tValence band\n\n\n\n\nSee also[edit]\n\n\tWide bandgap semiconductors\n\tBand bending\n\tSpectral density\n\tPseudogap\n\n\nReferences[edit]\n\n\n\t^ Babu, V.Suresh (2010). Solid State Devices and Technology, 3rd Edition. Peason.\n\n\t^ Ünlü, Hilmi (September 1992). \"A thermodynamic model for determining pressure and temperature effects on the bandgap energies and other properties of some semiconductors\". Solid-State Electronics. 35 (9): 1343–1352. Bibcode:1992SSEle..35.1343U. doi:10.1016/0038-1101(92)90170-H.\n\n\n\t^ Varshni, Y.P. (January 1967). \"Temperature dependence of the energy gap in semiconductors\". Physica. 34 (1): 149–154. doi:10.1016/0031-8914(67)90062-6.\n\n\n\t^ “Evident Technologies”. Evidenttech.com. Retrieved on 2013-04-03.\n\n\t^ Dean, K J (August 1984). \"Waves and Fields in Optoelectronics: Prentice-Hall Series in Solid State Physical Electronics\". Physics Bulletin. 35 (8): 339–339. doi:10.1088/0031-9112/35/8/023.\n\n\n\t^ Nanoscale Material Design. Nrel.gov. Retrieved on 2013-04-03.\n\n\t^ Nanocrystalline luminescent solar converters, 2004\n\n\t^ Feneberg, Martin; Leute, Robert A. R.; Neuschl, Benjamin; Thonke, Klaus; Bickermann, Matthias (16 August 2010). \"High-excitation and high-resolution photoluminescence spectra of bulk AlN\". Physical Review B. 82 (7). Bibcode:2010PhRvB..82g5208F. doi:10.1103/PhysRevB.82.075208.\n\n\n\t^ Kittel, Charles. Introduction to Solid State Physics, 7th Edition. Wiley.\n\n\n\t^ a b c d e f Streetman, Ben G.; Sanjay Banerjee (2000). Solid State electronic Devices (5th ed.). New Jersey: Prentice Hall. p. 524. ISBN 0-13-025538-6.\n\n\n\t^ Vella, E.; Messina, F.; Cannas, M.; Boscaino, R. (2011). \"Unraveling exciton dynamics in amorphous silicon dioxide: Interpretation of the optical features from 8 to 11 eV\". Physical Review B. 83 (17): 174201. Bibcode:2011PhRvB..83q4201V. doi:10.1103/PhysRevB.83.174201.\n\n\n\t^ Baumeister, P.W. (1961). \"Optical Absorption of Cuprous Oxide\". Physical Review. 121 (2): 359. Bibcode:1961PhRv..121..359B. doi:10.1103/PhysRev.121.359.\n\n\n\t^ Xie, R.; Long, G. G.; Weigand, S. J.; Moss, S. C.; Carvalho, T.; Roorda, S.; Hejna, M.; Torquato, S.; Steinhardt, P. J. (29 July 2013). \"Hyperuniformity in amorphous silicon based on the measurement of the infinite-wavelength limit of the structure factor\". Proceedings of the National Academy of Sciences. 110 (33): 13250–13254. Bibcode:2013PNAS..11013250X. doi:10.1073/pnas.1220106110. PMC 3746861. PMID 23898166.\n\n\n\t^ Yu, Sunkyu; Piao, Xianji; Hong, Jiho; Park, Namkyoo (16 September 2015). \"Bloch-like waves in random-walk potentials based on supersymmetry\". Nature Communications. 6 (1). arXiv:1501.02591. Bibcode:2015NatCo...6E8269Y. doi:10.1038/ncomms9269. PMC 4595658. PMID 26373616.\n\n\n\t^ Eichenfield, Matt; Chan, Jasper; Camacho, Ryan M.; Vahala, Kerry J.; Painter, Oskar (2009). \"Optomechanical crystals\". Nature. 462 (7269): 78–82. arXiv:0906.1236. doi:10.1038/nature08524. ISSN 0028-0836.\n\n\n\n\n\nExternal links[edit]\n\n\tDirect Band Gap Energy Calculator\n\tMoriarty, Philip. \"Energy Gap (and what makes glass transparent?)\". Sixty Symbols. Brady Haran for the University of Nottingham.\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Band_gap&oldid=917088607\"\n\n\t\t\n\t\tCategories: \tElectron states\n\tElectronic band structures\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tDeutsch\n\tEesti\n\tEspañol\n\tEsperanto\n\tفارسی\n\tFrançais\n\t한국어\n\tहिन्दी\n\tItaliano\n\tעברית\n\tMagyar\n\tമലയാളം\n\tNederlands\n\t日本語\n\tPolski\n\tPortuguês\n\tРусский\n\tSimple English\n\tSlovenščina\n\tSvenska\n\tไทย\n\tУкраїнська\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 22 September 2019, at 06:07 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "Band gap - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Solid_state_electronic_band_structure.svg/1200px-Solid_state_electronic_band_structure.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-band_gap", "title": "Band gap - Wikipedia"}}