{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBandwidth (signal processing) - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tBandwidth (signal processing)\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about the concept in signal theory and processing measured in hertz. For use in computing and networking expressed in bits per second, see Bandwidth (computing). For other uses, see Bandwidth (disambiguation).\n\n  \nBaseband bandwidth. Here the bandwidth equals the upper frequency.\n\n\n\nBandwidth is the difference between the upper and lower frequencies in a continuous band of frequencies.  It is typically measured in hertz, and depending on context, may specifically refer to passband bandwidth or  baseband bandwidth. Passband bandwidth is the difference between the upper and lower cutoff frequencies of, for example, a band-pass filter, a communication channel, or a signal spectrum. Baseband bandwidth applies to a low-pass filter or baseband signal; the bandwidth is equal to its upper cutoff frequency.\n\nBandwidth in hertz is a central concept in many fields, including electronics, information theory, digital communications, radio communications, signal processing, and spectroscopy and is one of the determinants of the capacity of a given communication channel.\n\nA key characteristic of bandwidth is that any band of a given width can carry the same amount of information, regardless of where that band is located in the frequency spectrum.[note 1] For example, a 3 kHz band can carry a telephone conversation whether that band is at baseband (as in a POTS telephone line) or modulated to some higher frequency.\n\n\nContents\n\n\n\t1 Overview\n\t2 x dB bandwidth\n\t3 Antenna systems\n\t4 Photonics\n\t5 See also\n\t6 Notes\n\t7 References\n\n\n\n\n\nOverview[edit]\n\nBandwidth is a key concept in many telecommunications applications. In radio communications, for example, bandwidth is the frequency range occupied by a modulated carrier signal. An FM radio receiver's tuner spans a limited range of frequencies.  A government agency (such as the Federal Communications Commission in the United States) may apportion the regionally available bandwidth to broadcast license holders so that their signals do not mutually interfere. In this context, bandwidth is also known as channel spacing.\n\nFor other applications there are other definitions. One definition of bandwidth, for a system, could be the range of frequencies over which the system produces a specified level of performance.  A less strict and more practically useful definition will refer to the frequencies beyond which Performance is degraded. In the case of frequency response, degradation could, for example, mean more than 3 dB below the maximum value or it could mean below a certain absolute value. As with any definition of the width of a function, many definitions are suitable for different purposes.\n\nIn the context of, for example, the sampling theorem and Nyquist sampling rate, bandwidth typically refers to baseband bandwidth. In the context of Nyquist symbol rate or Shannon-Hartley channel capacity for communication systems it refers to passband bandwidth.\n\nThe Rayleigh bandwidth of a simple radar pulse is defined as the inverse of its duration.  For example, a one-microsecond pulse has a Rayleigh bandwidth of one megahertz.[1]\n\nThe essential bandwidth is defined as the portion of a signal spectrum in the frequency domain which contains most of the energy of the signal.[2]\n\n\nx dB bandwidth[edit]\n\n  \nThe magnitude response of a band-pass filter illustrating the concept of −3 dB bandwidth at a gain of approximately 0.707.\n\n\n\nIn some contexts, the signal bandwidth in hertz refers to the frequency range in which the signal's spectral density (in W/Hz or V2/Hz) is nonzero or above a small threshold value.  That definition is used in calculations of the lowest sampling rate that will satisfy the sampling theorem.  The threshold value is often defined relative to the maximum value, and is most commonly the 3 dB point, that is the point where the spectral density is half its maximum value (or the spectral amplitude, in V or V/Hz, is 70.7% of its maximum).[3]\n\nThe word bandwidth applies to signals as described above, but it could also apply to systems, for example filters or communication channels. To say that a system has a certain bandwidth means that the system can process signals of that bandwidth, or that the system reduces the bandwidth of a white noise input to that bandwidth.\n\nThe 3 dB bandwidth of an electronic filter or communication channel is the part of the system's frequency response that lies within 3 dB of the response at its peak, which in the passband filter case is typically at or near its center frequency, and in the low-pass filter is near 0 hertz. If the maximum gain is 0 dB, the 3 dB bandwidth is the frequency range where the gain is more than −3 dB, or the attenuation is less than 3 dB. This is also the range of frequencies where the amplitude gain is above 70.7% of the maximum amplitude gain, and the power gain is above half the maximum power gain. This same half-power gain convention is also used in spectral width, and more generally for extent of functions as full width at half maximum (FWHM).\n\nIn electronic filter design, a filter specification may require that within the filter passband, the gain is nominally 0 dB ± a small number of dB, for example within the ±1 dB interval. In the stopband(s), the required attenuation in dB is above a certain level, for example >100 dB. In a transition band the gain is not specified. In this case, the filter bandwidth corresponds to the passband width, which in this example is the 1 dB-bandwidth. If the filter shows amplitude ripple within the passband, the x dB point refers to the point where the gain is x dB below the nominal passband gain rather than x dB below the maximum gain.\n\nA commonly used quantity is fractional bandwidth.  This is the bandwidth of a device divided by its center frequency. E.g., a passband filter that has a bandwidth of 2 MHz with center frequency 10 MHz will have a fractional bandwidth of 2/10, or 20%.\n\nIn communication systems, in calculations of the Shannon–Hartley channel capacity, bandwidth refers to the 3 dB-bandwidth. In calculations of the maximum symbol rate, the Nyquist sampling rate, and maximum bit rate according to the Hartley formula, the bandwidth refers to the frequency range within which the gain is non-zero, or the gain in dB is below a very large value.\n\nThe fact that in equivalent baseband models of communication systems, the signal spectrum consists of both negative and positive frequencies, can lead to confusion about bandwidth, since they are sometimes referred to only by the positive half, and one will occasionally see expressions such as \n  \n    \n      \n        B\n        =\n        2\n        W\n      \n    \n    {\\displaystyle B=2W}\n  \n, where \n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n is the total bandwidth (i.e. the maximum passband bandwidth of the carrier-modulated RF signal and the minimum passband bandwidth of the physical passband channel), and \n  \n    \n      \n        W\n      \n    \n    {\\displaystyle W}\n  \n is the positive bandwidth (the baseband bandwidth of the equivalent channel model).  For instance, the baseband model of the signal would require a low-pass filter with cutoff frequency of at least \n  \n    \n      \n        W\n      \n    \n    {\\displaystyle W}\n  \n to stay intact, and the physical passband channel would require a passband filter of at least \n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n to stay intact.\n\nIn signal processing and control theory the bandwidth is the frequency at which the closed-loop system gain drops 3 dB below peak.\n\nIn basic electric circuit theory, when studying band-pass and band-reject filters, the bandwidth represents the distance between the two points in the frequency domain where the signal is \n  \n    \n      \n        \n          \n            1\n            \n              2\n            \n          \n        \n      \n    \n    {\\displaystyle {\\frac {1}{\\sqrt {2}}}}\n  \n of the maximum signal amplitude (half power).\n\n\nAntenna systems[edit]\n\nSee also: Antenna (radio) § Bandwidth, and Antenna measurement § Bandwidth\n\nIn the field of antennas, two different methods of expressing relative bandwidth are used for narrowband and wideband antennas.[4] For either, a set of criteria is established to define the extents of the bandwidth, such as input impedance, pattern, or polarization.\n\nPercent bandwidth, usually used for narrowband antennas, is used defined as \n  \n    \n      \n        %\n        B\n        =\n        100\n        ×\n        \n          \n            \n              \n                f\n                \n                  H\n                \n              \n              −\n              \n                f\n                \n                  L\n                \n              \n            \n            \n              f\n              \n                c\n              \n            \n          \n        \n        =\n        200\n        ×\n        \n          \n            \n              \n                f\n                \n                  H\n                \n              \n              −\n              \n                f\n                \n                  L\n                \n              \n            \n            \n              \n                f\n                \n                  H\n                \n              \n              +\n              \n                f\n                \n                  L\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle \\%B=100\\times {\\frac {f_{H}-f_{L}}{f_{c}}}=200\\times {\\frac {f_{H}-f_{L}}{f_{H}+f_{L}}}}\n  \n. The theoretical limit to percent bandwidth is 200%, which occurs for \n  \n    \n      \n        \n          f\n          \n            L\n          \n        \n        =\n        0\n      \n    \n    {\\displaystyle f_{L}=0}\n  \n.\n\nFractional bandwidth or ratio bandwidth, usually used for wideband antennas, is defined as \n  \n    \n      \n        B\n        =\n        \n          f\n          \n            H\n          \n        \n        \n          /\n        \n        \n          f\n          \n            L\n          \n        \n        ,\n      \n    \n    {\\displaystyle B=f_{H}/f_{L},}\n  \n and is typically presented in the form of \n  \n    \n      \n        B\n        :\n        1\n      \n    \n    {\\displaystyle B:1}\n  \n. Fractional bandwidth is used for wideband antennas because of the compression of the percent bandwidth that occurs mathematically with percent bandwidths above 100%, which corresponds to a fractional bandwidth of 3:1.\n\nIf \n  \n    \n      \n        %\n        B\n        =\n        200\n        ×\n        \n          \n            \n              \n                f\n                \n                  H\n                \n              \n              −\n              \n                f\n                \n                  L\n                \n              \n            \n            \n              \n                f\n                \n                  H\n                \n              \n              +\n              \n                f\n                \n                  L\n                \n              \n            \n          \n        \n        =\n        p\n      \n    \n    {\\displaystyle \\%B=200\\times {\\frac {f_{H}-f_{L}}{f_{H}+f_{L}}}=p}\n  \n\n\nthen \n  \n    \n      \n        B\n        =\n        \n          \n            \n              200\n              +\n              p\n            \n            \n              200\n              −\n              p\n            \n          \n        \n      \n    \n    {\\displaystyle B={\\frac {200+p}{200-p}}}\n  \n.\n\n\nPhotonics[edit]\n\nIn photonics, the term bandwidth occurs in a variety of meanings:\n\n\n\tthe bandwidth of the output of some light source, e.g., an ASE source or a laser; the bandwidth of ultrashort optical pulses can be particularly large\n\tthe width of the frequency range that can be transmitted by some element, e.g. an optical fiber\n\tthe gain bandwidth of an optical amplifier\n\tthe width of the range of some other phenomenon (e.g., a reflection, the phase matching of a nonlinear process, or some resonance)\n\tthe maximum modulation frequency (or range of modulation frequencies) of an optical modulator\n\tthe range of frequencies in which some measurement apparatus (e.g., a powermeter) can operate\n\tthe data rate (e.g., in Gbit/s) achieved in an optical communication system; see bandwidth (computing).\n\n\nA related concept is the spectral linewidth of the radiation emitted by excited atoms.\n\n\nSee also[edit]\n\n\tRise time\n\tBandwidth (Wiktionary entry)\n\tBandwidth efficiency\n\tBandwidth extension\n\tBroadband\n\tEssential bandwidth\n\n\nNotes[edit]\n\n\n\t^ Assuming equivalent noise level.\n\n\n\n\n\nReferences[edit]\n\n\n\t^ Jeffrey A. Nanzer, Microwave and Millimeter-wave Remote Sensing for Security Applications, pp. 268-269, Artech House, 2012 ISBN 1608071723.\n\n\t^ Sundararajan, D. (4 March 2009). A Practical Approach to Signals and Systems. John Wiley & Sons. p. 109. ISBN 978-0-470-82354-5.\n\n\n\t^ \nVan Valkenburg, M. E. Network Analysis (3rd ed.). pp. 383–384. ISBN 0-13-611095-9. Retrieved 2008-06-22.\n\n\n\t^ Stutzman, Warren L.; Theiele, Gary A. (1998). Antenna Theory and Design (2nd ed.). New York. ISBN 0-471-02590-9.\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4487890-4\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Bandwidth_(signal_processing)&oldid=919147661\"\n\n\t\t\n\t\tCategories: \tSignal processing\n\tTelecommunication theory\n\tFilter frequency response\n\n\nHidden categories: \tWikipedia articles with GND identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\t한국어\n\tहिन्दी\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tLatina\n\tLatviešu\n\tMagyar\n\tМакедонски\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tPolski\n\tPortuguês\n\tРусский\n\tSimple English\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tTürkçe\n\tУкраїнська\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 2 October 2019, at 02:44 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Bandwidth (signal processing) - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Baseband.svg/1200px-Baseband.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-bandwidth_-signal_processing", "title": "Bandwidth (signal processing) - Wikipedia"}}