{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLiquid rocket propellant - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tLiquid rocket propellant\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Bipropellant)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tMain article: Liquid-propellant rocket\n\nThe highest specific impulse chemical rockets use liquid propellants (liquid-propellant rockets). They can consist of a single chemical (a monopropellant) or a mix of two chemicals, called bipropellants. Bipropellants can further be divided into two categories; hypergolic propellants, which ignite when the fuel and oxidizer make contact, and non-hypergolic propellants which require an ignition source.[1]\n\nAbout 170 different propellants made of liquid fuel have been tested, excluding minor changes to a specific propellant such as propellant additives, corrosion inhibitors, or stabilizers. In the U.S. alone at least 25 different propellant combinations have been flown.[2] No completely new propellant has been used for nearly 30 years.[3]\n\nMany factors go into choosing a propellant for a liquid propellant rocket engine. The primary factors include ease of operation, cost, hazards/environment and performance.[citation needed] \n\n\nContents\n\n\n\t1 History\n\t1.1 Development in early 20th century\n\t1.2 World War II era\n\t1.3 1950s and 1960s\n\n\n\n\t2 Kerosene\n\t3 Hydrogen\n\t3.1 Upper stage use\n\t3.2 Comparison to kerosene\n\n\n\n\t4 Lithium and fluorine\n\t5 Methane\n\t6 Monopropellants\n\t7 Present use\n\t8 Table\n\t8.1 Definitions\n\t8.2 Bipropellants\n\t8.3 Monopropellants\n\n\n\n\t9 References\n\t10 External links\n\n\n\n\n\nHistory[edit]\n\nDevelopment in early 20th century[edit]\n\nKonstantin Tsiolkovsky proposed the use of liquid propellants in 1903, in his article Exploration of Outer Space by Means of Rocket Devices. [4][5]\n  \nRobert H. Goddard on March 16, 1926, holding the launching frame of his most notable invention — the first liquid-fueled rocket.\n\n\n\nOn March 16, 1926, Robert H. Goddard used liquid oxygen (LOX) and gasoline as rocket fuels for his first partially successful liquid-propellant rocket launch. Both propellants are readily available, cheap and highly energetic. Oxygen is a moderate cryogen as air will not liquefy against a liquid oxygen tank, so it is possible to store LOX briefly in a rocket without excessive insulation.\n\n\nWorld War II era[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (March 2017) (Learn how and when to remove this template message)\n\n\n\nGermany had very active rocket development before and during World War II, both for the strategic V-2 rocket and other missiles. The V-2 used an alcohol/LOX liquid propellant engine, with hydrogen peroxide to drive the fuel pumps.[6] The alcohol was mixed with water for engine cooling. Both Germany and the United States developed reusable liquid propellant rocket engines that used a storeable liquid oxidizer with much greater density than LOX and a liquid fuel that ignited spontaneously on contact with the high density oxidizer. The German engine was powered by hydrogen peroxide and a fuel mixture of hydrazine hydrate and methyl alcohol. The U.S. engine was powered by nitric acid oxidizer and aniline. Both engines were used to power aircraft, the Me 163 Komet interceptor in the case of the German engine and RATO units to assist take-off of aircraft in the case of the U.S. engine.\n\n\n1950s and 1960s[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (March 2017) (Learn how and when to remove this template message)\n\n\n\nDuring the 1950s and 1960s there was a great burst of activity by propellant chemists to find high-energy liquid and solid propellants better suited to the military. Large strategic missiles need to sit in land-based or submarine-based silos for many years, able to launch at a moment's notice. Propellants requiring continuous refrigeration, which cause their rockets to grow ever-thicker blankets of ice, were not practical. As the military was willing to handle and use hazardous materials, a great number of dangerous chemicals were brewed up in large batches, most of which wound up being deemed unsuitable for operational systems. \nIn the case of nitric acid, the acid itself (HNO\n3) was unstable, and corroded most metals, making it difficult to store. The addition of a modest amount of nitrogen tetroxide, N\n2O\n4, turned the mixture red and kept it from changing composition, but left the problem that nitric acid corrodes containers it is placed in, releasing gases that can build up pressure in the process. \nThe breakthrough was the addition of a little hydrogen fluoride (HF), which forms a self-sealing metal fluoride on the interior of tank walls that Inhibited Red Fuming Nitric Acid. This made \"IRFNA\" storeable. Propellant combinations based on IRFNA or pure N\n2O\n4 as oxidizer and kerosene or hypergolic (self igniting) aniline, hydrazine or unsymmetrical dimethylhydrazine (UDMH) as fuel were then adopted in the United States and the Soviet Union for use in strategic and tactical missiles. The self-igniting storeable liquid bi-propellants have somewhat lower specific impulse than LOX/kerosene but have higher density so a greater mass of propellant can be placed in the same sized tanks. Gasoline was replaced by different hydrocarbon fuels,[citation needed] for example RP-1 - a highly refined grade of kerosene. This combination is quite practical for rockets that need not be stored.\n\n\nKerosene[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (December 2017) (Learn how and when to remove this template message)\n\n\n\nThe V-2 rockets developed by Nazi Germany used LOX and ethyl alcohol. One of the main advantages of alcohol was its water content which provided cooling in larger rocket engines. Petroleum-based fuels offered more power than alcohol, but standard gasoline and kerosene left too much silt and combustion by-products that could clog engine plumbing. In addition they lacked the cooling properties of ethyl alcohol.\n\nDuring the early 1950s, the chemical industry in the US was assigned the task of formulating an improved petroleum-based rocket propellant which would not leave residue behind and also ensure that the engines would remain cool. The result was RP-1, the specifications of which were finalized by 1954. A highly refined form of jet fuel, RP-1 burned much more cleanly than conventional petroleum fuels and also posed less of a danger to ground personnel from explosive vapors. It became the propellant for most of the early American rockets and ballistic missiles such as the Atlas, Titan I, and Thor. The Soviets quickly adopted RP-1 for their R-7 missile, but the majority of Soviet launch vehicles ultimately used storable hypergolic propellants. As of 2017[update], it is used in the first stages of many orbital launchers.\n\n\nHydrogen[edit]\n\nMany early rocket theorists believed that hydrogen would be a marvelous propellant, since it gives the highest specific impulse. It is also considered the cleanest when oxidized with oxygen because the only by-product is water. Steam reforming of natural gas is the most common method of producing commercial bulk hydrogen at about 95% of the world production[7][8] of 500 billion m3 in 1998.[9] At high temperatures (700 – 1100 °C) and in the presence of a metal-based catalyst (nickel), steam reacts with methane to yield carbon monoxide and hydrogen.\n\nHydrogen in any state is very bulky; it is typically stored as a deeply cryogenic liquid, a technique mastered in the early 1950s as part of the hydrogen bomb development program at Los Alamos. Liquid hydrogen is stored and transported without boil-off, because helium, which has a lower boiling point than hydrogen, acts as cooling refrigerant. Only when hydrogen is loaded on a launch vehicle, where no refrigeration exists, it vents to the atmosphere.[10]\n\nIn the late 1950s and early 1960s it was adopted for hydrogen fueled stages such as Centaur and Saturn upper stages.[citation needed] Even as a liquid, hydrogen has low density, requiring large tanks and pumps, and the extreme cold requires tank insulation. This extra weight reduces the mass fraction of the stage or requires extraordinary measures such as pressure stabilization of the tanks to reduce weight. Pressure stabilized tanks support most of the loads with internal pressure rather than with solid structures.[citation needed]\n\nThe Soviet rocket program, in part due to a lack of technical capabilities, did not use LH\n2 as a propellant until the 1980s when it was used for the Energiya core stage.[citation needed]\n\n\nUpper stage use[edit]\n\nThe liquid rocket engine propellant combination of liquid oxygen and hydrogen offers the highest specific impulse of currently used conventional rockets. This extra performance largely offsets the disadvantage of low density. Low density of a propellant leads to larger fuel tanks. However, a small increase in specific impulse in an upper stage application can have a significant increase in payload to orbit capability.[3]\n\n\nComparison to kerosene[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (March 2017) (Learn how and when to remove this template message)\n\n\n\nLaunch pad fires due to spilled kerosene are more damaging than hydrogen fires, primarily for two reasons. First, kerosene burns about 20% hotter in absolute temperature than hydrogen. The second reason is its buoyancy. Since hydrogen is a deep cryogen it boils quickly and rises due to its very low density as a gas. Even when hydrogen burns, the gaseous H\n2O that is formed has a molecular weight of only 18 u compared to 29.9 u for air, so it rises quickly as well. Kerosene on the other hand falls to the ground and burns for hours when spilled in large quantities, unavoidably causing extensive heat damage that requires time consuming repairs and rebuilding. This is a lesson most frequently experienced by test stand crews involved with firings of large, unproven rocket engines. Hydrogen-fueled engines have special design requirements such as running propellant lines horizontally, so traps do not form in the lines and cause ruptures due to boiling in confined spaces. These considerations apply to all cryogens, such as liquid oxygen and liquid natural gas (LNG) as well. Use of liquid hydrogen fuel has an excellent safety record and superb performance that is well above that of all other practical chemical rocket propellants.\n\n\nLithium and fluorine[edit]\n\nThe highest specific impulse chemistry ever test-fired in a rocket engine was lithium and fluorine, with hydrogen added to improve the exhaust thermodynamics (all propellants had to be kept in their own tanks, making this a tripropellant). The combination delivered 542 s specific impulse in a vacuum, equivalent to an exhaust velocity of 5320 m/s. The impracticality of this chemistry highlights why exotic propellants are not actually used: to make all three components liquids, the hydrogen must be kept below –252 °C (just 21 K) and the lithium must be kept above 180 °C (453 K). Lithium and fluorine are both extremely corrosive, lithium ignites on contact with air, fluorine ignites on contact with most fuels, including hydrogen. Fluorine and the hydrogen fluoride (HF) in the exhaust are very toxic, which makes working around the launch pad difficult, damages the environment, and makes getting a launch license that much more difficult. Both lithium and fluorine are expensive compared to most rocket propellants. This combination has therefore never flown.[11]\n\nDuring the 1950s, the Department of Defense initially proposed lithium/fluorine as ballistic missile propellants. A 1954 accident at a chemical works where a cloud of fluorine was released into the atmosphere convinced them to instead use LOX/RP-1.\n\n\nMethane[edit]\n\nIn November 2012, SpaceX CEO Elon Musk announced plans to develop liquid methane/LOX rocket engines.[12] It had previously used only RP-1/LOX in SpaceX rocket engines. As of March 2014[update], SpaceX was developing the Raptor methalox bipropellant rocket engine, which by 2016 was predicted to generate 3,000 kN (670,000 lbf) of thrust.[13] The engine was slated to be used on a future super-heavy rocket, the MCT launch vehicle now designated the BFR.[14][15]\n\nIn July 2014, Firefly Space Systems announced their plans to use methane fuel for their small satellite launch vehicle, Firefly Alpha with an aerospike engine design.[16]\n\nIn September 2014, Blue Origin and United Launch Alliance announced the joint development of the BE-4 LOX/LNG engine. The BE-4 will provide 2,400 kN (550,000 lbf) of thrust.[17]\n\n\nMonopropellants[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (March 2017) (Learn how and when to remove this template message)\n\n\n\n\tHigh-test peroxide\n\tHigh test peroxide is concentrated Hydrogen peroxide, with around 2% to 30% water. It decomposes to steam and oxygen when passed over a catalyst. This was historically used for reaction control systems, due to being easily storable. It is often used to drive Turbopumps, being used on the V2 rocket, and modern Soyuz.\n\tHydrazine\n\tdecomposes energetically to nitrogen, hydrogen, and ammonia (2N2H4 → N2+H2+2NH3) and is the most widely used in space vehicles. (Non-oxidized ammonia decomposition is endothermic and would decrease performance).\n\tNitrous oxide\n\tdecomposes to nitrogen and oxygen.\n\tSteam\n\twhen externally heated gives a reasonably modest Isp of up to 190 seconds, depending on material corrosion and thermal limits.\n\n\nPresent use[edit]\n\nIsp in vacuum of various rockets\n\tRocket\n\tPropellants\n\tIsp, vacuum (s)\n\n\tSpace shuttle\nliquid engines\n\tLOX/LH2\n\t453[18]\n\n\tSpace shuttle\nsolid motors\n\tAPCP\n\t268[18]\n\n\tSpace shuttle\nOMS\n\tNTO/MMH\n\t313[18]\n\n\tSaturn V\nstage 1\n\tLOX/RP-1\n\t304[18]\n\n\n\nAs of 2018[update], liquid fuel combinations in common use:\n\n\n\tKerosene (RP-1) / Liquid Oxygen (LOX)\n\tUsed for the lower stages of the Soyuz boosters, and the first stage of the U.S. Saturn V, Atlas, and Falcon 9 boosters.  Very similar to Robert Goddard's first rocket.\n\tLiquid hydrogen (LH) / LOX\n\tUsed in the stages of the Space Shuttle, Space Launch System, Ariane 5, Delta IV, New Shepard, H-IIB, GSLV and Centaur.\n\tUnsymmetrical dimethylhydrazine (UDMH or MMH) / Dinitrogen tetroxide (NTO or N\n2O\n4)\n\tUsed in three first stages of the Russian Proton booster, Indian Vikas engine for PSLV and GSLV rockets, most Chinese boosters, a number of military, orbital and deep space rockets, as this fuel combination is hypergolic and storable for long periods at reasonable temperatures and pressures.\n\tHydrazine (N\n2H\n4)\n\tUsed in deep space missions because it is storable and hypergolic, and can be used as a monopropellant with a catalyst.\n\tAerozine-50 (50/50 hydrazine and UDMH)\n\tUsed in deep space missions because it is storable and hypergolic, and can be used as a monopropellant with a catalyst.\n\n\nTable[edit]\n\nTo approximate Isp at other chamber pressures[clarification needed]\n\tAbsolute pressure kPa; atm (psi)\n\tMultiply by\n\n\t6,895 kPa; 68.05 atm (1,000 psi)\n\t1.00\n\n\t6,205 kPa; 61.24 atm (900 psi)\n\t0.99\n\n\t5,516 kPa; 54.44 atm (800 psi)\n\t0.98\n\n\t4,826 kPa; 47.63 atm (700 psi)\n\t0.97\n\n\t4,137 kPa; 40.83 atm (600 psi)\n\t0.95\n\n\t3,447 kPa; 34.02 atm (500 psi)\n\t0.93\n\n\t2,758 kPa; 27.22 atm (400 psi)\n\t0.91\n\n\t2,068 kPa; 20.41 atm (300 psi)\n\t0.88\n\n\n\nThe table uses data from the JANAF thermochemical tables (Joint Army-Navy-NASA-Air Force (JANNAF) Interagency Propulsion Committee) throughout, with best-possible specific impulse calculated by Rocketdyne under the assumptions of adiabatic combustion, isentropic expansion, one-dimensional expansion and shifting equilibrium[19] Some units have been converted to metric, but pressures have not.\n\n\nDefinitions[edit]\n\n\tVe\n\tAverage exhaust velocity, m/s. The same measure as specific impulse in different units, numerically equal to specific impulse in N·s/kg.\n\tr\n\tMixture ratio: mass oxidizer / mass fuel\n\tTc\n\tChamber temperature, °C\n\td\n\tBulk density of fuel and oxidizer, g/cm³\n\tC*\n\tCharacteristic velocity, m/s. Equal to chamber pressure multiplied by throat area, divided by mass flow rate. Used to check experimental rocket's combustion efficiency.\n\n\nBipropellants[edit]\n\n\tOxidizer\n\tFuel\n\tComment\n\tOptimum expansion from\n68.05 atm to 1 atm[citation needed]\n\tExpansion from\n68.05 Atm to vacuum (0 atm)\n(Areanozzle = 40:1)[citation needed]\n\n\tVe\n\tr\n\tTc\n\td\n\tC*\n\tVe\n\tr\n\tTc\n\td\n\tC*\n\n\tLOX\n\tH\n2\n\tHydrolox. Common.\n\t3816\n\t4.13\n\t2740\n\t0.29\n\t2416\n\t4462\n\t4.83\n\t2978\n\t0.32\n\t2386\n\n\tH\n2:Be 49:51\t\n\t4498\n\t0.87\n\t2558\n\t0.23\n\t2833\n\t5295\n\t0.91\n\t2589\n\t0.24\n\t2850\n\n\tCH\n4 (methane)\n\tMethalox. Many engines under development in the 2010s.\n\t3034\n\t3.21\n\t3260\n\t0.82\n\t1857\n\t3615\n\t3.45\n\t3290\n\t0.83\n\t1838\n\n\tC2H6\t\n\t3006\n\t2.89\n\t3320\n\t0.90\n\t1840\n\t3584\n\t3.10\n\t3351\n\t0.91\n\t1825\n\n\tC2H4\t\n\t3053\n\t2.38\n\t3486\n\t0.88\n\t1875\n\t3635\n\t2.59\n\t3521\n\t0.89\n\t1855\n\n\tRP-1 (kerosene)\n\tKerolox. Common.\n\t2941\n\t2.58\n\t3403\n\t1.03\n\t1799\n\t3510\n\t2.77\n\t3428\n\t1.03\n\t1783\n\n\tN2H4\t\n\t3065\n\t0.92\n\t3132\n\t1.07\n\t1892\n\t3460\n\t0.98\n\t3146\n\t1.07\n\t1878\n\n\tB5H9\t\n\t3124\n\t2.12\n\t3834\n\t0.92\n\t1895\n\t3758\n\t2.16\n\t3863\n\t0.92\n\t1894\n\n\tB2H6\t\n\t3351\n\t1.96\n\t3489\n\t0.74\n\t2041\n\t4016\n\t2.06\n\t3563\n\t0.75\n\t2039\n\n\tCH4:H2 92.6:7.4\n\t\n\t3126\n\t3.36\n\t3245\n\t0.71\n\t1920\n\t3719\n\t3.63\n\t3287\n\t0.72\n\t1897\n\n\tGOX\n\tGH2\n\tGaseous form\n\t3997\n\t3.29\n\t2576\n\t-\n\t2550\n\t4485\n\t3.92\n\t2862\n\t-\n\t2519\n\n\tF2\n\tH2\t\n\t4036\n\t7.94\n\t3689\n\t0.46\n\t2556\n\t4697\n\t9.74\n\t3985\n\t0.52\n\t2530\n\n\tH2:Li 65.2:34.0\t\n\t4256\n\t0.96\n\t1830\n\t0.19\n\t2680\n\t\n\t\n\t\n\t\n\t\n\n\tH2:Li 60.7:39.3\n\t\n\t\n\t\n\t\n\t\n\t\n\t5050\n\t1.08\n\t1974\n\t0.21\n\t2656\n\n\tCH4\t\n\t3414\n\t4.53\n\t3918\n\t1.03\n\t2068\n\t4075\n\t4.74\n\t3933\n\t1.04\n\t2064\n\n\tC2H6\t\n\t3335\n\t3.68\n\t3914\n\t1.09\n\t2019\n\t3987\n\t3.78\n\t3923\n\t1.10\n\t2014\n\n\tMMH\t\n\t3413\n\t2.39\n\t4074\n\t1.24\n\t2063\n\t4071\n\t2.47\n\t4091\n\t1.24\n\t1987\n\n\tN2H4\t\n\t3580\n\t2.32\n\t4461\n\t1.31\n\t2219\n\t4215\n\t2.37\n\t4468\n\t1.31\n\t2122\n\n\tNH3\t\n\t3531\n\t3.32\n\t4337\n\t1.12\n\t2194\n\t4143\n\t3.35\n\t4341\n\t1.12\n\t2193\n\n\tB5H9\n\t\n\t3502\n\t5.14\n\t5050\n\t1.23\n\t2147\n\t4191\n\t5.58\n\t5083\n\t1.25\n\t2140\n\n\tOF2\n\tH2\t\n\t4014\n\t5.92\n\t3311\n\t0.39\n\t2542\n\t4679\n\t7.37\n\t3587\n\t0.44\n\t2499\n\n\tCH4\t\n\t3485\n\t4.94\n\t4157\n\t1.06\n\t2160\n\t4131\n\t5.58\n\t4207\n\t1.09\n\t2139\n\n\tC2H6\t\n\t3511\n\t3.87\n\t4539\n\t1.13\n\t2176\n\t4137\n\t3.86\n\t4538\n\t1.13\n\t2176\n\n\tRP-1\n\t\n\t3424\n\t3.87\n\t4436\n\t1.28\n\t2132\n\t4021\n\t3.85\n\t4432\n\t1.28\n\t2130\n\n\tMMH\t\n\t3427\n\t2.28\n\t4075\n\t1.24\n\t2119\n\t4067\n\t2.58\n\t4133\n\t1.26\n\t2106\n\n\tN2H4\t\n\t3381\n\t1.51\n\t3769\n\t1.26\n\t2087\n\t4008\n\t1.65\n\t3814\n\t1.27\n\t2081\n\n\tMMH:N2H4:H2O 50.5:29.8:19.7\t\n\t3286\n\t1.75\n\t3726\n\t1.24\n\t2025\n\t3908\n\t1.92\n\t3769\n\t1.25\n\t2018\n\n\tB2H6\t\n\t3653\n\t3.95\n\t4479\n\t1.01\n\t2244\n\t4367\n\t3.98\n\t4486\n\t1.02\n\t2167\n\n\tB5H9\n\t\n\t3539\n\t4.16\n\t4825\n\t1.20\n\t2163\n\t4239\n\t4.30\n\t4844\n\t1.21\n\t2161\n\n\tF2:O2 30:70\n\tH2\t\n\t3871\n\t4.80\n\t2954\n\t0.32\n\t2453\n\t4520\n\t5.70\n\t3195\n\t0.36\n\t2417\n\n\tRP-1\n\t\n\t3103\n\t3.01\n\t3665\n\t1.09\n\t1908\n\t3697\n\t3.30\n\t3692\n\t1.10\n\t1889\n\n\tF2:O2 70:30\n\tRP-1\n\t\n\t3377\n\t3.84\n\t4361\n\t1.20\n\t2106\n\t3955\n\t3.84\n\t4361\n\t1.20\n\t2104\n\n\tF2:O2 87.8:12.2\n\tMMH\n\t\n\t3525\n\t2.82\n\t4454\n\t1.24\n\t2191\n\t4148\n\t2.83\n\t4453\n\t1.23\n\t2186\n\n\tOxidizer\n\tFuel\n\tComment\n\tVe\n\tr\n\tTc\n\td\n\tC*\n\tVe\n\tr\n\tTc\n\td\n\tC*\n\n\tN2F4\n\tCH4\t\n\t3127\n\t6.44\n\t3705\n\t1.15\n\t1917\n\t3692\n\t6.51\n\t3707\n\t1.15\n\t1915\n\n\tC2H4\t\n\t3035\n\t3.67\n\t3741\n\t1.13\n\t1844\n\t3612\n\t3.71\n\t3743\n\t1.14\n\t1843\n\n\tMMH\t\n\t3163\n\t3.35\n\t3819\n\t1.32\n\t1928\n\t3730\n\t3.39\n\t3823\n\t1.32\n\t1926\n\n\tN2H4\t\n\t3283\n\t3.22\n\t4214\n\t1.38\n\t2059\n\t3827\n\t3.25\n\t4216\n\t1.38\n\t2058\n\n\tNH3\t\n\t3204\n\t4.58\n\t4062\n\t1.22\n\t2020\n\t3723\n\t4.58\n\t4062\n\t1.22\n\t2021\n\n\tB5H9\n\t\n\t3259\n\t7.76\n\t4791\n\t1.34\n\t1997\n\t3898\n\t8.31\n\t4803\n\t1.35\n\t1992\n\n\tClF5\n\tMMH\t\n\t2962\n\t2.82\n\t3577\n\t1.40\n\t1837\n\t3488\n\t2.83\n\t3579\n\t1.40\n\t1837\n\n\tN2H4\t\n\t3069\n\t2.66\n\t3894\n\t1.47\n\t1935\n\t3580\n\t2.71\n\t3905\n\t1.47\n\t1934\n\n\tMMH:N2H4 86:14\t\n\t2971\n\t2.78\n\t3575\n\t1.41\n\t1844\n\t3498\n\t2.81\n\t3579\n\t1.41\n\t1844\n\n\tMMH:N2H4:N2H5NO3 55:26:19\n\t\n\t2989\n\t2.46\n\t3717\n\t1.46\n\t1864\n\t3500\n\t2.49\n\t3722\n\t1.46\n\t1863\n\n\tClF3\n\tMMH:N2H4:N2H5NO3 55:26:19\n\tHypergolic\n\t2789\n\t2.97\n\t3407\n\t1.42\n\t1739\n\t3274\n\t3.01\n\t3413\n\t1.42\n\t1739\n\n\tN2H4\n\tHypergolic\n\t2885\n\t2.81\n\t3650\n\t1.49\n\t1824\n\t3356\n\t2.89\n\t3666\n\t1.50\n\t1822\n\n\tN2O4\n\tMMH\n\tHypergolic, common\n\t2827\n\t2.17\n\t3122\n\t1.19\n\t1745\n\t3347\n\t2.37\n\t3125\n\t1.20\n\t1724\n\n\tMMH:Be 76.6:29.4\t\n\t3106\n\t0.99\n\t3193\n\t1.17\n\t1858\n\t3720\n\t1.10\n\t3451\n\t1.24\n\t1849\n\n\tMMH:Al 63:27\t\n\t2891\n\t0.85\n\t3294\n\t1.27\n\t1785\n\t\n\t\n\t\n\t\n\t\n\n\tMMH:Al 58:42\n\t\n\t\n\t\n\t\n\t\n\t\n\t3460\n\t0.87\n\t3450\n\t1.31\n\t1771\n\n\tN2H4\n\tHypergolic, common\n\t2862\n\t1.36\n\t2992\n\t1.21\n\t1781\n\t3369\n\t1.42\n\t2993\n\t1.22\n\t1770\n\n\tN2H4:UDMH 50:50\n\tHypergolic, common\n\t2831\n\t1.98\n\t3095\n\t1.12\n\t1747\n\t3349\n\t2.15\n\t3096\n\t1.20\n\t1731\n\n\tN2H4:Be 80:20\t\n\t3209\n\t0.51\n\t3038\n\t1.20\n\t1918\n\t\n\t\n\t\n\t\n\t\n\n\tN2H4:Be 76.6:23.4\n\t\n\t\n\t\n\t\n\t\n\t\n\t3849\n\t0.60\n\t3230\n\t1.22\n\t1913\n\n\tB5H9\n\t\n\t2927\n\t3.18\n\t3678\n\t1.11\n\t1782\n\t3513\n\t3.26\n\t3706\n\t1.11\n\t1781\n\n\tNO:N2O4 25:75\n\tMMH\t\n\t2839\n\t2.28\n\t3153\n\t1.17\n\t1753\n\t3360\n\t2.50\n\t3158\n\t1.18\n\t1732\n\n\tN2H4:Be 76.6:23.4\n\t\n\t2872\n\t1.43\n\t3023\n\t1.19\n\t1787\n\t3381\n\t1.51\n\t3026\n\t1.20\n\t1775\n\n\tIRFNA IIIa\n\tUDMH:DETA 60:40\n\tHypergolic\n\t2638\n\t3.26\n\t2848\n\t1.30\n\t1627\n\t3123\n\t3.41\n\t2839\n\t1.31\n\t1617\n\n\tMMH\n\tHypergolic\n\t2690\n\t2.59\n\t2849\n\t1.27\n\t1665\n\t3178\n\t2.71\n\t2841\n\t1.28\n\t1655\n\n\tUDMH\n\tHypergolic\n\t2668\n\t3.13\n\t2874\n\t1.26\n\t1648\n\t3157\n\t3.31\n\t2864\n\t1.27\n\t1634\n\n\tIRFNA IV HDA\n\tUDMH:DETA 60:40\n\tHypergolic\n\t2689\n\t3.06\n\t2903\n\t1.32\n\t1656\n\t3187\n\t3.25\n\t2951\n\t1.33\n\t1641\n\n\tMMH\n\tHypergolic\n\t2742\n\t2.43\n\t2953\n\t1.29\n\t1696\n\t3242\n\t2.58\n\t2947\n\t1.31\n\t1680\n\n\tUDMH\n\tHypergolic\n\t2719\n\t2.95\n\t2983\n\t1.28\n\t1676\n\t3220\n\t3.12\n\t2977\n\t1.29\n\t1662\n\n\tH2O2\n\tMMH\t\n\t2790\n\t3.46\n\t2720\n\t1.24\n\t1726\n\t3301\n\t3.69\n\t2707\n\t1.24\n\t1714\n\n\tN2H4\t\n\t2810\n\t2.05\n\t2651\n\t1.24\n\t1751\n\t3308\n\t2.12\n\t2645\n\t1.25\n\t1744\n\n\tN2H4:Be 74.5:25.5\t\n\t3289\n\t0.48\n\t2915\n\t1.21\n\t1943\n\t3954\n\t0.57\n\t3098\n\t1.24\n\t1940\n\n\tB5H9\n\t\n\t3016\n\t2.20\n\t2667\n\t1.02\n\t1828\n\t3642\n\t2.09\n\t2597\n\t1.01\n\t1817\n\n\tOxidizer\n\tFuel\n\tComment\n\tVe\n\tr\n\tTc\n\td\n\tC*\n\tVe\n\tr\n\tTc\n\td\n\tC*\n\n\n\nDefinitions of some of the mixtures:\n\n\n\tIRFNA IIIa\n\t83.4% HNO3, 14% NO2, 2% H2O, 0.6% HF\n\tIRFNA IV HDA\n\t54.3% HNO3, 44% NO2, 1% H2O, 0.7% HF\n\tRP-1\n\tSee MIL-P-25576C, basically kerosene (approximately C\n10H\n18)\n\tMMH monomethylhydrazine\n\tCH\n3NHNH\n2\n\n\nHas not all data for CO/O2, purposed for NASA for Martian-based rockets, only a specific impulse about 250 s.\n\n\n\tr\n\tMixture ratio: mass oxidizer / mass fuel\n\tVe\n\tAverage exhaust velocity, m/s. The same measure as specific impulse in different units, numerically equal to specific impulse in N·s/kg.\n\tC*\n\tCharacteristic velocity, m/s. Equal to chamber pressure multiplied by throat area, divided by mass flow rate. Used to check experimental rocket's combustion efficiency.\n\tTc\n\tChamber temperature, °C\n\td\n\tBulk density of fuel and oxidizer, g/cm³\n\n\nMonopropellants[edit]\n\n\tPropellant\n\tComment\n\tOptimum expansion from\n68.05 atm to 1 atm[citation needed]\n\tExpansion from\n68.05 atm to vacuum (0 atm)\n(Areanozzle = 40:1)[citation needed]\n\n\tVe\n\tTc\n\td\n\tC*\n\tVe\n\tTc\n\td\n\tC*\n\n\tAmmonium dinitramide (LMP-103S)[20][21]\n\tPRISMA mission (2010–2015)\n5 S/Cs launched 2016[22]\n\t\n\t1608\n\t1.24\n\t\n\t\n\t1608\n\t1.24\n\t\n\n\tHydrazine[21]\n\tCommon\n\t\n\t883\n\t1.01\n\t\n\t\n\t883\n\t1.01\n\t\n\n\tHydrogen peroxide\n\tCommon\n\t1610\n\t1270\n\t1.45\n\t1040\n\t1860\n\t1270\n\t1.45\n\t1040\n\n\tHydroxylammonium nitrate (AF-M315E)[21]\n\t\n\t\n\t1893\n\t1.46\n\t\n\t\n\t1893\n\t1.46\n\t\n\n\tNitromethane\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\tPropellant\n\tComment\n\tVe\n\tTc\n\td\n\tC*\n\tVe\n\tTc\n\td\n\tC*\n\n\n\nReferences[edit]\n\n\n\t^ Larson, W.J.; Wertz, J.R. (1992). Space Mission Analysis and Design. Boston: Kluver Academic Publishers.\n\n\t^ Sutton, G. P. (2003). \"History of liquid propellant rocket engines in the united states\". Journal of Propulsion and Power. 19 (6): 978–1007.\n\n\n\t^ a b Sutton, E.P; Biblarz, O. (2010). Rocket Propulsion Elements. New York: Wiley.\n\n\n\t^ Tsiolkovsky, Konstantin E. (1903), \"The Exploration of Cosmic Space by Means of Reaction Devices (Исследование мировых пространств реактивными приборами)\", The Science Review (in Russian) (5), archived from the original on 19 October 2008, retrieved 22 September 2008\n\n\t^ Zumerchik, John, ed. (2001). Macmillan encyclopedia of energy. New York: Macmillan Reference USA. ISBN 0028650212. OCLC 44774933.\n\n\n\t^ Clark, John D. (1972). Ignition! An Informal History of Liquid Rocket Propellants. Rutgers University Press. p. 9. ISBN 978-0-8135-9583-2.\n\n\n\t^ Ogden, J.M. (1999). \"Prospects for building a hydrogen energy infrastructure\". Annual Review of Energy and the Environment. 24: 227–279. doi:10.1146/annurev.energy.24.1.227.\n\n\n\t^ \"Hydrogen Production: Natural Gas Reforming\". Department of Energy. Retrieved 6 April 2017.\n\n\n\t^ Rostrup-Nielsen. \"Large-scale Hydrogen Production\" (PDF). Haldor Topsøe. p. 3. The total hydrogen market was in 1998 390·10^9 Nm3/y + 110·10^9 Nm3/y co-production.\n\n\n\t^ Richard Rhodes, Dark Sun: The Making of the Hydrogen Bomb, 1995, pp. 483-504, Simon & Schuster, NY  \nISBN 978-0-684-82414-7\n\n\t^ Zurawski, Robert (June 1986). \"Current Evaluation of the Tripropellant Concept\" (PDF).\n\n\n\t^ Todd, David (2012-11-20). \"Musk goes for methane-burning reusable rockets as step to colonise Mars\". FlightGlobal/Blogs Hyperbola. Archived from the original on 2012-11-28. Retrieved 2012-11-22. \"We are going to do methane.\" Musk announced as he described his future plans for reusable launch vehicles including those designed to take astronauts to Mars within 15 years.\n\n\n\t^ Belluscio, Alejandro G. (2016-10-03). \"ITS Propulsion – The evolution of the SpaceX Raptor engine\". NASASpaceFlight.com. Retrieved 2016-10-03.\n\n\n\t^ \"SpaceX propulsion chief elevates crowd in Santa Barbara\". Pacific Business Times. 2014-02-19. Retrieved 2014-02-22.\n\n\n\t^ Belluscio, Alejandro G. (2014-03-07). \"SpaceX advances drive for Mars rocket via Raptor power\". NASAspaceflight.com. Retrieved 2014-03-07.\n\n\n\t^ \"Firefly α\". Firefly Space Systems. Archived from the original on 6 October 2014. Retrieved 5 October 2014.\n\n\n\t^ \"United Launch Alliance and Blue Origin Announce Partnership to Develop New American Rocket Engine\". United Launch Alliance. Retrieved 5 October 2014.\n\n\n\t^ a b c d Braeunig, Robert A. (2008). \"Rocket Propellants\". Rocket & Space Technology.\n\n\n\t^ Huzel, D. K.; Huang, D. H. (1971), NASA SP-125, \"Modern Engineering for Design of Liquid-Propellant Rocket Engines\", (2nd ed.), NASA\n\n\t^ Anflo, K.; Moore, S.; King, P. Expanding the ADN-based Monopropellant Thruster Family. 23rd Annual AIAA/USU Conference on Small Satellites. SSC09-II-4.\n\n\n\t^ a b c Shchetkovskiy, Anatoliy; McKechnie, Tim; Mustaikis, Steven (13 August 2012). Advanced Monopropellants Combustion Chambers and Monolithic Catalyst for Small Satellite Propulsion (PDF). 15th Annual Space and Missile Defense Conference. Huntsville, AL. Retrieved 14 December 2017.\n\n\n\t^ Dingertz, Wilhelm (10 October 2017). HPGP® - High Performance Green Propulsion (PDF). ECAPS: Polish - Swedish Space Industry Meeting. Retrieved 14 December 2017.\n\n\n\n\n\n\nExternal links[edit]\n\n\tCpropep-Web an online computer program to calculate propellant performance in rocket engines\n\tDesign Tool for Liquid Rocket Engine Thermodynamic Analysis is a computer program to predict the performance of the liquid-propellant rocket engines.\n\tClark, John D. (1972). Ignition! An Informal History of Liquid Rocket Propellants (PDF). Rutgers University Press. p. 214. ISBN 0-8135-0725-1.\n for a history of liquid rocket propellants in the US by a pioneering rocket propellant developer.\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft propulsion\n\n\tChemical\nrockets\t\n\tState\t\n\tLiquid-propellant rocket\n\tSolid-propellant rocket\n\tHybrid-propellant rocket\n\n\n\n\n\tPropellants\t\n\tLiquid propellant\n\tCryogenic\n\tHypergolic\n\n\n\tMonopropellant\n\tBipropellant\n\tStaged combustion cycle\n\tExpander cycle\n\tGas-generator cycle\n\tTap-off cycle\n\tPressure-fed engine\n\tPump-fed engine\n\tElectric-pump-fed engine\n\n\n\tTripropellant\n\n\n\n\n\n\n\n\tElectrical\nthrusters\t\n\tElectrostatic\t\n\tColloid thruster\n\tIon thruster\n\tGridded\n\tHall-effect thruster\n\tField-emission electric propulsion\n\n\n\n\n\n\n\tElectromagnetic\t\n\tPulsed inductive thruster\n\tMagnetoplasmadynamic thruster\n\tElectrodeless plasma thruster\n\n\n\n\n\tElectrothermal\t\n\tPulsed plasma thruster\n\tHelicon double-layer thruster\n\tArcjet rocket\n\tResistojet rocket\n\tVASIMR\n\n\n\n\n\tOther\t\n\tAtmosphere-breathing electric propulsion\n\tHigh Power Electric Propulsion\n\tMagBeam\n\tMass driver\n\n\n\n\n\n\n\n\tNuclear\npropulsion\t\n\tClosed system\t\n\tDirect Fusion Drive\n\tNuclear electric rocket\n\tNuclear thermal rocket\n\tRadioisotope\n\tSalt-water\n\tGas core\n\t\"Lightbulb\"\n\n\n\n\n\n\n\tOpen system\t\n\tNuclear pulse propulsion\n\tAntimatter-catalyzed\n\n\n\tPulsed nuclear thermal rocket‎\n\tFusion rocket\n\tBussard ramjet\n\n\n\tFission-fragment rocket\n\tFission sail\n\n\n\tNuclear photonic rocket\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tBeam-powered propulsion\n\tCold gas thruster\n\tGravity assist\n\tSolar sail\n\tElectric sail\n\tMagnetic sail\n\n\n\tSolar thermal rocket\n\tTethers\n\tSteam thruster\n\n\n\n\n\tSpaceflight portal\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Liquid_rocket_propellant&oldid=917163891#Bipropellants\"\n\n\t\t\n\t\tCategories: \tRocket propulsion\n\tRocket propellants\n\n\nHidden categories: \tAll articles with unsourced statements\n\tArticles with unsourced statements from March 2017\n\tArticles needing additional references from March 2017\n\tAll articles needing additional references\n\tArticles needing additional references from December 2017\n\tArticles containing potentially dated statements from 2017\n\tAll articles containing potentially dated statements\n\tArticles containing potentially dated statements from March 2014\n\tArticles containing potentially dated statements from 2018\n\tWikipedia articles needing clarification from January 2016\n\tArticles with unsourced statements from April 2016\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tEspañol\n\tفارسی\n\tFrançais\n\tItaliano\n\t日本語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 22 September 2019, at 15:12 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "6", "dc:title": "Liquid rocket propellant - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-bipropellant", "title": "Liquid rocket propellant - Wikipedia"}}