{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCapacitance - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tCapacitance\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tAbility of a body to store an electrical charge\n\n\n\n\n\tCommon symbols\n\tC\n\tSI unit\tfarad\n\tOther units\n\tμF, nF, pF\n\tIn SI base units\tF = A2 s4 kg−1 m−2\n\tDerivations from\nother quantities\n\tC = charge / voltage\n\tDimension\tM−1 L−2 T4 I2\n\n\n\tPart of a series of articles about\n\tElectromagnetism\n\t\n\t\n\tElectricity\n\tMagnetism\n\n\n\t\nElectrostatics\n\n\tConductor\n\tCoulomb's law\n\tElectric charge\n\tElectric dipole moment\n\tElectric field\n\tElectric flux / potential energy\n\tElectrostatic discharge\n\tGauss's law\n\tInduction\n\tInsulator\n\tPolarization density\n\tStatic electricity\n\tTriboelectricity\n\n\n\n\n\t\nMagnetostatics\n\n\tAmpère's law\n\tBiot–Savart law\n\tGauss's law for magnetism\n\tMagnetic field\n\tMagnetic flux\n\tMagnetic dipole moment\n\tMagnetization\n\tMagnetomotive force\n\n\n\n\n\t\nElectrodynamics\n\n\tLorentz force law\n\tElectromagnetic induction\n\tFaraday's law\n\tLenz's law\n\tDisplacement current\n\tMagnetic potential\n\tMaxwell's equations\n\tElectromagnetic field\n\tElectromagnetic pulse\n\tElectromagnetic radiation\n\tMaxwell tensor\n\tPoynting vector\n\tLiénard–Wiechert potential\n\tJefimenko's equations\n\tEddy current\n\tLondon equations\n\n\n\tMathematical descriptions of the electromagnetic field\n\n\n\n\n\n\t\nElectrical network\n\n\tAlternating current\n\tCapacitance\n\tDirect current\n\tElectric current\n\tElectric potential\n\tElectromotive force\n\tImpedance\n\tInductance\n\tOhm's law\n\tParallel circuit\n\tResistance\n\tResonant cavities\n\tSeries circuit\n\tVoltage\n\tWaveguides\n\n\n\n\n\t\nCovariant formulation\n\n\tElectromagnetic tensor\n(stress–energy tensor)\n\n\n\n\tFour-current\n\tElectromagnetic four-potential\n\n\n\n\n\t\nScientists\n\n\tAmpère\n\tBiot\n\tCoulomb\n\tFaraday\n\tGauss\n\tHeaviside\n\tHenry\n\tHertz\n\tLenz\n\tLorentz\n\tMaxwell\n\tØrsted\n\tSavart\n\tTesla\n\tVolta\n\tWeber\n\t\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nCapacitance is the ratio of the change in an electric charge in a system to the corresponding change in its electric potential. There are two closely related notions of capacitance: self capacitance and mutual capacitance. Any object that can be electrically charged exhibits self capacitance. A material with a large self capacitance holds more electric charge at a given voltage than one with low capacitance. The notion of mutual capacitance is particularly important for understanding the operations of the capacitor, one of the three elementary linear electronic components (along with resistors and inductors).\n\nThe capacitance is a function only of the geometry of the design (e.g. area of the plates and the distance between them) and the permittivity of the dielectric material between the plates of the capacitor. For many dielectric materials, the permittivity and thus the capacitance, is independent of the potential difference between the conductors and the total charge on them.\n\nThe SI unit of capacitance is the farad (symbol: F), named after the English physicist Michael Faraday. A 1 farad capacitor, when charged with 1 coulomb of electrical charge, has a potential difference of 1 volt between its plates.[1] The reciprocal of capacitance is called elastance.\n\n\nContents\n\n\n\t1 Self capacitance\n\t2 Mutual capacitance\n\t2.1 Capacitance matrix\n\n\n\n\t3 Capacitors\n\t4 Stray capacitance\n\t5 Capacitance of conductors with simple shapes\n\t6 Energy storage\n\t7 Nanoscale systems\n\t7.1 Single-electron devices\n\t7.2 Few-electron devices\n\n\n\n\t8 Capacitance in electronic and semiconductor devices\n\t9 Negative capacitance in semiconductor devices\n\t10 Measuring capacitance\n\t11 See also\n\t12 References\n\t13 Further reading\n\n\n\n\n\nSelf capacitance[edit]\n\nIn electrical circuits, the term capacitance is usually a shorthand for the mutual capacitance between two adjacent conductors, such as the two plates of a capacitor. However, for an isolated conductor, there also exists a property called self capacitance, which is the amount of electric charge that must be added to an isolated conductor to raise its electric potential by one unit (i.e. one volt, in most measurement systems).[2] The reference point for this potential is a theoretical hollow conducting sphere, of infinite radius, with the conductor centered inside this sphere.\n\nMathematically, the self capacitance of a conductor is defined by\n\n\n\t\n  \n    \n      \n        C\n        =\n        \n          \n            q\n            V\n          \n        \n        ,\n      \n    \n    {\\displaystyle C={\\frac {q}{V}},}\n  \n\n\n\nwhere\n\n\n\tq is the charge held by the conductor,\n\t\n  \n    \n      \n        V\n        =\n        \n          \n            1\n            \n              4\n              π\n              \n                ε\n                \n                  0\n                \n              \n            \n          \n        \n        ∫\n        \n          \n            σ\n            r\n          \n        \n        \n        d\n        S\n      \n    \n    {\\displaystyle V={1 \\over 4\\pi \\varepsilon _{0}}\\int {\\sigma  \\over r}\\,dS}\n  \n is the electric potential,\n\tσ is the surface charge density.\n\tdS is an infinitesimal element of area,\n\tr is the length from dS to a fixed point M within the plate\n\t\n  \n    \n      \n        \n          ε\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle \\varepsilon _{0}}\n  \n is the vacuum permittivity\n\n\nUsing this method, the self capacitance of a conducting sphere of radius R is:[3]\n\n\n\t\n  \n    \n      \n        C\n        =\n        4\n        π\n        \n          ε\n          \n            0\n          \n        \n        R\n        \n      \n    \n    {\\displaystyle C=4\\pi \\varepsilon _{0}R\\,}\n  \n\n\n\nExample values of self capacitance are:\n\n\n\tfor the top \"plate\" of a van de Graaff generator, typically a sphere 20 cm in radius: 22.24 pF,\n\tthe planet Earth: about 710 µF.[4]\n\n\nThe inter-winding capacitance of a coil is sometimes called self capacitance,[5] but this is a different phenomenon. It is actually mutual capacitance between the individual turns of the coil and is a form of stray, or parasitic capacitance. This self-capacitance is an important consideration at high frequencies: It changes the impedance of the coil and gives rise to parallel resonance. In many applications this is an undesirable effect and sets an upper frequency limit for the correct operation of the circuit.[citation needed]\n\n\nMutual capacitance[edit]\n\nMain article: Mutual capacitance\n\nA common form is a parallel-plate capacitor, which consists of two conductive plates insulated from each other, usually sandwiching a dielectric material. In a parallel plate capacitor, capacitance is very nearly proportional to the surface area of the conductor plates and inversely proportional to the separation distance between the plates.\n\nIf the charges on the plates are +q and −q, and V gives the voltage between the plates, then the capacitance C is given by\n\n\n\t\n  \n    \n      \n        C\n        =\n        \n          \n            q\n            V\n          \n        \n        .\n      \n    \n    {\\displaystyle C={\\frac {q}{V}}.}\n  \n\n\n\nwhich gives the voltage/current relationship\n\n\n\t\n  \n    \n      \n        i\n        (\n        t\n        )\n        =\n        C\n        \n          \n            \n              \n                d\n              \n              v\n              (\n              t\n              )\n            \n            \n              \n                d\n              \n              t\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle i(t)=C{\\frac {\\mathrm {d} v(t)}{\\mathrm {d} t}}.}\n  \n\n\n\nThe energy stored in a capacitor is found by integrating the work W:\n\n\n\t\n  \n    \n      \n        \n          W\n          \n            charging\n          \n        \n        =\n        \n          \n            1\n            2\n          \n        \n        C\n        \n          V\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle W_{\\text{charging}}={\\frac {1}{2}}CV^{2}}\n  \n\n\n\nCapacitance matrix[edit]\n\nThe discussion above is limited to the case of two conducting plates, although of arbitrary size and shape.\nThe definition\n\n  \n    \n      \n        C\n        =\n        Q\n        \n          /\n        \n        V\n      \n    \n    {\\displaystyle C=Q/V}\n  \n does not apply when there are more than two charged plates, or when the net charge on the two plates is non-zero. To handle this case, Maxwell introduced his coefficients of potential. If three (nearly ideal) conductors are given charges \n  \n    \n      \n        \n          Q\n          \n            1\n          \n        \n        ,\n        \n          Q\n          \n            2\n          \n        \n        ,\n        \n          Q\n          \n            3\n          \n        \n      \n    \n    {\\displaystyle Q_{1},Q_{2},Q_{3}}\n  \n, then the voltage at conductor 1 is given by\n\n\n\t\n  \n    \n      \n        \n          V\n          \n            1\n          \n        \n        =\n        \n          P\n          \n            11\n          \n        \n        \n          Q\n          \n            1\n          \n        \n        +\n        \n          P\n          \n            12\n          \n        \n        \n          Q\n          \n            2\n          \n        \n        +\n        \n          P\n          \n            13\n          \n        \n        \n          Q\n          \n            3\n          \n        \n        ,\n      \n    \n    {\\displaystyle V_{1}=P_{11}Q_{1}+P_{12}Q_{2}+P_{13}Q_{3},}\n  \n\n\n\nand similarly for the other voltages. Hermann von Helmholtz and Sir William Thomson showed that the coefficients of potential are symmetric, so that \n  \n    \n      \n        \n          P\n          \n            12\n          \n        \n        =\n        \n          P\n          \n            21\n          \n        \n      \n    \n    {\\displaystyle P_{12}=P_{21}}\n  \n, etc. Thus the system can be described by a collection of coefficients known as the elastance matrix or reciprocal capacitance matrix, which is defined as:\n\n\n\t\n  \n    \n      \n        \n          P\n          \n            i\n            j\n          \n        \n        =\n        \n          \n            \n              ∂\n              \n                V\n                \n                  i\n                \n              \n            \n            \n              ∂\n              \n                Q\n                \n                  j\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle P_{ij}={\\frac {\\partial V_{i}}{\\partial Q_{j}}}}\n  \n\n\n\nFrom this, the mutual capacitance \n  \n    \n      \n        \n          C\n          \n            m\n          \n        \n      \n    \n    {\\displaystyle C_{m}}\n  \n between two objects can be defined[6] by solving for the total charge Q and using \n  \n    \n      \n        \n          C\n          \n            m\n          \n        \n        =\n        Q\n        \n          /\n        \n        V\n      \n    \n    {\\displaystyle C_{m}=Q/V}\n  \n.\n\n\n\t\n  \n    \n      \n        \n          C\n          \n            m\n          \n        \n        =\n        \n          \n            1\n            \n              (\n              \n                P\n                \n                  11\n                \n              \n              +\n              \n                P\n                \n                  22\n                \n              \n              )\n              −\n              (\n              \n                P\n                \n                  12\n                \n              \n              +\n              \n                P\n                \n                  21\n                \n              \n              )\n            \n          \n        \n      \n    \n    {\\displaystyle C_{m}={\\frac {1}{(P_{11}+P_{22})-(P_{12}+P_{21})}}}\n  \n\n\n\nSince no actual device holds perfectly equal and opposite charges on each of the two \"plates\", it is the mutual capacitance that is reported on capacitors.\n\nThe collection of coefficients \n  \n    \n      \n        \n          C\n          \n            i\n            j\n          \n        \n        =\n        \n          \n            \n              ∂\n              \n                Q\n                \n                  i\n                \n              \n            \n            \n              ∂\n              \n                V\n                \n                  j\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle C_{ij}={\\frac {\\partial Q_{i}}{\\partial V_{j}}}}\n  \n is known as the capacitance matrix,[7][8] and is the inverse of the elastance matrix.\n\n\nCapacitors[edit]\n\nMain article: Capacitor\n\nThe capacitance of the majority of capacitors used in electronic circuits is generally several orders of magnitude smaller than the farad. The most common subunits of capacitance in use today are the microfarad (µF), nanofarad (nF), picofarad (pF), and, in microcircuits, femtofarad (fF). However, specially made supercapacitors can be much larger (as much as hundreds of farads), and parasitic capacitive elements can be less than a femtofarad. In the past, alternate subunits were used in historical electronic books; \"mfd\" and \"mf\" for microfarad (µF); \"mmfd\", \"mmf\", \"µµF\" for picofarad (pF); but are rarely used any more.[9][10]\n\nCapacitance can be calculated if the geometry of the conductors and the dielectric properties of the insulator between the conductors are known. A qualitative explanation for this can be given as follows.\n Once a positive charge is put unto a conductor, this charge creates an electrical field, repelling any other positive charge to be moved onto the conductor; i.e., increasing the necessary voltage. But if nearby there is another conductor with a negative charge on it, the electrical field of the positive conductor repelling the second positive charge is weakened (the second positive charge also feels the attracting force of the negative charge). So due to the second conductor with a negative charge, it becomes easier to put a positive charge on the already positive charged first conductor, and vice versa; i.e., the necessary voltage is lowered. \n As a quantitative example consider the capacitance of a capacitor constructed of two parallel plates both of area A separated by a distance d. If d is sufficiently small with respect to the smallest chord of A, there holds, to a high level of accuracy:\n\n\n\t\n  \n    \n      \n         \n        C\n        =\n        \n          ε\n          \n            0\n          \n        \n        \n          \n            A\n            d\n          \n        \n      \n    \n    {\\displaystyle \\ C=\\varepsilon _{0}{\\frac {A}{d}}}\n  \n\n\n\nwhere\n\n\n\tC is the capacitance, in farads;\n\tA is the area of overlap of the two plates, in square meters;\n\tε0 is the electric constant (ε0 ≈ 8.854×10−12 F⋅m−1); and\n\td is the separation between the plates, in meters;\n\n\nCapacitance is proportional to the area of overlap and inversely proportional to the separation between conducting sheets. The closer the sheets are to each other, the greater the capacitance.\nThe equation is a good approximation if d is small compared to the other dimensions of the plates so that the electric field in the capacitor area is uniform, and the so-called fringing field around the periphery provides only a small contribution to the capacitance.\n\nCombining the equation for capacitance with the above equation for the energy stored in a capacitance, for a flat-plate capacitor the energy stored is:\n\n\n\t\n  \n    \n      \n        \n          W\n          \n            stored\n          \n        \n        =\n        \n          \n            1\n            2\n          \n        \n        C\n        \n          V\n          \n            2\n          \n        \n        =\n        \n          \n            1\n            2\n          \n        \n        \n          ε\n          \n            0\n          \n        \n        \n          \n            A\n            d\n          \n        \n        \n          V\n          \n            2\n          \n        \n        .\n      \n    \n    {\\displaystyle W_{\\text{stored}}={\\frac {1}{2}}CV^{2}={\\frac {1}{2}}\\varepsilon _{0}{\\frac {A}{d}}V^{2}.}\n  \n\n\n\nwhere W is the energy, in joules; C is the capacitance, in farads; and V is the voltage, in volts.\n\n\nStray capacitance[edit]\n\nMain article: Parasitic capacitance\n\nAny two adjacent conductors can function as a capacitor, though the capacitance is small unless the conductors are close together for long distances or over a large area. This (often unwanted) capacitance is called parasitic or \"stray capacitance\". Stray capacitance can allow signals to leak between otherwise isolated circuits (an effect called crosstalk), and it can be a limiting factor for proper functioning of circuits at high frequency.\n\nStray capacitance between the input and output in amplifier circuits can be troublesome because it can form a path for feedback, which can cause instability and parasitic oscillation in the amplifier. It is often convenient for analytical purposes to replace this capacitance with a combination of one input-to-ground capacitance and one output-to-ground capacitance; the original configuration — including the input-to-output capacitance — is often referred to as a pi-configuration. Miller's theorem can be used to effect this replacement: it states that, if the gain ratio of two nodes is 1/K, then an impedance of Z connecting the two nodes can be replaced with a Z/(1 − k) impedance between the first node and ground and a KZ/(K − 1) impedance between the second node and ground. Since impedance varies inversely with capacitance, the internode capacitance, C, is replaced by a capacitance of KC from input to ground and a capacitance of (K − 1)C/K from output to ground. When the input-to-output gain is very large, the equivalent input-to-ground impedance is very small while the output-to-ground impedance is essentially equal to the original (input-to-output) impedance.\n\n\nCapacitance of conductors with simple shapes[edit]\n\nCalculating the capacitance of a system amounts to solving the Laplace equation ∇2φ = 0 with a constant potential φ on the 2-dimensional surface of the conductors embedded in 3-space. This is simplified by symmetries. There is no solution in terms of elementary functions in more complicated cases.\n\nFor plane situations analytic functions may be used to map different geometries to each other. See also Schwarz–Christoffel mapping.\n\n\nCapacitance of simple systems\n\tType\tCapacitance\tComment\n\n\tParallel-plate capacitor\n\t\n  \n    \n      \n        ε\n        A\n        \n          /\n        \n        d\n      \n    \n    {\\displaystyle \\varepsilon A/d}\n  \n\n\t\nε: Permittivity\n\n\n\n\tConcentric cylinders\n\t\n  \n    \n      \n        \n          \n            \n              2\n              π\n              ε\n              ℓ\n            \n            \n              ln\n              ⁡\n              \n                (\n                \n                  \n                    R\n                    \n                      2\n                    \n                  \n                  \n                    /\n                  \n                  \n                    R\n                    \n                      1\n                    \n                  \n                \n                )\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\frac {2\\pi \\varepsilon \\ell }{\\ln \\left(R_{2}/R_{1}\\right)}}}\n  \n\n\t\nε: Permittivity\n\n\n\n\tPair of parallel wires[11]\n\t\n  \n    \n      \n        \n          \n            \n              π\n              ε\n              ℓ\n            \n            \n              arcosh\n              ⁡\n              \n                (\n                \n                  \n                    d\n                    \n                      2\n                      a\n                    \n                  \n                \n                )\n              \n            \n          \n        \n        =\n        \n          \n            \n              π\n              ε\n              ℓ\n            \n            \n              ln\n              ⁡\n              \n                (\n                \n                  \n                    \n                      d\n                      \n                        2\n                        a\n                      \n                    \n                  \n                  +\n                  \n                    \n                      \n                        \n                          \n                            d\n                            \n                              2\n                            \n                          \n                          \n                            4\n                            \n                              a\n                              \n                                2\n                              \n                            \n                          \n                        \n                      \n                      −\n                      1\n                    \n                  \n                \n                )\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\frac {\\pi \\varepsilon \\ell }{\\operatorname {arcosh} \\left({\\frac {d}{2a}}\\right)}}={\\frac {\\pi \\varepsilon \\ell }{\\ln \\left({\\frac {d}{2a}}+{\\sqrt {{\\frac {d^{2}}{4a^{2}}}-1}}\\right)}}}\n  \n\n\t\n\n\tWire parallel to wall[11]\n\t\n  \n    \n      \n        \n          \n            \n              2\n              π\n              ε\n              ℓ\n            \n            \n              arcosh\n              ⁡\n              \n                (\n                \n                  \n                    d\n                    a\n                  \n                \n                )\n              \n            \n          \n        \n        =\n        \n          \n            \n              2\n              π\n              ε\n              ℓ\n            \n            \n              ln\n              ⁡\n              \n                (\n                \n                  \n                    \n                      d\n                      a\n                    \n                  \n                  +\n                  \n                    \n                      \n                        \n                          \n                            d\n                            \n                              2\n                            \n                          \n                          \n                            a\n                            \n                              2\n                            \n                          \n                        \n                      \n                      −\n                      1\n                    \n                  \n                \n                )\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\frac {2\\pi \\varepsilon \\ell }{\\operatorname {arcosh} \\left({\\frac {d}{a}}\\right)}}={\\frac {2\\pi \\varepsilon \\ell }{\\ln \\left({\\frac {d}{a}}+{\\sqrt {{\\frac {d^{2}}{a^{2}}}-1}}\\right)}}}\n  \n\n\ta: Wire radius \nd: Distance, d > a \nℓ: Wire length\n\n\tTwo parallel\ncoplanar strips[12]\n\t\n  \n    \n      \n        ε\n        ℓ\n        \n          \n            \n              K\n              \n                (\n                \n                  \n                    1\n                    −\n                    \n                      k\n                      \n                        2\n                      \n                    \n                  \n                \n                )\n              \n            \n            \n              K\n              \n                (\n                k\n                )\n              \n            \n          \n        \n      \n    \n    {\\displaystyle \\varepsilon \\ell {\\frac {K\\left({\\sqrt {1-k^{2}}}\\right)}{K\\left(k\\right)}}}\n  \n\n\td: Distance\nw1, w2: Strip width\nkm: d/(2wm+d)\n\nk2: k1k2\nK: Elliptic integral\nℓ: Length\n\n\n\n\tConcentric spheres\n\t\n  \n    \n      \n        \n          \n            \n              4\n              π\n              ε\n            \n            \n              \n                \n                  1\n                  \n                    R\n                    \n                      1\n                    \n                  \n                \n              \n              −\n              \n                \n                  1\n                  \n                    R\n                    \n                      2\n                    \n                  \n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\frac {4\\pi \\varepsilon }{{\\frac {1}{R_{1}}}-{\\frac {1}{R_{2}}}}}}\n  \n\n\t\nε: Permittivity\n\n\n\n\tTwo spheres,\nequal radius[13][14]\n\t\n  \n    \n      \n        2\n        π\n        ε\n        a\n        \n          ∑\n          \n            n\n            =\n            1\n          \n          \n            ∞\n          \n        \n        \n          \n            \n              sinh\n              ⁡\n              \n                (\n                \n                  ln\n                  ⁡\n                  \n                    (\n                    \n                      D\n                      +\n                      \n                        \n                          \n                            D\n                            \n                              2\n                            \n                          \n                          −\n                          1\n                        \n                      \n                    \n                    )\n                  \n                \n                )\n              \n            \n            \n              sinh\n              ⁡\n              \n                (\n                \n                  n\n                  ln\n                  ⁡\n                  \n                    (\n                    \n                      D\n                      +\n                      \n                        \n                          \n                            D\n                            \n                              2\n                            \n                          \n                          −\n                          1\n                        \n                      \n                    \n                    )\n                  \n                \n                )\n              \n            \n          \n        \n      \n    \n    {\\displaystyle 2\\pi \\varepsilon a\\sum _{n=1}^{\\infty }{\\frac {\\sinh \\left(\\ln \\left(D+{\\sqrt {D^{2}-1}}\\right)\\right)}{\\sinh \\left(n\\ln \\left(D+{\\sqrt {D^{2}-1}}\\right)\\right)}}}\n  \n\n\n  \n    \n      \n        =\n        2\n        π\n        ε\n        a\n        \n          {\n          \n            1\n            +\n            \n              \n                1\n                \n                  2\n                  D\n                \n              \n            \n            +\n            \n              \n                1\n                \n                  4\n                  \n                    D\n                    \n                      2\n                    \n                  \n                \n              \n            \n            +\n            \n              \n                1\n                \n                  8\n                  \n                    D\n                    \n                      3\n                    \n                  \n                \n              \n            \n            +\n            \n              \n                1\n                \n                  8\n                  \n                    D\n                    \n                      4\n                    \n                  \n                \n              \n            \n            +\n            \n              \n                3\n                \n                  32\n                  \n                    D\n                    \n                      5\n                    \n                  \n                \n              \n            \n            +\n            O\n            \n              (\n              \n                \n                  1\n                  \n                    D\n                    \n                      6\n                    \n                  \n                \n              \n              )\n            \n          \n          }\n        \n      \n    \n    {\\displaystyle =2\\pi \\varepsilon a\\left\\{1+{\\frac {1}{2D}}+{\\frac {1}{4D^{2}}}+{\\frac {1}{8D^{3}}}+{\\frac {1}{8D^{4}}}+{\\frac {3}{32D^{5}}}+O\\left({\\frac {1}{D^{6}}}\\right)\\right\\}}\n  \n\n\n  \n    \n      \n        =\n        2\n        π\n        ε\n        a\n        \n          {\n          \n            ln\n            ⁡\n            2\n            +\n            γ\n            −\n            \n              \n                1\n                2\n              \n            \n            ln\n            ⁡\n            \n              (\n              \n                2\n                D\n                −\n                2\n              \n              )\n            \n            +\n            O\n            \n              (\n              \n                2\n                D\n                −\n                2\n              \n              )\n            \n          \n          }\n        \n      \n    \n    {\\displaystyle =2\\pi \\varepsilon a\\left\\{\\ln 2+\\gamma -{\\frac {1}{2}}\\ln \\left(2D-2\\right)+O\\left(2D-2\\right)\\right\\}}\n  \n\n\ta: Radius\nd: Distance, d > 2a\nD = d/2a, D > 1\n γ: Euler's constant\n\n\tSphere in front of wall[13]\n\t\n  \n    \n      \n        4\n        π\n        ε\n        a\n        \n          ∑\n          \n            n\n            =\n            1\n          \n          \n            ∞\n          \n        \n        \n          \n            \n              sinh\n              ⁡\n              \n                (\n                \n                  ln\n                  ⁡\n                  \n                    (\n                    \n                      D\n                      +\n                      \n                        \n                          \n                            D\n                            \n                              2\n                            \n                          \n                          −\n                          1\n                        \n                      \n                    \n                    )\n                  \n                \n                )\n              \n            \n            \n              sinh\n              ⁡\n              \n                (\n                \n                  n\n                  ln\n                  ⁡\n                  \n                    (\n                    \n                      D\n                      +\n                      \n                        \n                          \n                            D\n                            \n                              2\n                            \n                          \n                          −\n                          1\n                        \n                      \n                    \n                    )\n                  \n                \n                )\n              \n            \n          \n        \n      \n    \n    {\\displaystyle 4\\pi \\varepsilon a\\sum _{n=1}^{\\infty }{\\frac {\\sinh \\left(\\ln \\left(D+{\\sqrt {D^{2}-1}}\\right)\\right)}{\\sinh \\left(n\\ln \\left(D+{\\sqrt {D^{2}-1}}\\right)\\right)}}}\n  \n\n\t\n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n: Radius\n\n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n: Distance, \n  \n    \n      \n        d\n        >\n        a\n      \n    \n    {\\displaystyle d>a}\n  \n\n\n  \n    \n      \n        D\n        =\n        d\n        \n          /\n        \n        a\n      \n    \n    {\\displaystyle D=d/a}\n  \n\n\n\tSphere\n\t\n  \n    \n      \n        4\n        π\n        ε\n        a\n      \n    \n    {\\displaystyle 4\\pi \\varepsilon a}\n  \n\n\t\n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n: Radius\n\n\tCircular disc[15]\n\t\n  \n    \n      \n        8\n        ε\n        a\n      \n    \n    {\\displaystyle 8\\varepsilon a}\n  \n\n\t\n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n: Radius\n\n\tThin straight wire,\n finite length[16][17][18]\n\t\n  \n    \n      \n        \n          \n            \n              2\n              π\n              ε\n              ℓ\n            \n            Λ\n          \n        \n        \n          {\n          \n            1\n            +\n            \n              \n                1\n                Λ\n              \n            \n            \n              (\n              \n                1\n                −\n                ln\n                ⁡\n                2\n              \n              )\n            \n            +\n            \n              \n                1\n                \n                  Λ\n                  \n                    2\n                  \n                \n              \n            \n            \n              [\n              \n                1\n                +\n                \n                  \n                    (\n                    \n                      1\n                      −\n                      ln\n                      ⁡\n                      2\n                    \n                    )\n                  \n                  \n                    2\n                  \n                \n                −\n                \n                  \n                    \n                      π\n                      \n                        2\n                      \n                    \n                    12\n                  \n                \n              \n              ]\n            \n            +\n            O\n            \n              (\n              \n                \n                  1\n                  \n                    Λ\n                    \n                      3\n                    \n                  \n                \n              \n              )\n            \n          \n          }\n        \n      \n    \n    {\\displaystyle {\\frac {2\\pi \\varepsilon \\ell }{\\Lambda }}\\left\\{1+{\\frac {1}{\\Lambda }}\\left(1-\\ln 2\\right)+{\\frac {1}{\\Lambda ^{2}}}\\left[1+\\left(1-\\ln 2\\right)^{2}-{\\frac {\\pi ^{2}}{12}}\\right]+O\\left({\\frac {1}{\\Lambda ^{3}}}\\right)\\right\\}}\n  \n\n\t\n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n: Wire radius\n\n  \n    \n      \n        ℓ\n      \n    \n    {\\displaystyle \\ell }\n  \n: Length\n\n  \n    \n      \n        Λ\n        =\n        ln\n        ⁡\n        \n          (\n          \n            ℓ\n            \n              /\n            \n            a\n          \n          )\n        \n      \n    \n    {\\displaystyle \\Lambda =\\ln \\left(\\ell /a\\right)}\n  \n\n\n\n\nEnergy storage[edit]\n\nThe energy (measured in joules) stored in a capacitor is equal to the work required to push the charges into the capacitor, i.e. to charge it. Consider a capacitor of capacitance C, holding a charge +q on one plate and −q on the other. Moving a small element of charge dq from one plate to the other against the potential difference V = q/C requires the work dW:\n\n\n\t\n  \n    \n      \n        \n          d\n        \n        W\n        =\n        \n          \n            q\n            C\n          \n        \n        \n        \n          d\n        \n        q\n      \n    \n    {\\displaystyle \\mathrm {d} W={\\frac {q}{C}}\\,\\mathrm {d} q}\n  \n\n\n\nwhere W is the work measured in joules, q is the charge measured in coulombs and C is the capacitance, measured in farads.\n\nThe energy stored in a capacitor is found by integrating this equation. Starting with an uncharged capacitance (q = 0) and moving charge from one plate to the other until the plates have charge +Q and −Q requires the work W:\n\n\n\t\n  \n    \n      \n        \n          W\n          \n            charging\n          \n        \n        =\n        \n          ∫\n          \n            0\n          \n          \n            Q\n          \n        \n        \n          \n            q\n            C\n          \n        \n        \n        \n          d\n        \n        q\n        =\n        \n          \n            1\n            2\n          \n        \n        \n          \n            \n              Q\n              \n                2\n              \n            \n            C\n          \n        \n        =\n        \n          \n            1\n            2\n          \n        \n        Q\n        V\n        =\n        \n          \n            1\n            2\n          \n        \n        C\n        \n          V\n          \n            2\n          \n        \n        =\n        \n          W\n          \n            stored\n          \n        \n        .\n      \n    \n    {\\displaystyle W_{\\text{charging}}=\\int _{0}^{Q}{\\frac {q}{C}}\\,\\mathrm {d} q={\\frac {1}{2}}{\\frac {Q^{2}}{C}}={\\frac {1}{2}}QV={\\frac {1}{2}}CV^{2}=W_{\\text{stored}}.}\n  \n\n\n\nNanoscale systems[edit]\n\nThe capacitance of nanoscale dielectric capacitors such as quantum dots may differ from conventional formulations of larger capacitors. In particular, the electrostatic potential difference experienced by electrons in conventional capacitors is spatially well-defined and fixed by the shape and size of metallic electrodes in addition to the statistically large number of electrons present in conventional capacitors. In nanoscale capacitors, however, the electrostatic potentials experienced by electrons are determined by the number and locations of all electrons that contribute to the electronic properties of the device. In such devices, the number of electrons may be very small, however, the resulting spatial distribution of equipotential surfaces within the device are exceedingly complex.\n\n\nSingle-electron devices[edit]\n\nThe capacitance of a connected, or \"closed\", single-electron device is twice the capacitance of an unconnected, or \"open\", single-electron device.[19] This fact may be traced more fundamentally to the energy stored in the single-electron device whose \"direct polarization\" interaction energy may be equally divided into the interaction of the electron with the polarized charge on the device itself due to the presence of the electron and the amount of potential energy required to form the polarized charge on the device (the interaction of charges in the device's dielectric material with the potential due to the electron).[20]\n\n\nFew-electron devices[edit]\n\nThe derivation of a \"quantum capacitance\" of a few-electron device involves the thermodynamic chemical potential of an N-particle system given by\n\n\n\t\n  \n    \n      \n        μ\n        (\n        N\n        )\n        =\n        U\n        (\n        N\n        )\n        −\n        U\n        (\n        N\n        −\n        1\n        )\n      \n    \n    {\\displaystyle \\mu (N)=U(N)-U(N-1)}\n  \n\n\n\nwhose energy terms may be obtained as solutions of the Schrödinger equation. The definition of capacitance,\n\n\n\t\n  \n    \n      \n        \n          \n            1\n            C\n          \n        \n        ≡\n        \n          \n            \n              Δ\n              \n              V\n            \n            \n              Δ\n              \n              Q\n            \n          \n        \n      \n    \n    {\\displaystyle {1 \\over C}\\equiv {\\Delta \\,V \\over \\Delta \\,Q}}\n  \n,\n\n\nwith the potential difference\n\n\n\t\n  \n    \n      \n        Δ\n        \n        V\n        =\n        \n          \n            \n              Δ\n              \n              μ\n              \n            \n            e\n          \n        \n        =\n        \n          \n            \n              μ\n              (\n              N\n              +\n              Δ\n              \n              N\n              )\n              −\n              μ\n              (\n              N\n              )\n            \n            e\n          \n        \n      \n    \n    {\\displaystyle \\Delta \\,V={\\Delta \\,\\mu \\, \\over e}={\\mu (N+\\Delta \\,N)-\\mu (N) \\over e}}\n  \n\n\n\nmay be applied to the device with the addition or removal of individual electrons,\n\n\n\t\n  \n    \n      \n        Δ\n        \n        N\n        =\n        1\n      \n    \n    {\\displaystyle \\Delta \\,N=1}\n  \n and \n  \n    \n      \n        Δ\n        \n        Q\n        =\n        e\n      \n    \n    {\\displaystyle \\Delta \\,Q=e}\n  \n.\n\n\nThen\n\n\n\t\n  \n    \n      \n        \n          C\n          \n            Q\n          \n        \n        (\n        N\n        )\n        =\n        \n          \n            \n              e\n              \n                2\n              \n            \n            \n              μ\n              (\n              N\n              +\n              1\n              )\n              −\n              μ\n              (\n              N\n              )\n            \n          \n        \n        =\n        \n          \n            \n              e\n              \n                2\n              \n            \n            \n              E\n              (\n              N\n              )\n            \n          \n        \n      \n    \n    {\\displaystyle C_{Q}(N)={e^{2} \\over \\mu (N+1)-\\mu (N)}={e^{2} \\over E(N)}}\n  \n\n\n\nis the \"quantum capacitance\" of the device.[21]\n\nThis expression of \"quantum capacitance\" may be written as\n\n\n\t\n  \n    \n      \n        \n          C\n          \n            Q\n          \n        \n        (\n        N\n        )\n        =\n        \n          \n            \n              e\n              \n                2\n              \n            \n            \n              U\n              (\n              N\n              )\n            \n          \n        \n      \n    \n    {\\displaystyle C_{Q}(N)={e^{2} \\over U(N)}}\n  \n\n\n\nwhich differs from the conventional expression described in the introduction where \n  \n    \n      \n        \n          W\n          \n            stored\n          \n        \n        =\n        U\n      \n    \n    {\\displaystyle W_{\\text{stored}}=U}\n  \n, the stored electrostatic potential energy,\n\n\n\t\n  \n    \n      \n        C\n        =\n        \n          \n            \n              Q\n              \n                2\n              \n            \n            \n              2\n              U\n            \n          \n        \n      \n    \n    {\\displaystyle C={Q^{2} \\over 2U}}\n  \n\n\n\nby a factor of 1/2 with \n  \n    \n      \n        Q\n        =\n        N\n        e\n      \n    \n    {\\displaystyle Q=Ne}\n  \n.\n\nHowever, within the framework of purely classical electrostatic interactions, the appearance of the factor of 1/2 is the result of integration in the conventional formulation,\n\n\n\t\n  \n    \n      \n        \n          W\n          \n            charging\n          \n        \n        =\n        U\n        =\n        \n          ∫\n          \n            0\n          \n          \n            Q\n          \n        \n        \n          \n            q\n            C\n          \n        \n        \n        \n          d\n        \n        q\n      \n    \n    {\\displaystyle W_{\\text{charging}}=U=\\int _{0}^{Q}{\\frac {q}{C}}\\,\\mathrm {d} q}\n  \n\n\n\nwhich is appropriate since \n  \n    \n      \n        \n          d\n        \n        q\n        =\n        0\n      \n    \n    {\\displaystyle \\mathrm {d} q=0}\n  \n for systems involving either many electrons or metallic electrodes, but in few-electron systems, \n  \n    \n      \n        \n          d\n        \n        q\n        →\n        Δ\n        \n        Q\n        =\n        e\n      \n    \n    {\\displaystyle \\mathrm {d} q\\to \\Delta \\,Q=e}\n  \n. The integral generally becomes a summation. One may trivially combine the expressions of capacitance and electrostatic interaction energy,\n\n\n\t\n  \n    \n      \n        Q\n        =\n        C\n        V\n      \n    \n    {\\displaystyle Q=CV}\n  \n and \n  \n    \n      \n        U\n        =\n        Q\n        V\n      \n    \n    {\\displaystyle U=QV}\n  \n,\n\n\nrespectively, to obtain,\n\n\n\t\n  \n    \n      \n        C\n        =\n        Q\n        \n          \n            1\n            V\n          \n        \n        =\n        Q\n        \n          \n            Q\n            U\n          \n        \n        =\n        \n          \n            \n              Q\n              \n                2\n              \n            \n            U\n          \n        \n      \n    \n    {\\displaystyle C=Q{1 \\over V}=Q{Q \\over U}={Q^{2} \\over U}}\n  \n\n\n\nwhich is similar to the quantum capacitance. A more rigorous derivation is reported in the literature.[22] In particular, to circumvent the mathematical challenges of the spatially complex equipotential surfaces within the device, an average electrostatic potential experiences by each electron is utilized in the derivation.\n\nThe reason for apparent mathematical differences is understood more fundamentally as the potential energy, \n  \n    \n      \n        U\n        (\n        N\n        )\n      \n    \n    {\\displaystyle U(N)}\n  \n, of an isolated device (self-capacitance) is twice that stored in a \"connected\" device in the lower limit N=1. As N grows large, \n  \n    \n      \n        U\n        (\n        N\n        )\n        →\n        U\n      \n    \n    {\\displaystyle U(N)\\to U}\n  \n.[20] Thus, the general expression of capacitance is\n\n\n\t\n  \n    \n      \n        C\n        (\n        N\n        )\n        =\n        \n          \n            \n              (\n              N\n              e\n              \n                )\n                \n                  2\n                \n              \n            \n            \n              U\n              (\n              N\n              )\n            \n          \n        \n      \n    \n    {\\displaystyle C(N)={(Ne)^{2} \\over U(N)}}\n  \n.\n\n\nIn nanoscale devices such as quantum dots, the \"capacitor\" is often an isolated, or partially isolated, component within the device. The primary differences between nanoscale capacitors and macroscopic (conventional) capacitors are the number of excess electrons (charge carriers, or electrons, that contribute to the device's electronic behavior) and the shape and size of metallic electrodes. In nanoscale devices, nanowires consisting of metal atoms typically do not exhibit the same conductive properties as their macroscopic, or bulk material, counterparts.\n\n\nCapacitance in electronic and semiconductor devices[edit]\n\nIn electronic and semiconductor devices, transient or frequency-dependent current between terminals contains both conduction and displacement components. Conduction current is related to moving charge carriers (electrons, holes, ions, etc.), while displacement current is caused by time-varying electric field. Carrier transport is affected by electric field and by a number of physical phenomena - such as carrier drift and diffusion, trapping, injection, contact-related effects, impact ionization, etc. As a result, device admittance is frequency-dependent, and a simple electrostatic formula for capacitance \n  \n    \n      \n        C\n        =\n        q\n        \n          /\n        \n        V\n        ,\n      \n    \n    {\\displaystyle C=q/V,}\n  \n is not applicable. A more general definition of capacitance, encompassing electrostatic formula, is:[23]\n\n\n\t\n  \n    \n      \n        C\n        =\n        \n          \n            \n              Im\n              ⁡\n              (\n              Y\n              (\n              ω\n              )\n              )\n            \n            ω\n          \n        \n        ,\n      \n    \n    {\\displaystyle C={\\frac {\\operatorname {Im} (Y(\\omega ))}{\\omega }},}\n  \n\n\n\nwhere \n  \n    \n      \n        Y\n        (\n        ω\n        )\n      \n    \n    {\\displaystyle Y(\\omega )}\n  \n is the device admittance, and \n  \n    \n      \n        ω\n      \n    \n    {\\displaystyle \\omega }\n  \n is the angular frequency.\n\nIn general case, capacitance is a function of frequency. At high frequencies, capacitance approached a constant value, equal to \"geometric\" capacitance, determined by the terminals' geometry and dielectric content in the device.\nA paper by Steven Laux[23] presents a review of numerical techniques for capacitance calculation. In particular, capacitance can be calculated by a Fourier transform of a transient current in response to a step-like voltage excitation:\n\n\n\t\n  \n    \n      \n        C\n        (\n        ω\n        )\n        =\n        1\n        \n          /\n        \n        (\n        Δ\n        V\n        )\n        \n          ∫\n          \n            0\n          \n          \n            ∞\n          \n        \n        [\n        i\n        (\n        t\n        )\n        −\n        i\n        (\n        ∞\n        )\n        ]\n        c\n        o\n        s\n        (\n        ω\n        t\n        )\n        d\n        t\n        .\n      \n    \n    {\\displaystyle C(\\omega )=1/(\\Delta V)\\int _{0}^{\\infty }[i(t)-i(\\infty )]cos(\\omega t)dt.}\n  \n\n\n\nNegative capacitance in semiconductor devices[edit]\n\nUsually, capacitance in semiconductor devices is positive. However, in some devices and under certain conditions (temperature, applied voltages, frequency, etc.), capacitance can become negative. Non-monotonic behavior of the transient current in response to a step-like excitation has been proposed as the mechanism of negative capacitance.[24] Negative capacitance has been demonstrated and explored in many different types of semiconductor devices.[25]\n\n\nMeasuring capacitance[edit]\n\nMain article: Capacitance meter\n\nA capacitance meter is a piece of electronic test equipment used to measure capacitance, mainly of discrete capacitors. For most purposes and in most cases the capacitor must be disconnected from circuit. \n\nMany DVMs (digital volt meters) have a capacitance-measuring function. These usually operate by charging and discharging the capacitor under test with a known current and measuring the rate of rise of the resulting voltage; the slower the rate of rise, the larger the capacitance. DVMs can usually measure capacitance from nanofarads to a few hundred microfarads, but wider ranges are not unusual.  It is also possible to measure capacitance by passing a known high-frequency alternating current through the device under test and measuring the resulting voltage across it (does not work for polarised capacitors).\n\n\n  \nAn Andeen-Hagerling 2700A capacitance bridge\n\n\n\nMore sophisticated instruments use other techniques such as inserting the capacitor-under-test into a bridge circuit. By varying the values of the other legs in the bridge (so as to bring the bridge into balance), the value of the unknown capacitor is determined. This method of indirect use of measuring capacitance ensures greater precision. Through the use of Kelvin connections and other careful design techniques, these instruments can usually measure capacitors over a range from picofarads to farads.\n\n\nSee also[edit]\n\n\tCapacitive displacement sensor\n\tCapacity of a set\n\tQuantum capacitance\n\tConductance\n\tDisplacement current\n\tAmpère's law\n\tGauss law\n\tHydraulic analogy\n\tMagnetocapacitance\n\tRKM code\n\tLCR meter\n\n\nReferences[edit]\n\n\n\t^ \"Definition of 'farad'\". Collins.\n\n\t^ William D. Greason (1992). Electrostatic discharge in electronics. Research Studies Press. p. 48. ISBN 978-0-86380-136-5. Retrieved 4 December 2011.\n\n\n\t^ Lecture notes; University of New South Wales\n\n\t^ Tipler, Paul; Mosca, Gene (2004). Physics for Scientists and Engineers (5th ed.). Macmillan. p. 752. ISBN 978-0-7167-0810-0.\n\n\n\t^ Massarini, A.; Kazimierczuk, M.K. (1997). \"Self capacitance of inductors\". IEEE Transactions on Power Electronics. 12 (4): 671–676. Bibcode:1997ITPE...12..671M. CiteSeerX 10.1.1.205.7356. doi:10.1109/63.602562: example of the use of the term 'self capacitance'.\n\n\n\t^ Jackson, John David (1999). Classical Electrodynamic (3rd ed.). John Wiley & Sons. p. 43. ISBN 978-0-471-30932-1.\n\n\n\t^ Maxwell, James (1873). \"3\". A treatise on electricity and magnetism. 1. Clarendon Press. p. 88ff.\n\n\n\t^ \"Capacitance : Charge as a Function of Voltage\". Av8n.com. Retrieved 20 September 2010.\n\n\n\t^ \"Capacitor MF-MMFD Conversion Chart\". Just Radios.\n\n\n\t^ Fundamentals of Electronics. Volume 1b — Basic Electricity — Alternating Current. Bureau of Naval Personnel. 1965. p. 197.\n\n\n\t^ a b Jackson, J. D. (1975). Classical Electrodynamics. Wiley. p. 80.\n\n\n\t^ Binns; Lawrenson (1973). Analysis and computation of electric and magnetic field problems. Pergamon Press. ISBN 978-0-08-016638-4.\n\n\n\t^ a b Maxwell, J. C. (1873). A Treatise on Electricity and Magnetism. Dover. p. 266ff. ISBN 978-0-486-60637-8.\n\n\n\t^ Rawlins, A. D. (1985). \"Note on the Capacitance of Two Closely Separated Spheres\". IMA Journal of Applied Mathematics. 34 (1): 119–120. doi:10.1093/imamat/34.1.119.\n\n\n\t^ Jackson, J. D. (1975). Classical Electrodynamics. Wiley. p. 128, problem 3.3.\n\n\n\t^ Maxwell, J. C. (1878). \"On the electrical capacity of a long narrow cylinder and of a disk of sensible thickness\". Proc. London Math. Soc. IX: 94–101. doi:10.1112/plms/s1-9.1.94.\n\n\n\t^ Vainshtein, L. A. (1962). \"Static boundary problems for a hollow cylinder of finite length. III Approximate formulas\". Zh. Tekh. Fiz. 32: 1165–1173.\n\n\n\t^ Jackson, J. D. (2000). \"Charge density on thin straight wire, revisited\". Am. J. Phys. 68 (9): 789–799. Bibcode:2000AmJPh..68..789J. doi:10.1119/1.1302908.\n\n\n\t^ \nRaphael Tsu (2011). Superlattice to Nanoelectronics. Elsevier. pp. 312–315. ISBN 978-0-08-096813-1.\n\n\n\t^ a b \nT. LaFave Jr. (2011). \"Discrete charge dielectric model of electrostatic energy\". J. Electrostatics. 69 (6): 414–418. arXiv:1203.3798. doi:10.1016/j.elstat.2011.06.006.\n\n\n\t^ \nG. J. Iafrate; K. Hess; J. B. Krieger; M. Macucci (1995). \"Capacitive nature of atomic-sized structures\". Phys. Rev. B. 52 (15): 10737–10739. Bibcode:1995PhRvB..5210737I. doi:10.1103/physrevb.52.10737.\n\n\n\t^ \nT. LaFave Jr; R. Tsu (March–April 2008). \"Capacitance: A property of nanoscale materials based on spatial symmetry of discrete electrons\" (PDF). Microelectronics Journal. 39 (3–4): 617–623. doi:10.1016/j.mejo.2007.07.105. Archived from the original (PDF) on 22 February 2014. Retrieved 12 February 2014.\n\n\n\t^ a b Laux, S.E. (October 1985). \"Techniques for small-signal analysis of semiconductor devices\". IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems. 4 (4): 472–481. doi:10.1109/TCAD.1985.1270145.\n\n\n\t^ Jonscher, A.K. (1986). \"The physical origin of negative capacitance\". J. Chem. Soc. Faraday Trans. II. 82: 75–81. doi:10.1039/F29868200075.\n\n\n\t^ Ershov, M.; Liu, H.C.; Li, L.; Buchanan, M.; Wasilewski, Z.R.; Jonscher, A.K. (October 1998). \"Negative capacitance effect in semiconductor devices\". IEEE Trans. Electron Devices. 45 (10): 2196–2206. arXiv:cond-mat/9806145. Bibcode:1998ITED...45.2196E. doi:10.1109/16.725254.\n\n\n\n\n\nFurther reading[edit]\n\n\n\tTipler, Paul (1998). Physics for Scientists and Engineers: Vol. 2: Electricity and Magnetism, Light (4th ed.). W. H. Freeman. \nISBN 1-57259-492-6\n\tSerway, Raymond; Jewett, John (2003). Physics for Scientists and Engineers (6th ed.). Brooks Cole. \nISBN 0-534-40842-7\n\tSaslow, Wayne M.(2002). Electricity, Magnetism, and Light. Thomson Learning. \nISBN 0-12-619455-6. See Chapter 8, and especially pp. 255–259 for coefficients of potential.\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Capacitance&oldid=917982361\"\n\n\t\t\n\t\tCategories: \tCapacitance\n\tConcepts in physics\n\tPhysical quantities\n\tElectricity\n\n\nHidden categories: \tCS1: long volume value\n\tArticles with short description\n\tUse dmy dates from June 2013\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from May 2017\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tአማርኛ\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tBân-lâm-gú\n\tБългарски\n\tBoarisch\n\tBosanski\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tҚазақша\n\tKreyòl ayisyen\n\tLatviešu\n\tLietuvių\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tМонгол\n\tNederlands\n\tनेपाल भाषा\n\t日本語\n\tNordfriisk\n\tNorsk\n\tNorsk nynorsk\n\tਪੰਜਾਬੀ\n\tPiemontèis\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tТатарча/tatarça\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tئۇيغۇرچە / Uyghurche\n\tTiếng Việt\n\t吴语\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 26 September 2019, at 12:22 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "12", "dc:title": "Capacitance - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/VFPt_Solenoid_correct2.svg/1200px-VFPt_Solenoid_correct2.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-capacitance", "title": "Capacitance - Wikipedia"}}