{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCapacitor - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tCapacitor\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tPassive two-terminal electronic component that stores electrical energy in an electric field\n\nPassive two-terminal electronic component that stores electrical energy in an electric field\n\nThis article is about the device. For the physical phenomenon, see capacitance. For an overview of various kinds of capacitors, see types of capacitor.\n\n\"Capacitive\" redirects here. For the term used when referring to touchscreens, see capacitive sensing.\n\n\t\n\tThis article is missing information about graph of discharge characteristics showing time constant etc.. Please expand the article to include this information. Further details may exist on the talk page.  (February 2019)\n\n\n\nCapacitor\t\n\tType\tPassive\n\tInvented\tEwald Georg von Kleist\n\tElectronic symbol\n\t\n\n\nA capacitor is a device that stores electrical energy in an electric field.  It is a passive  electronic component with two terminals.\n\nThe effect of a capacitor is known as capacitance. While some capacitance exists between any two electrical conductors in proximity in a circuit, a capacitor is a component designed to add capacitance to a circuit.  The capacitor was originally known as a condenser or condensator.[1] The original name is still widely used in many languages, but not commonly in English.\n\nThe physical form and construction of practical capacitors vary widely and many types of capacitor are in common use. Most capacitors contain at least two electrical conductors often in the form of metallic plates or surfaces separated by a dielectric medium. A conductor may be a foil, thin film, sintered bead of metal, or an electrolyte. The nonconducting dielectric acts to increase the capacitor's charge capacity. Materials commonly used as dielectrics include glass, ceramic, plastic film, paper, mica, air, and oxide layers. Capacitors are widely used as parts of electrical circuits in many common electrical devices. Unlike a resistor, an ideal capacitor does not dissipate energy.  When an electric potential, a voltage, is applied across the terminals of a capacitor, for example when a capacitor is connected across a battery, an electric field develops across the dielectric, causing a net positive charge to collect on one plate and net negative charge to collect on the other plate. No current actually flows through the dielectric. However, there is a flow of charge through the source circuit. If the condition is maintained sufficiently long, the current through the source circuit ceases. If a time-varying voltage is applied across the leads of the capacitor, the source experiences an ongoing current due to the charging and discharging cycles of the capacitor.\n\nThe earliest forms of capacitors were created in the 1740s, when European experimenters discovered that electric charge could be stored in water-filled glass jars that came to be known as Leyden jars. In 1748, Benjamin Franklin connected a series of jars together to create what he called an \"electrical battery\", from their visual similarity to a battery of cannon, which became the standard English term electric battery. Today, capacitors are widely used in electronic circuits for blocking direct current while allowing alternating current to pass. In analog filter networks, they smooth the output of power supplies. In resonant circuits they tune radios to particular frequencies. In electric power transmission systems, they stabilize voltage and power flow.[2] The property of energy storage in capacitors was exploited as dynamic memory in early digital computers.[3]\n\n\nContents\n\n\n\t1 History\n\t2 Theory of operation\n\t2.1 Overview\n\t2.2 Hydraulic analogy\n\t2.3 Parallel-plate capacitor\n\t2.4 Interleaved capacitor\n\t2.5 Energy stored in a capacitor\n\t2.6 Current–voltage relation\n\t2.7 DC circuits\n\t2.8 AC circuits\n\t2.9 Laplace circuit analysis (s-domain)\n\t2.10 Circuit analysis\n\n\n\n\t3 Non-ideal behavior\n\t3.1 Breakdown voltage\n\t3.2 Equivalent circuit\n\t3.3 Q factor\n\t3.4 Ripple current\n\t3.5 Capacitance instability\n\t3.6 Current and voltage reversal\n\t3.7 Dielectric absorption\n\t3.8 Leakage\n\t3.9 Electrolytic failure from disuse\n\n\n\n\t4 Capacitor types\n\t4.1 Dielectric materials\n\t4.2 Voltage-dependent capacitors\n\t4.3 Frequency-dependent capacitors\n\t4.4 Styles\n\n\n\n\t5 Capacitor markings\n\t5.1 RKM code\n\t5.2 Historical\n\n\n\n\t6 Applications\n\t6.1 Energy storage\n\t6.2 Digital memory\n\t6.3 Pulsed power and weapons\n\t6.4 Power conditioning\n\t6.4.1 Power factor correction\n\n\n\n\t6.5 Suppression and coupling\n\t6.5.1 Signal coupling\n\t6.5.2 Decoupling\n\t6.5.3 High-pass and low-pass filters\n\t6.5.4 Noise suppression, spikes, and snubbers\n\n\n\n\t6.6 Motor starters\n\t6.7 Signal processing\n\t6.7.1 Tuned circuits\n\n\n\n\t6.8 Sensing\n\t6.9 Oscillators\n\t6.10 Producing light\n\n\n\n\t7 Hazards and safety\n\t8 See also\n\t9 References\n\t10 Bibliography\n\t11 External links\n\n\n\n\n\nHistory[edit]\n\n  \nBattery of four Leyden jars in Museum Boerhaave, Leiden, the Netherlands\n\n\n\nIn October 1745, Ewald Georg von Kleist of Pomerania, Germany, found that charge could be stored by connecting a high-voltage electrostatic generator by a wire to a volume of water in a hand-held glass jar.[4] Von Kleist's hand and the water acted as conductors, and the jar as a dielectric (although details of the mechanism were incorrectly identified at the time). Von Kleist found that touching the wire resulted in a powerful spark, much more painful than that obtained from an electrostatic machine. The following year, the Dutch physicist Pieter van Musschenbroek invented a similar capacitor, which was named the Leyden jar, after the University of Leiden where he worked.[5]  He also was impressed by the power of the shock he received, writing, \"I would not take a second shock for the kingdom of France.\"[6]\n\nDaniel Gralath was the first to combine several jars in parallel to increase the charge storage capacity.[7] Benjamin Franklin investigated the Leyden jar and came to the conclusion that the charge was stored on the glass, not in the water as others had assumed. He also adopted the term \"battery\",[8][9] (denoting the increasing of power with a row of similar units as in a battery of cannon), subsequently applied to clusters of electrochemical cells.[10] Leyden jars were later made by coating the inside and outside of jars with metal foil, leaving a space at the mouth to prevent arcing between the foils.[citation needed] The earliest unit of capacitance was the jar, equivalent to about 1.11 nanofarads.[11]\n\nLeyden jars or more powerful devices employing flat glass plates alternating with foil conductors were used exclusively up until about 1900, when the invention of wireless (radio) created a demand for standard capacitors, and the steady move to higher frequencies required capacitors with lower inductance. More compact construction methods began to be used, such as a flexible dielectric sheet (like oiled paper) sandwiched between sheets of metal foil, rolled or folded into a small package.\n\n\n\n\n  \nAdvert from the 28 December 1923 edition of The Radio Times for Dubilier condensers, for use in wireless receiving sets\n\n\n\nEarly capacitors were known as condensers, a term that is still occasionally used today, particularly in high power applications, such as automotive systems. The term was first used for this purpose by Alessandro Volta in 1782, with reference to the device's ability to store a higher density of electric charge than was possible with an isolated conductor.[12][1]  The term became deprecated because of the ambiguous meaning of steam condenser, with capacitor becoming the recommended term from 1926.[13]\n\nSince the beginning of the study of electricity non conductive materials like glass, porcelain, paper and mica have been used as insulators. These materials some decades later were also well-suited for further use as the dielectric for the first capacitors. \nPaper capacitors made by sandwiching a strip of impregnated paper between strips of metal, and rolling the result into a cylinder were commonly used in the late 19th century; their manufacture started in 1876,[14] and they were used from the early 20th century as decoupling capacitors in telecommunications (telephony).\n\nPorcelain was used in the first ceramic capacitors. In the early years of Marconi's wireless transmitting apparatus porcelain capacitors were used for high voltage and high frequency application in the transmitters. On the receiver side smaller mica capacitors were used for resonant circuits. Mica dielectric capacitors were invented in 1909 by William Dubilier. Prior to World War II, mica was the most common dielectric for capacitors in the United States.[14]\n\nCharles Pollak (born Karol Pollak), the inventor of the first electrolytic capacitors, found out that the oxide layer on an aluminum anode remained stable in a neutral or alkaline electrolyte, even when the power was switched off. In 1896 he was granted U.S. Patent No. 672,913 for an \"Electric liquid capacitor with aluminum electrodes\". Solid electrolyte tantalum capacitors were invented by Bell Laboratories in the early 1950s as a miniaturized and more reliable low-voltage support capacitor to complement their newly invented transistor.\n\nWith the development of plastic materials by organic chemists during the Second World War, the capacitor industry began to replace paper with thinner polymer films. One very early development in film capacitors was described in British Patent 587,953 in 1944.[14]\n\nElectric double-layer capacitors (now Supercapacitors) were invented in 1957 when H. Becker developed a \"Low voltage electrolytic capacitor with porous carbon electrodes\".[14][15][16] He believed that the energy was stored as a charge in the carbon pores used in his capacitor as in the pores of the etched foils of electrolytic capacitors. Because the double layer mechanism was not known by him at the time, he wrote in the patent: \"It is not known exactly what is taking place in the component if it is used for energy storage, but it leads to an extremely high capacity.\"\n\n\nTheory of operation[edit]\n\nMain article: Capacitance\n\nOverview[edit]\n\n  \nCharge separation in a parallel-plate capacitor causes an internal electric field. A dielectric (orange) reduces the field and increases the capacitance.\n\n\n\n  \nA simple demonstration capacitor made of two parallel metal plates, using an air gap as the dielectric.\n\n\n\nA capacitor consists of two conductors separated by a non-conductive region.[17] The non-conductive region can either be a vacuum or an electrical insulator material known as a dielectric. Examples of dielectric media are glass, air, paper, plastic, ceramic, and even a semiconductor depletion region chemically identical to the conductors.  From Coulomb's law a charge on one conductor will exert a force on the charge carriers within the other conductor, attracting opposite polarity charge and repelling like polarity charges, thus an opposite polarity charge will be induced on the surface of the other conductor.  The conductors thus hold equal and opposite charges on their facing surfaces,[18] and the dielectric develops an electric field.\n\nAn ideal capacitor is characterized by a constant capacitance C, in farads in the SI system of units, defined as the ratio of the positive or negative charge Q on each conductor to the voltage V between them:[17]\n\n\n\t\n  \n    \n      \n        C\n        =\n        \n          \n            Q\n            V\n          \n        \n      \n    \n    {\\displaystyle C={\\frac {Q}{V}}}\n  \n\n\n\nA capacitance of one farad (F) means that one coulomb of charge on each conductor causes a voltage of one volt across the device.[19] Because the conductors (or plates) are close together, the opposite charges on the conductors attract one another due to their electric fields, allowing the capacitor to store more charge for a given voltage than when the conductors are separated, yielding a larger capacitance.\n\nIn practical devices, charge build-up sometimes affects the capacitor mechanically, causing its capacitance to vary. In this case, capacitance is defined in terms of incremental changes:\n\n\n\t\n  \n    \n      \n        C\n        =\n        \n          \n            \n              \n                d\n              \n              Q\n            \n            \n              \n                d\n              \n              V\n            \n          \n        \n      \n    \n    {\\displaystyle C={\\frac {\\mathrm {d} Q}{\\mathrm {d} V}}}\n  \n\n\n\nHydraulic analogy[edit]\n\n  \nIn the hydraulic analogy, a capacitor is analogous to a rubber membrane sealed inside a pipe— this animation illustrates a membrane being repeatedly stretched and un-stretched by the flow of water, which is analogous to a capacitor being repeatedly charged and discharged by the flow of charge\n\n\n\nIn the hydraulic analogy, charge carriers flowing through a wire are analogous to water flowing through a pipe. A capacitor is like a rubber membrane sealed inside a pipe. Water molecules cannot pass through the membrane, but some water can move by stretching the membrane. The analogy clarifies a few aspects of capacitors:\n\n\n\tThe current alters the charge on a capacitor, just as the flow of water changes the position of the membrane. More specifically, the effect of an electric current is to increase the charge of one plate of the capacitor, and decrease the charge of the other plate by an equal amount. This is just as when water flow moves the rubber membrane, it increases the amount of water on one side of the membrane, and decreases the amount of water on the other side.\n\tThe more a capacitor is charged, the larger its voltage drop; i.e., the more it \"pushes back\" against the charging current. This is analogous to  the more a membrane is stretched, the more it pushes back on the water.\n\tCharge can flow \"through\" a capacitor even though no individual electron can get from one side to the other. This is analogous to water flowing through the pipe even though no water molecule can pass through the rubber membrane. The flow cannot continue in the same direction forever; the capacitor experiences dielectric breakdown, and analogously the membrane will eventually break.\n\tThe capacitance describes how much charge can be stored on one plate of a capacitor for a given \"push\" (voltage drop). A very stretchy, flexible membrane corresponds to a higher capacitance than a stiff membrane.\n\tA charged-up capacitor is storing potential energy, analogously to a stretched membrane.\n\n\nParallel-plate capacitor[edit]\n\n  \nParallel plate capacitor model consists of two conducting plates, each of area A, separated by a gap of thickness d containing a dielectric.\n\n\n\nThe simplest model capacitor consists of two thin parallel conductive plates each with an area of \n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n separated by a uniform gap of thickness \n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n filled with a dielectric with permittivity \n  \n    \n      \n        ε\n      \n    \n    {\\displaystyle \\varepsilon }\n  \n.  It is assumed the gap \n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n is much smaller than the dimensions of the plates.  This model applies well to many practical capacitors which are constructed of metal sheets separated by a thin layer of insulating dielectric, since manufacturers try to keep the dielectric very uniform in thickness to avoid thin spots which can cause failure of the capacitor.\n\nSince the separation between the plates is uniform over the plate area, the electric field between the plates \n  \n    \n      \n        E\n      \n    \n    {\\displaystyle E}\n  \n is constant, and directed perpendicularly to the plate surface, except for an area near the edges of the plates where the field decreases because the electric field lines \"bulge\" out of the sides of the capacitor.    This \"fringing field\" area is approximately the same width as the plate separation, \n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n, and assuming \n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n is small compared to the plate dimensions, it is small enough to be ignored.  Therefore, if a charge of \n  \n    \n      \n        +\n        Q\n      \n    \n    {\\displaystyle +Q}\n  \n is placed on one plate and \n  \n    \n      \n        −\n        Q\n      \n    \n    {\\displaystyle -Q}\n  \n on the other plate, the charge on each plate will be spread evenly in a surface charge layer of constant charge density \n  \n    \n      \n        σ\n        =\n        ±\n        Q\n        \n          /\n        \n        A\n      \n    \n    {\\displaystyle \\sigma =\\pm Q/A}\n  \n coulombs per square meter, on the inside surface of each plate.  From Gauss's law the magnitude of the electric field between the plates is \n  \n    \n      \n        E\n        =\n        σ\n        \n          /\n        \n        ε\n      \n    \n    {\\displaystyle E=\\sigma /\\varepsilon }\n  \n.  The voltage \n  \n    \n      \n        V\n      \n    \n    {\\displaystyle V}\n  \n between the plates is defined as the line integral of the electric field over a line from one plate to another\n\n\n\t\n  \n    \n      \n        V\n        =\n        \n          ∫\n          \n            0\n          \n          \n            d\n          \n        \n        E\n        (\n        z\n        )\n        \n        \n          d\n        \n        z\n        =\n        E\n        d\n        =\n        \n          \n            σ\n            ε\n          \n        \n        d\n        =\n        \n          \n            \n              Q\n              d\n            \n            \n              ε\n              A\n            \n          \n        \n      \n    \n    {\\displaystyle V=\\int _{0}^{d}E(z)\\,\\mathrm {d} z=Ed={\\sigma  \\over \\varepsilon }d={Qd \\over \\varepsilon A}}\n  \n\n\n\nThe capacitance is defined as \n  \n    \n      \n        C\n        =\n        Q\n        \n          /\n        \n        V\n      \n    \n    {\\displaystyle C=Q/V}\n  \n.  Substituting \n  \n    \n      \n        V\n      \n    \n    {\\displaystyle V}\n  \n above into this equation\n\n\n\n\n  \n    \n      \n        C\n        =\n        \n          \n            \n              ε\n              A\n            \n            d\n          \n        \n      \n    \n    {\\displaystyle C={\\varepsilon A \\over d}}\n  \n\n\n\n\n\nTherefore, in a capacitor the highest capacitance is achieved with a high permittivity dielectric material, large plate area, and small separation between the plates.\n\nSince the area \n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n of the plates increases with the square of the linear dimensions and the separation \n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n increases linearly, the capacitance scales with the linear dimension of a capacitor (\n  \n    \n      \n        C\n        ∝\n        L\n      \n    \n    {\\displaystyle C\\varpropto L}\n  \n), or as the cube root of the volume.\n\nA parallel plate capacitor can only store a finite amount of energy before dielectric breakdown occurs. The capacitor's dielectric material has a dielectric strength Ud which sets the capacitor's breakdown voltage at V = Vbd = Udd. The maximum energy that the capacitor can store is therefore\n\n\n\t\n  \n    \n      \n        E\n        =\n        \n          \n            1\n            2\n          \n        \n        C\n        \n          V\n          \n            2\n          \n        \n        =\n        \n          \n            1\n            2\n          \n        \n        \n          \n            \n              ε\n              A\n            \n            d\n          \n        \n        (\n        \n          U\n          \n            d\n          \n        \n        d\n        \n          )\n          \n            2\n          \n        \n        =\n        \n          \n            1\n            2\n          \n        \n        ε\n        A\n        d\n        \n          U\n          \n            d\n          \n          \n            2\n          \n        \n      \n    \n    {\\displaystyle E={\\frac {1}{2}}CV^{2}={\\frac {1}{2}}{\\frac {\\varepsilon A}{d}}(U_{d}d)^{2}={\\frac {1}{2}}\\varepsilon AdU_{d}^{2}}\n  \n\n\n\nThe maximum energy is a function of dielectric volume, permittivity, and dielectric strength. Changing the plate area and the separation between the plates while maintaining the same volume causes no change of the maximum amount of energy that the capacitor can store, so long as the distance between plates remains much smaller than both the length and width of the plates. In addition, these equations assume that the electric field is entirely concentrated in the dielectric between the plates. In reality there are fringing fields outside the dielectric, for example between the sides of the capacitor plates, which increase the effective capacitance of the capacitor. This is sometimes called parasitic capacitance. For some simple capacitor geometries this additional capacitance term can be calculated analytically.[20] It becomes negligibly small when the ratios of plate width to separation and length to separation are large.\n\n\nInterleaved capacitor[edit]\n\n  \nThe interleaved capacitor can be seen as combination of several parallel connected capacitors.\n\n\n\nFor \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n number of plates in a capacitor, the total capacitance would be\n\n\n  \n    \n      \n        C\n        =\n        \n          ϵ\n          \n            o\n          \n        \n        \n          \n            A\n            d\n          \n        \n        (\n        n\n        −\n        1\n        )\n      \n    \n    {\\displaystyle C=\\epsilon _{o}{\\frac {A}{d}}(n-1)}\n  \n\n\nwhere \n  \n    \n      \n        C\n        =\n        \n          ϵ\n          \n            o\n          \n        \n        A\n        \n          /\n        \n        d\n      \n    \n    {\\displaystyle C=\\epsilon _{o}A/d}\n  \n is the capacitance for a single plate and \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n is the number of interleaved plates.\n\nAs shown to the figure on the right, the interleaved plates can be seen as parallel plates connected to each other. With the number of capacitor equal to the number of the spaces in between the plates. Thus the \n  \n    \n      \n        (\n        n\n        −\n        1\n        )\n      \n    \n    {\\displaystyle (n-1)}\n  \n multiplier.\n\n\nEnergy stored in a capacitor[edit]\n\nTo increase the charge and voltage on a capacitor, work must be done by an external power source to move charge from the negative to the positive plate against the opposing force of the electric field.[21][22]  If the voltage on the capacitor is \n  \n    \n      \n        V\n      \n    \n    {\\displaystyle V}\n  \n, the work \n  \n    \n      \n        d\n        W\n      \n    \n    {\\displaystyle dW}\n  \n required to move a small increment of charge \n  \n    \n      \n        d\n        q\n      \n    \n    {\\displaystyle dq}\n  \n from the negative to the positive plate is \n  \n    \n      \n        d\n        W\n        =\n        V\n        d\n        q\n      \n    \n    {\\displaystyle dW=Vdq}\n  \n.  The energy is stored in the increased electric field between the plates.  The total energy \n  \n    \n      \n        W\n      \n    \n    {\\displaystyle W}\n  \n stored in a capacitor (expressed in Joule) is equal to the total work done in establishing the electric field from an uncharged state.[23][22][21]\n\n\n\t\n  \n    \n      \n        W\n        =\n        \n          ∫\n          \n            0\n          \n          \n            Q\n          \n        \n        V\n        (\n        q\n        )\n        \n          d\n        \n        q\n        =\n        \n          ∫\n          \n            0\n          \n          \n            Q\n          \n        \n        \n          \n            q\n            C\n          \n        \n        \n          d\n        \n        q\n        =\n        \n          \n            1\n            2\n          \n        \n        \n          \n            \n              Q\n              \n                2\n              \n            \n            C\n          \n        \n        =\n        \n          \n            1\n            2\n          \n        \n        V\n        Q\n        =\n        \n          \n            1\n            2\n          \n        \n        C\n        \n          V\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle W=\\int _{0}^{Q}V(q)\\mathrm {d} q=\\int _{0}^{Q}{\\frac {q}{C}}\\mathrm {d} q={1 \\over 2}{Q^{2} \\over C}={1 \\over 2}VQ={1 \\over 2}CV^{2}}\n  \n\n\n\nwhere \n  \n    \n      \n        Q\n      \n    \n    {\\displaystyle Q}\n  \n is the charge stored in the capacitor, \n  \n    \n      \n        V\n      \n    \n    {\\displaystyle V}\n  \n is the voltage across the capacitor, and \n  \n    \n      \n        C\n      \n    \n    {\\displaystyle C}\n  \n is the capacitance.  This potential energy will remain in the capacitor until the charge is removed.   If charge is allowed to move back from the positive to the negative plate, for example by connecting a circuit with resistance between the plates, the charge moving under the influence of the electric field will do work on the external circuit.\n\nIf the gap between the capacitor plates \n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n is constant, as in the parallel plate model above, the electric field between the plates will be uniform (neglecting fringing fields) and will have a constant value \n  \n    \n      \n        E\n        =\n        V\n        \n          /\n        \n        d\n      \n    \n    {\\displaystyle E=V/d}\n  \n.  In this case the stored energy can be calculated from the electric field strength\n\n\n\t\n  \n    \n      \n        W\n        =\n        \n          \n            1\n            2\n          \n        \n        C\n        \n          V\n          \n            2\n          \n        \n        =\n        \n          \n            1\n            2\n          \n        \n        \n          \n            \n              ϵ\n              A\n            \n            d\n          \n        \n        (\n        E\n        d\n        \n          )\n          \n            2\n          \n        \n        =\n        \n          \n            1\n            2\n          \n        \n        ϵ\n        A\n        d\n        \n          E\n          \n            2\n          \n        \n        =\n        \n          \n            1\n            2\n          \n        \n        ϵ\n        \n          E\n          \n            2\n          \n        \n        (\n        \n          volume of electric field\n        \n        )\n      \n    \n    {\\displaystyle W={1 \\over 2}CV^{2}={1 \\over 2}{\\epsilon A \\over d}(Ed)^{2}={1 \\over 2}\\epsilon AdE^{2}={1 \\over 2}\\epsilon E^{2}({\\text{volume of electric field}})}\n  \n\n\n\nThe last formula above is equal to the energy density per unit volume in the electric field multiplied by the volume of field between the plates, confirming that the energy in the capacitor is stored in its electric field.\n\n\nCurrent–voltage relation[edit]\n\nThe current I(t) through any component in an electric circuit is defined as the rate of flow of a charge Q(t) passing through it, but actual charges—electrons—cannot pass through the dielectric layer of a capacitor. Rather, one electron accumulates on the negative plate for each one that leaves the positive plate, resulting in an electron depletion and consequent positive charge on one electrode that is equal and opposite to the accumulated negative charge on the other. Thus the charge on the electrodes is equal to the integral of the current as well as proportional to the voltage, as discussed above. As with any antiderivative, a constant of integration is added to represent the initial voltage V(t0). This is the integral form of the capacitor equation:[24]\n\n\n\t\n  \n    \n      \n        V\n        (\n        t\n        )\n        =\n        \n          \n            \n              Q\n              (\n              t\n              )\n            \n            C\n          \n        \n        =\n        \n          \n            1\n            C\n          \n        \n        \n          ∫\n          \n            \n              t\n              \n                0\n              \n            \n          \n          \n            t\n          \n        \n        I\n        (\n        τ\n        )\n        \n          d\n        \n        τ\n        +\n        V\n        (\n        \n          t\n          \n            0\n          \n        \n        )\n      \n    \n    {\\displaystyle V(t)={\\frac {Q(t)}{C}}={\\frac {1}{C}}\\int _{t_{0}}^{t}I(\\tau )\\mathrm {d} \\tau +V(t_{0})}\n  \n\n\n\nTaking the derivative of this and multiplying by C yields the derivative form:[25]\n\n\n\t\n  \n    \n      \n        I\n        (\n        t\n        )\n        =\n        \n          \n            \n              \n                d\n              \n              Q\n              (\n              t\n              )\n            \n            \n              \n                d\n              \n              t\n            \n          \n        \n        =\n        C\n        \n          \n            \n              \n                d\n              \n              V\n              (\n              t\n              )\n            \n            \n              \n                d\n              \n              t\n            \n          \n        \n      \n    \n    {\\displaystyle I(t)={\\frac {\\mathrm {d} Q(t)}{\\mathrm {d} t}}=C{\\frac {\\mathrm {d} V(t)}{\\mathrm {d} t}}}\n  \n\n\n\nThe dual of the capacitor is the inductor, which stores energy in a magnetic field rather than an electric field. Its current-voltage relation is obtained by exchanging current and voltage in the capacitor equations and replacing C with the inductance L.\n\n\nDC circuits[edit]\n\nSee also: RC circuit\n\n  \nA simple resistor-capacitor circuit demonstrates charging of a capacitor.\n\n\n\nA series circuit containing only a resistor, a capacitor, a switch and a constant DC source of voltage V0 is known as a charging circuit.[26] If the capacitor is initially uncharged while the switch is open, and the switch is closed at t0, it follows from Kirchhoff's voltage law that\n\n\n\t\n  \n    \n      \n        \n          V\n          \n            0\n          \n        \n        =\n        \n          v\n          \n            resistor\n          \n        \n        (\n        t\n        )\n        +\n        \n          v\n          \n            capacitor\n          \n        \n        (\n        t\n        )\n        =\n        i\n        (\n        t\n        )\n        R\n        +\n        \n          \n            1\n            C\n          \n        \n        \n          ∫\n          \n            \n              t\n              \n                0\n              \n            \n          \n          \n            t\n          \n        \n        i\n        (\n        τ\n        )\n        \n          d\n        \n        τ\n      \n    \n    {\\displaystyle V_{0}=v_{\\text{resistor}}(t)+v_{\\text{capacitor}}(t)=i(t)R+{\\frac {1}{C}}\\int _{t_{0}}^{t}i(\\tau )\\mathrm {d} \\tau }\n  \n\n\n\nTaking the derivative and multiplying by C, gives a first-order differential equation:\n\n\n\t\n  \n    \n      \n        R\n        C\n        \n          \n            \n              \n                d\n              \n              i\n              (\n              t\n              )\n            \n            \n              \n                d\n              \n              t\n            \n          \n        \n        +\n        i\n        (\n        t\n        )\n        =\n        0\n      \n    \n    {\\displaystyle RC{\\frac {\\mathrm {d} i(t)}{\\mathrm {d} t}}+i(t)=0}\n  \n\n\n\nAt t = 0, the voltage across the capacitor is zero and the voltage across the resistor is V0. The initial current is then I(0) =V0/R. With this assumption, solving the differential equation yields\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                I\n                (\n                t\n                )\n              \n              \n                \n                =\n                \n                  \n                    \n                      V\n                      \n                        0\n                      \n                    \n                    R\n                  \n                \n                ⋅\n                \n                  e\n                  \n                    \n                      \n                        −\n                        t\n                      \n                      \n                        τ\n                        \n                          0\n                        \n                      \n                    \n                  \n                \n              \n            \n            \n              \n                V\n                (\n                t\n                )\n              \n              \n                \n                =\n                \n                  V\n                  \n                    0\n                  \n                \n                \n                  (\n                  \n                    1\n                    −\n                    \n                      e\n                      \n                        \n                          \n                            −\n                            t\n                          \n                          \n                            τ\n                            \n                              0\n                            \n                          \n                        \n                      \n                    \n                  \n                  )\n                \n              \n            \n            \n              \n                Q\n                (\n                t\n                )\n              \n              \n                \n                =\n                C\n                ⋅\n                \n                  V\n                  \n                    0\n                  \n                \n                \n                  (\n                  \n                    1\n                    −\n                    \n                      e\n                      \n                        \n                          \n                            −\n                            t\n                          \n                          \n                            τ\n                            \n                              0\n                            \n                          \n                        \n                      \n                    \n                  \n                  )\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}I(t)&={\\frac {V_{0}}{R}}\\cdot e^{\\frac {-t}{\\tau _{0}}}\\\\V(t)&=V_{0}\\left(1-e^{\\frac {-t}{\\tau _{0}}}\\right)\\\\Q(t)&=C\\cdot V_{0}\\left(1-e^{\\frac {-t}{\\tau _{0}}}\\right)\\end{aligned}}}\n  \n\n\n\nwhere τ0 = RC, the time constant of the system. As the capacitor reaches equilibrium with the source voltage, the voltages across the resistor and the current through the entire circuit decay exponentially. In the case of a discharging capacitor, the capacitor's initial voltage (VCi) replaces V0. The equations become\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                I\n                (\n                t\n                )\n              \n              \n                \n                =\n                \n                  \n                    \n                      V\n                      \n                        C\n                        i\n                      \n                    \n                    R\n                  \n                \n                ⋅\n                \n                  e\n                  \n                    \n                      \n                        −\n                        t\n                      \n                      \n                        τ\n                        \n                          0\n                        \n                      \n                    \n                  \n                \n              \n            \n            \n              \n                V\n                (\n                t\n                )\n              \n              \n                \n                =\n                \n                  V\n                  \n                    C\n                    i\n                  \n                \n                ⋅\n                \n                  e\n                  \n                    \n                      \n                        −\n                        t\n                      \n                      \n                        τ\n                        \n                          0\n                        \n                      \n                    \n                  \n                \n              \n            \n            \n              \n                Q\n                (\n                t\n                )\n              \n              \n                \n                =\n                C\n                ⋅\n                \n                  V\n                  \n                    C\n                    i\n                  \n                \n                ⋅\n                \n                  e\n                  \n                    \n                      \n                        −\n                        t\n                      \n                      \n                        τ\n                        \n                          0\n                        \n                      \n                    \n                  \n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}I(t)&={\\frac {V_{Ci}}{R}}\\cdot e^{\\frac {-t}{\\tau _{0}}}\\\\V(t)&=V_{Ci}\\cdot e^{\\frac {-t}{\\tau _{0}}}\\\\Q(t)&=C\\cdot V_{Ci}\\cdot e^{\\frac {-t}{\\tau _{0}}}\\end{aligned}}}\n  \n\n\n\nAC circuits[edit]\n\nSee also: reactance (electronics) and electrical impedance § Deriving the device-specific impedances\n\nImpedance, the vector sum of reactance and resistance, describes the phase difference and the ratio of amplitudes between sinusoidally varying voltage and sinusoidally varying current at a given frequency. Fourier analysis allows any signal to be constructed from a spectrum of frequencies, whence the circuit's reaction to the various frequencies may be found. The reactance and impedance of a capacitor are respectively\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                X\n              \n              \n                \n                =\n                −\n                \n                  \n                    1\n                    \n                      ω\n                      C\n                    \n                  \n                \n                =\n                −\n                \n                  \n                    1\n                    \n                      2\n                      π\n                      f\n                      C\n                    \n                  \n                \n              \n            \n            \n              \n                Z\n              \n              \n                \n                =\n                \n                  \n                    1\n                    \n                      j\n                      ω\n                      C\n                    \n                  \n                \n                =\n                −\n                \n                  \n                    j\n                    \n                      ω\n                      C\n                    \n                  \n                \n                =\n                −\n                \n                  \n                    j\n                    \n                      2\n                      π\n                      f\n                      C\n                    \n                  \n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}X&=-{\\frac {1}{\\omega C}}=-{\\frac {1}{2\\pi fC}}\\\\Z&={\\frac {1}{j\\omega C}}=-{\\frac {j}{\\omega C}}=-{\\frac {j}{2\\pi fC}}\\end{aligned}}}\n  \n\n\n\nwhere j is the imaginary unit and ω is the angular frequency of the sinusoidal signal. The −j phase indicates that the AC voltage V = ZI lags the AC current by 90°: the positive current phase corresponds to increasing voltage as the capacitor charges; zero current corresponds to instantaneous constant voltage, etc.\n\nImpedance decreases with increasing capacitance and increasing frequency.[27] This implies that a higher-frequency signal or a larger capacitor results in a lower voltage amplitude per current amplitude—an AC \"short circuit\" or AC coupling. Conversely, for very low frequencies, the reactance is high, so that a capacitor is nearly an open circuit in AC analysis—those frequencies have been \"filtered out\".\n\nCapacitors are different from resistors and inductors in that the impedance is inversely proportional to the defining characteristic; i.e., capacitance.\n\nA capacitor connected to a sinusoidal voltage source causes a displacement current to flow through it. In the case that the voltage source is V0cos(ωt), the displacement current can be expressed as:\n\n\n\t\n  \n    \n      \n        I\n        =\n        C\n        \n          \n            \n              d\n              V\n            \n            \n              d\n              t\n            \n          \n        \n        =\n        −\n        ω\n        \n          C\n        \n        \n          \n            V\n            \n              0\n            \n          \n        \n        sin\n        ⁡\n        (\n        ω\n        t\n        )\n      \n    \n    {\\displaystyle I=C{\\frac {dV}{dt}}=-\\omega {C}{V_{\\text{0}}}\\sin(\\omega t)}\n  \n\n\n\nAt sin(ωt) = -1, the capacitor has a maximum (or peak) current whereby I0 = ωCV0. The ratio of peak voltage to peak current is due to capacitive reactance (denoted XC).\n\n\n  \n    \n      \n        \n          X\n          \n            C\n          \n        \n        =\n        \n          \n            \n              V\n              \n                0\n              \n            \n            \n              I\n              \n                0\n              \n            \n          \n        \n        =\n        \n          \n            \n              V\n              \n                0\n              \n            \n            \n              ω\n              C\n              \n                V\n                \n                  0\n                \n              \n            \n          \n        \n        =\n        \n          \n            1\n            \n              ω\n              C\n            \n          \n        \n      \n    \n    {\\displaystyle X_{C}={\\frac {V_{\\text{0}}}{I_{\\text{0}}}}={\\frac {V_{\\text{0}}}{\\omega CV_{\\text{0}}}}={\\frac {1}{\\omega C}}}\n  \n\n\nXC approaches zero as ω approaches infinity. If XC approaches 0, the capacitor resembles a short wire that strongly passes current at high frequencies. XC approaches infinity as ω approaches zero. If XC approaches infinity, the capacitor resembles an open circuit that poorly passes low frequencies.\n\nThe current of the capacitor may be expressed in the form of cosines to better compare with the voltage of the source:\n\n\n\t\n  \n    \n      \n        I\n        =\n        −\n        \n          \n            I\n            \n              0\n            \n          \n        \n        \n          sin\n          ⁡\n          (\n          \n            ω\n            t\n          \n        \n        )\n        =\n        \n          \n            I\n            \n              0\n            \n          \n        \n        \n          cos\n          ⁡\n          (\n          \n            ω\n            t\n          \n          +\n          \n            \n              90\n              \n                ∘\n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle I=-{I_{\\text{0}}}{\\sin({\\omega t}})={I_{\\text{0}}}{\\cos({\\omega t}+{90^{\\circ }})}}\n  \n\n\n\nIn this situation, the current is out of phase with the voltage by +π/2 radians or +90 degrees, i.e. the current leads the voltage by 90°.\n\n\nLaplace circuit analysis (s-domain)[edit]\n\nWhen using the Laplace transform in circuit analysis, the impedance of an ideal capacitor with no initial charge is represented in the s domain by:\n\n\n\t\n  \n    \n      \n        Z\n        (\n        s\n        )\n        =\n        \n          \n            1\n            \n              s\n              C\n            \n          \n        \n      \n    \n    {\\displaystyle Z(s)={\\frac {1}{sC}}}\n  \n\n\n\nwhere\n\n\n\tC is the capacitance, and\n\ts is the complex frequency.\n\n\nCircuit analysis[edit]\n\nSee also: Series and parallel circuits\n\n\tFor capacitors in parallel\n\n\n  \nSeveral capacitors in parallel\n\n\n\n  \nIllustration of the parallel connection of two capacitors\n\n\n\n\tCapacitors in a parallel configuration each have the same applied voltage. Their capacitances add up. Charge is apportioned among them by size. Using the schematic diagram to visualize parallel plates, it is apparent that each capacitor contributes to the total surface area.\n\n\n\t\t\n  \n    \n      \n        \n          C\n          \n            \n              e\n              q\n            \n          \n        \n        =\n        \n          ∑\n          \n            i\n          \n        \n        \n          C\n          \n            i\n          \n        \n        =\n        \n          C\n          \n            1\n          \n        \n        +\n        \n          C\n          \n            2\n          \n        \n        +\n        ⋯\n        +\n        \n          C\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle C_{\\mathrm {eq} }=\\sum _{i}C_{i}=C_{1}+C_{2}+\\cdots +C_{n}}\n  \n\n\n\n\n\n\n\n\tFor capacitors in series\n\n\n  \nSeveral capacitors in series\n\n\n\n  \nIllustration of the serial connection of two capacitors\n\n\n\n\tConnected in series, the schematic diagram reveals that the separation distance, not the plate area, adds up. The capacitors each store instantaneous charge build-up equal to that of every other capacitor in the series. The total voltage difference from end to end is apportioned to each capacitor according to the inverse of its capacitance. The entire series acts as a capacitor smaller than any of its components.\n\n\n\t\t\n  \n    \n      \n        \n          \n            1\n            \n              C\n              \n                \n                  e\n                  q\n                \n              \n            \n          \n        \n        =\n        \n          ∑\n          \n            i\n          \n        \n        \n          \n            1\n            \n              C\n              \n                i\n              \n            \n          \n        \n        =\n        \n          \n            1\n            \n              C\n              \n                1\n              \n            \n          \n        \n        +\n        \n          \n            1\n            \n              C\n              \n                2\n              \n            \n          \n        \n        +\n        ⋯\n        +\n        \n          \n            1\n            \n              C\n              \n                n\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\frac {1}{C_{\\mathrm {eq} }}}=\\sum _{i}{\\frac {1}{C_{i}}}={\\frac {1}{C_{1}}}+{\\frac {1}{C_{2}}}+\\cdots +{\\frac {1}{C_{n}}}}\n  \n\n\n\n\n\n\n\n\tCapacitors are combined in series to achieve a higher working voltage, for example for smoothing a high voltage power supply. The voltage ratings, which are based on plate separation, add up, if capacitance and leakage currents for each capacitor are identical. In such an application, on occasion, series strings are connected in parallel, forming a matrix. The goal is to maximize the energy storage of the network without overloading any capacitor. For high-energy storage with capacitors in series, some safety considerations must be applied to ensure one capacitor failing and leaking current does not apply too much voltage to the other series capacitors.\n\n\n\tSeries connection is also sometimes used to adapt polarized electrolytic capacitors for bipolar AC use. See electrolytic capacitor#Designing for reverse bias.\n\n\n\tVoltage distribution in parallel-to-series networks.\n\tTo model the distribution of voltages from a single charged capacitor \n  \n    \n      \n        \n          (\n          A\n          )\n        \n      \n    \n    {\\displaystyle \\left(A\\right)}\n  \n connected in parallel to a chain of capacitors in series \n  \n    \n      \n        \n          (\n          \n            B\n            \n              n\n            \n          \n          )\n        \n      \n    \n    {\\displaystyle \\left(B_{\\text{n}}\\right)}\n  \n :\n\n\n\t\t\n  \n    \n      \n        \n          \n            \n              \n                (\n                v\n                o\n                l\n                t\n                s\n                )\n                \n                  A\n                  \n                    \n                      e\n                      q\n                    \n                  \n                \n              \n              \n                \n                =\n                A\n                \n                  (\n                  \n                    1\n                    −\n                    \n                      \n                        1\n                        \n                          n\n                          +\n                          1\n                        \n                      \n                    \n                  \n                  )\n                \n              \n            \n            \n              \n                (\n                v\n                o\n                l\n                t\n                s\n                )\n                \n                  B\n                  \n                    1..n\n                  \n                \n              \n              \n                \n                =\n                \n                  \n                    A\n                    n\n                  \n                \n                \n                  (\n                  \n                    1\n                    −\n                    \n                      \n                        1\n                        \n                          n\n                          +\n                          1\n                        \n                      \n                    \n                  \n                  )\n                \n              \n            \n            \n              \n                A\n                −\n                B\n              \n              \n                \n                =\n                0\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}(volts)A_{\\mathrm {eq} }&=A\\left(1-{\\frac {1}{n+1}}\\right)\\\\(volts)B_{\\text{1..n}}&={\\frac {A}{n}}\\left(1-{\\frac {1}{n+1}}\\right)\\\\A-B&=0\\end{aligned}}}\n  \n\n\n\n\n\n\tNote: This is only correct if all capacitance values are equal.\n\n\n\tThe power transferred in this arrangement is:\n\n\n\t\t\n  \n    \n      \n        P\n        =\n        \n          \n            1\n            R\n          \n        \n        ⋅\n        \n          \n            1\n            \n              n\n              +\n              1\n            \n          \n        \n        \n          A\n          \n            volts\n          \n        \n        \n          (\n          \n            \n              A\n              \n                farads\n              \n            \n            +\n            \n              B\n              \n                farads\n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle P={\\frac {1}{R}}\\cdot {\\frac {1}{n+1}}A_{\\text{volts}}\\left(A_{\\text{farads}}+B_{\\text{farads}}\\right)}\n  \n\n\n\n\n\nNon-ideal behavior[edit]\n\n\nCapacitors deviate from the ideal capacitor equation in a number of ways. Some of these, such as leakage current and parasitic effects are linear, or can be analyzed as nearly linear, and can be dealt with by adding virtual components to the equivalent circuit of an ideal capacitor. The usual methods of network analysis can then be applied.[28] In other cases, such as with breakdown voltage, the effect is non-linear and ordinary (normal, e.g., linear) network analysis cannot be used, the effect must be dealt with separately. There is yet another group, which may be linear but invalidate the assumption in the analysis that capacitance is a constant. Such an example is temperature dependence. Finally, combined parasitic effects such as inherent inductance, resistance, or dielectric losses can exhibit non-uniform behavior at variable frequencies of operation.\n\n\n\n\nBreakdown voltage[edit]\n\nMain article: Breakdown voltage\n\nAbove a particular electric field, known as the dielectric strength Eds, the dielectric in a capacitor becomes conductive. The voltage at which this occurs is called the breakdown voltage of the device, and is given by the product of the dielectric strength and the separation between the conductors,[29]\n\n\n\t\n  \n    \n      \n        \n          V\n          \n            bd\n          \n        \n        =\n        \n          E\n          \n            ds\n          \n        \n        d\n      \n    \n    {\\displaystyle V_{\\text{bd}}=E_{\\text{ds}}d}\n  \n\n\n\nThe maximum energy that can be stored safely in a capacitor is limited by the breakdown voltage. Due to the scaling of capacitance and breakdown voltage with dielectric thickness, all capacitors made with a particular dielectric have approximately equal maximum energy density, to the extent that the dielectric dominates their volume.[30]\n\nFor air dielectric capacitors the breakdown field strength is of the order 2–5 MV/m (or kV/mm); for mica the breakdown is 100–300 MV/m; for oil, 15–25 MV/m; it can be much less when other materials are used for the dielectric.[31] The dielectric is used in very thin layers and so absolute breakdown voltage of capacitors is limited. Typical ratings for capacitors used for general electronics applications range from a few volts to 1 kV. As the voltage increases, the dielectric must be thicker, making high-voltage capacitors larger per capacitance than those rated for lower voltages.\n\nThe breakdown voltage is critically affected by factors such as the geometry of the capacitor conductive parts; sharp edges or points increase the electric field strength at that point and can lead to a local breakdown. Once this starts to happen, the breakdown quickly tracks through the dielectric until it reaches the opposite plate, leaving carbon behind and causing a short (or relatively low resistance) circuit. The results can be explosive, as the short in the capacitor draws current from the surrounding circuitry and dissipates the energy.[32] However, in capacitors with particular dielectrics[33][34] and thin metal electrodes shorts are not formed after breakdown. It happens because a metal melts or evaporates in a breakdown vicinity, isolating it from the rest of the capacitor.[35][36]\n\nThe usual breakdown route is that the field strength becomes large enough to pull electrons in the dielectric from their atoms thus causing conduction. Other scenarios are possible, such as impurities in the dielectric, and, if the dielectric is of a crystalline nature, imperfections in the crystal structure can result in an avalanche breakdown as seen in semi-conductor devices. Breakdown voltage is also affected by pressure, humidity and temperature.[37]\n\n\nEquivalent circuit[edit]\n\n  \nTwo different circuit models of a real capacitor\n\n\n\nAn ideal capacitor only stores and releases electrical energy, without dissipating any. In reality, all capacitors have imperfections within the capacitor's material that create resistance. This is specified as the equivalent series resistance or ESR of a component. This adds a real component to the impedance:\n\n\n\t\n  \n    \n      \n        \n          Z\n          \n            C\n          \n        \n        =\n        Z\n        +\n        \n          R\n          \n            ESR\n          \n        \n        =\n        \n          \n            1\n            \n              j\n              ω\n              C\n            \n          \n        \n        +\n        \n          R\n          \n            ESR\n          \n        \n      \n    \n    {\\displaystyle Z_{\\text{C}}=Z+R_{\\text{ESR}}={\\frac {1}{j\\omega C}}+R_{\\text{ESR}}}\n  \n\n\n\nAs frequency approaches infinity, the capacitive impedance (or reactance) approaches zero and the ESR becomes significant. As the reactance becomes negligible, power dissipation approaches PRMS = VRMS² /RESR.\n\nSimilarly to ESR, the capacitor's leads add equivalent series inductance or ESL to the component. This is usually significant only at relatively high frequencies. As inductive reactance is positive and increases with frequency, above a certain frequency capacitance is canceled by inductance. High-frequency engineering involves accounting for the inductance of all connections and components.\n\nIf the conductors are separated by a material with a small conductivity rather than a perfect dielectric, then a small leakage current flows directly between them. The capacitor therefore has a finite parallel resistance,[38] and slowly discharges over time (time may vary greatly depending on the capacitor material and quality).\n\n\nQ factor[edit]\n\nThe quality factor (or Q) of a capacitor is the ratio of its reactance to its resistance at a given frequency, and is a measure of its efficiency. The higher the Q factor of the capacitor, the closer it approaches the behavior of an ideal capacitor.\n\nThe Q factor of a capacitor can be found through the following formula:\n\n\n\t\n  \n    \n      \n        Q\n        =\n        \n          \n            \n              X\n              \n                C\n              \n            \n            R\n          \n        \n        =\n        \n          \n            1\n            \n              ω\n              C\n              R\n            \n          \n        \n      \n    \n    {\\displaystyle Q={\\frac {X_{C}}{R}}={\\frac {1}{\\omega CR}}}\n  \n\n\n\nwhere \n  \n    \n      \n        ω\n      \n    \n    {\\displaystyle \\omega }\n  \n is angular frequency, \n  \n    \n      \n        C\n      \n    \n    {\\displaystyle C}\n  \n is the capacitance, \n  \n    \n      \n        \n          X\n          \n            C\n          \n        \n      \n    \n    {\\displaystyle X_{C}}\n  \n is the capacitive reactance, and \n  \n    \n      \n        R\n      \n    \n    {\\displaystyle R}\n  \n is the equivalent series resistance (ESR) of the capacitor.\n\n\nRipple current[edit]\n\nRipple current is the AC component of an applied source (often a switched-mode power supply) whose frequency may be constant or varying. Ripple current causes heat to be generated within the capacitor due to the dielectric losses caused by the changing field strength together with the current flow across the slightly resistive supply lines or the electrolyte in the capacitor. The equivalent series resistance (ESR) is the amount of internal series resistance one would add to a perfect capacitor to model this.\n\nSome types of capacitors, primarily tantalum and aluminum electrolytic capacitors, as well as some film capacitors have a specified rating value for maximum ripple current.\n\n\n\tTantalum electrolytic capacitors with solid manganese dioxide electrolyte are limited by ripple current and generally have the highest ESR ratings in the capacitor family. Exceeding their ripple limits can lead to shorts and burning parts.\n\tAluminum electrolytic capacitors, the most common type of electrolytic, suffer a shortening of life expectancy at higher ripple currents. If ripple current exceeds the rated value of the capacitor, it tends to result in explosive failure.\n\tCeramic capacitors generally have no ripple current limitation and have some of the lowest ESR ratings.\n\tFilm capacitors have very low ESR ratings but exceeding rated ripple current may cause degradation failures.\n\n\nCapacitance instability[edit]\n\nThe capacitance of certain capacitors decreases as the component ages. In ceramic capacitors, this is caused by degradation of the dielectric. The type of dielectric, ambient operating and storage temperatures are the most significant aging factors, while the operating voltage usually has a smaller effect, i.e., usual capacitor design is to minimize voltage coefficient. The aging process may be reversed by heating the component above the Curie point. Aging is fastest near the beginning of life of the component, and the device stabilizes over time.[39] Electrolytic capacitors age as the electrolyte evaporates. In contrast with ceramic capacitors, this occurs towards the end of life of the component.\n\nTemperature dependence of capacitance is usually expressed in parts per million (ppm) per °C. It can usually be taken as a broadly linear function but can be noticeably non-linear at the temperature extremes. The temperature coefficient can be either positive or negative, sometimes even amongst different samples of the same type. In other words, the spread in the range of temperature coefficients can encompass zero.\n\nCapacitors, especially ceramic capacitors, and older designs such as paper capacitors, can absorb sound waves resulting in a microphonic effect. Vibration moves the plates, causing the capacitance to vary, in turn inducing AC current. Some dielectrics also generate piezoelectricity. The resulting interference is especially problematic in audio applications, potentially causing feedback or unintended recording. In the reverse microphonic effect, the varying electric field between the capacitor plates exerts a physical force, moving them as a speaker. This can generate audible sound, but drains energy and stresses the dielectric and the electrolyte, if any.\n\n\nCurrent and voltage reversal[edit]\n\nCurrent reversal occurs when the current changes direction. Voltage reversal is the change of polarity in a circuit. Reversal is generally described as the percentage of the maximum rated voltage that reverses polarity. In DC circuits, this is usually less than 100%, often in the range of 0 to 90%, whereas AC circuits experience 100% reversal.\n\nIn DC circuits and pulsed circuits, current and voltage reversal are affected by the damping of the system. Voltage reversal is encountered in RLC circuits that are underdamped. The current and voltage reverse direction, forming a harmonic oscillator between the inductance and capacitance. The current and voltage tends to oscillate and may reverse direction several times, with each peak being lower than the previous, until the system reaches an equilibrium. This is often referred to as ringing. In comparison, critically damped or overdamped systems usually do not experience a voltage reversal. Reversal is also encountered in AC circuits, where the peak current is equal in each direction.\n\nFor maximum life, capacitors usually need to be able to handle the maximum amount of reversal that a system may experience. An AC circuit experiences 100% voltage reversal, while underdamped DC circuits experience less than 100%. Reversal creates excess electric fields in the dielectric, causes excess heating of both the dielectric and the conductors, and can dramatically shorten the life expectancy of the capacitor. Reversal ratings often affect the design considerations for the capacitor, from the choice of dielectric materials and voltage ratings to the types of internal connections used.[40]\n\n\nDielectric absorption[edit]\n\nCapacitors made with any type of dielectric material show some level of \"dielectric absorption\" or \"soakage\". On discharging a capacitor and disconnecting it, after a short time it may develop a voltage due to hysteresis in the dielectric. This effect is objectionable in applications such as precision sample and hold circuits or timing circuits. The level of absorption depends on many factors, from design considerations to charging time, since the absorption is a time-dependent process. However, the primary factor is the type of dielectric material. Capacitors such as tantalum electrolytic or polysulfone film exhibit relatively high absorption, while polystyrene or Teflon allow very small levels of absorption.[41] In some capacitors where dangerous voltages and energies exist, such as in flashtubes, television sets, and defibrillators, the dielectric absorption can recharge the capacitor to hazardous voltages after it has been shorted or discharged. Any capacitor containing over 10 joules of energy is generally considered hazardous, while 50 joules or higher is potentially lethal. A capacitor may regain anywhere from 0.01 to 20% of its original charge over a period of several minutes, allowing a seemingly safe capacitor to become surprisingly dangerous.[42][43][44][45][46]\n\n\nLeakage[edit]\n\nLeakage is equivalent to a resistor in parallel with the capacitor. Constant exposure to heat can cause dielectric breakdown and excessive leakage, a problem often seen in older vacuum tube circuits, particularly where oiled paper and foil capacitors were used. In many vacuum tube circuits, interstage coupling capacitors are used to conduct a varying signal from the plate of one tube to the grid circuit of the next stage. A leaky capacitor can cause the grid circuit voltage to be raised from its normal bias setting, causing excessive current or signal distortion in the downstream tube. In power amplifiers this can cause the plates to glow red, or current limiting resistors to overheat, even fail. Similar considerations apply to component fabricated solid-state (transistor) amplifiers, but owing to lower heat production and the use of modern polyester dielectric barriers this once-common problem has become relatively rare.\n\n\nElectrolytic failure from disuse[edit]\n\nAluminum electrolytic capacitors are conditioned when manufactured by applying a voltage sufficient to initiate the proper internal chemical state. This state is maintained by regular use of the equipment. If a system using electrolytic capacitors is unused for a long period of time it can lose its conditioning. Sometimes they fail with a short circuit when next operated.\n\n\nCapacitor types[edit]\n\nMain article: Types of capacitor\n\nPractical capacitors are available commercially in many different forms. The type of internal dielectric, the structure of the plates and the device packaging all strongly affect the characteristics of the capacitor, and its applications.\n\nValues available range from very low (picofarad range; while arbitrarily low values are in principle possible, stray (parasitic) capacitance in any circuit is the limiting factor) to about 5 kF supercapacitors.\n\nAbove approximately 1 microfarad electrolytic capacitors are usually used because of their small size and low cost compared with other types, unless their relatively poor stability, life and polarised nature make them unsuitable. Very high capacity supercapacitors use a porous carbon-based electrode material.\n\n\nDielectric materials[edit]\n\n  \nCapacitor materials. From left: multilayer ceramic, ceramic disc, multilayer polyester film, tubular ceramic, polystyrene, metalized polyester film, aluminum electrolytic. Major scale divisions are in centimetres.\n\n\n\nMost capacitors have a dielectric spacer, which increases their capacitance compared to air or a vacuum. In order to maximise the charge that a capacitor can hold, the dielectric material needs to have as high a permittivity as possible, while also having as high a breakdown voltage as possible. The dielectric also needs to have as low a loss with frequency as possible.\n\nHowever, low value capacitors are available with a vacuum between their plates to allow extremely high voltage operation and low losses. Variable capacitors with their plates open to the atmosphere were commonly used in radio tuning circuits. Later designs use polymer foil dielectric between the moving and stationary plates, with no significant air space between the plates.\n\nSeveral solid dielectrics are available, including paper, plastic, glass, mica and ceramic.[14]\n\nPaper was used extensively in older capacitors and offers relatively high voltage performance. However, paper absorbs moisture, and has been largely replaced by plastic film capacitors.\n\nMost of the plastic films now used offer better stability and ageing performance than such older dielectrics such as oiled paper, which makes them useful in timer circuits, although they may be limited to relatively low operating temperatures and frequencies, because of the limitations of the plastic film being used. Large plastic film capacitors are used extensively in suppression circuits, motor start circuits, and power factor correction circuits.\n\nCeramic capacitors are generally small, cheap and useful for high frequency applications, although their capacitance varies strongly with voltage and temperature and they age poorly. They can also suffer from the piezoelectric effect. Ceramic capacitors are broadly categorized as class 1 dielectrics, which have predictable variation of capacitance with temperature or class 2 dielectrics, which can operate at higher voltage.  Modern multilayer ceramics are usually quite small, but some types have inherently wide value tolerances, microphonic issues, and are usually physically brittle.\n\nGlass and mica capacitors are extremely reliable, stable and tolerant to high temperatures and voltages, but are too expensive for most mainstream applications.\n\nElectrolytic capacitors and supercapacitors are used to store small and larger amounts of energy, respectively, ceramic capacitors are often used in resonators, and parasitic capacitance occurs in circuits wherever the simple conductor-insulator-conductor structure is formed unintentionally by the configuration of the circuit layout.\n\n\n  \nThree aluminum electrolytic capacitors of varying capacity.\n\n\n\nElectrolytic capacitors use an aluminum or tantalum plate with an oxide dielectric layer. The second electrode is a liquid electrolyte, connected to the circuit by another foil plate. Electrolytic capacitors offer very high capacitance but suffer from poor tolerances, high instability, gradual loss of capacitance especially when subjected to heat, and high leakage current. Poor quality capacitors may leak electrolyte, which is harmful to printed circuit boards. The conductivity of the electrolyte drops at low temperatures, which increases equivalent series resistance. While widely used for power-supply conditioning, poor high-frequency characteristics make them unsuitable for many applications. Electrolytic capacitors suffer from self-degradation if unused for a period (around a year), and when full power is applied may short circuit, permanently damaging the capacitor and usually blowing a fuse or causing failure of rectifier diodes. For example, in older equipment, this may cause arcing in rectifier tubes. They can be restored before use by gradually applying the operating voltage, often performed on antique vacuum tube equipment over a period of thirty minutes by using a variable transformer to supply AC power.  The use of this technique may be less satisfactory for some solid state equipment, which may be damaged by operation below its normal power range, requiring that the power supply first be isolated from the consuming circuits. Such remedies may not be applicable to modern high-frequency power supplies as these produce full output voltage even with reduced input.[citation needed]\n\nTantalum capacitors offer better frequency and temperature characteristics than aluminum, but higher dielectric absorption and leakage.[47]\n\nPolymer capacitors (OS-CON, OC-CON, KO, AO) use solid conductive polymer (or polymerized organic semiconductor) as electrolyte and offer longer life and lower ESR at higher cost than standard electrolytic capacitors.\n\nA feedthrough capacitor is a component that, while not serving as its main use, has capacitance and is used to conduct signals through a conductive sheet.\n\nSeveral other types of capacitor are available for specialist applications. Supercapacitors store large amounts of energy. Supercapacitors made from carbon aerogel, carbon nanotubes, or highly porous electrode materials, offer extremely high capacitance (up to 5 kF as of 2010[update]) and can be used in some applications instead of rechargeable batteries. Alternating current capacitors are specifically designed to work on line (mains) voltage AC power circuits. They are commonly used in electric motor circuits and are often designed to handle large currents, so they tend to be physically large. They are usually ruggedly packaged, often in metal cases that can be easily grounded/earthed. They also are designed with direct current breakdown voltages of at least five times the maximum AC voltage.\n\n\nVoltage-dependent capacitors[edit]\n\nThe dielectric constant for a number of very useful dielectrics changes as a function of the applied electrical field, for example ferroelectric materials, so the capacitance for these devices is more complex. For example, in charging such a capacitor the differential increase in voltage with charge is governed by:\n\n\n\t\n  \n    \n      \n         \n        d\n        Q\n        =\n        C\n        (\n        V\n        )\n        \n        d\n        V\n      \n    \n    {\\displaystyle \\ dQ=C(V)\\,dV}\n  \n\n\n\nwhere the voltage dependence of capacitance, C(V), suggests that the capacitance is a function of the electric field strength, which in a large area parallel plate device is given by ε = V/d. This field polarizes the dielectric, which polarization, in the case of a ferroelectric, is a nonlinear S-shaped function of the electric field, which, in the case of a large area parallel plate device, translates into a capacitance that is a nonlinear function of the voltage.[48][49]\n\nCorresponding to the voltage-dependent capacitance, to charge the capacitor to voltage V an integral relation is found:\n\n\n\t\n  \n    \n      \n        Q\n        =\n        \n          ∫\n          \n            0\n          \n          \n            V\n          \n        \n        C\n        (\n        V\n        )\n        \n        d\n        V\n         \n      \n    \n    {\\displaystyle Q=\\int _{0}^{V}C(V)\\,dV\\ }\n  \n\n\n\nwhich agrees with Q = CV only when C does not depend on voltage V.\n\nBy the same token, the energy stored in the capacitor now is given by\n\n\n\t\n  \n    \n      \n        d\n        W\n        =\n        Q\n        \n        d\n        V\n        =\n        \n          [\n          \n            \n              ∫\n              \n                0\n              \n              \n                V\n              \n            \n             \n            d\n            \n              V\n              ′\n            \n             \n            C\n            (\n            \n              V\n              ′\n            \n            )\n          \n          ]\n        \n         \n        d\n        V\n         \n        .\n      \n    \n    {\\displaystyle dW=Q\\,dV=\\left[\\int _{0}^{V}\\ dV'\\ C(V')\\right]\\ dV\\ .}\n  \n\n\n\nIntegrating:\n\n\n\t\n  \n    \n      \n        W\n        =\n        \n          ∫\n          \n            0\n          \n          \n            V\n          \n        \n         \n        d\n        V\n         \n        \n          ∫\n          \n            0\n          \n          \n            V\n          \n        \n         \n        d\n        \n          V\n          ′\n        \n         \n        C\n        (\n        \n          V\n          ′\n        \n        )\n        =\n        \n          ∫\n          \n            0\n          \n          \n            V\n          \n        \n         \n        d\n        \n          V\n          ′\n        \n         \n        \n          ∫\n          \n            \n              V\n              ′\n            \n          \n          \n            V\n          \n        \n         \n        d\n        V\n         \n        C\n        (\n        \n          V\n          ′\n        \n        )\n        =\n        \n          ∫\n          \n            0\n          \n          \n            V\n          \n        \n         \n        d\n        \n          V\n          ′\n        \n        \n          (\n          \n            V\n            −\n            \n              V\n              ′\n            \n          \n          )\n        \n        C\n        (\n        \n          V\n          ′\n        \n        )\n         \n        ,\n      \n    \n    {\\displaystyle W=\\int _{0}^{V}\\ dV\\ \\int _{0}^{V}\\ dV'\\ C(V')=\\int _{0}^{V}\\ dV'\\ \\int _{V'}^{V}\\ dV\\ C(V')=\\int _{0}^{V}\\ dV'\\left(V-V'\\right)C(V')\\ ,}\n  \n\n\n\nwhere interchange of the order of integration is used.\n\nThe nonlinear capacitance of a microscope probe scanned along a ferroelectric surface is used to study the domain structure of ferroelectric materials.[50]\n\nAnother example of voltage dependent capacitance occurs in semiconductor devices such as semiconductor diodes, where the voltage dependence stems not from a change in dielectric constant but in a voltage dependence of the spacing between the charges on the two sides of the capacitor.Template:Sze This effect is intentionally exploited in diode-like devices known as varicaps.\n\n\nFrequency-dependent capacitors[edit]\n\nIf a capacitor is driven with a time-varying voltage that changes rapidly enough, at some frequency the polarization of the dielectric cannot follow the voltage. As an example of the origin of this mechanism, the internal microscopic dipoles contributing to the dielectric constant cannot move instantly, and so as frequency of an applied alternating voltage increases, the dipole response is limited and the dielectric constant diminishes. A changing dielectric constant with frequency is referred to as dielectric dispersion, and is governed by dielectric relaxation processes, such as Debye relaxation. Under transient conditions, the displacement field can be expressed as (see electric susceptibility):\n\n\n\t\n  \n    \n      \n        \n          D\n          (\n          t\n          )\n        \n        =\n        \n          ε\n          \n            0\n          \n        \n        \n          ∫\n          \n            −\n            ∞\n          \n          \n            t\n          \n        \n         \n        \n          ε\n          \n            r\n          \n        \n        (\n        t\n        −\n        \n          t\n          ′\n        \n        )\n        \n          E\n        \n        (\n        \n          t\n          ′\n        \n        )\n         \n        d\n        \n          t\n          ′\n        \n        ,\n      \n    \n    {\\displaystyle {\\boldsymbol {D(t)}}=\\varepsilon _{0}\\int _{-\\infty }^{t}\\ \\varepsilon _{r}(t-t'){\\boldsymbol {E}}(t')\\ dt',}\n  \n\n\n\nindicating the lag in response by the time dependence of εr, calculated in principle from an underlying microscopic analysis, for example, of the dipole behavior in the dielectric. See, for example, linear response function.[51][52] The integral extends over the entire past history up to the present time. A Fourier transform in time then results in:\n\n\n\t\n  \n    \n      \n        \n          D\n        \n        (\n        ω\n        )\n        =\n        \n          ε\n          \n            0\n          \n        \n        \n          ε\n          \n            r\n          \n        \n        (\n        ω\n        )\n        \n          E\n        \n        (\n        ω\n        )\n         \n        ,\n      \n    \n    {\\displaystyle {\\boldsymbol {D}}(\\omega )=\\varepsilon _{0}\\varepsilon _{r}(\\omega ){\\boldsymbol {E}}(\\omega )\\ ,}\n  \n\n\n\nwhere εr(ω) is now a complex function, with an imaginary part related to absorption of energy from the field by the medium. See permittivity. The capacitance, being proportional to the dielectric constant, also exhibits this frequency behavior. Fourier transforming Gauss's law with this form for displacement field:\n\n\n\t\n  \n    \n      \n        I\n        (\n        ω\n        )\n        =\n        j\n        ω\n        Q\n        (\n        ω\n        )\n        =\n        j\n        ω\n        \n          \n            \n              \n                ∮\n                \n              \n            \n            \n          \n          \n            Σ\n          \n        \n        ⁡\n        \n          D\n        \n        (\n        \n          r\n        \n        ,\n         \n        ω\n        )\n        ⋅\n        d\n        \n          Σ\n        \n         \n      \n    \n    {\\displaystyle I(\\omega )=j\\omega Q(\\omega )=j\\omega \\oint _{\\Sigma }{\\boldsymbol {D}}({\\boldsymbol {r}},\\ \\omega )\\cdot d{\\boldsymbol {\\Sigma }}\\ }\n  \n\n\t\t\n  \n    \n      \n        =\n        \n          [\n          \n            G\n            (\n            ω\n            )\n            +\n            j\n            ω\n            C\n            (\n            ω\n            )\n          \n          ]\n        \n        V\n        (\n        ω\n        )\n        =\n        \n          \n            \n              V\n              (\n              ω\n              )\n            \n            \n              Z\n              (\n              ω\n              )\n            \n          \n        \n         \n        ,\n      \n    \n    {\\displaystyle =\\left[G(\\omega )+j\\omega C(\\omega )\\right]V(\\omega )={\\frac {V(\\omega )}{Z(\\omega )}}\\ ,}\n  \n\n\n\n\n\n\n\nwhere j is the imaginary unit, V(ω) is the voltage component at angular frequency ω, G(ω) is the real part of the current, called the conductance, and C(ω) determines the imaginary part of the current and is the capacitance. Z(ω) is the complex impedance.\n\nWhen a parallel-plate capacitor is filled with a dielectric, the measurement of dielectric properties of the medium is based upon the relation:\n\n\n\t\n  \n    \n      \n        \n          ε\n          \n            r\n          \n        \n        (\n        ω\n        )\n        =\n        \n          ε\n          \n            r\n          \n          ′\n        \n        (\n        ω\n        )\n        −\n        j\n        \n          ε\n          \n            r\n          \n          ″\n        \n        (\n        ω\n        )\n        =\n        \n          \n            1\n            \n              j\n              ω\n              Z\n              (\n              ω\n              )\n              \n                C\n                \n                  0\n                \n              \n            \n          \n        \n        =\n        \n          \n            \n              \n                C\n                \n                  cmplx\n                \n              \n              (\n              ω\n              )\n            \n            \n              C\n              \n                0\n              \n            \n          \n        \n         \n        ,\n      \n    \n    {\\displaystyle \\varepsilon _{r}(\\omega )=\\varepsilon '_{r}(\\omega )-j\\varepsilon ''_{r}(\\omega )={\\frac {1}{j\\omega Z(\\omega )C_{0}}}={\\frac {C_{\\text{cmplx}}(\\omega )}{C_{0}}}\\ ,}\n  \n\n\n\nwhere a single prime denotes the real part and a double prime the imaginary part, Z(ω) is the complex impedance with the dielectric present, Ccmplx(ω) is the so-called complex capacitance with the dielectric present, and C0 is the capacitance without the dielectric.[53][54] (Measurement \"without the dielectric\" in principle means measurement in free space, an unattainable goal inasmuch as even the quantum vacuum is predicted to exhibit nonideal behavior, such as dichroism. For practical purposes, when measurement errors are taken into account, often a measurement in terrestrial vacuum, or simply a calculation of C0, is sufficiently accurate.[55])\n\nUsing this measurement method, the dielectric constant may exhibit a resonance at certain frequencies corresponding to characteristic response frequencies (excitation energies) of contributors to the dielectric constant. These resonances are the basis for a number of experimental techniques for detecting defects. The conductance method measures absorption as a function of frequency.[56] Alternatively, the time response of the capacitance can be used directly, as in deep-level transient spectroscopy.[57]\n\nAnother example of frequency dependent capacitance occurs with MOS capacitors, where the slow generation of minority carriers means that at high frequencies the capacitance measures only the majority carrier response, while at low frequencies both types of carrier respond.[58][59]\n\nAt optical frequencies, in semiconductors the dielectric constant exhibits structure related to the band structure of the solid. Sophisticated modulation spectroscopy measurement methods based upon modulating the crystal structure by pressure or by other stresses and observing the related changes in absorption or reflection of light have advanced our knowledge of these materials.[60]\n\n\nStyles[edit]\n\n  \nCapacitor packages: SMD ceramic at top left; SMD tantalum at bottom left; through-hole tantalum at top right; through-hole electrolytic at bottom right. Major scale divisions are cm.\n\n\n\nThe arrangement of plates and dielectric has many variations in different styles depending on the desired ratings of the capacitor. For small values of capacitance (microfarads and less), ceramic disks use metallic coatings, with wire leads bonded to the coating. Larger values can be made by multiple stacks of plates and disks. Larger value capacitors usually use a metal foil or metal film layer deposited on the surface of a dielectric film to make the plates, and a dielectric film of impregnated paper or plastic – these are rolled up to save space. To reduce the series resistance and inductance for long plates, the plates and dielectric are staggered so that connection is made at the common edge of the rolled-up plates, not at the ends of the foil or metalized film strips that comprise the plates.\n\nThe assembly is encased to prevent moisture entering the dielectric – early radio equipment used a cardboard tube sealed with wax. Modern paper or film dielectric capacitors are dipped in a hard thermoplastic. Large capacitors for high-voltage use may have the roll form compressed to fit into a rectangular metal case, with bolted terminals and bushings for connections. The dielectric in larger capacitors is often impregnated with a liquid to improve its properties.\n\n\n  \nSeveral axial-lead electrolytic capacitors\n\n\nCapacitors may have their connecting leads arranged in many configurations, for example axially or radially. \"Axial\" means that the leads are on a common axis, typically the axis of the capacitor's cylindrical body – the leads extend from opposite ends. Radial leads are rarely aligned along radii of the body's circle, so the term is conventional. The leads (until bent) are usually in planes parallel to that of the flat body of the capacitor, and extend in the same direction; they are often parallel as manufactured.\n\nSmall, cheap discoidal ceramic capacitors have existed from the 1930s onward, and remain in widespread use. After the 1980s, surface mount packages for capacitors have been widely used. These packages are extremely small and lack connecting leads, allowing them to be soldered directly onto the surface of printed circuit boards. Surface mount components avoid undesirable high-frequency effects due to the leads and simplify automated assembly, although manual handling is made difficult due to their small size.\n\nMechanically controlled variable capacitors allow the plate spacing to be adjusted, for example by rotating or sliding a set of movable plates into alignment with a set of stationary plates. Low cost variable capacitors squeeze together alternating layers of aluminum and plastic with a screw. Electrical control of capacitance is achievable with varactors (or varicaps), which are reverse-biased semiconductor diodes whose depletion region width varies with applied voltage. They are used in phase-locked loops, amongst other applications.\n\n\nCapacitor markings[edit]\n\nSee also: E-series of preferred numbers\n\nMost capacitors have numbers printed on their bodies to indicate their electrical characteristics. Larger capacitors like electrolytics usually display the actual capacitance together with the unit, for example, 220 μF. Smaller capacitors like ceramics, however, use a shorthand-notation consisting of three digits and a letter, where the digits indicate the capacitance in pF, calculated as XY × 10Z for digits XYZ, and the letter indicates the tolerance. Common tolerance indications are J, K, and M for ±5%, ±10%, and ±20%, respectively.\n\nAdditionally, the capacitor may be labeled with its working voltage, temperature and other relevant characteristics.\n\nFor typographical reasons, some manufacturers print MF on capacitors to indicate microfarads (μF).[61]\n\n\n\tExample\n\n\nA capacitor labeled or designated as 473K 330V has a capacitance of 47 × 103 pF = 47 nF (±10%) with a maximum working voltage of 330 V. The working voltage of a capacitor is nominally the highest voltage that may be applied across it without undue risk of breaking down the dielectric layer.\n\n\nRKM code[edit]\n\nThe notation to state a capacitor's value in a circuit diagram varies. The RKM code following IEC 60062 and BS 1852 avoids using a decimal separator and replaces the decimal separator with the SI prefix symbol for the particular value (and the letter F for weight 1). Example: 4n7 for 4.7 nF or 2F2 for 2.2 F.\n\n\nHistorical[edit]\n\nSee also: Farad § Informal and deprecated terminology\n\nIn texts prior to 1960s and on some capacitor packages until more recently,[14] obsolete capacitance units were utilized in electronic books,[62] magazines, and electronics catalogs.[63] The old units \"mfd\" and \"mf\" meant microfarad (µF); and the old units \"mmfd\", \"mmf\", \"uuf\", \"µµf\", \"pfd\" meant picofarad (pF); but they are rarely used any more.[64]  Also, \"Micromicrofarad\" or \"micro-microfarad\" are obsolete units that are found in some older texts that is equivalent to picofarad (pF).[62]\n\n\nApplications[edit]\n\nMain article: Applications of capacitors\n\n  \nThis mylar-film, oil-filled capacitor has very low inductance and low resistance, to provide the high-power (70 megawatt) and high speed (1.2 microsecond) discharge needed to operate a dye laser.\n\n\n\nEnergy storage[edit]\n\nA capacitor can store electric energy when disconnected from its charging circuit, so it can be used like a temporary battery, or like other types of rechargeable energy storage system.[65] Capacitors are commonly used in electronic devices to maintain power supply while batteries are being changed. (This prevents loss of information in volatile memory.)\n\nA capacitor can facilitate conversion of kinetic energy of charged particles into electric energy and store it.[66]\n\nConventional capacitors provide less than 360 joules per kilogram of specific energy, whereas a conventional alkaline battery has a density of 590 kJ/kg. There is \nan intermediate solution: Supercapacitors, which can accept and deliver charge much faster than batteries, and tolerate many more charge and discharge cycles than rechargeable batteries. They are, however, 10 times larger than conventional batteries for a given charge. On the other hand, it has been shown that the amount of charge stored in the dielectric \nlayer of the thin film capacitor can be equal to, or can even exceed, the amount of charge stored on its plates.[67]\n\nIn car audio systems, large capacitors store energy for the amplifier to use on demand. Also, for a flash tube, a capacitor is used to hold the high voltage.\n\n\nDigital memory[edit]\n\nIn the 1930s, John Atanasoff applied the principle of energy storage in capacitors to construct dynamic digital memories for the first binary computers that used electron tubes for logic.[68]\n\n\nPulsed power and weapons[edit]\n\nGroups of large, specially constructed, low-inductance high-voltage capacitors (capacitor banks) are used to supply huge pulses of current for many pulsed power applications. These include electromagnetic forming, Marx generators, pulsed lasers (especially TEA lasers), pulse forming networks, radar, fusion research, and particle accelerators.\n\nLarge capacitor banks (reservoir) are used as energy sources for the exploding-bridgewire detonators or slapper detonators in nuclear weapons and other specialty weapons. Experimental work is under way using banks of capacitors as power sources for electromagnetic armour and electromagnetic railguns and coilguns.\n\n\nPower conditioning[edit]\n\n  \nA 10,000 microfarad capacitor in an amplifier power supply\n\n\n\nReservoir capacitors are used in power supplies where they smooth the output of a full or half wave rectifier. They can also be used in charge pump circuits as the energy storage element in the generation of higher voltages than the input voltage.\n\nCapacitors are connected in parallel with the power circuits of most electronic devices and larger systems (such as factories) to shunt away and conceal current fluctuations from the primary power source to provide a \"clean\" power supply for signal or control circuits. Audio equipment, for example, uses several capacitors in this way, to shunt away power line hum before it gets into the signal circuitry. The capacitors act as a local reserve for the DC power source, and bypass AC currents from the power supply. This is used in car audio applications, when a stiffening capacitor compensates for the inductance and resistance of the leads to the lead-acid car battery.\n\n\nPower factor correction[edit]\n\n  \nA high-voltage capacitor bank used for power factor correction on a power transmission system\n\n\n\nIn electric power distribution, capacitors are used for power factor correction. Such capacitors often come as three capacitors connected as a three phase load. Usually, the values of these capacitors are not given in farads but rather as a reactive power in volt-amperes reactive (var). The purpose is to counteract inductive loading from devices like electric motors and transmission lines to make the load appear to be mostly resistive. Individual motor or lamp loads may have capacitors for power factor correction, or larger sets of capacitors (usually with automatic switching devices) may be installed at a load center within a building or in a large utility substation.\n\n\nSuppression and coupling[edit]\n\nSignal coupling[edit]\n\nMain article: capacitive coupling\n\n  \nPolyester film capacitors are frequently used as coupling capacitors.\n\n\n\nBecause capacitors pass AC but block DC signals (when charged up to the applied DC voltage), they are often used to separate the AC and DC components of a signal. This method is known as AC coupling or \"capacitive coupling\". Here, a large value of capacitance, whose value need not be accurately controlled, but whose reactance is small at the signal frequency, is employed.\n\n\nDecoupling[edit]\n\nMain article: decoupling capacitor\n\nA decoupling capacitor is a capacitor used to protect one part of a circuit from the effect of another, for instance to suppress noise or transients. Noise caused by other circuit elements is shunted through the capacitor, reducing the effect they have on the rest of the circuit. It is most commonly used between the power supply and ground.\nAn alternative name is bypass capacitor as it is used to bypass the power supply or other high impedance component of a circuit.\n\nDecoupling capacitors need not always be discrete components. Capacitors used in these applications may be built into a printed circuit board, between the various layers. These are often referred to as embedded capacitors.[69] The layers in the board contributing to the capacitive properties also function as power and ground planes, and have a dielectric in between them, enabling them to operate as a parallel plate capacitor.\n\n\nHigh-pass and low-pass filters[edit]\n\nFurther information: High-pass filter and Low-pass filter\n\nNoise suppression, spikes, and snubbers[edit]\n\nFurther information: High-pass filter and Low-pass filter\n\nWhen an inductive circuit is opened, the current through the inductance collapses quickly, creating a large voltage across the open circuit of the switch or relay. If the inductance is large enough, the energy may generate a spark, causing the contact points to oxidize, deteriorate, or sometimes weld together, or destroying a solid-state switch. A snubber capacitor across the newly opened circuit creates a path for this impulse to bypass the contact points, thereby preserving their life; these were commonly found in contact breaker ignition systems, for instance. Similarly, in smaller scale circuits, the spark may not be enough to damage the switch but may still radiate undesirable radio frequency interference (RFI), which a filter capacitor absorbs. Snubber capacitors are usually employed with a low-value resistor in series, to dissipate energy and minimize RFI. Such resistor-capacitor combinations are available in a single package.\n\nCapacitors are also used in parallel with interrupting units of a high-voltage circuit breaker to equally distribute the voltage between these units. These are called \"grading capacitors\".\n\nIn schematic diagrams, a capacitor used primarily for DC charge storage is often drawn vertically in circuit diagrams with the lower, more negative, plate drawn as an arc. The straight plate indicates the positive terminal of the device, if it is polarized (see electrolytic capacitor).\n\n\nMotor starters[edit]\n\nMain article: motor capacitor\n\nIn single phase squirrel cage motors, the primary winding within the motor housing is not capable of starting a rotational motion on the rotor, but is capable of sustaining one. To start the motor, a secondary \"start\" winding has a series non-polarized starting capacitor to introduce a lead in the sinusoidal current. When the secondary (start) winding is placed at an angle with respect to the primary (run) winding, a rotating electric field is created. The force of the rotational field is not constant, but is sufficient to start the rotor spinning. When the rotor comes close to operating speed, a centrifugal switch (or current-sensitive relay in series with the main winding) disconnects the capacitor. The start capacitor is typically mounted to the side of the motor housing. These are called capacitor-start motors, that have relatively high starting torque. Typically they can have up-to four times as much starting torque than a split-phase motor and are used on applications such as compressors, pressure washers and any small device requiring high starting torques.\n\nCapacitor-run induction motors have a permanently connected phase-shifting capacitor in series with a second winding. The motor is much like a two-phase induction motor.\n\nMotor-starting capacitors are typically non-polarized electrolytic types, while running capacitors are conventional paper or plastic film dielectric types.\n\n\nSignal processing[edit]\n\nThe energy stored in a capacitor can be used to represent information, either in binary form, as in DRAMs, or in analogue form, as in analog sampled filters and CCDs. Capacitors can be used in analog circuits as components of integrators or more complex filters and in negative feedback loop stabilization. Signal processing circuits also use capacitors to integrate a current signal.\n\n\nTuned circuits[edit]\n\nCapacitors and inductors are applied together in tuned circuits to select information in particular frequency bands. For example, radio receivers rely on variable capacitors to tune the station frequency. Speakers use passive analog crossovers, and analog equalizers use capacitors to select different audio bands.\n\nThe resonant frequency f of a tuned circuit is a function of the inductance (L) and capacitance (C) in series, and is given by:\n\n\n\t\n  \n    \n      \n        f\n        =\n        \n          \n            1\n            \n              2\n              π\n              \n                \n                  L\n                  C\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle f={\\frac {1}{2\\pi {\\sqrt {LC}}}}}\n  \n\n\n\nwhere L is in henries and C is in farads.\n\n\nSensing[edit]\n\n\tMain article: capacitive sensing\n\n\tMain article: Capacitive displacement sensor\n\n\n\nMost capacitors are designed to maintain a fixed physical structure. However, various factors can change the structure of the capacitor, and the resulting change in capacitance can be used to sense those factors.\n\nChanging the dielectric:\n\n\n\n\tThe effects of varying the characteristics of the dielectric can be used for sensing purposes. Capacitors with an exposed and porous dielectric can be used to measure humidity in air. Capacitors are used to accurately measure the fuel level in airplanes; as the fuel covers more of a pair of plates, the circuit capacitance increases. Squeezing the dielectric can change a capacitor at a few tens of bar pressure sufficiently that it can be used as a pressure sensor.[70] A selected, but otherwise standard, polymer dielectric capacitor, when immersed in a compatible gas or liquid, can work usefully as a very low cost pressure sensor up to many hundreds of bar.\n\n\nChanging the distance between the plates:\n\n\n\n\tCapacitors with a flexible plate can be used to measure strain or pressure. Industrial pressure transmitters used for process control use pressure-sensing diaphragms, which form a capacitor plate of an oscillator circuit. Capacitors are used as the sensor in condenser microphones, where one plate is moved by air pressure, relative to the fixed position of the other plate. Some accelerometers use MEMS capacitors etched on a chip to measure the magnitude and direction of the acceleration vector. They are used to detect changes in acceleration, in tilt sensors, or to detect free fall, as sensors triggering airbag deployment, and in many other applications. Some fingerprint sensors use capacitors. Additionally, a user can adjust the pitch of a theremin musical instrument by moving their hand since this changes the effective capacitance between the user's hand and the antenna.\n\n\nChanging the effective area of the plates:\n\n\n\n\tCapacitive touch switches are now[when?] used on many consumer electronic products.\n\n\nOscillators[edit]\n\nFurther information: Hartley oscillator\n\n  \nExample of a simple oscillator incorporating a capacitor\n\n\n\nA capacitor can possess spring-like qualities in an oscillator circuit. In the image example, a capacitor acts to influence the biasing voltage at the npn transistor's base. The resistance values of the voltage-divider resistors and the capacitance value of the capacitor together control the oscillatory frequency.\n\n\nProducing light[edit]\n\nMain article: light emitting capacitor\n\nA light-emitting capacitor is made from a dielectric that uses phosphorescence to produce light. If one of the conductive plates is made with a transparent material, the light is visible. Light-emitting capacitors are used in the construction of electroluminescent panels, for applications such as backlighting for laptop computers. In this case, the entire panel is a capacitor used for the purpose of generating light.\n\n\nHazards and safety[edit]\n\nThe hazards posed by a capacitor are usually determined, foremost, by the amount of energy stored, which is the cause of things like electrical burns or heart fibrillation. Factors such as voltage and chassis material are of secondary consideration, which are more related to how easily a shock can be initiated rather than how much damage can occur.[46] Under certain conditions, including conductivity of the surfaces, preexisting medical conditions, the humidity of the air, or the pathways it takes through the body (i.e.: shocks that travel across the core of the body and, especially, the heart are more dangerous than those limited to the extremities), shocks as low as one joule have been reported to cause death, although in most instances they may not even leave a burn. Shocks over ten joules will generally damage skin, and are usually considered hazardous. Any capacitor that can store 50 joules or more should be considered potentially lethal.[71][46]\n\nCapacitors may retain a charge long after power is removed from a circuit; this charge can cause dangerous or even potentially fatal shocks or damage connected equipment. For example, even a seemingly innocuous device such as a disposable-camera flash unit, powered by a 1.5 volt AA battery, has a capacitor which may contain over 15 joules of energy and be charged to over 300 volts. This is easily capable of delivering a shock. Service procedures for electronic devices usually include instructions to discharge large or high-voltage capacitors, for instance using a Brinkley stick. Capacitors may also have built-in discharge resistors to dissipate stored energy to a safe level within a few seconds after power is removed. High-voltage capacitors are stored with the terminals shorted, as protection from potentially dangerous voltages due to dielectric absorption or from transient voltages the capacitor may pick up from static charges or passing weather events.[46]\n\nSome old, large oil-filled paper or plastic film capacitors contain polychlorinated biphenyls (PCBs). It is known that waste PCBs can leak into groundwater under landfills. Capacitors containing PCB were labelled as containing \"Askarel\" and several other trade names. PCB-filled paper capacitors are found in very old (pre-1975) fluorescent lamp ballasts, and other applications.\n\nCapacitors may catastrophically fail when subjected to voltages or currents beyond their rating, or as they reach their normal end of life. Dielectric or metal interconnection failures may create arcing that vaporizes the dielectric fluid, resulting in case bulging, rupture, or even an explosion. Capacitors used in RF or sustained high-current applications can overheat, especially in the center of the capacitor rolls. Capacitors used within high-energy capacitor banks can violently explode when a short in one capacitor causes sudden dumping of energy stored in the rest of the bank into the failing unit. High voltage vacuum capacitors can generate soft X-rays even during normal operation. Proper containment, fusing, and preventive maintenance can help to minimize these hazards.\n\nHigh-voltage capacitors may benefit from a pre-charge to limit in-rush currents at power-up of high voltage direct current (HVDC) circuits. This extends the life of the component and may mitigate high-voltage hazards.\n\n\n\t\n\t\t\t\n\n\n\t\t\t\nSwollen electrolytic capacitors – the special design of the capacitor tops allows them to vent instead of bursting violently\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nThis high-energy capacitor from a defibrillator has a resistor connected between the terminals for safety, to dissipate stored energy.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nCatastrophic failure of a capacitor has scattered fragments of paper and metallic foil\n\n\n\t\t\t\n\n\t\t\n\n\n\nSee also[edit]\n\n\n\tElectronics portal\n\n\n\n\n\tCapacitance meter\n\tCapacitor plague\n\tElectric displacement field\n\tElectroluminescence\n\n\n\n\nReferences[edit]\n\n\n\t^ a b Duff, Wilmer (1908–1916). A Text-Book of Physics (4th ed.). Philadelphia: P. Blakiston's Son & Co. p. 361. Retrieved 1 December 2016.\n\n\t^ Bird, John (2010). Electrical and Electronic Principles and Technology. Routledge. pp. 63–76. ISBN 9780080890562. Retrieved 2013-03-17.\n\n\n\t^ Floyd, Thomas (1984–2005). Electronic Devices (7th ed.). Upper Saddle River, NJ: Pearson Education. p. 10. ISBN 0-13-127827-4.\n\n\n\t^ Williams, Henry Smith. \"A History of Science Volume II, Part VI: The Leyden Jar Discovered\". Retrieved 2013-03-17.\n\n\n\t^ Keithley, Joseph F. (1999). The Story of Electrical and Magnetic Measurements: From 500 BC to the 1940s. John Wiley & Sons. p. 23. ISBN 9780780311930. Retrieved 2013-03-17.\n\n\n\t^ Houston, Edwin J. (1905). Electricity in Every-day Life. P. F. Collier & Son. p. 71. Retrieved 2013-03-17.\n\n\n\t^ Benjamin, Park (1895). A History of Electricity: (The Intellectual Rise in Electricity) from Antiquity to the Days of Benjamin Franklin. J. Wiley & Sons. pp. 522–524.\n\n\n\t^ Isaacson, Walter (2003). Benjamin Franklin: An American Life. Simon and Schuster. p. 136. ISBN 9780743260848. Retrieved 2013-03-17.\n\n\n\t^ Franklin, Benjamin (1749-04-29). \"Experiments & Observations on Electricity: Letter IV to Peter Collinson\" (PDF). p. 28. Retrieved 2009-08-09.\n\n\n\t^ Morse, Robert A. (September 2004). \"Franklin and Electrostatics—Ben Franklin as my Lab Partner\" (PDF). Wright Center for Science Education. Tufts University. p. 23. Retrieved 2009-08-10. After Volta’s discovery of the electrochemical cell in 1800, the term was then applied to a group of electrochemical cells\n\n\n\t^ \"eFunda: Glossary: Units: Electric Capacitance: Jar\". eFunda. Retrieved 2013-03-17.\n\n\n\t^ \"Sketch of Alessandro Volta\". The Popular Science Monthly. New York: Bonnier Corporation: 118–119. May 1892. ISSN 0161-7370.\n\n\n\t^ British Engineering Standards Association, British Standard Glossary of Terms in Electrical Engineering, C. Lockwood & son, 1926\n\n\t^ a b c d e f Ho, Janet; Jow, T. Richard; Boggs, Steven (Jan 2010). \"Historical Introduction to Capacitor Technology\". IEEE Electrical Insulation Magazine. 26 (1): 20–25. doi:10.1109/mei.2010.5383924.\n\n\n\t^ US 2800616, Becker, H.I., \"Low voltage electrolytic capacitor\", issued 1957-07-23 \n\n\t^ A brief history of supercapacitors AUTUMN 2007 Batteries & Energy Storage Technology Archived 2014-01-06 at the Wayback Machine\n\n\t^ a b Ulaby 1999, p. 168.\n\n\t^ Ulaby 1999, p. 157.\n\n\t^ Ulaby 1999, p. 69.\n\n\t^ Pillai, K. P. P. (1970). \"Fringing field of finite parallel-plate capacitors\". Proceedings of the Institution of Electrical Engineers. 117 (6): 1201–1204. doi:10.1049/piee.1970.0232.\n\n\n\t^ a b Purcell, Edward (2011). Electricity and Magnetism, 2nd Ed. Cambridge University Press. pp. 110–111. ISBN 978-1139503556.\n\n\n\t^ a b Serway, Raymond A.; Vuille, Chris (2014). College Physics, 10th Ed. Cengage Learning. p. 582. ISBN 978-1305142824.\n\n\n\t^ Hammond, P. (22 October 2013). Electromagnetism for Engineers: An Introductory Course. Elsevier Science. pp. 44–45. ISBN 978-1-4831-4978-3.\n\n\n\t^ Dorf & Svoboda 2001, p. 263.\n\n\t^ Dorf & Svoboda 2001, p. 260.\n\n\t^ \"Capacitor charging and discharging\". All About Circuits. Retrieved 2009-02-19.\n\n\n\t^ Current percolation through resistors and capacitors PLoS one 2017\n\n\t^ Scaling in binary percolation networks\n\n\t^ Ulaby 1999, p. 170.\n\n\t^ Pai, S. T.; Qi Zhang (1995). Introduction to High Power Pulse Technology. Advanced Series in Electrical and Computer Engineering. 10. World Scientific. ISBN 9789810217143. Retrieved 2013-03-17.\n\n\n\t^ Dyer, Stephen A. (2004). Wiley Survey of Instrumentation and Measurement. John Wiley & Sons. p. 397. ISBN 9780471221654. Retrieved 2013-03-17.\n\n\n\t^ Scherz, Paul (2006). Practical Electronics for Inventors (2nd ed.). McGraw Hill Professional. p. 100. ISBN 9780071776448. Retrieved 2013-03-17.\n\n\n\t^ Inuishi, Y.; Powers, D.A. (1957). \"Electric breakdown and conduction through Mylar films\". J. Appl. Phys. 28 (9): 1017–1022. Bibcode:1957JAP....28.1017I. doi:10.1063/1.1722899.\n\n\n\t^ Reed, C.W.; Cichanowski, S.W. (1994). \"The fundamentals of aging in HV polymer-film capacitors\". IEEE Transactions on Dielectrics and Electrical Insulation. 1 (5): 904–922. doi:10.1109/94.326658.\n\n\n\t^ Klein, N.; Gafni, H. (1966). \"The maximum dielectric strength of thin silicon oxide films\". IEEE Transactions on Electron Devices. 13 (2): 281–289. Bibcode:1966ITED...13..281K. doi:10.1109/T-ED.1966.15681.\n\n\n\t^ Belkin, A.;  et al. (2017). \"Recovery of alumina nanocapacitors after high voltage breakdown\". Scientific Reports. 7 (1): 932. Bibcode:2017NatSR...7..932B. doi:10.1038/s41598-017-01007-9. PMC 5430567. PMID 28428625.\n\n\n\t^ Bird, John (2007). Electrical Circuit Theory and Technology. Routledge. p. 501. ISBN 9780750681391. Retrieved 2013-03-17.\n\n\n\t^ Ulaby 1999, p. 169.\n\n\t^ \"Ceramic Capacitor Aging Made Simple\". Johanson Dielectrics. 2012-05-21. Retrieved 2013-03-17.\n\n\n\t^ \"The Effect of Reversal on Capacitor Life\" (PDF). Engineering Bulletin 96-004. Sorrento Electronics. November 2003. Archived from the original (PDF) on 2014-07-14. Retrieved 2013-03-17.\n\n\n\t^ Kaiser, Cletus J. (6 December 2012). The Capacitor Handbook. Springer Science & Business Media. ISBN 978-94-011-8090-0.\n\n\n\t^ Electronics. McGraw-Hill 1960 p. 90\n\n\t^ Xenon Strobe and Flash Safety Hints. donklipstein.com. May 29, 2006\n\n\t^ Prutchi, David (28 February 2012). Exploring Quantum Physics through Hands-on Projects. John Wiley & Sons. p. 10. ISBN 978-1-118-17070-0.\n\n\n\t^ Dixit, J. B.; Yadav, Amit (2010). Electrical Power Quality. Laxmi Publications, Ltd. p. 63. ISBN 978-93-80386-74-4.\n\n\n\t^ a b c d Winburn (13 November 1989). Practical Laser Safety, Second Edition. CRC Press. p. 189. ISBN 978-0-8247-8240-5.\n\n\n\t^ Guinta, Steve. \"Ask The Applications Engineer – 21\". Analog Devices. Retrieved 2013-03-17.\n\n\n\t^ Carlos Paz de Araujo; Ramamoorthy Ramesh; George W Taylor, eds. (2001). Science and Technology of Integrated Ferroelectrics: Selected Papers from Eleven Years of the Proceedings of the International Symposium on Integrated Ferroelectrics. CRC Press. Figure 2, p. 504. ISBN 90-5699-704-1.\n\n\n\t^ Solomon Musikant (1991). What Every Engineer Should Know about Ceramics. CRC Press. Figure 3.9, p. 43. ISBN 0-8247-8498-7.\n\n\n\t^ Yasuo Cho (2005). Scanning Nonlinear Dielectric Microscope (in Polar Oxides; R Waser, U Böttger & S Tiedke, editors ed.). Wiley-VCH. Chapter 16. ISBN 3-527-40532-1.\n\n\n\t^ Gabriele Giuliani; Giovanni Vignale (2005). Quantum Theory of the Electron Liquid. Cambridge University Press. p. 111. ISBN 0-521-82112-6.\n\n\n\t^ Jørgen Rammer (2007). Quantum Field Theory of Non-equilibrium States. Cambridge University Press. p. 158. ISBN 978-0-521-87499-1.\n\n\n\t^ Horst Czichos; Tetsuya Saito; Leslie Smith (2006). Springer Handbook of Materials Measurement Methods. Springer. p. 475. ISBN 3-540-20785-6.\n\n\n\t^ William Coffey; Yu. P. Kalmykov (2006). Fractals, diffusion and relaxation in disordered complex systems..Part A. Wiley. p. 17. ISBN 0-470-04607-4.\n\n\n\t^ 2005 IEEE Instrumentation and Measurement Technology Conference (IMTC): Ottawa, Ontario Canada, 16–19 May 2005. IEEE. 2005. pp. 1350–1353. doi:10.1109/IMTC.2005.1604368. ISBN 978-0-7803-8879-6.\n\n\n\t^ Schroder 2006, p. 347.\n\n\t^ Schroder 2006, p. 305.\n\n\t^ Sze & Ng 2006, p. 217.\n\n\t^ Safa O. Kasap; Peter Capper (2006). Springer Handbook of Electronic and Photonic Materials. Springer. Figure 20.22, p. 425.\n\n\n\t^ PY Yu; Cardona, Manuel (2001). Fundamentals of Semiconductors (3rd ed.). Springer. §6.6 \"Modulation Spectroscopy\". ISBN 3-540-25470-6.\n\n\n\t^ Kaplan, Daniel M.; White, Christopher G. (15 May 2003). Hands-On Electronics: A Practical Introduction to Analog and Digital Circuits. Cambridge University Press. p. 19. ISBN 978-0-521-89351-0.\n\n\n\t^ a b Fundamentals of Electronics – Volume 1b – Basic Electricity – Alternating Current; Bureau of Naval Personnel; 1965; page 197.\n\n\t^ \"1930 Catalog – Page 139 – Capacitors (Condensers)\". Allied Radio. Archived from the original on 11 July 2017. Retrieved 11 July 2017.\n\n\n\t^ Capacitor MF-MMFD Conversion Chart; Just Radios.\n\n\t^ Miller, Charles (2011). Illustrated Guide to the National Electrical Code. Cengage Learning. p. 445.\n\n\n\t^ Shinn, Eric; et., al. (2012). \"Nuclear energy conversion with stacks of graphene nanocapacitors\". Complexity. 18 (3): 24. Bibcode:2013Cmplx..18c..24S. doi:10.1002/cplx.21427.\n\n\n\t^ Bezryadin, A.; Belkin, A.; et., al. (2017). \"Large energy storage efficiency of the dielectric layer of graphene nanocapacitors\". Nanotechnology. 28 (49): 495401. Bibcode:2017Nanot..28W5401B. doi:10.1088/1361-6528/aa935c. PMID 29027908.\n\n\n\t^ Floyd, Thomas L. (5 January 2017). Electronic Devices. Pearson. p. 10. ISBN 978-0-13-441444-7.\n\n\n\t^ Alam, Mohammed; Michael H. Azarian; Michael Osterman; Michael Pecht (2010). \"Effectiveness of embedded capacitors in reducing the number of surface mount capacitors for decoupling applications\". Circuit World. 36 (1): 22. doi:10.1108/03056121011015068.\n\n\n\t^ Downie, Neil A and Mathilde Pradier, 'Method and apparatus for monitoring fluid pressure\", US Patent 7526961 (2009)\n\n\t^ \"Some Xenon Strobe and Flash Safety Hints\".\n\n\n\n\n\nBibliography[edit]\n\n\tDorf, Richard C.; Svoboda, James A. (2001). Introduction to Electric Circuits (5th ed.). New York: John Wiley & Sons. ISBN 9780471386896.\n\n\tPhilosophical Transactions of the Royal Society LXXII, Appendix 8, 1782 (Volta coins the word condenser)\n\tUlaby, Fawwaz Tayssir (1999). Fundamentals of Applied Electromagnetics. Upper Saddle River, New Jersey: Prentice Hall. ISBN 9780130115546.\n\n\tZorpette, Glenn (2005). \"Super Charged: A Tiny South Korean Company is Out to Make Capacitors Powerful enough to Propel the Next Generation of Hybrid-Electric Cars\". IEEE Spectrum (North American ed.). 42 (1): 32. doi:10.1109/MSPEC.2005.1377872.\n\n\tDeshpande, R.P. (5 November 2014). Capacitors. McGraw-Hill Education. ISBN 978-0-07-184856-5.\n\n\tSchroder, Dieter K (2006). Semiconductor Material and Device Characterization (3rd ed.). Wiley. p. 270 ff. ISBN 0-471-73906-5.\n\n\tSze, Simon M.; Ng, Kwok K. (2006). Physics of Semiconductor Devices (3rd ed.). Wiley. ISBN 0-470-06830-2.\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Capacitors and Capacitors (SMD).\n\n\n\t\tThe Wikibook Electronics has a page on the topic of: Capacitors\n\n\n\t\tLook up capacitor in Wiktionary, the free dictionary.\n\n\n\tThe First Condenser – A Beer Glass – SparkMuseum\n\tHow Capacitors Work – Howstuffworks\n\tIntroduction to Capacitors – CapSite\n\tCapacitor Tutorial\n\n\n\t\tv\n\tt\n\te\n\n\nElectronic components\n\n\tSemiconductor\ndevices\t\n\tMOS transistors\t\n\tBiCMOS\n\tComplementary MOS (CMOS)\n\tDepletion-load NMOS\n\tFin field-effect transistor (FinFET)\n\tFloating-gate MOSFET (FGMOS)\n\tInsulated-gate bipolar transistor (IGBT)\n\tLateral diffused MOS (LDMOS)\n\tMOS field-effect transistor (MOSFET)\n\tMulti-gate field-effect transistor (MuGFET)\n\tNMOS\n\tPMOS\n\tPower MOSFET\n\tThin-film transistor (TFT)\n\tVMOS\n\n\n\n\n\tOther transistors\t\n\tBipolar junction transistor (BJT)\n\tDarlington transistor\n\tDiffusion transistor\n\tField-effect transistor (FET)\n\tJFET\n\tLight-emitting transistor (LET)\n\tOrganic field-effect transistor (OFET)\n\tOrganic light-emitting transistor (OLET)\n\tPentode transistor\n\tPoint-contact transistor\n\tProgrammable unijunction transistor (PUT)\n\tStatic induction transistor (SIT)\n\tTetrode transistor\n\tUnijunction transistor (UJT)\n\n\n\n\n\tDiodes\t\n\tAvalanche diode\n\tConstant-current diode (CLD, CRD)\n\tLaser diode (LD)\n\tLight-emitting diode (LED)\n\tOrganic light-emitting diode (OLED)\n\tPhotodiode\n\tPIN diode\n\tSchottky diode\n\tStep recovery diode\n\tZener diode\n\n\n\n\n\tOther devices\t\n\tDIAC\n\tHeterostructure barrier varactor\n\tIntegrated circuit (IC)\n\tMemistor\n\tMemory cell\n\tMemristor\n\tOrganic semiconductor\n\tPhotodetector\n\tSolaristor\n\tQuantum circuit\n\tSilicon controlled rectifier (SCR)\n\tStatic induction thyristor (SITh)\n\tThree-dimensional integrated circuit (3D IC)\n\tThyristor\n\tTRIAC\n\tVaricap\n\n\n\n\n\n\n\n\tVoltage regulators\t\n\tLinear regulator\n\tLow-dropout regulator\n\tSwitching regulator\n\tBuck\n\tBoost\n\tBuck–boost\n\tSplit-pi\n\tĆuk\n\tSEPIC\n\tCharge pump\n\tSwitched capacitor\n\n\n\n\n\tVacuum tubes\t\n\tAcorn tube\n\tAudion\n\tBeam tetrode\n\tBarretter\n\tCompactron\n\tDiode\n\tFleming valve\n\tNonode\n\tNuvistor\n\tPentagrid (Hexode, Heptode, Octode)\n\tPentode\n\tPhotomultiplier\n\tPhototube\n\tTetrode\n\tTriode\n\n\n\n\n\tVacuum tubes (RF)\t\n\tBackward-wave oscillator (BWO)\n\tCavity magnetron\n\tCrossed-field amplifier (CFA)\n\tGyrotron\n\tInductive output tube (IOT)\n\tKlystron\n\tMaser\n\tSutton tube\n\tTraveling-wave tube (TWT)\n\n\n\n\n\tCathode ray tubes\t\n\tBeam deflection tube\n\tCharactron\n\tIconoscope\n\tMagic eye tube\n\tMonoscope\n\tSelectron tube\n\tStorage tube\n\tTrochotron\n\tVideo camera tube\n\tWilliams tube\n\n\n\n\n\tGas-filled tubes\t\n\tCold cathode\n\tCrossatron\n\tDekatron\n\tIgnitron\n\tKrytron\n\tMercury-arc valve\n\tNeon lamp\n\tNixie tube\n\tThyratron\n\tTrigatron\n\tVoltage-regulator tube\n\n\n\n\n\tAdjustable\t\n\tPotentiometer\n\tdigital\n\n\n\tVariable capacitor\n\tVaricap\n\n\n\n\n\tPassive\t\n\tConnector\n\taudio and video\n\telectrical power\n\tRF\n\n\n\tElectrolytic detector\n\tFerrite\n\tFuse\n\tresettable\n\n\n\tResistor\n\tSwitch\n\tThermistor\n\tTransformer\n\tVaristor\n\tWire\n\tWollaston wire\n\n\n\n\n\n\n\tReactive\t\n\tCapacitor\n\ttypes\n\n\n\tCeramic resonator\n\tCrystal oscillator\n\tInductor\n\tParametron\n\tRelay\n\treed relay\n\tmercury switch\n\n\n\n\n\n\n\n\n\n\tAuthority control \t\n\tBNF: cb119811121 (data)\n\tGND: 4128311-9\n\tLCCN: sh85019859\n\tNDL: 00573017\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Capacitor&oldid=918589977\"\n\n\t\t\n\t\tCategories: \tElectrical components\n\tEnergy storage\n\tCapacitors\n\tScience and technology in the Dutch Republic\n\tDutch inventions\n\t18th-century introductions\n\n\nHidden categories: \tCS1: Julian–Gregorian uncertainty\n\tWebarchive template wayback links\n\tArticles with short description\n\tArticles to be expanded from February 2019\n\tPages using deprecated image syntax\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from December 2008\n\tArticles with unsourced statements from November 2016\n\tArticles containing potentially dated statements from 2010\n\tAll articles containing potentially dated statements\n\tAll articles with vague or ambiguous time\n\tVague or ambiguous time from May 2018\n\tWikipedia articles with BNF identifiers\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\tWikibooks\n\tWikiversity\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tالعربية\n\tAragonés\n\tঅসমীয়া\n\tAsturianu\n\tAzərbaycanca\n\tتۆرکجه\n\tবাংলা\n\tBân-lâm-gú\n\tБашҡортса\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBoarisch\n\tBosanski\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\t贛語\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tInterlingua\n\tИрон\n\tÍslenska\n\tItaliano\n\tעברית\n\tJawa\n\tქართული\n\tҚазақша\n\tKurdî\n\tКыргызча\n\tLatina\n\tLatviešu\n\tLietuvių\n\tMagyar\n\tМакедонски\n\tMalagasy\n\tമലയാളം\n\tमराठी\n\tمصرى\n\tمازِرونی\n\tBahasa Melayu\n\tМонгол\n\tမြန်မာဘာသာ\n\tNederlands\n\tनेपाली\n\tनेपाल भाषा\n\t日本語\n\tНохчийн\n\tNordfriisk\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tOromoo\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tپښتو\n\tPatois\n\tPiemontèis\n\tPolski\n\tPortuguês\n\tRomână\n\tРусиньскый\n\tРусский\n\tScots\n\tSeeltersk\n\tShqip\n\tසිංහල\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tТатарча/tatarça\n\tไทย\n\tТоҷикӣ\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tئۇيغۇرچە / Uyghurche\n\tTiếng Việt\n\tWinaray\n\tWolof\n\t吴语\n\tייִדיש\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 29 September 2019, at 12:20 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "15", "dc:title": "Capacitor - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Capacitors_%287189597135%29.jpg/1200px-Capacitors_%287189597135%29.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-capacitor", "title": "Capacitor - Wikipedia"}}