{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCASSIOPE - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tCASSIOPE\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\n\n\nCASSIOPE\tCASSIOPE launches on a Falcon 9 v1.1\n\n\t\n\tMission type\tTechnology \n Communications \n Research\n\tOperator\tMDA\n\tCOSPAR ID\t2013-055A\n\tSATCAT no.\t39265\n\tWebsite\thttp://www.asc-csa.gc.ca/eng/satellites/cassiope.asp\n\tMission duration\tPrimary mission: 18 months[1] \n Design life: 2 years[2][3] \n Elapsed: 5 years, 11 months, 26 days\n\tOrbits completed\t6763[4]\n\t\n\n\t\n\tSpacecraft properties\n\tBus\tMAC-200\n\tManufacturer\tMDA (prime) \n Magellan Aerospace (subcontractor) \n Com Dev (subcontractor)\n\tLaunch mass\t500 kg (1,100 lb)[3]\n\tDimensions\t180×125 cm (71×49 in)[3]\n\tPower\t5 solar panels generating \n up to 600 W[3]\n\t\n\n\t\n\tStart of mission\n\tLaunch date\tSeptember 29, 2013, 16:00 (2013-09-29UTC16Z) UTC\n\tRocket\tFalcon 9 v1.1\n\tLaunch site\tVandenberg SLC-4E\n\tContractor\tSpaceX\n\t\n\n\t\n\tOrbital parameters\n\tReference system\tGeocentric\n\tRegime\tLow Earth\n\tSemi-major axis\t7,240.49 km (4,499.03 mi)[4]\n\tEccentricity\t0.0744616[4]\n\tPerigee altitude\t330 km (210 mi)[4]\n\tApogee altitude\t1,408 km (875 mi)[4]\n\tInclination\t80.98 degrees[4]\n\tPeriod\t102.19 minutes[4]\n\tRAAN\t192.36 degrees[4]\n\tArgument of perigee\t243.84 degrees[4]\n\tMean anomaly\t14.09 degrees[4]\n\tMean motion\t14.09[4]\n\tEpoch\tJanuary 24, 2015, 21:55:19 UTC[4]\n\t\n\n\t \n\n\nCASSIOPE, or CAScade, Smallsat and IOnospheric Polar Explorer,[5] is a Canadian Space Agency (CSA) multi-mission satellite operated by MacDonald, Dettwiler and Associates (MDA). The mission is funded through CSA and the Technology Partnerships Canada program.[5] It was launched September 29, 2013, on the first flight of the SpaceX Falcon 9 v1.1 launch vehicle.[2][6]  CASSIOPE is the first Canadian hybrid satellite to carry a dual mission in the fields of telecommunications and scientific research. The main objectives are to gather information to better understand the science of space weather, while verifying high-speed communications concepts through the use of advanced space technologies.\n\nThe satellite was deployed in an elliptical[7] polar orbit[8] and carries a commercial communications system called Cascade as well as a scientific experiment package called e-POP (enhanced Polar Outflow Probe).[8]\n\nFollowing staging, the Falcon 9's first stage was used by SpaceX for a controlled descent and landing test. While the first stage was destroyed on impact with the ocean, significant data was acquired and the test was considered a success.[9]\n\n\nContents\n\n\n\t1 Spacecraft\n\t1.1 Cascade\n\t1.2 e-POP\n\n\n\n\t2 History\n\t3 Launch\n\t3.1 Post-mission launch vehicle testing\n\t3.2 Secondary payloads\n\n\n\n\t4 See also\n\t5 References\n\t6 Further reading\n\t7 External links\n\n\n\n\n\nSpacecraft[edit]\n\nCASSIOPE is a 500 kg (1,100 lb) small satellite that is 180 cm (5.9 ft) long and 125 cm (4.10 ft) high. It combines the function of two distinct missions in order to be more cost-effective and reduce risk.[10]\n\nThe spacecraft carries a primary payload of two instrument suites: the Cascade commercial communications system and a scientific payload named e-POP.\n\n\nCascade[edit]\n\nThe commercial payload, named Cascade, is a technology demonstrator courier in the sky, aimed a providing a proof of concept for a digital broadband courier service for commercial use.  Built by MDA, the operational concept is to receive very large data files as the satellite orbits the globe, store them onboard temporarily, then deliver them at a later time to nearly any destination worldwide.[10]\n\nThe demonstrator will provide a secure digital store-and-forward file delivery service, exploiting the fact that CASSIOPE passes over much of the globe 15 times per day.  It has been described[by whom?] as a courier service, with the customers using a small parabolic antenna of one or two meters (three or six feet) to upload or download files at a rate of 1.2 gigabits per second. The storage capacity will be between 50 and 500 gigabytes and the data delivery time will be about 90 minutes, depending on the pickup and deposit points on the globe.[citation needed]\n\n\ne-POP[edit]\n\nThe e-POP portion of CASSIOPE is a suite of eight scientific instruments. The University of Calgary's Institute for Space Research leads the science project, while MDA is the prime contractor for the mission including launch and operation of the spacecraft. The orbital science mission is scheduled for a 21-month duration.[8]\n\ne-POP will gather data on Solar storms in the upper atmosphere.  These storms give rise to the polar aurora or northern lights seen in the skies in northern latitudes.  While these atmospheric glows may offer a thrilling night time spectacle, the inducing radiation can interfere with radio communications, GPS navigation, and other space-based systems.[citation needed] The eight scientific instruments aboard CASSIOPE will help scientists understand solar weather and eventually plan for measures to mitigate its deleterious effects.[7]\n\nThe e-POP payload contains eight scientific instruments:[11]\n\n\n\tCoherent EM Radio Tomography (CER), measuring radio propagation and ionospheric scintillation\n\tFast Auroral Imager (FAI), measuring large-scale auroral emissions\n\tGPS Altitude and Profiling Experiment (GAP), high-precision position and attitude determination\n\tImaging and Rapid Scanning Ion Mass Spectrometer (IRM), measuring the three-dimensional distribution of ions\n\tFluxgate Magnetometer (MGF), high-precision magnetic field perturbation measurement\n\tNeutral Mass Spectrometer (NMS), measuring the mass, composition and velocity of neutral particles\n\tRadio Receiver Instrument (RRI), measuring radio wave propagation\n\tSuprathermal Electron Imager (SEI), measuring low-energy electron distribution\n\n\nHistory[edit]\n\nThe satellite that became CASSIOPE began with a 1996 concept for a small (70 kg/150 lb), inexpensive microsatellite called Polar Outflow Probe, or POP.  The Canadian Space Agency funded a 1997 feasibility study that led to a modified mission concept that was designed during 2000-2005.[8]\nThe revised concept was to combine an enhanced version of POP, called e-POP, with an MDA Corporation commercial satellite called Cascade, into a single satellite, and to design and build a generic, low-cost small satellite bus that would be useful for other Canadian satellite missions in the future.\n\nThe eight e-POP scientific instruments were built, calibrated, and tested in 2005-2007, with integration onto the satellite bus for spacecraft-level testing in 2008-2009.[8]\n\n\nLaunch[edit]\n\nPlay media\n  \nSpaceX Falcon 9 launch from Vandenberg with CASSIOPE\n\n\n\nThe satellite was launched on September 29, 2013, aboard a SpaceX Falcon 9 v1.1 rocket.[12]\n\nAt the time the launch was contracted in 2005, a SpaceX Falcon 1 was the planned launch vehicle. The launch was originally scheduled for 2008 from Omelek Island. The launch date slipped several times, and after SpaceX discontinued the Falcon 1, the launch was shifted to the much larger Falcon 9 in June 2010.[7][13]\n\nMDA contracted with SpaceX to put the CASSIOPE payload on the first flight of an essentially new launch vehicle—a non-operational demonstration launch.[14] The Falcon 9 v1.1, upgraded from the original Falcon 9, is a 60 percent heavier rocket with 60% more thrust.[14] The flight was contracted with a payload mass that is very small relative to the rocket's capability, at a discounted rate because it was a technology demonstration mission for SpaceX, approximately 20% of the normal published price for SpaceX Falcon 9 LEO missions.[15]\n\nSince this was the first flight of a new launch vehicle, the US Air Force had estimated the overall probability of failure on the mission was nearly fifty percent.[16]  In the event, the mission was successful, as was each of the next 13 Falcon 9 v1.1 missions before a launch vehicle failure and loss of mission occurred on Falcon 9 Flight 19 in June 2015.\n\nThe Falcon 9 upper stage used to launch CASSIOPE was left derelict in a decaying elliptical low Earth orbit that, as of January 20, 2016[update], had a perigee of 317 km (197 mi) and an apogee of 1,283 km (797 mi).[17]\n\n\nPost-mission launch vehicle testing[edit]\n\nMain article: SpaceX reusable launch system development program\n\nAfter the second stage separated from the booster stage, SpaceX conducted a novel flight test where the booster conducted a test to attempt to reenter the lower atmosphere in a controlled manner and decelerate to a simulated over-water landing.[18]  The test was successful, but the booster stage was not recovered.\n\nAfter the three-minute boost phase of September 29, 2013 launch, the booster stage attitude was reversed, and three of the nine engines refired at high altitude, as planned, to initiate the deceleration and controlled descent trajectory to the surface of the ocean. The first phase of the test worked well and the first stage re-entered safely.[12]\n\nHowever, the first stage began to roll due to aerodynamic forces during the descent through the atmosphere, and the roll rate exceeded the capabilities of the booster attitude control system (ACS) to null it out. The fuel in the tanks centrifuged to the outside of the tank and the single engine involved in the low-altitude deceleration maneuver shut down.  Debris from the first stage was subsequently retrieved from the ocean.[12]\n\nSpaceX also ran a post-mission test on the second stage.  While a number of the new capabilities were successfully tested on the September 29, 2013, CASSIOPE flight, there was an issue with the second stage restart test. The test to reignite the second stage Merlin 1D vacuum engine once the rocket had deployed its primary payload (CASSIOPE) and all of its nanosat secondary payloads was unsuccessful.[9]\nThe engine failed to restart while the second stage was coasting in low Earth orbit.\n\n\nSecondary payloads[edit]\n\nFive nanosatellite spacecraft that were also carried to orbit on the same launch vehicle that carried the CASSIOPE primary payload:[10]\n\n\n\tCUSat, Cornell University\n\tDrag and Atmospheric Neutral Density Explorer (DANDE), University of Colorado Boulder\n\tthree Polar Orbiting Passive Atmospheric Calibration Spheres (POPACS), each a 10 cm (4 in) white aluminum sphere, joint project of Morehead State University, University of Arkansas, Montana State University, Drexel University, and Planetary Systems Corporation.[19]\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\tList of Falcon 9 launches\n\n\nReferences[edit]\n\n\n\t^ Howell, Elizabeth (September 27, 2013). \"SpaceX to Launch Space Weather Satellite for Canada Sunday\". Space.com. Retrieved April 13, 2014.\n\n\t^ a b Graham, William (September 29, 2013). \"SpaceX successfully launches debut Falcon 9 v1.1\". NASA Spaceflight. Retrieved April 13, 2014.\n\n\n\t^ a b c d \"CASSIOPE/e-POP Fact Sheet\". University of Calgary. 2014. Retrieved April 14, 2014.\n\n\n\t^ a b c d e f g h i j k l \"CASSIOPE Satellite details 2013-055A NORAD 39265\". N2YO. January 24, 2015. Retrieved January 25, 2015.\n\n\n\t^ a b Giffin, Gregory B.; Ressl, Waqar-Un-Nissa; Yau, Andrew W.; King, E. Peter (2004). Cassiope: A Canadian Smallsat-Based Space Science and Advanced Satcom Demonstration Mission. 18th AIAA/USU Conference on Small Satellites. Logan, Utah. August 9–12, 2004. SSC04-VI-5.\n\n\n\t^ Foust, Jeff (March 27, 2013). \"After Dragon, SpaceX's focus returns to Falcon\". NewSpace Journal. Retrieved April 5, 2013.\n\n\n\t^ a b c Boucher, Mark (June 26, 2012). \"Canada's CASSIOPE Satellite Nearing Liftoff\". SpaceRef Canada. Archived from the original on January 15, 2013. Retrieved September 7, 2013.\n\n\n\t^ a b c d e \"e-POP Project Schedule\". University of Calgary. 2013. Archived from the original on July 28, 2013. Retrieved September 6, 2013.\n\n\n\t^ a b Ferster, Warren (September 29, 2013). \"Upgraded Falcon 9 Rocket Successfully Debuts from Vandenberg\". Space News. Retrieved September 30, 2013.\n\n\n\t^ a b c Messier, Doug (September 10, 2013). \"A Preview of Falcon 9′s Flight From Vandenberg\". Parabolic Arc. Retrieved September 11, 2013.\n\n\n\t^ \"e-POP Payload on CASSIOPE\". University of Calgary. 2013. Retrieved February 20, 2014.\n\n\n\t^ a b c Messier, Doug (September 29, 2013). \"Falcon 9 Launches Payloads into Orbit From Vandenberg\". Parabolic Arc. Retrieved September 30, 2013.\n\n\n\t^ Boucher, Mark (June 28, 2010). \"Old News Revisited - SpaceX to Launch CASSIOPE\". SpaceRef Canada. Archived from the original on July 17, 2012. Retrieved September 7, 2013.\n\n\n\t^ a b Clark, Stephen (September 28, 2013). \"SpaceX to put Falcon 9 upgrades to the test Sunday\". Spaceflight Now. Retrieved September 28, 2013.\n\n\n\t^ Klotz, Irene (September 6, 2013). \"Musk Says SpaceX Being \"Extremely Paranoid\" as It Readies for Falcon 9's California Debut\". Space News. Retrieved September 13, 2013.\n\n\n\t^ \"Waiver to Space Exploration Technologies Corporation of Acceptable Risk Limit for Launch\". Federal Register. United States Government. Federal Aviation Administration. August 27, 2013. Retrieved January 21, 2016. The Falcon 9 v1.1 is a new launch vehicle. The U.S. Air Force has determined that its overall failure probability is nearly fifty percent for each of the first two launches.\n\n\n\t^ \"Falcon 9 R/B - Orbit\". Heavens Above. January 20, 2016. Retrieved January 21, 2016.\n\n\n\t^ Lindsey, Clark (March 28, 2013). \"SpaceX moving quickly towards fly-back first stage\". NewSpace Watch. Archived from the original on April 16, 2013. Retrieved March 29, 2013.\n\n\n\t^ Holemans, Walter; Moore, R. Gilbert; Kang, Jin (2012). Counting Down to the Launch of POPACS (Polar Orbiting Passive Atmospheric Calibration Spheres). 26th Annual AIAA/USU Conference on Small Satellites. August 13–16, 2012. Utah State University. SSC12-X-3.\n\n\n\n\n\nFurther reading[edit]\n\n\tYau, Andrew W.; James, H. Gordon (June 2009). \"CASSIOPE Enhanced Polar Outflow Probe (e-POP) Small Satellite Mission: Space Plasma Observations and International Collaborations\". AIP Conference Proceedings. 1144: 192–195. Bibcode:2009AIPC.1144..192Y. doi:10.1063/1.3169287.\n\n\tFujikawa, Nobuko; Hayakawa, Hajime; Tsuruda, Koichiro;  et al. (2005). Neutral mass and velocity spectrometer (NMS) on e-POP/CASSIOPE spacecraft (PDF). International Sessions of Japan Earth and Planetary Science Joint Meeting 2005.\n\n\tYau, Andrew W.; James, H. Gordon (2011). \"Scientific Objectives of the Canadian CASSIOPE Enhanced Polar Outflow Probe (e-POP) Small Satellite Mission\". The Sun, the Solar Wind, and the Heliosphere. IAGA Special Sopron Book Series, Volume 4. Springer Netherlands. pp. 355–364. Bibcode:2011sswh.book..355Y. doi:10.1007/978-90-481-9787-3_26. ISBN 978-90-481-9786-6.\n\n\tYau, A. W.; James, H. G.; Bernhardt, P. A.;  et al. (April 2009). \"The Canadian Enhanced Polar Outflow Probe (e-POP) Mission: Current Status and Planned Observations and Data Distribution\". Data Science Journal. 8: S38–S44. doi:10.2481/dsj.8.S38.\n\n\n\nExternal links[edit]\n\n\tCASSIOPE at the Canadian Space Agency\n\tCASSIOPE at MacDonald, Dettwiler and Associates\n\n\n\t\tv\n\tt\n\te\n\n\n Canadian Space Agency\n\n\tCanadian astronauts\t\n\n\tActive\t\n\tJeremy Hansen\n\tDavid Saint-Jacques\n\tJennifer Sidey\n\tJoshua Kutryk\n\n\n\n\n\tRetired\t\n\tMarc Garneau\n\tRoberta Bondar\n\tSteven MacLean\n\tChris Hadfield\n\tRobert Thirsk\n\tBjarni Tryggvason\n\tDafydd Williams\n\tJulie Payette\n\tMichael McKay\n\tKen Money\n\n\n\n\n\tOther\t\n\tGuy Laliberté (space tourist)\n\n\n\n\n\n\n\n\tSatellites\t\n\tAlouette 1\n\tAlouette 2\n\tAnik series\n\tBRITE\n\tCASSIOPE\n\tHermes\n\tISIS 1\n\tISIS 2\n\tM3MSat\n\tMOST\n\tMSAT-1\n\tNEOSSat\n\tNimiq series\n\tRADARSAT-1\n\tRADARSAT-2\n\tRADARSAT Constellation\n\tSCISAT-1\n\tSapphire\n\n\n\n\n\tOther space technology\t\n\tBlack Brant rocket\n\tCanadarm\n\tCanadarm2\n\tDextre\n\tFGS/NIRISS\n\tMOPITT\n\tOSIRIS\n\n\n\n\n\tFacilities\t\n\tJohn H. Chapman Space Centre\n\tDavid Florida Laboratory\n\tSaskatoon CSA Building\n\n\n\n\n\tContractors\t\n\tCOM DEV\n\tMacDonald, Dettwiler and Associates (MDA Space Missions/Spar Aerospace)\n\tMagellan Aerospace (Bristol Aerospace)\n\tTelesat\n\tUTIAS-SFL\n\n\n\n\n\tRelated institutions\t\n\tCanadian Geospace Monitoring\n\tCommunications Research Centre Canada\n\tDefence Research and Development Canada\n\tNational Research Council\n\n\n\n\n\tInternational partners\t\n\tESA\n\tNASA\n\tISRO\n\tJAXA\n\tSNSB\n\n\n\n\n\tOther\t\n\tBell TV\n\tChurchill Rocket Research Range\n\tInternational Space Station\n\tLunar Orbital Platform-Gateway\n\tShaw Direct\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nFalcon rocket launches\n\n\tFalcon rocket family\t\n\tFalcon 1\n\tFalcon 9\n\tv1.0\n\tv1.1\n\tFull Thrust\n\tBlock 5\n\n\n\tFalcon Heavy\n\n\n\n\t\n\n\tFalcon 1 missions\t\n\tDemo 1† (FalconSAT-2)\n\tDemo 2†\n\tFlight 3†\n\tTrailblazer\n\tPRESat\n\tNanoSail-D\n\tExplorers\n\n\n\tRatsat\n\tRazakSAT\n\n\n\n\n\tFalcon 9 missions\t\n\tDemonstration flights\t\n\tDragon Spacecraft Qualification Unit\n\tNASA COTS Demo Flight 1\n\tDragon C2+\n\tCrew Dragon Demo-1\n\tCrew Dragon in-flight abort test\n\n\n\n\n\tDragon ISS logistics\t\n\tCRS-1\n\tCRS-2\n\tCRS-3\n\tCRS-4\n\tCRS-5\n\tCRS-6\n\tCRS-7†\n\tCRS-8\n\tCRS-9\n\tCRS-10\n\tCRS-11\n\tCRS-12\n\tCRS-13\n\tCRS-14\n\tCRS-15\n\tCRS-16\n\tCRS-17\n\tCRS-18\n\tCRS-19\n\tCRS-20\n\tCRS-21\n\tCRS-22\n\t(missions contracted up to CRS-26)\n\n\n\n\n\tDragon 2 crewed missions\t\n\tCrew Dragon Demo-2\n\tUSCV-1\n\tBigelow Crew 1\n\n\n\n\n\tCommercial satellites\t\n\tSES-8\n\tThaicom 6\n\tOrbcomm OG2 × 6\n\tAsiaSat 8\n\tAsiaSat 6\n\tABS-3A / Eutelsat 115 West B\n\tTürkmenÄlem 52°E\n\tOrbcomm OG2 × 11\n\tSES-9\n\tJCSAT-14\n\tThaicom 8\n\tABS-2A / Eutelsat 117 West B\n\tJCSAT-16\n\tAmos-6†\n\tIridium NEXT 1–10\n\tEchoStar 23\n\tSES-10\n\tInmarsat-5 F4\n\tBulgariaSat-1\n\tIridium NEXT 11–20\n\tIntelsat 35e\n\tIridium NEXT 21–30\n\tSES-11\n\tKoreasat 5A\n\tIridium NEXT 31–40\n\tHispasat 30W-6\n\tIridium NEXT 41–50\n\tBangabandhu-1\n\tIridium NEXT 51–55\n\tSES-12\n\tTelstar 19V\n\tIridium NEXT 56–65\n\tTelkom 4 (Merah Putih)\n\tTelstar 18V\n\tEs'hail 2\n\tSSO-A\n\tIridium NEXT 66–75\n\tNusantara Satu + Beresheet\n\tAmos 17\n\tJCSAT-18\n\tSXM 7\n\tSXM 8\n\tTürksat 5A\n\n\n\n\n\tScientific satellites\t\n\tCASSIOPE\n\tDSCOVR\n\tJason-3\n\tFormosat-5\n\tTESS\n\tGRACE-FO\n\tSAOCOM 1A\n\tRADARSAT Constellation\n\tSAOCOM 1B\n\tHakuto-R\n\tJason-CS\n\tKPLO\n\tDART\n\n\n\n\n\tMilitary satellites\t\n\tNROL-76\n\tX-37B OTV-5\n\tZuma\n\tSES-16 / GovSat-1\n\tPaz\n\tGPS IIIA-01\n\tANASIS-II\n\tGPS IIIA-03\n\tGPS IIIA-04\n\tGPS IIIA-05\n\tSARah 1\n\tGPS IIIA-06\n\tSARah 2/3\n\n\n\n\n\tStarlink constellation\t\n\t2019\n\tStarlink group 1\n\t2\n\t3\n\n\n\t2020\n\tStarlink group 4\n\t5\n\t6\n\t7\n\t8\n\t9\n\n\n\n\n\n\n\tRideshares\t\n\t2021\n\tMission 1\n\n\n\t2022\n\tMission 2\n\n\n\t2023\n\tMission 3\n\n\n\n\n\n\n\n\n\n\tFalcon Heavy missions\t\n\tTest flight\n\tTesla Roadster\n\n\n\tArabsat-6A\n\tUSAF STP-2\n\tDSX\n\tFormoSat-7\n\tLightSail 2\n\tGPIM\n\tDSAC\n\tISAT\n\n\n\tAFSPC-44\n\tAFSPC-52\n\tViaSat-3 class\n\tOvzon-3\n\n\n\n\n\t\n\tItalics indicate future missions and vehicles under development. † denotes failed missions and destroyed vehicles.\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n← 2012  ·  Orbital launches in 2013  ·  2014 →\n\n\tJanuary\tKosmos 2482 ·  Kosmos 2483 ·  Kosmos 2484 – JSE Reda 4 ·  Jissho Eisei – STSAT-2C – TDRS-11\n\n\tFebruary\tIntelsat 27 – Globalstar M078, M087, M093, M094, M095, M096 – Azerspace-1/Africasat-1a ·  Amazonas 3 – Progress M-18M – Landsat 8 – SARAL ·  Sapphire ·  NEOSSat ·  UniBRITE-1 ·  TUGSAT-1 ·  AAUSAT3 ·  STRaND-1\n\n\tMarch\tSpaceX CRS-2 – USA-241 – Satmex 8 – Soyuz TMA-08M\n\n\tApril\tAnik G1 – Bion-M No.1 (Aist 2 ·  BeeSat-2 ·  BeeSat-3 ·  SOMP ·  Dove-2 ·  OSSI-1) – Cygnus Mass Simulator ·  Dove 1 ·  Alexander ·  Graham ·  Bell – Progress M-19M – Gaofen 1 ·  TurkSat-3USat ·  NEE-01 Pegaso ·  CubeBug-1 – Kosmos 2485\n\n\tMay\tZhongxing 11 – PROBA-V ·  VNREDSat 1A ·  ESTCube-1 – Eutelsat 3D – USA-242 – USA-243 – Soyuz TMA-09M\n\n\tJune\tSES-6 – Albert Einstein ATV – Kosmos 2486 – Shenzhou 10 – Resurs-P No.1 – O3b × 4 (PFM, FM2, FM4, FM5) – Kosmos 2487 – IRIS\n\n\tJuly\tIRNSS-1A – Uragan-M 48, 49, 50 – Shijian XI-05 – MUOS-2 – Shijian 15 ·  Shiyan 7 ·  Chuangxin 3 – Inmarsat-4A F4 ·  INSAT-3D – Progress M-20M\n\n\tAugust\tKounotori 4 (TechEdSat-3 ·  ArduSat-1 ·  ArduSat-X ·  PicoDragon) – USA-244 – Arirang-5 – USA-245 – Eutelsat 25B / Es'hail 1 ·  GSAT-7 / INSAT-4F – Amos-4\n\n\tSeptember\tYaogan 17 A, B, C – LADEE – Gonets-M No.5 ·  Gonets-M No.6 ·  Gonets-M No.7 – Hisaki – USA-246 – Cygnus Orb-D1 – Fengyun III-03 – Kuaizhou-1 – Soyuz TMA-10M – CASSIOPE ·  CUSat ·  POPACS 1, 2, 3 ·  DANDE – Astra 2E\n\n\tOctober\tShijian 16 – Sirius FM-6 – Yaogan 18\n\n\tNovember\tMars Orbiter Mission – Soyuz TMA-11M – Globus-1M No.13L – MAVEN – ORS-3 ·  STPSat-3 ·  Black Knight 1 ·  CAPE-2 ·  ChargerSat-1 ·  COPPER ·  DragonSat-1 ·  Firefly ·  Ho'oponopono-2 ·  Horus ·  KySat-2 ·  NPS-SCAT ·  ORSES ·  ORS Tech 1, 2 ·  PhoneSat 2.4 ·  Prometheus × 8 ·  SENSE A, B ·  SwampSat ·  TJ3Sat ·  Trailblazer-1 ·  Vermont Lunar CubeSat – Yaogan 19 – DubaiSat-2 ·  STSAT-3 ·  SkySat-1 ·  UniSat-5 (Dove 4 ·  ICube-1 ·  HumSat-D ·  PUCP-Sat 1 (Pocket-PUCP) ·  BeakerSat-1 ·  $50SAT ·  QBScout-1 ·  WREN) ·  AprizeSat 7, 8 ·  Lem ·  WNISat-1 ·  GOMX-1 ·  CubeBug-2 ·  Delfi-n3Xt ·  Dove 3 ·  First-MOVE ·  FUNcube-1 ·  HINCube-1 ·  KHUSat-1 ·  KHUSat-2 ·  NEE-02 Krysaor ·  OPTOS ·  Triton 1 ·  UWE-3 ·  VELOX-P2 ·  ZACUBE-1 ·  BPA-3 – Swarm A, B, C – Shiyan Weixing 5 – Progress M-21M\n\n\tDecember\tChang'e 3 (Yutu) – SES-8 – USA-247 ·  ALICE ·  AeroCube 5A, 5B ·  CUNYSAT-1 ·  FIREBIRD A, B ·  IPEX ·  M-Cubed-2 ·  SMDC-ONE 2.3, 2.4 ·  SNaP ·  TacSat-6 – Inmarsat-5 F1 – CBERS-3 – Gaia – Túpac Katari 1 – Kosmos 2488 ·  Kosmos 2489 ·  Kosmos 2490 – Ekspress AM5 – Aist 1 ·  SKRL-756 1, 2\n\n\tLaunches are separated by dashes ( – ), payloads by dots ( · ). Manned flights are bolded. Launch failures are in italics. Payloads deployed from other spacecraft are (enclosed in brackets).\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=CASSIOPE&oldid=915867000\"\n\n\t\t\n\t\tCategories: \tSpace program of Canada\n\tSpaceX commercial payloads\n\tSpacecraft launched in 2013\n\tSatellites of Canada\n\t2013 in Canada\n\n\nHidden categories: \tUse mdy dates from February 2014\n\tArticles with specifically marked weasel-worded phrases from September 2013\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from May 2013\n\tArticles with unsourced statements from February 2013\n\tArticles containing potentially dated statements from January 2016\n\tAll articles containing potentially dated statements\n\tArticles containing video clips\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCatalà\n\tČeština\n\tDeutsch\n\tFrançais\n\tBahasa Indonesia\n\tLatviešu\n\tSuomi\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 15 September 2019, at 18:32 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "6", "dc:title": "CASSIOPE - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/8/80/CASSIOPE_launch_001.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-cassiope", "title": "CASSIOPE - Wikipedia"}}