{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCharge carrier - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tCharge carrier\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\t\n\tThis article does not cite any sources. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.  (January 2009) (Learn how and when to remove this template message)\n\n\n\nIn physics, a charge carrier is a particle or quasiparticle that is free to move, carrying an electric charge, especially the particles that carry electric charges in electrical conductors. Examples are electrons, ions and holes. In a conducting medium, an electric field can exert force on these free particles, causing a net motion of the particles through the medium; this is what constitutes an electric current. In conducting media, particles serve to carry charge:\n\n\n\tIn many metals, the charge carriers are electrons. One or two of the valence electrons from each atom is able to move about freely within the crystal structure of the metal. The free electrons are referred to as conduction electrons, and the cloud of free electrons is called a Fermi gas. Many metals have electron and hole bands.  In some, the majority carriers are holes.\n\tIn electrolytes, such as salt water, the charge carriers are ions, which are atoms or molecules that have gained or lost electrons so they are electrically charged. Atoms that have gained electrons so they are negatively charged are called anions, atoms that have lost electrons so they are positively charged are called cations. Cations and anions of the dissociated liquid also serve as charge carriers in melted ionic solids (see e.g. the Hall–Héroult process for an example of electrolysis of a melted ionic solid). Proton conductors are electrolytic conductors employing positive hydrogen ions as carriers.\n\tIn a plasma, an electrically charged gas which is found in electric arcs through air, neon signs, and the sun and stars, the electrons and cations of ionized gas act as charge carriers.\n\tIn a vacuum, free electrons can act as charge carriers. In the electronic component known as the vacuum tube (also called valve), the mobile electron cloud is generated by a heated metal cathode, by a process called thermionic emission. When an electric field is applied strong enough to draw the electrons into a beam, this may be referred to as a cathode ray, and is the basis of the cathode ray tube display widely used in televisions and computer monitors until the 2000s.\n\tIn semiconductors, which are the material used to make electronic components like transistors and integrated circuits, behave as if \"effective particles\" known as electron holes with positive charge move through them, causing electrical properties. The \"holes\" behave as the traveling vacancies in the valence-band electron population of the semi-conductor and are treated as charge carriers. Electrons and holes are the charge carriers in semiconductors.\n\n\nIt can be seen that in some conductors, such as ionic solutions and plasmas, there are positive and negative charge carriers, so an electric current in them consists of the two polarities of carrier moving in opposite directions. In other conductors, such as metals, there are only charge carriers of one polarity, so an electric current in them just consists of charge carriers moving in one direction.\n\n\nContents\n\n\n\t1 In semiconductors\n\t1.1 Carrier generation and recombination\n\t1.2 Majority and minority carriers\n\t1.3 Free carrier concentration\n\n\n\n\t2 See also\n\n\n\n\n\nIn semiconductors[edit]\n\nThere are two recognized types of charge carriers in semiconductors. One is electrons, which carry a negative electric charge. In addition, it is convenient to treat the traveling vacancies in the valence band electron population (holes) as a second type of charge carrier, which carry a positive charge equal in magnitude to that of an electron.\n\n\nCarrier generation and recombination[edit]\n\nMain article: Carrier generation and recombination\n\nWhen an electron meets with a hole, they recombine and these free carriers effectively vanish. The energy released can be either thermal, heating up the semiconductor (thermal recombination, one of the sources of waste heat in semiconductors), or released as photons (optical recombination, used in LEDs and semiconductor lasers). The recombination means an electron which has been excited from the valence band to the conduction band falls back to the empty state in the valence band, known as the holes. The holes are the empty state created in the valence band when an electron gets excited after getting some energy to overpass the energy gap.\n\n\nMajority and minority carriers[edit]\n\nThe more abundant charge carriers are called majority carriers, which are primarily responsible for current transport in a piece of semiconductor. In n-type semiconductors they are electrons, while in p-type semiconductors they are holes. The less abundant charge carriers are called minority carriers; in n-type semiconductors they are holes, while in p-type semiconductors they are electrons.\n\nIn an intrinsic semiconductor, which does not contain any impurity, the concentrations of both types of carriers are ideally equal. If an intrinsic semiconductor is doped with a donor impurity then the majority carriers are electrons. If the semiconductor is doped with an acceptor impurity then the majority carriers are holes.\n\nMinority carriers play an important role in bipolar transistors and solar cells. Their role in field-effect transistors (FETs) is a bit more complex: for example, a MOSFET has p-type and n-type regions. The transistor action involves the majority carriers of the source and drain regions, but these carriers traverse the body of the opposite type, where they are minority carriers. However, the traversing carriers hugely outnumber their opposite type in the transfer region (in fact, the opposite type carriers are removed by an applied electric field that creates an inversion layer), so conventionally the source and drain designation for the carriers is adopted, and FETs are called \"majority carrier\" devices.\n\n\nFree carrier concentration[edit]\n\nMain article: Charge carrier density\n\nFree carrier concentration is the concentration of free carriers in a doped semiconductor. It is similar to the carrier concentration in a metal and for the purposes of calculating currents or drift velocities can be used in the same way. Free carriers are electrons (or holes) which have been introduced directly into the conduction band (or valence band) by doping and are not promoted thermally. For this reason electrons (holes) will not act as double carriers by leaving behind holes (electrons) in the other band. In other words, charge carriers are particles/electrons that are free to move (carry the charge). They get charged at the battery/cell, and then flow throughout the circuit, giving energy to any components in the way, then when out of charge and towards the end of the circuit, they get re-charged by the battery/cell.\n\n\nSee also[edit]\n\n\tCarrier lifetime\n\tColor charge\n\tMolecular diffusion\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Charge_carrier&oldid=918718498\"\n\n\t\t\n\t\tCategories: \tParticle physics\n\tCharge carriers\n\n\nHidden categories: \tArticles lacking sources from January 2009\n\tAll articles lacking sources\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tČeština\n\tDeutsch\n\tEesti\n\tEspañol\n\tفارسی\n\tFrançais\n\t한국어\n\tहिन्दी\n\tItaliano\n\tעברית\n\tҚазақша\n\tMagyar\n\tNederlands\n\t日本語\n\tNorsk\n\tPolski\n\tPortuguês\n\tРусский\n\tSvenska\n\tไทย\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 30 September 2019, at 00:50 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Charge carrier - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-charge_carrier", "title": "Charge carrier - Wikipedia"}}