{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCoaxial cable - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tCoaxial cable\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tA type of electrical cable with an inner conductor surrounded by concentric insulating layer and conducting shield\n\n\"Coax\" redirects here. For the act of coaxing, see Persuasion.\n\n  \nRG-59 flexible coaxial cable composed of:\tOuter plastic sheath\n\tWoven copper shield\n\tInner dielectric insulator\n\tCopper core\n\n\n\n\n\n  \nCross-sectional view of a coaxial cable\n\n\n\nCoaxial cable, or coax (pronounced /ˈkoʊ.æks/) is a type of electrical cable that has an inner conductor surrounded by a tubular insulating layer, surrounded by a tubular conducting shield. Many coaxial cables also have an insulating outer sheath or jacket.  The term coaxial comes from the inner conductor and the outer shield sharing a geometric axis. Coaxial cable was invented by English physicist, engineer, and mathematician Oliver Heaviside, who patented the design in 1880.[1]\n\nCoaxial cable is a type of transmission line, used to carry high frequency electrical signals with low losses.  It is used in such applications as telephone trunklines, broadband internet networking cables,  high speed computer data busses, carrying cable television signals, and connecting radio transmitters and receivers to their antennas. It differs from other shielded cables because the dimensions of the cable and connectors are controlled to give a precise, constant conductor spacing, which is needed for it to function efficiently as a transmission line.\n\n\n  \nOliver Heaviside invented the coaxial cable in 1880\n\n\n\nContents\n\n\n\t1 Applications\n\t2 Description\n\t3 Construction\n\t4 Signal propagation\n\t5 Connectors\n\t6 Important parameters\n\t6.1 Physical parameters\n\t6.2 Fundamental electrical parameters\n\t6.3 Derived electrical parameters\n\t6.4 Choice of impedance\n\n\n\n\t7 Coaxial Characteristic Impedance Derivation\n\t8 Issues\n\t8.1 Signal leakage\n\t8.2 Ground loops\n\t8.3 Noise\n\t8.3.1 Transformer effect\n\n\n\n\t8.4 Common mode current and radiation\n\n\n\n\t9 Standards\n\t10 Uses\n\t11 Types\n\t11.1 Hard line\n\t11.2 Radiating\n\t11.3 RG-6\n\t11.4 Triaxial cable\n\t11.5 Twin-axial cable\n\t11.6 Semi-rigid\n\t11.7 Rigid line\n\t11.8 Cables used in the UK\n\n\n\n\t12 Interference and troubleshooting\n\t13 History\n\t14 See also\n\t15 References\n\t16 External links\n\n\n\n\n\nApplications[edit]\n\nCoaxial cable is used as a transmission line for radio frequency signals. Its applications include feedlines connecting radio transmitters and receivers to their antennas, computer network (e.g., Ethernet) connections, digital audio (S/PDIF), and distribution of cable television signals. One advantage of coaxial over other types of radio transmission line is that in an ideal coaxial cable the electromagnetic field carrying the signal exists only in the space between the inner and outer conductors. This allows coaxial cable runs to be installed next to metal objects such as gutters without the power losses that occur in other types of transmission lines. Coaxial cable also provides protection of the signal from external electromagnetic interference.\n\n\nDescription[edit]\n\n  \nCoaxial cable cutaway (not to scale)\n\n\n\nCoaxial cable conducts electrical signal using an inner conductor (usually a solid copper, stranded copper or copper plated steel wire) surrounded by an insulating layer and all enclosed by a shield, typically one to four layers of woven metallic braid and metallic tape.  The cable is protected by an outer insulating jacket. Normally, the shield is kept at ground potential and a signal carrying voltage is applied to the center conductor. The advantage of coaxial design is that electric and magnetic fields are restricted to the dielectric with little leakage outside the shield. Further, electric and magnetic fields outside the cable are largely kept from interfering with signals inside the cable. Larger diameter cables and cables with multiple shields have less leakage. This property makes coaxial cable a good choice for carrying weak signals that cannot tolerate interference from the environment or for stronger electrical signals that must not be allowed to radiate or couple into adjacent structures or circuits.[2]\n\nCommon applications of coaxial cable include video and CATV distribution, RF and microwave transmission, and computer and instrumentation data connections.[3]\n\nThe characteristic impedance of the cable (\n  \n    \n      \n        \n          Z\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle Z_{0}}\n  \n) is determined by the dielectric constant of the inner insulator and the radii of the inner and outer conductors.  In radio frequency systems, where the cable length is comparable to the wavelength of the signals transmitted, a uniform cable characteristic impedance is important  to minimize loss. The source and load impedances are chosen to match  the impedance of the cable to ensure maximum power transfer and minimum standing wave ratio.   Other important properties of coaxial cable include attenuation as a function of frequency, voltage handling capability, and shield quality.[2]\n\n\nConstruction[edit]\n\nCoaxial cable design choices affect physical size, frequency performance, attenuation, power handling capabilities, flexibility, strength, and cost. The inner conductor might be solid or stranded; stranded is more flexible. To get better high-frequency performance, the inner conductor may be silver-plated. Copper-plated steel wire is often used as an inner conductor for cable used in the cable TV industry.[4]\n\nThe insulator surrounding the inner conductor may be solid plastic, a foam plastic, or air with spacers supporting the inner wire. The properties of the dielectric insulator determine some of the electrical properties of the cable. A common choice is a solid polyethylene (PE) insulator, used in lower-loss cables. Solid Teflon (PTFE) is also used as an insulator, and exclusively in plenum-rated cables.[citation needed] Some coaxial lines use air (or some other gas) and have spacers to keep the inner conductor from touching the shield.\n\nMany conventional coaxial cables use braided copper wire forming the shield. This allows the cable to be flexible, but it also means there are gaps in the shield layer, and the inner dimension of the shield varies slightly because the braid cannot be flat. Sometimes the braid is silver-plated. For better shield performance, some cables have a double-layer shield.[4] The shield might be just two braids, but it is more common now to have a thin foil shield covered by a wire braid. Some cables may invest in more than two shield layers, such as \"quad-shield\", which uses four alternating layers of foil and braid. Other shield designs sacrifice flexibility for better performance; some shields are a solid metal tube. Those cables cannot be bent sharply, as the shield will kink, causing losses in the cable. When a foil shield is used a small wire conductor incorporated into the foil makes soldering the shield termination easier.\n\nFor high-power radio-frequency transmission up to about 1 GHz, coaxial cable with a solid copper outer conductor is available in sizes of 0.25 inch upward. The outer conductor is corrugated like a bellows to permit flexibility and the inner conductor is held in position by a plastic spiral to approximate an air dielectric.[4] One brand name for such cable is Heliax.[5]\n\nCoaxial cables require an internal structure of an insulating (dielectric) material to maintain the spacing between the center conductor and shield. The dielectric losses increase in this order: Ideal dielectric (no loss), vacuum, air, polytetrafluoroethylene (PTFE), polyethylene foam, and solid polyethylene. A low relative permittivity allows for higher-frequency usage. An inhomogeneous dielectric needs to be compensated by a non-circular conductor to avoid current hot-spots.\n\nWhile many cables have a solid dielectric, many others have a foam dielectric that contains as much air or other gas as possible to reduce the losses by allowing the use of a larger diameter center conductor. Foam coax will have about 15% less attenuation but some types of foam dielectric can absorb moisture—especially at its many surfaces — in humid environments, significantly increasing the loss. Supports shaped like stars or spokes are even better but more expensive and very susceptible to moisture infiltration. Still more expensive were the air-spaced coaxials used for some inter-city communications in the mid-20th century. The center conductor was suspended by polyethylene discs every few centimeters. In some low-loss coaxial cables such as the RG-62 type, the inner conductor is supported by a spiral strand of polyethylene, so that an air space exists between most of the conductor and the inside of the jacket. The lower dielectric constant of air allows for a greater inner diameter at the same impedance and a greater outer diameter at the same cutoff frequency, lowering ohmic losses. Inner conductors are sometimes silver-plated to smooth the surface and reduce losses due to skin effect.[4] A rough surface extends the current path and concentrates the current at peaks, thus increasing ohmic loss.\n\nThe insulating jacket can be made from many materials. A common choice is PVC, but some applications may require fire-resistant materials. Outdoor applications may require the jacket to resist ultraviolet light, oxidation, rodent damage, or direct burial.  Flooded coaxial cables use a water blocking gel to protect the cable from water infiltration through minor cuts in the jacket.  For internal chassis connections the insulating jacket may be omitted.\n\n\nSignal propagation[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Coaxial cable\" – news · newspapers · books · scholar · JSTOR  (March 2016) (Learn how and when to remove this template message)\n\n\n\nTwin-lead transmission lines have the property that the electromagnetic wave propagating down the line extends into the space surrounding the parallel wires. These lines have low loss, but also have undesirable characteristics. They cannot be bent, tightly twisted, or otherwise shaped without changing their characteristic impedance, causing reflection of the signal back toward the source. They also cannot be buried or run along or attached to anything conductive, as the extended fields will induce currents in the nearby conductors causing unwanted radiation and detuning of the line. Coaxial lines largely solve this problem by confining virtually all of the electromagnetic wave to the area inside the cable. Coaxial lines can therefore be bent and moderately twisted without negative effects, and they can be strapped to conductive supports without inducing unwanted currents in them.\n\nIn radio-frequency applications up to a few gigahertz, the wave propagates primarily in the transverse electric magnetic (TEM) mode, which means that the electric and magnetic fields are both perpendicular to the direction of propagation. However, above a certain cutoff frequency, transverse electric (TE) or transverse magnetic (TM) modes can also propagate, as they do in a waveguide. It is usually undesirable to transmit signals above the cutoff frequency, since it may cause multiple modes with different phase velocities to propagate, interfering with each other. The outer diameter is roughly inversely proportional to the cutoff frequency. A propagating surface-wave mode that does not involve or require the outer shield but only a single central conductor also exists in coax but this mode is effectively suppressed in coax of conventional geometry and common impedance. Electric field lines for this [TM] mode have a longitudinal component and require line lengths of a half-wavelength or longer.\n\nCoaxial cable may be viewed as a type of waveguide. Power is transmitted through the radial electric field and the circumferential magnetic field in the TEM00 transverse mode. This is the dominant mode from zero frequency (DC) to an upper limit determined by the electrical dimensions of the cable.[6]\n\n\nConnectors[edit]\n\nMain article: RF connector\n\n\nA male F-type connector used with common RG-6 cable\n\n\nA male N-type connector\n\n\n\n\n\nThe ends of coaxial cables usually terminate with connectors. Coaxial connectors are designed to maintain a coaxial form across the connection and have the same impedance as the attached cable.[4] Connectors are usually plated with high-conductivity metals such as silver or tarnish-resistant gold. Due to the skin effect, the RF signal is only carried by the plating at higher frequencies and does not penetrate to the connector body. Silver however tarnishes quickly and the silver sulfide that is produced is poorly conductive, degrading connector performance, making silver a poor choice for this application.[citation needed]\n\n\nImportant parameters[edit]\n\nCoaxial cable is a particular kind of transmission line, so the circuit models developed for general transmission lines are appropriate. See Telegrapher's equation.\n\n\n  \nSchematic representation of the elementary components of a transmission line.\n\n\n  \nSchematic representation of a coaxial transmission line, showing the characteristic impedance \n  \n    \n      \n        \n          Z\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle Z_{0}}\n  \n.\n\n\n\nPhysical parameters[edit]\n\nIn the following section, these symbols are used:\n\n\n\tLength of the cable, \n  \n    \n      \n        h\n      \n    \n    {\\displaystyle h}\n  \n.\n\tOutside diameter of inner conductor, \n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n.\n\tInside diameter of the shield, \n  \n    \n      \n        D\n      \n    \n    {\\displaystyle D}\n  \n.\n\tDielectric constant of the insulator, \n  \n    \n      \n        ϵ\n      \n    \n    {\\displaystyle \\epsilon }\n  \n. The dielectric constant is often quoted as the relative dielectric constant \n  \n    \n      \n        \n          ϵ\n          \n            r\n          \n        \n      \n    \n    {\\displaystyle \\epsilon _{r}}\n  \n referred to the dielectric constant of free space \n  \n    \n      \n        \n          ϵ\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle \\epsilon _{0}}\n  \n: \n  \n    \n      \n        ϵ\n        =\n        \n          ϵ\n          \n            r\n          \n        \n        \n          ϵ\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle \\epsilon =\\epsilon _{r}\\epsilon _{0}}\n  \n. When the insulator is a mixture of different dielectric materials (e.g., polyethylene foam is a mixture of polyethylene and air), then the term effective dielectric constant \n  \n    \n      \n        \n          ϵ\n          \n            e\n            f\n            f\n          \n        \n      \n    \n    {\\displaystyle \\epsilon _{eff}}\n  \n is often used.\n\tMagnetic permeability of the insulator, \n  \n    \n      \n        μ\n      \n    \n    {\\displaystyle \\mu }\n  \n. Permeability is often quoted as the relative permeability \n  \n    \n      \n        \n          μ\n          \n            r\n          \n        \n      \n    \n    {\\displaystyle \\mu _{r}}\n  \n referred to the permeability of free space \n  \n    \n      \n        \n          μ\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle \\mu _{0}}\n  \n: \n  \n    \n      \n        μ\n        =\n        \n          μ\n          \n            r\n          \n        \n        \n          μ\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle \\mu =\\mu _{r}\\mu _{0}}\n  \n.  The relative permeability will almost always be 1.\n\n\nFundamental electrical parameters[edit]\n\n\tShunt capacitance per unit length, in farads per metre.[7]\n\n\n\t\t\n  \n    \n      \n        \n          (\n          \n            \n              C\n              h\n            \n          \n          )\n        \n        =\n        \n          \n            \n              2\n              π\n              ϵ\n            \n            \n              ln\n              ⁡\n              (\n              D\n              \n                /\n              \n              d\n              )\n            \n          \n        \n        =\n        \n          \n            \n              2\n              π\n              \n                ϵ\n                \n                  0\n                \n              \n              \n                ϵ\n                \n                  r\n                \n              \n            \n            \n              ln\n              ⁡\n              (\n              D\n              \n                /\n              \n              d\n              )\n            \n          \n        \n      \n    \n    {\\displaystyle \\left({\\frac {C}{h}}\\right)={2\\pi \\epsilon  \\over \\ln(D/d)}={2\\pi \\epsilon _{0}\\epsilon _{r} \\over \\ln(D/d)}}\n  \n\n\n\n\n\n\tSeries inductance per unit length, in henrys per metre.\n\n\n\t\t\n  \n    \n      \n        \n          (\n          \n            \n              L\n              h\n            \n          \n          )\n        \n        =\n        \n          \n            μ\n            \n              2\n              π\n            \n          \n        \n        ln\n        ⁡\n        (\n        D\n        \n          /\n        \n        d\n        )\n        =\n        \n          \n            \n              \n                μ\n                \n                  0\n                \n              \n              \n                μ\n                \n                  r\n                \n              \n            \n            \n              2\n              π\n            \n          \n        \n        ln\n        ⁡\n        (\n        D\n        \n          /\n        \n        d\n        )\n      \n    \n    {\\displaystyle \\left({\\frac {L}{h}}\\right)={\\mu  \\over 2\\pi }\\ln(D/d)={\\mu _{0}\\mu _{r} \\over 2\\pi }\\ln(D/d)}\n  \n\n\n\n\n\n\tSeries resistance per unit length, in ohms per metre. The resistance per unit length is just the resistance of inner conductor and the shield at low frequencies. At higher frequencies, skin effect increases the effective resistance by confining the conduction to a thin layer of each conductor.\n\tShunt conductance per unit length, in siemens per metre. The shunt conductance is usually very small because insulators with good dielectric properties are used (a very low loss tangent). At high frequencies, a dielectric can have a significant resistive loss.\n\n\nDerived electrical parameters[edit]\n\n\tCharacteristic impedance in ohms (Ω). The complex impedance Z of an infinite length of transmission line is:\n\n\n\t\t\n  \n    \n      \n        Z\n        =\n        \n          \n            \n              \n                R\n                +\n                s\n                L\n              \n              \n                G\n                +\n                s\n                C\n              \n            \n          \n        \n      \n    \n    {\\displaystyle Z={\\sqrt {\\frac {R+sL}{G+sC}}}}\n  \n\n\n\n\tWhere R is the resistance per unit length, L is the inductance per unit length, G is the conductance per unit length of the dielectric, C is the capacitance per unit length, and s = jω = j2πf is the frequency. The \"per unit length\" dimensions cancel out in the impedance formula.\n\tAt DC the two reactive terms are zero, so the impedance is real-valued, and is extremely high. It looks like\n\t\n  \n    \n      \n        \n          Z\n          \n            \n              D\n              C\n            \n          \n        \n        =\n        \n          \n            \n              R\n              G\n            \n          \n        \n      \n    \n    {\\displaystyle Z_{\\mathrm {DC} }={\\sqrt {\\frac {R}{G}}}}\n  \n.\n\n\n\tWith increasing frequency, the reactive components take effect and the impedance of the line is complex-valued. At very low frequencies (audio range, of interest to telephone systems) G is typically much smaller than sC, so the impedance at low frequencies is\n\t\n  \n    \n      \n        \n          Z\n          \n            \n              L\n              o\n              w\n              F\n              r\n              e\n              q\n            \n          \n        \n        =\n        \n          \n            \n              R\n              \n                s\n                C\n              \n            \n          \n        \n      \n    \n    {\\displaystyle Z_{\\mathrm {LowFreq} }={\\sqrt {\\frac {R}{sC}}}}\n  \n,\n\n\n\twhich has a phase value of -45 degrees.\n\tAt higher frequencies, the reactive terms usually dominate R and G, and the cable impedance again becomes real-valued. That value is Z0, the characteristic impedance of the cable:\n\t\n  \n    \n      \n        \n          Z\n          \n            0\n          \n        \n        =\n        \n          \n            \n              \n                s\n                L\n              \n              \n                s\n                C\n              \n            \n          \n        \n        =\n        \n          \n            \n              L\n              C\n            \n          \n        \n      \n    \n    {\\displaystyle Z_{0}={\\sqrt {\\frac {sL}{sC}}}={\\sqrt {\\frac {L}{C}}}}\n  \n.\n\n\n\tAssuming the dielectric properties of the material inside the cable do not vary appreciably over the operating range of the cable, the characteristic impedance is frequency independent above about five times the shield cutoff frequency. For typical coaxial cables, the shield cutoff frequency is 600 (RG-6A) to 2,000 Hz (RG-58C).[8]\n\tThe parameters L and C are determined from the ratio of the inner (d) and outer (D) diameters and the dielectric constant (ε). The characteristic impedance is given by[9]\n\t\n  \n    \n      \n        \n          Z\n          \n            0\n          \n        \n        =\n        \n          \n            1\n            \n              2\n              π\n            \n          \n        \n        \n          \n            \n              μ\n              ϵ\n            \n          \n        \n        ln\n        ⁡\n        \n          \n            D\n            d\n          \n        \n        ≈\n        \n          \n            \n              60\n              Ω\n            \n            \n              \n                ϵ\n                \n                  r\n                \n              \n            \n          \n        \n        ln\n        ⁡\n        \n          \n            D\n            d\n          \n        \n        ≈\n        \n          \n            \n              138\n              Ω\n            \n            \n              \n                ϵ\n                \n                  r\n                \n              \n            \n          \n        \n        \n          log\n          \n            10\n          \n        \n        ⁡\n        \n          \n            D\n            d\n          \n        \n      \n    \n    {\\displaystyle Z_{0}={\\frac {1}{2\\pi }}{\\sqrt {\\frac {\\mu }{\\epsilon }}}\\ln {\\frac {D}{d}}\\approx {\\frac {60\\Omega }{\\sqrt {\\epsilon _{r}}}}\\ln {\\frac {D}{d}}\\approx {\\frac {138\\Omega }{\\sqrt {\\epsilon _{r}}}}\\log _{10}{\\frac {D}{d}}}\n  \n\n\n\n\n\n\tAttenuation (loss) per unit length, in decibels per meter. This is dependent on the loss in the dielectric material filling the cable, and resistive losses in the center conductor and outer shield. These losses are frequency dependent, the losses becoming higher as the frequency increases. Skin effect losses in the conductors can be reduced by increasing the diameter of the cable. A cable with twice the diameter will have half the skin effect resistance.  Ignoring dielectric and other losses, the larger cable would halve the dB/meter loss. In designing a system, engineers consider not only the loss in the cable but also the loss in the connectors.\n\tVelocity of propagation, in meters per second.  The velocity of propagation depends on the dielectric constant and permeability (which is usually 1).\n\n\n\t\t\n  \n    \n      \n        v\n        =\n        \n          \n            1\n            \n              \n                ϵ\n                μ\n              \n            \n          \n        \n        =\n        \n          \n            c\n            \n              \n                \n                  ϵ\n                  \n                    r\n                  \n                \n                \n                  μ\n                  \n                    r\n                  \n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle v={1 \\over {\\sqrt {\\epsilon \\mu }}}={c \\over {\\sqrt {\\epsilon _{r}\\mu _{r}}}}}\n  \n\n\n\n\n\n\tSingle-mode band. In coaxial cable, the dominant mode (the mode with the lowest cutoff frequency) is the TEM mode, which has a cutoff frequency of zero; it propagates all the way down to d.c. The mode with the next lowest cutoff is the TE11 mode. This mode has one 'wave' (two reversals of polarity) in going around the circumference of the cable. To a good approximation, the condition for the TE11 mode to propagate is that the wavelength in the dielectric is no longer than the average circumference of the insulator; that is that the frequency is at least\n\n\n\t\t\n  \n    \n      \n        \n          f\n          \n            c\n          \n        \n        ≈\n        \n          \n            1\n            \n              π\n              (\n              \n                \n                  \n                    D\n                    +\n                    d\n                  \n                  2\n                \n              \n              )\n              \n                \n                  μ\n                  ϵ\n                \n              \n            \n          \n        \n        =\n        \n          \n            c\n            \n              π\n              (\n              \n                \n                  \n                    D\n                    +\n                    d\n                  \n                  2\n                \n              \n              )\n              \n                \n                  \n                    μ\n                    \n                      r\n                    \n                  \n                  \n                    ϵ\n                    \n                      r\n                    \n                  \n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle f_{c}\\approx {1 \\over \\pi ({D+d \\over 2}){\\sqrt {\\mu \\epsilon }}}={c \\over \\pi ({D+d \\over 2}){\\sqrt {\\mu _{r}\\epsilon _{r}}}}}\n  \n.\n\n\n\tHence, the cable is single-mode from to d.c. up to this frequency, and might in practice be used up to 90%[10] of this frequency.\n\n\n\tPeak Voltage. The peak voltage is set by the breakdown voltage of the insulator. One website[11] gives:\n\n\n\t\t\n  \n    \n      \n        \n          V\n          \n            p\n          \n        \n        =\n        1150\n        \n        \n          S\n          \n            mils\n          \n        \n        \n        \n          d\n          \n            in\n          \n        \n        \n        \n          log\n          \n            10\n          \n        \n        ⁡\n        \n          (\n          \n            \n              D\n              d\n            \n          \n          )\n        \n      \n    \n    {\\displaystyle V_{p}=1150\\,S_{\\text{mils}}\\,d_{\\text{in}}\\,\\log _{10}\\left({\\frac {D}{d}}\\right)}\n  \n\n\twhere\n\tSmils is the insulator's breakdown voltage in volts per mil\n\tdin is the inner diameter in inches\n\tThe 1150 factor converts inches (diameter) to mils (radius) and log10 to ln.\n\n\n\n\n\tThe above expression may be rewritten[12] as\n\t\n  \n    \n      \n        \n          V\n          \n            p\n          \n        \n        =\n        0.5\n        \n        S\n        \n        d\n        \n        ln\n        ⁡\n        \n          (\n          \n            \n              D\n              d\n            \n          \n          )\n        \n      \n    \n    {\\displaystyle V_{p}=0.5\\,S\\,d\\,\\ln \\left({\\frac {D}{d}}\\right)}\n  \n\n\twhere\n\tS is the insulator's breakdown voltage in volts per meter\n\td is the inner diameter in meters\n\n\n\n\n\tThe calculated peak voltage is often reduced by a safety factor.\n\n\nChoice of impedance[edit]\n\nThe best coaxial cable impedances in high-power, high-voltage, and low-attenuation applications were experimentally determined at Bell Laboratories in 1929 to be 30, 60, and 77 Ω, respectively. For a coaxial cable with air dielectric and a shield of a given inner diameter, the attenuation is minimized by choosing the diameter of the inner conductor to give a characteristic impedance of 76.7 Ω.[13] When more common dielectrics are considered, the best-loss impedance drops down to a value between 52–64 Ω. Maximum power handling is achieved at 30 Ω.[14]\n\nThe approximate impedance required to match a centre-fed dipole antenna in free space (i.e., a dipole without ground reflections) is 73 Ω, so 75 Ω coax was commonly used for connecting shortwave antennas to receivers. These typically involve such low levels of RF power that power-handling and high-voltage breakdown characteristics are unimportant when compared to attenuation. Likewise with CATV, although many broadcast TV installations and CATV headends use 300 Ω folded dipole antennas to receive off-the-air signals, 75 Ω coax makes a convenient 4:1 balun transformer for these as well as possessing low attenuation.\n\nThe arithmetic mean between 30 Ω and 77 Ω is 53.5 Ω; the geometric mean is 48 Ω. The selection of 50 Ω as a compromise between power-handling capability and attenuation is in general cited as the reason for the number.[15] 50 Ω also works out tolerably well because it corresponds approximately to the drive impedance (ideally 36 ohms) of a quarter-wave monopole, mounted on a less than optimum ground plane such as a vehicle roof. The match is better at low frequencies, such as for CB Radio around 27 MHz, where the roof dimensions are much less than a quarter wavelength, and relatively poor at higher frequencies, VHF and UHF, where the roof dimensions may be several wavelengths. The match is at best poor, because the antenna drive impedance, due to the imperfect ground plane, is reactive rather than purely resistive, and so a 36 ohm coaxial cable would not match properly either. Installations which need exact matching will use some kind of matching circuit at the base of the antenna, or elsewhere, in conjunction with a carefully chosen (in terms of wavelength) length of coaxial, such that a proper match is achieved, which will be only over a fairly narrow frequency range.\n\nRG-62 is a 93 Ω coaxial cable originally used in mainframe computer networks in the 1970s and early 1980s (it was the cable used to connect IBM 3270 terminals to IBM 3274/3174 terminal cluster controllers). Later, some manufacturers of LAN equipment, such as Datapoint for ARCNET, adopted RG-62 as their coaxial cable standard. The cable has the lowest capacitance per unit-length when compared to other coaxial cables of similar size. \n\nAll of the components of a coaxial system should have the same impedance to avoid internal reflections at connections between components. Such reflections may cause signal attenuation and ghosting TV picture display; multiple reflections may cause the original signal to be followed by more than one echo. In analog video or TV systems, this causes ghosting in the image. Reflections also introduce standing waves, which cause increased losses and can even result in cable dielectric breakdown with high-power transmission (see Impedance matching). Briefly, if a coaxial cable is open, the termination has nearly infinite resistance, this causes reflections; if the coaxial cable is short-circuited, the termination resistance is nearly zero, there will be reflections with the opposite polarity. Reflection will be nearly eliminated if the coaxial cable is terminated in a pure resistance equal to its impedance.\n\n\nCoaxial Characteristic Impedance Derivation[edit]\n\n  \nCoaxial Cable Dimensions. D is the radius of the larger conductor and d is the radius of the smaller conductor.\n\n\n\nTaking the characteristic impedance at high frequencies,\n\n\n  \n    \n      \n        \n          Z\n          \n            0\n          \n        \n        =\n        \n          \n            \n              L\n              C\n            \n          \n        \n      \n    \n    {\\displaystyle Z_{0}={\\sqrt {\\frac {L}{C}}}}\n  \n\n\nOne should also know the inductance and capacitance of the two concentric cylindrical conductors which is the coaxial cable. By definition \n  \n    \n      \n        C\n        =\n        Q\n        \n          /\n        \n        V\n      \n    \n    {\\displaystyle C=Q/V}\n  \n and getting the electric field by the formula of electric field of an infinite line,\n\n\n  \n    \n      \n        \n          \n            \n              E\n              →\n            \n          \n        \n        =\n        \n          \n            Q\n            \n              2\n              π\n              \n                ϵ\n                \n                  o\n                \n              \n            \n          \n        \n        \n          \n            \n              \n                r\n                ^\n              \n            \n            r\n          \n        \n      \n    \n    {\\displaystyle {\\vec {E}}={\\frac {Q}{2\\pi \\epsilon _{o}}}{\\frac {\\hat {r}}{r}}}\n  \n[16]\n\nwhere \n  \n    \n      \n        Q\n      \n    \n    {\\displaystyle Q}\n  \n is charge,\n  \n    \n      \n        \n          ϵ\n          \n            o\n          \n        \n      \n    \n    {\\displaystyle \\epsilon _{o}}\n  \n is the permittivity of free space, \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n  \n is the radial distance and \n  \n    \n      \n        \n          \n            \n              r\n              ^\n            \n          \n        \n      \n    \n    {\\displaystyle {\\hat {r}}}\n  \n is the unit vector in the direction away from the axis. The Voltage, V, is\n\n\n  \n    \n      \n        V\n        =\n        E\n        d\n        =\n        −\n        \n          ∫\n          \n            d\n          \n          \n            D\n          \n        \n        \n          \n            Q\n            \n              2\n              π\n              \n                ϵ\n                \n                  o\n                \n              \n              r\n            \n          \n        \n        d\n        r\n        =\n        \n          \n            Q\n            \n              2\n              π\n              \n                ϵ\n                \n                  o\n                \n              \n            \n          \n        \n        l\n        n\n        \n          \n            D\n            d\n          \n        \n      \n    \n    {\\displaystyle V=Ed=-\\int _{d}^{D}{\\frac {Q}{2\\pi \\epsilon _{o}r}}dr={\\frac {Q}{2\\pi \\epsilon _{o}}}ln{\\frac {D}{d}}}\n  \n\n\nwhere \n  \n    \n      \n        D\n      \n    \n    {\\displaystyle D}\n  \n is the diameter of the bigger conductor and \n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n is the diameter of the smaller conductor. The capacitance can then be solved by substitution,\n\n\n  \n    \n      \n        C\n        =\n        \n          \n            Q\n            V\n          \n        \n        =\n        \n          \n            \n              2\n              π\n              \n                ϵ\n                \n                  o\n                \n              \n            \n            \n              l\n              n\n              \n                \n                  D\n                  d\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle C={\\frac {Q}{V}}={\\frac {2\\pi \\epsilon _{o}}{ln{\\frac {D}{d}}}}}\n  \n\n\nand the inductance is taken from Ampere's Law for two concentric conductors (coaxial wire) and with the definition of inductance,\n\n\n  \n    \n      \n        B\n        =\n        \n          \n            \n              \n                μ\n                \n                  o\n                \n              \n              I\n            \n            \n              2\n              π\n              r\n            \n          \n        \n      \n    \n    {\\displaystyle B={\\frac {\\mu _{o}I}{2\\pi r}}}\n  \n[17] and \n  \n    \n      \n        L\n        =\n        \n          \n            ϕ\n            I\n          \n        \n        =\n        ∫\n        \n          \n            B\n            I\n          \n        \n        d\n        S\n      \n    \n    {\\displaystyle L={\\frac {\\phi }{I}}=\\int {\\frac {B}{I}}dS}\n  \n\n\nwhere \n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n is magnetic induction, \n  \n    \n      \n        \n          μ\n          \n            o\n          \n        \n      \n    \n    {\\displaystyle \\mu _{o}}\n  \n is the permeability of free space, \n  \n    \n      \n        ϕ\n      \n    \n    {\\displaystyle \\phi }\n  \n is the magnetic flux and \n  \n    \n      \n        d\n        S\n      \n    \n    {\\displaystyle dS}\n  \n is the differential surface. Taking the inductance per meter,\n\n\n  \n    \n      \n        L\n        =\n        \n          ∫\n          \n            d\n          \n          \n            D\n          \n        \n        \n          \n            \n              μ\n              \n                o\n              \n            \n            \n              2\n              π\n              r\n            \n          \n        \n        d\n        r\n        =\n        \n          \n            \n              μ\n              \n                o\n              \n            \n            \n              2\n              π\n            \n          \n        \n        l\n        n\n        \n          \n            D\n            d\n          \n        \n      \n    \n    {\\displaystyle L=\\int \\limits _{d}^{D}{\\frac {\\mu _{o}}{2\\pi r}}dr={\\frac {\\mu _{o}}{2\\pi }}ln{\\frac {D}{d}}}\n  \n,[18]\n\nSubstituting the derived capacitance and inductance,\n\n\n  \n    \n      \n        \n          Z\n          \n            0\n          \n        \n        =\n        \n          \n            \n              L\n              C\n            \n          \n        \n        =\n        \n          \n            1\n            \n              2\n              π\n            \n          \n        \n        \n          \n            \n              μ\n              ϵ\n            \n          \n        \n        ln\n        ⁡\n        \n          \n            D\n            d\n          \n        \n      \n    \n    {\\displaystyle Z_{0}={\\sqrt {\\frac {L}{C}}}={\\frac {1}{2\\pi }}{\\sqrt {\\frac {\\mu }{\\epsilon }}}\\ln {\\frac {D}{d}}}\n  \n[11]\n\n\nIssues[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Coaxial cable\" – news · newspapers · books · scholar · JSTOR  (March 2016) (Learn how and when to remove this template message)\n\n\n\nSignal leakage[edit]\n\nSignal leakage is the passage of electromagnetic fields through the shield of a cable and occurs in both directions. Ingress is the passage of an outside signal into the cable and can result in noise and disruption of the desired signal. Egress is the passage of signal intended to remain within the cable into the outside world and can result in a weaker signal at the end of the cable and radio frequency interference to nearby devices.  Severe leakage usually results from improperly installed connectors or faults in the cable shield.\n\nFor example, in the United States, signal leakage from cable television systems is regulated by the FCC, since cable signals use the same frequencies as aeronautical and radionavigation bands. CATV operators may also choose to monitor their networks for leakage to prevent ingress. Outside signals entering the cable can cause unwanted noise and picture ghosting. Excessive noise can overwhelm the signal, making it useless.\n\nAn ideal shield would be a perfect conductor with no holes, gaps, or bumps connected to a perfect ground. However, a smooth solid highly conductive shield would be heavy, inflexible, and expensive.  Such coax is used for straight line feeds to commercial radio broadcast towers.  More economical cables must make compromises between shield efficacy, flexibility, and cost, such as the corrugated surface of flexible hardline, flexible braid, or foil shields. Since shields cannot be perfect conductors, current flowing on the inside of the shield produces an electromagnetic field on the outer surface of the shield.\n\nConsider the skin effect. The magnitude of an alternating current in a conductor decays exponentially with distance beneath the surface, with the depth of penetration being proportional to the square root of the resistivity. This means that, in a shield of finite thickness, some small amount of current will still be flowing on the opposite surface of the conductor. With a perfect conductor (i.e., zero resistivity), all of the current would flow at the surface, with no penetration into and through the conductor. Real cables have a shield made of an imperfect, although usually very good, conductor, so there must always be some leakage.\n\nThe gaps or holes, allow some of the electromagnetic field to penetrate to the other side. For example, braided shields have many small gaps. The gaps are smaller when using a foil (solid metal) shield, but there is still a seam running the length of the cable. Foil becomes increasingly rigid with increasing thickness, so a thin foil layer is often surrounded by a layer of braided metal, which offers greater flexibility for a given cross-section.\n\nSignal leakage can be severe if there is poor contact at the interface to connectors at either end of the cable or if there is a break in the shield.\n\nTo greatly reduce signal leakage into or out of the cable, by a factor of 1000, or even 10,000, superscreened cables are often used in critical applications, such as for neutron flux counters in nuclear reactors.\n\nSuperscreened cables for nuclear use are defined in IEC 96-4-1, 1990, however as there have been long gaps in the construction of nuclear power stations in Europe, many existing installations are using superscreened cables to the UK standard AESS(TRG) 71181[19] which is referenced in IEC 61917.[20]\n\n\nGround loops[edit]\n\nA continuous current, even if small, along the imperfect shield of a coaxial cable can cause visible or audible interference. In CATV systems distributing analog signals the potential difference between the coaxial network and the electrical grounding system of a house can cause a visible \"hum bar\" in the picture. This appears as a wide horizontal distortion bar in the picture that scrolls slowly upward. Such differences in potential can be reduced by proper bonding to a common ground at the house. See ground loop.\n\n\nNoise[edit]\n\nExternal fields create a voltage across the inductance of the outside of the outer conductor between sender and receiver. The effect is less when there are several parallel cables, as this reduces the inductance and, therefore, the voltage. Because the outer conductor carries the reference potential for the signal on the inner conductor, the receiving circuit measures the wrong voltage.\n\n\nTransformer effect[edit]\n\nThe transformer effect is sometimes used to mitigate the effect of currents induced in the shield. The inner and outer conductors form the primary and secondary winding of the transformer, and the effect is enhanced in some high-quality cables that have an outer layer of mu-metal. Because of this 1:1 transformer, the aforementioned voltage across the outer conductor is transformed onto the inner conductor so that the two voltages can be cancelled by the receiver. Many sender and receivers have means to reduce the leakage even further. They increase the transformer effect by passing the whole cable through a ferrite core one or more times.\n\n\nCommon mode current and radiation[edit]\n\nCommon mode current occurs when stray currents in the shield flow in the same direction as the current in the center conductor, causing the coax to radiate.\n\nMost of the shield effect in coax results from opposing currents in the center conductor and shield creating opposite magnetic fields that cancel, and thus do not radiate.  The same effect helps ladder line.  However, ladder line is extremely sensitive to surrounding metal objects, which can enter the fields before they completely cancel.  Coax does not have this problem, since the field is enclosed in the shield.  However, it is still possible for a field to form between the shield and other connected objects, such as the antenna the coax feeds.  The current formed by the field between the antenna and the coax shield would flow in the same direction as the current in the center conductor, and thus not be canceled. Energy would radiate from the coax itself, affecting the radiation pattern of the antenna. With sufficient power this could be a hazard to people near the cable.  A properly placed and properly sized balun can prevent common mode radiation in coax. An isolating transformer or blocking capacitor can be used to couple a coaxial cable to equipment, where it is desirable to pass radio-frequency signals but to block direct current or low-frequency power.\n\n\nStandards[edit]\n\n\t\n\tThis section includes a list of references, but its sources remain unclear because it has insufficient inline citations. Please help to improve this section by introducing more precise citations.  (June 2009) (Learn how and when to remove this template message)\n\n\n\nMost coaxial cables have a characteristic impedance of either 50, 52, 75, or 93 Ω. The RF industry uses standard type-names for coaxial cables.  Thanks to television, RG-6 is the most commonly used coaxial cable for home use, and the majority of connections outside Europe are by F connectors.\n\nA series of standard types of coaxial cable were specified for military uses, in the form \"RG-#\" or \"RG-#/U\". They date from World War II and were listed in MIL-HDBK-216 published in 1962. These designations are now obsolete. The RG designation stands for Radio Guide; the U designation stands for Universal. The current military standard is MIL-SPEC MIL-C-17. MIL-C-17 numbers, such as \"M17/75-RG214\", are given for military cables and manufacturer's catalog numbers for civilian applications. However, the RG-series designations were so common for generations that they are still used, although critical users should be aware that since the handbook is withdrawn there is no standard to guarantee the electrical and physical characteristics of a cable described as \"RG-# type\". The RG designators are mostly used to identify compatible connectors that fit the inner conductor, dielectric, and jacket dimensions of the old RG-series cables.\n\n\n\tType\n\tImpedance\n(ohms)\n\tCore (mm)\n\tDielectric\n\tOutside diameter\n\tShields\n\tRemarks\n\tMax. attenuation, 750 MHz \n(dB/100 ft)\n\n\tType\n\t(VF)\n\t(in)\n\t(mm)\n\t(in)\n\t(mm)\n\n\tRG-6/U\n\t75\t1.024\tPF\t0.75\t0.185\t4.7\t0.270\t6.86\tDouble\n\tLow loss at high frequency for cable television, satellite television and cable modems\n\t5.650\n\n\tRG-6/UQ\n\t75\t1.024\tPF\t0.75\t0.185\t4.7\t0.298\t7.57\tQuad\n\tThis is \"quad shield RG-6\". It has four layers of shielding; regular RG-6 has only one or two\n\t5.650[21]\n\n\tRG-7\n\t75\t1.30\tPF\t\t0.225\t5.72\t0.320\t8.13\tDouble\n\tLow loss at high frequency for cable television, satellite television and cable modems\n\t4.570\n\n\tRG-8/U\n\t50\t2.17\tPE\t\t0.285\t7.2\t0.405\t10.3\t\n\tAmateur radio; Thicknet (10BASE5) is similar\n\t5.967[22]\n\n\tRG-8X\n\t50\t1.0\tPF\t0.75\t0.185\t4.7\t0.242\t6.1\tDouble\n\tA thinner version, with the electrical characteristics of RG-8U in a diameter similar to RG-6.[23]\n\t10.946[22]\n\n\tRG-9/U\n\t51\t\tPE\t\t\t\t0.420\t10.7\t\n\t\n\n\tRG-11/U\n\t75\t1.63\tPE\t0.66-.85\t0.285\t7.2\t0.412\t10.5\tDual/triple/quad\n\tLow loss at high frequency for cable and satellite television. Used for long drops and underground conduit, similar to RG7 but generally lower loss.[24][25]\n\t3.650\n\n\tRG-56/U\n\t48\t1.4859\t\t\t\t\t0.308\t7.82\tDual braid shielded\n\tRated to 8000 volts, rubber dielectric\n\n\tRG-58/U\n\t50\t0.81\tPE\t0.66\t0.116\t2.9\t0.195\t5.0\tSingle\n\tUsed for radiocommunication and amateur radio, thin Ethernet (10BASE2) and NIM electronics, Loss 1.056 dB/m @ 2.4 GHz. Common.[26]\n\t13.104[22]\n\n\tRG-59/U\n\t75\t0.64\tPE\t0.66\t0.146\t3.7\t0.242\t6.1\tSingle\n\tUsed to carry baseband video in closed-circuit television, previously used for cable television. In general, it has poor shielding but will carry an HQ HD signal or video over short distances.[27]\n\t9.708[22]\n\n\tRG-59A/U\n\t75\t0.762\tPF\t0.78\t0.146\t3.7\t0.242\t6.1\tSingle\n\tSimilar physical characteristics as RG-59 and RG-59/U, but with a higher velocity factor. 8.9@700 MHz\n\t8.900[28]\n\n\t3C-2V\n\t75\t0.50\tPE\t0.85\t\t3.0\t\t5.4\tSingle\n\tUsed to carry television, video observation systems, and other. PVC jacket.\n\n\t5C-2V\n\t75\t0.80\tPE\t0.82±0.02\t0.181\t4.6\t0.256\t6.5\tDouble\n\tUsed for interior lines for monitoring system, CCTV feeder lines, wiring between the camera and control unit and video signal transmission. PVC jacket.\n\n\tRG-60/U\n\t50\t1.024\tPE\t\t\t\t0.425\t10.8\tSingle\n\tUsed for high-definition cable TV and high-speed cable Internet.\n\n\tRG-62/U\n\t92\t\tPF\t0.84\t\t\t0.242\t6.1\tSingle\n\tUsed for ARCNET and automotive radio antennas.[29]\n\n\tRG-62A\n\t93\t\tASP\t\t\t\t0.242\t6.1\tSingle\n\tUsed for NIM electronics\n\n\tRG-63\n\t125\t1.2\tPE\t\t\t\t0.405\t10.29\tDouble braid\n\tUsed for aerospace\t4.6\n\n\tRG-142/U\n\t50\t0.94\tPTFE\t\t0.116\t2.95\t0.195\t4.95\tDouble braid\n\tUsed for test equipment\n\t9.600\n\n\tRG-174/U\n\t50\t7x0.16\tPE\t0.66\t0.059\t1.5\t0.100\t2.55\tSingle\n\tCommon for Wi-Fi pigtails: more flexible but higher loss than RG58; used with LEMO 00 connectors in NIM electronics.\n\t23.565[22]\n\n\tRG-178/U\n\t50\t7×0.1\tPTFE\t0.69\t0.033\t0.84\t0.071\t1.8\tSingle\n\tUsed for high-frequency signal transmission. 42.7 @ 900 MHz,[30] Core material: Ag-plated Cu-clad Steel\n\t42.700[31]\n\n\tRG-179/U\n\t75\t7×0.1\tPTFE\t0.67\t0.063\t1.6\t0.098\t2.5\tSingle\n\tVGA RGBHV,[32] Core material: Ag-plated Cu\n\n\tRG-180B/U\n\t95\t0.31\tPTFE\t\t0.102\t2.59\t0.145\t3.68\tSingle silver-covered copper\n\tVGA RGBHV, Core material: Ag-plated Cu-clad steel\n\n\tRG-188A/U\n\t50\t7×0.16\tPTFE\t0.70\t0.06\t1.52\t0.1\t2.54\tSingle\n\t26.2 @ 1000 MHz, Core material: Ag-plated Cu-clad steel\n\t26.200[33]\n\n\tRG-195\n\t95\t0.305\tPTFE\t\t0.102\t2.59\t0.145\t3.68\tSingle\n\tPTFE jacket suitable for direct burial, Core material: Ag-plated Cu-clad steel\n\t[34]\n\n\tRG-213/U\n\t50\t7×0.75\tPE\t0.66\t0.285\t7.2\t0.405\t10.3\tSingle\n\tFor radiocommunication and amateur radio, EMC test antenna cables. Typically lower loss than RG58. Common.[35]\n\t5.967[22]\n\n\tRG-214/U\n\t50\t7×0.75\tPE\t0.66\t0.285\t7.2\t0.425\t10.8\tDouble\n\tUsed for high-frequency signal transmission.[36]\n\t6.702[22]\n\n\tRG-218\n\t50\t4.963\tPE\t0.66\t0.660 (0.680?)\t16.76 (17.27?)\t0.870\t22\tSingle\n\tLarge diameter, not very flexible, low-loss (2.5 dB/100 ft @ 400 MHz), 11 kV dielectric withstand.\n\t2.834[22]\n\n\tRG-223/U\n\t50\t0.88\tPE\t0.66\t0.0815\t2.07\t0.212\t5.4\tDouble\n\tSilver-plated shields. Sample RG-223 Datasheet\n\t11.461[22]\n\n\tRG-316/U\n\t50\t7×0.17\tPTFE\t0.695\t0.060\t1.5\t0.098\t2.6\tSingle\n\tUsed with LEMO 00 connectors in NIM electronics[37]\n\t22.452[22]\n\n\tRG-400/U\n\t50\t19x0.20\tPTFE\t\t\t2.95\t\t4.95\tDouble\n\t[38]\n\t12.566[22]\n\n\tRG-402/U\n\t50\t0.93\tPTFE\t\t\t3.0\t0.141\t3.58\tSingle silver-plated copper\n\tSemi-rigid, 0.91 dB/m@5 GHz\n\t27.700\n\n\tRG-405/U\n\t50\t0.51\tPTFE\t\t\t1.68\t0.0865\t2.20\tSingle silver-plated copper-clad steel\n\tSemi-rigid, 1.51 dB/m@5 GHz\n\t46.000\n\n\tH155\n\t50\t19 × 0.28\tPF\t0.79\t0.0984\t2.5\t0.2126\t5.4\tDouble\n\tLower loss at high frequency for radiocommunication and amateur radio\n\n\tH500\n\t50\t2.5\tPF\t0.81\t0.1772\t4.5\t0.386\t9.8\tDouble\n\tLow loss at high frequency for radiocommunication and amateur radio, 4.45 @ 1000 MHz\n\t4.450[39]\n\n\tLMR-100\n\t50\t0.46\tPE\t0.66\t0.0417\t1.06\t0.110\t2.79\tDouble\n\tLow loss communications, 1.36 dB/meter @ 2.4 GHz\n\t20.7[22]\n\n\tLMR-195\n\t50\t0.94\tPF\t0.80\t0.073\t1.85\t0.195\t4.95\tDouble\n\tLow loss communications, 0.620 dB/meter @ 2.4 GHz\n\t10.1[22]\n\n\tLMR-200\nHDF-200\nCFD-200\n\t50\t1.12\tPF\t0.83\t0.116\t2.95\t0.195\t4.95\tDouble\n\tLow-loss communications, 0.554 dB/meter @ 2.4 GHz\n\t9.0[22]\n\n\tLMR-240\nEMR-240\n\t50\t1.42\tPF\t0.84\t0.150\t3.81\t0.240\t6.1\tDouble\n\tAmateur radio, low-loss replacement for RG-8X[40]\n\t6.9[22]\n\n\tLMR-300\n\t50\n\t1.78\n\tPF\n\t0.82\n\t0.190\n\t4.83\n\t0.300\n\t7.62\n\tFoil, Braid\n\tLow-loss communications\n\t5.5[22]\n\n\tLMR-400\nHDF-400\nCFD-400\nEMR-400\n\t50\t2.74\tPF\t0.85\t0.285\t7.24\t0.405\t10.29\tDouble\n\tLow-loss communications, 0.223 dB/meter @ 2.4 GHz,[41] Core material: Cu-clad Al\n\t3.5[22]\n\n\tLMR-500\n\t50\t3.61\tPF\t0.86\t0.370\t9.4\t0.500\t12.7\tDouble\n\tLow-loss communications, Core material: Cu-clad Al\n\t2.8[22]\n\n\tLMR-600\n\t50\t4.47\tPF\t0.87\t0.455\t11.56\t0.590\t14.99\tDouble\n\tLow-loss communications, 0.144 dB/meter @ 2.4 GHz, Core material: Cu-clad Al\n\t2.3[22]\n\n\tLMR-900\n\t50\t6.65\tPF\t0.87\t0.680\t17.27\t0.870\t22.10\tDouble\n\tLow-loss communications, 0.098 dB/meter @ 2.4 GHz, Core material: BC tube\n\t1.5[22]\n\n\tLMR-1200\n\t50\t8.86\tPF\t0.88\t0.920\t23.37\t1.200\t30.48\tDouble\n\tLow-loss communications, 0.075 dB/meter @ 2.4 GHz, Core material: BC tube\n\t1.3[22]\n\n\tLMR-1700\n\t50\t13.39\tPF\t0.89\t1.350\t34.29\t1.670\t42.42\tDouble\n\tLow-loss communications, 0.056 dB/meter @ 2.4 GHz, Core material: BC tube\n\t0.8[22]\n\n\tQR-320\n\t75\t1.80\tPF\t\t0.395\t10.03\t\t\tSingle\n\tLow-loss line, which replaced RG-11 in most applications\n\t3.340\n\n\tQR-540\n\t75\t3.15\tPF\t\t0.610\t15.49\t\t\tSingle\n\tLow-loss hard line\n\t1.850\n\n\tQR-715\n\t75\t4.22\tPF\t\t0.785\t19.94\t\t\tSingle\n\tLow-loss hard line\n\t1.490\n\n\tQR-860\n\t75\t5.16\tPF\t\t0.960\t24.38\t\t\tSingle\n\tLow-loss hard line\n\t1.240\n\n\tQR-1125\n\t75\t6.68\tPF\t\t1.225\t31.12\t\t\tSingle\n\tLow-loss hard line\n\t1.010\n\n\n\nDielectric material codes\n\n\n\tFPE is foamed polyethylene\n\tPE is solid polyethylene\n\tPF is polyethylene foam\n\tPTFE is polytetrafluoroethylene;\n\tASP is air space polyethylene[42]\n\n\nVF is the Velocity Factor; it is determined by the effective \n  \n    \n      \n        \n          ϵ\n          \n            r\n          \n        \n      \n    \n    {\\displaystyle \\epsilon _{r}}\n  \n and \n  \n    \n      \n        \n          μ\n          \n            r\n          \n        \n      \n    \n    {\\displaystyle \\mu _{r}}\n  \n[43]\n\n\n\tVF for solid PE is about 0.66\n\tVF for foam PE is about 0.78 to 0.88\n\tVF for air is about 1.00\n\tVF for solid PTFE is about 0.70\n\tVF for foam PTFE is about 0.84\n\n\nThere are also other designation schemes for coaxial cables such as the URM, CT, BT, RA, PSF and WF series.\n\n\n  \nRG-6 Coaxial cable\n\n\n\n  \nRG-142 Coaxial cable\n\n\n\n  \nRG-405 semi-rigid coaxial cable\n\n\n\n  \nHigh-end coaxial audio cable (S/PDIF)\n\n\n\nUses[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (June 2009) (Learn how and when to remove this template message)\n\n\n\nShort coaxial cables are commonly used to connect home video equipment, in ham radio setups, and in measurement electronics. While formerly common for implementing computer networks, in particular Ethernet (\"thick\" 10BASE5 and \"thin\" 10BASE2), twisted pair cables have replaced them in most applications except in the growing consumer cable modem market for broadband Internet access.\n\nLong distance coaxial cable was used in the 20th century to connect radio networks, television networks, and Long Distance telephone networks though this has largely been superseded by later methods (fibre optics, T1/E1, satellite).\n\nShorter coaxials still carry cable television signals to the majority of television receivers, and this purpose consumes the majority of coaxial cable production. In 1980s and early 1990s coaxial cable was also used in computer networking, most prominently in Ethernet networks, where it was later in late 1990s to early 2000s replaced by UTP cables in North America and STP cables in Western Europe, both with 8P8C modular connectors.\n\nMicro coaxial cables are used in a range of consumer devices, military equipment, and also in ultra-sound scanning equipment.\n\nThe most common impedances that are widely used are 50 or 52 ohms, and 75 ohms, although other impedances are available for specific applications. The 50 / 52 ohm cables are widely used for industrial and commercial two-way radio frequency applications (including radio, and telecommunications), although 75 ohms is commonly used for broadcast television and radio.\n\nCoax cable is often used to carry data/signals from an antenna to a receiver—from a satellite dish to a satellite receiver, from a television antenna to a television receiver, from a radio mast to a radio receiver, etc.\nIn many cases, the same single coax cable carries power in the opposite direction, to the antenna, to power the low-noise amplifier.\nIn some cases a single coax cable carries (unidirectional) power and bidirectional data/signals, as in DiSEqC.\n\n\nTypes[edit]\n\nHard line[edit]\n\n  \n1 5⁄8 in (41 mm) flexible line\n\n\n\n  \n1-5/8\" Heliax coaxial cable\n\n\n\nHard line is used in broadcasting as well as many other forms of radio communication. It is a coaxial cable constructed using round copper, silver or gold tubing or a combination of such metals as a shield. Some lower-quality hard line may use aluminum shielding, aluminum however is easily oxidized and unlike silver oxide, aluminum oxide drastically loses effective conductivity. Therefore, all connections must be air and water tight. The center conductor may consist of solid copper, or copper-plated aluminum. Since skin effect is an issue with RF, copper plating provides sufficient surface for an effective conductor.  Most varieties of hardline used for external chassis or when exposed to the elements have a PVC jacket; however, some internal applications may omit the insulation jacket. Hard line can be very thick, typically at least a half inch or 13 mm and up to several times that, and has low loss even at high power. These large-scale hard lines are almost always used in the connection between a transmitter on the ground and the antenna or aerial on a tower. Hard line may also be known by trademarked names such as Heliax (CommScope),[44] or Cablewave (RFS/Cablewave).[45] Larger varieties of hardline may have a center conductor that is constructed from either rigid or corrugated copper tubing. The dielectric in hard line may consist of polyethylene foam, air, or a pressurized gas such as nitrogen or desiccated air (dried air). In gas-charged lines, hard plastics such as nylon are used as spacers to separate the inner and outer conductors. The addition of these gases into the dielectric space reduces moisture contamination, provides a stable dielectric constant, and provides a reduced risk of internal arcing. Gas-filled hardlines are usually used on high-power RF transmitters such as television or radio broadcasting, military transmitters, and high-power amateur radio applications but may also be used on some critical lower-power applications such as those in the microwave bands. However, in the microwave region, waveguide is more often used than hard line for transmitter-to-antenna, or antenna-to-receiver applications. The various shields used in hardline also differ; some forms use rigid tubing, or pipe, while others may use a corrugated tubing, which makes bending easier, as well as reduces kinking when the cable is bent to conform. Smaller varieties of hard line may be used internally in some high-frequency applications, in particular in equipment within the microwave range, to reduce interference between stages of the device.\n\n\nRadiating[edit]\n\nMain article: Leaky feeder\n\nRadiating or leaky cable is another form of coaxial cable which is constructed in a similar fashion to hard line, however it is constructed with tuned slots cut into the shield. These slots are tuned to the specific RF wavelength of operation or tuned to a specific radio frequency band. This type of cable is to provide a tuned bi-directional \"desired\" leakage effect between transmitter and receiver. It is often used in elevator shafts, US Navy Ships, underground transportation tunnels and in other areas where an antenna is not feasible.  One example of this type of cable is Radiax (CommScope).[46]\n\n\nRG-6[edit]\n\nMain article: RG-6\n\nRG-6 is available in four different types designed for various applications.  In addition, the core may be copper clad steel (CCS) or bare solid copper (BC).  \"Plain\" or \"house\" RG-6 is designed for indoor or external house wiring. \"Flooded\" cable is infused with waterblocking gel for use in underground conduit or direct burial. \"Messenger\" may contain some waterproofing but is distinguished by the addition of a steel messenger wire along its length to carry the tension involved in an aerial drop from a utility pole.  \"Plenum\" cabling is expensive and comes with a special Teflon-based outer jacket designed for use in ventilation ducts to meet fire codes. It was developed since the plastics used as the outer jacket and inner insulation in many \"Plain\" or \"house\" cabling gives off poisonous gas when burned.\n\n\nTriaxial cable[edit]\n\nMain article: Triaxial cable\n\nTriaxial cable or triax is coaxial cable with a third layer of shielding, insulation and sheathing. The outer shield, which is earthed (grounded), protects the inner shield from electromagnetic interference from outside sources.\n\n\nTwin-axial cable[edit]\n\nMain article: Twinaxial cabling\n\nTwin-axial cable or twinax is a balanced, twisted pair within a cylindrical shield. It allows a nearly perfect differential signal which is both shielded and balanced to pass through. Multi-conductor coaxial cable is also sometimes used.\n\n\nSemi-rigid[edit]\n\n  \nSemi-Rigid coax assembly\n\n\n\n  \nSemi-Rigid coax installed in an Agilent N9344C 20GHz spectrum analyser\n\n\n\nSemi-rigid cable is a coaxial form using a solid copper outer sheath. This type of coax offers superior screening compared to cables with a braided outer conductor, especially at higher frequencies. The major disadvantage is that the cable, as its name implies, is not very flexible, and is not intended to be flexed after initial forming. (See \"hard line\")\n\nConformable cable is a flexible reformable alternative to semi-rigid coaxial cable used where flexibility is required. Conformable cable can be stripped and formed by hand without the need for specialized tools, similar to standard coaxial cable.\n\n\nRigid line[edit]\n\nRigid line is a coaxial line formed by two copper tubes maintained concentric every other meter using PTFE-supports. Rigid lines cannot be bent, so they often need elbows. Interconnection with rigid line is done with an inner bullet/inner support and a flange or connection kit. Typically, rigid lines are connected using standardised EIA RF Connectors whose bullet and flange sizes match the standard line diameters. For each outer diameter, either 75 or 50 ohm inner tubes can be obtained. \nRigid line is commonly used indoors for interconnection between high power transmitters and other RF-components, but more rugged rigid line with weatherproof flanges is used outdoors on antenna masts, etc. In the interests of saving weight and costs, on masts and similar structures the outer line is often aluminium, and special care must be taken to prevent corrosion.\nWith a flange connector, it is also possible to go from rigid line to hard line. Many broadcasting antennas and antenna splitters use the flanged rigid line interface even when connecting to flexible coaxial cables and hard line.\nRigid line is produced in a number of different sizes:\n\n\n\tSize\n\tOuter conductor\n\tInner conductor\n\n\tOuter diameter (not flanged)\tInner diameter\tOuter diameter\tInner diameter\n\n\t7/8\"\t22.2 mm\t20 mm\t8.7 mm\t7.4 mm\n\n\t1 5/8\"\t41.3 mm\t38.8 mm\t16.9 mm\t15.0 mm\n\n\t3 1/8\"\t79.4 mm\t76.9 mm\t33.4 mm\t31.3 mm\n\n\t4 1/2\"\t106 mm\t103 mm\t44.8 mm\t42.8 mm\n\n\t6 1/8\"\t155.6 mm\t151.9 mm\t66.0 mm\t64.0 mm\n\n\n\nCables used in the UK[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (February 2017) (Learn how and when to remove this template message)\n\n\n\nAt the start of analogue satellite TV broadcasts in the UK by BskyB, a 75 ohm cable referred to as RG6 was used. This cable had a 1 mm copper core, air-spaced polyethylene dielectric and copper braid on an aluminium foil shield. When installed outdoors without protection, the cable was affected by UV radiation, which cracked the PVC outer sheath and allowed moisture ingress. The combination of copper, aluminium, moisture and air caused rapid corrosion, sometimes resulting in a 'snake swallowed an egg' appearance. Consequently, despite the higher cost, the RG6 cable was dropped in favour of CT100 when BSKYB launched its digital broadcasts.\n\nFrom around 1999 to 2005 (when CT100 manufacturer Raydex went out of business), CT100 remained the 75 ohm cable of choice for satellite TV and especially BskyB. It had an air-spaced polyethylene dielectric, a 1 mm solid copper core and copper braid on copper foil shield. CT63 was a thinner cable in 'shotgun' style, meaning that it was two cables moulded together and was used mainly by BskyB for the twin connection required by the Sky+ satellite TV receiver, which incorporated a hard drive recording system and a second, independent tuner.\n\nIn 2005, these cables were replaced by WF100 and WF65, respectively, manufactured by Webro and having a similar construction but a foam dielectric that provided the same electrical performance as air-spaced but was more robust and less likely to be crushed.\n\nAt the same time, with the price of copper steadily rising, the original RG6 was dropped in favour of a construction that used a copper-clad steel core and aluminium braid on aluminium foil. Its lower price made it attractive to aerial installers looking for a replacement for the so-called low-loss cable traditionally used for UK terrestrial aerial installations. This cable had been manufactured with a decreasing number of strands of braid, as the price of copper increased, such that the shielding performance of cheaper brands had fallen to as low as 40 percent. With the advent of digital terrestrial transmissions in the UK, this low-loss cable was no longer suitable.\n\nThe new RG6 still performed well at high frequencies because of the skin effect in the copper cladding. However, the aluminium shield had a high DC resistance and the steel core an even higher one. The result is that this type of cable could not reliably be used in satellite TV installations, where it was required to carry a significant amount of current, because the voltage drop affected the operation of the low noise block downconverter (LNB) on the dish.\n\nA problem with all the aforementioned cables, when passing current, is that electrolytic corrosion can occur in the connections unless moisture and air are excluded. Consequently, various solutions to exclude moisture have been proposed. The first was to seal the connection by wrapping it with self-amalgamating rubberised tape, which bonds to itself when activated by stretching. The second proposal, by the American Channel Master company (now owned by Andrews corp.) at least as early as 1999, was to apply silicone grease to the wires making connection. The third proposal was to fit a self-sealing plug to the cable. All of these methods are reasonably successful if implemented correctly.\n\n\nInterference and troubleshooting[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (June 2009) (Learn how and when to remove this template message)\n\n\n\nCoaxial cable insulation may degrade, requiring replacement of the cable, especially if it has been exposed to the elements on a continuous basis. The shield is normally grounded, and if even a single thread of the braid or filament of foil touches the center conductor, the signal will be shorted causing significant or total signal loss. This most often occurs at improperly installed end connectors and splices. Also, the connector or splice must be properly attached to the shield, as this provides the path to ground for the interfering signal.\n\nDespite being shielded, interference can occur on coaxial cable lines.  Susceptibility to interference has little relationship to broad cable type designations (e.g. RG-59, RG-6) but is strongly related to the composition and configuration of the cable's shielding.  For cable television, with frequencies extending well into the UHF range, a foil shield is normally provided, and will provide total coverage as well as high effectiveness against high-frequency interference.  Foil shielding is ordinarily accompanied by a tinned copper or aluminum braid shield, with anywhere from 60 to 95% coverage.  The braid is important to shield effectiveness because (1) it is more effective than foil at preventing low-frequency interference, (2) it provides higher conductivity to ground than foil, and (3) it makes attaching a connector easier and more reliable.  \"Quad-shield\" cable, using two low-coverage aluminum braid shields and two layers of foil, is often used in situations involving troublesome interference, but is less effective than a single layer of foil and single high-coverage copper braid shield such as is found on broadcast-quality precision video cable.\n\nIn the United States and some other countries, cable television distribution systems use extensive networks of outdoor coaxial cable, often with in-line distribution amplifiers.  Leakage of signals into and out of cable TV systems can cause interference to cable subscribers and to over-the-air radio services using the same frequencies as those of the cable system.\n\n\nHistory[edit]\n\n  \nEarly coaxial antenna feedline of 50 kW radio station WNBC, New York, in 1930s\n\n\n\n  \nAT&T coaxial cable trunkline installed between East Coast and Midwest in 1948. Each of the 8 coaxial subcables could carry 480 telephone calls or one television channel.\n\n\n\n\t1880 — Coaxial cable patented in England by Oliver Heaviside, patent no. 1,407.[47]\n\t1884 — Siemens & Halske patent coaxial cable in Germany (Patent No. 28,978, 27 March 1884).[48]\n\t1894 — Nikola Tesla (U.S. Patent 514,167)\n\t1929 — First modern coaxial cable patented by Lloyd Espenschied and Herman Affel of AT&T's Bell Telephone Laboratories.[49]\n\t1936 — First closed circuit transmission of TV pictures on coaxial cable, from the 1936 Summer Olympics in Berlin to Leipzig.[50]\n\t1936 — World's first underwater coaxial cable installed between Apollo Bay, near Melbourne, Australia, and Stanley, Tasmania. The 300 km (190 mi) cable can carry one 8.5-kHz broadcast channel and seven telephone channels.[51]\n\t1936 — AT&T installs experimental coaxial telephone and television cable between New York and Philadelphia, with automatic booster stations every ten miles (16 km). Completed in December, it can transmit 240 telephone calls simultaneously.[52][53]\n\t1936 — Coaxial cable laid by the General Post Office (now BT) between London and Birmingham, providing 40 telephone channels.[54][55]\n\t1941 — First commercial use in USA by AT&T, between Minneapolis, Minnesota and Stevens Point, Wisconsin. L1 system with capacity of one TV channel or 480 telephone circuits.\n\t1949 — On January 11, eight stations on the US East Coast and seven Midwestern stations are linked via a long-distance coaxial cable.[56]\n\t1956 — First transatlantic coaxial cable laid, TAT-1.[57][58]\n\t1962 — 960 km (600 mi) Sydney–Melbourne co-axial cable commissioned, carrying 3 x 1,260 simultaneous telephone connections, and-or simultaneous inter-city television transmission.[59][60]\n\n\nSee also[edit]\n\n\tBalanced line\n\tRadio frequency power transmission\n\tBNC Connector\n\tLEMO Connector\n\n\nReferences[edit]\n\n\n\t^ Nahin, Paul J. (2002). Oliver Heaviside: The Life, Work, and Times of an Electrical Genius of the Victorian Age. ISBN 0-8018-6909-9.\n\n\t^ a b H. Ward Silver, N0AX; Mark J. Wilson, K1RO, eds. (2010). \"Chapter 20: Transmission Lines\". The ARRL Handbook for Radio Communications (87th ed.). The American Radio Relay League. ISBN 978-0-87259-144-8.\n\n\n\t^ Martin J. Van Der Burgt. \"Coaxial Cables and Applications\" (PDF). Belden. p. 4. Archived from the original (PDF) on 2011-07-28. Retrieved 11 July 2011.\n\n\n\t^ a b c d e The ARRL UHF/Microwave Experimenter's Manual, American Radio Relay League, Newington CT USA,1990 \nISBN 0-87259-312-6, Chapter 5 Transmission Media pages 5.19 through 5.21\n\n\t^ http://www.commscope.com/catalog/wireless/pdf/part/1329/LDF4-50A.pdf CommScope product specifications, retrieved May 25, 2017\n\n\t^ Jackson, John David (1962). Classical Electrodynamics. New York: John Wiley & Sons, Inc. p. 244.\n\n\n\t^ Pozar, David M. (1993). Microwave Engineering Addison-Wesley Publishing Company. \nISBN 0-201-50418-9.\n\n\t^ Ott, Henry W. (1976). Noise Reduction Techniques in Electronic Systems. ISBN 0-471-65726-3.\n\n\n\t^ Elmore, William C.; Heald, Mark A. (1969). Physics of Waves. ISBN 0-486-64926-1.\n\n\n\t^ Kizer, George Maurice (1990). Microwave communication. Iowa State University Press. p. 312. ISBN 978-0-8138-0026-4.\n\n\n\t^ a b \"Coaxial Cable Equations Formulas\". RF Cafe. Retrieved 2012-01-25.\n\n\n\t^ See \"field enhancement\" discussion at http://www.microwaves101.com/encyclopedia/why50ohms.cfm\n\n\t^ \"Why 50 Ohms?\". Microwaves 101. 2009-01-13. Retrieved 2012-01-25.\n\n\n\t^ \"Coax power handling\". Microwaves 101. 2008-09-14. Retrieved 2012-01-25.\n\n\n\t^ \"Why 50 Ohms?\". Microwaves 101. 2009-01-13. Retrieved 2012-01-25.\n\n\n\t^ Michel van Biezen (2014-10-16), Physics - E&M: Electric Potential (15 of 22) Potential Outside 2 Concentric Cylindrical Conductors, retrieved 2018-09-11\n\n\n\t^ McManusPhysics (2014-03-31), Finding B field for coaxial wire using Ampere's law, retrieved 2018-09-11\n\n\n\t^ Physics Galaxy (2014-07-07), 55. Physics | Magnetic Effects | Self Inductance of a Coaxial Cable | by Ashish Arora, retrieved 2018-09-11\n\n\n\t^ \"AESS(TRG) 71181 Part 2, May 1977 Superscreened co-axial cables for the nuclear power industry\". May 1977. Cite journal requires |journal= (help)\n\n\n\t^ \"IEC 61917 Cables, cable assemblies and connectors – Introduction to electromagnetic (EMC) screening measurements First edition 1998-06\" (PDF).\n[permanent dead link]\n\n\t^ \"Coaxial Cable Specifications for RG-6\". madaboutcable.com. Archived from the original on 2010-08-13. Retrieved 2011-06-28.\n\n\n\t^ a b c d e f g h i j k l m n o p q r s t u v \n\"Times Microwave Coax Loss Calculator\". Retrieved 2011-10-26.\n\n\n\t^ http://www.dxengineering.com/pdf/Belden%20RG8X%20Date%209258.pdf\n\n\t^ \"Coaxial Cable Specifications for RG-11\". madaboutcable.com. Archived from the original on 2010-08-11. Retrieved 2011-03-29.\n\n\n\t^ \n\"Belden 7731A RG11 Coax\" (PDF). belden.com.\n\n\n\t^ \"Coaxial Cable Specifications for RG-58\". madaboutcable.com. Archived from the original on 2010-08-09. Retrieved 2011-03-29.\n\n\n\t^ \"Coaxial Cable Specifications for RG-59\". madaboutcable.com. Archived from the original on 2010-08-11. Retrieved 2011-03-29.\n\n\n\t^ \n\"Cable Velocity Factor and Loss Data\". febo.com.\n\n\n\t^ \"Coaxial Cable Specifications for RG-62\". madaboutcable.com. Archived from the original on 2010-08-11. Retrieved 2011-03-29.\n\n\n\t^ \"Coaxial Cable Specifications for RG-178\". madaboutcable.com. Archived from the original on 2011-09-28. Retrieved 2011-04-11.\n\n\n\t^ \nCaledonian.com - RG178 Mini-Coax\n\n\t^ \"Coaxial Cable Specifications for 5 Core RG-179 (RGBHV)\". madaboutcable.com. Archived from the original on 2012-03-30. Retrieved 2011-06-28.\n\n\n\t^ \n [1]\n\n\t^ \"RG195 Coax Cable | Allied Wire & Cable\".\n\n\n\t^ \"Coaxial Cable Specifications for RG-213\". madaboutcable.com. Archived from the original on 2011-09-26. Retrieved 2011-06-28.\n\n\n\t^ \"Coaxial Cable Specifications for RG-214\". madaboutcable.com. Archived from the original on 2010-10-08. Retrieved 2011-03-29.\n\n\n\t^ \"Coaxial Cable Specifications for RG-316\". madaboutcable.com. Archived from the original on 2010-08-11. Retrieved 2011-06-28.\n\n\n\t^ \"Coaxial Cable Specifications for RG-400\". madaboutcable.com. Archived from the original on 2011-09-28. Retrieved 2011-06-28.\n\n\n\t^ [2]\n\n\t^ \"Times Microwave LMR-240 Data Sheet\" (PDF). Archived from the original (PDF) on 2011-10-18. Retrieved 2011-10-26.\n\n\n\t^ \"Radio City Inc\". Archived from the original on 2008-12-07. Retrieved 2009-02-06.\n\n\n\t^ \"Coaxial Cable Specifications Cables Chart\". RF Cafe. Retrieved 2012-01-25.\n\n\n\t^ \"Phase Velocity\". Microwaves 101. 2010-03-30. Retrieved 2012-01-25.\n\n\n\t^  \n\"CommScope Heliax\".\n\n\n\t^ \n\"Cablewave Radio Frequency Systems <http://www.rfsworld.com>\".\n\n\n\t^ \"CommScope Radiax\".\n\n\n\t^ Google Book Search - Oliver Heaviside By Paul J. Nahin\n\n\t^ Feldenkirchen, Wilfried (1994). Werner von Siemens - Inventor and International Entrepreneur. ISBN 0-8142-0658-1.\n\n\n\t^ U.S. Patent 1,835,031\n\n\t^ earlytelevision.org - Early Electronic Television - The 1936 Berlin Olympics Archived 2007-12-03 at the Wayback Machine\n\n\t^ The worldwide history of telecommunications By Anton A. Huurdeman - Copper-Line Transmission\n\n\t^ \"Coaxial Debut,\" Time, Dec. 14, 1936.\n\n\t^ Boing Boing - Gallery: An illustrated history of the transoceanic cable\n\n\t^ Google books - Broadcast engineer's reference book By Edwin Paul J. Tozer\n\n\t^ Radio-electronics.com - Coaxial feeder or RF coax cable\n\n\t^ Teachout, Terry. \"The New-Media Crisis of 1949\". Wall Street Journal. Retrieved 19 January 2015.\n\n\n\t^ Atlantic-cable.com - 1956 TAT-1 Silver Commemorative Dish\n\n\t^ Google books - The worldwide history of telecommunications By Anton A. Huurdeman\n\n\t^ \"Australia's Prime Ministers\". National Archives of Australia. Retrieved 14 September 2013.\n\n\n\t^ The Australasian Engineer, 1962, p.33.\n\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Coaxial cables.\n\n\n\tRF transmission lines and fittings. Military Standardization Handbook MIL-HDBK-216, U.S. Department of Defense, 4 January 1962. [3]\n\tWithdrawal Notice for MIL-HDBK-216 2001\n\tCables, radio frequency, flexible and rigid. Details Specification MIL-DTL-17H, 19 August 2005 (superseding MIL-C-17G, 9 March 1990). [4]\n\tRadio-frequency cables, International Standard IEC 60096.\n\tCoaxial communication cables, International Standard IEC 61196.\n\tCoaxial cables, British Standard BS EN 50117\n\tH. P. Westman et al., (ed), Reference Data for Radio Engineers, Fifth Edition, 1968, Howard W. Sams and Co., no ISBN, Library of Congress Card No. 43-14665\n\tWhat's the Best Cable to Use (UK) [5]\n\thttps://books.google.com/books?id=e9wEntQmA0IC&pg=PA20&lpg=PA20&source=bl&hl=en&sa=X&f=false\n\thttps://archive.org/details/bstj13-4-532 journal=Bell System Technical Journal date= volume=13 issue=4\n\tBrooke Clarke, Transmission Line Zo vs. Frequency, http://www.prc68.com/I/Zo.shtml\n\n\n\t\tv\n\tt\n\te\n\n\nRF connectors (coaxial)\n\n\t\n\t7/16 DIN\n\tAPC-7\n\tBNC\n\tBelling-Lee connector\n\tC\n\tF-type\n\tFME\n\tHirose U.FL\n\tHirose W.FL\n\tIPX\n\tMotorola\n\tMCX\n\tMicrodot\n\tMMCX\n\tN\n\tQLS\n\tQMA/QN\n\tRCA\n\tSHV\n\tSMA\n\tSMB\n\tSMC\n\tTNC\n\tTV aerial plug\n\tUHF / Mini-UHF\n\n\n\n\n\t\n\tVariations and alternate names\n\t\n\t10-32\n\t2.9 mm (SMA)\n\t7 mm\n\tAMC (UFL)\n\tIPEX\n\tMHF\n\tRP-SMA\n\tRP-TNC\n\tSnapN\n\tTriax / Triaxial\n\tTwin BNC / Twinax (BNC)\n\n\n\n\n\t\n\tOld or seldom used\n\tEIA\n\tGR\n\tLEMO 00\n\tMusa\n\n\n\n\n\t\n\tSee also\n\t\n\tAudio and video interfaces and connectors\n\tRadio frequency\n\tRadio spectrum\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nTelecommunications\n\n\tHistory\t\n\tBeacon\n\tBroadcasting\n\tCable protection system\n\tCable TV\n\tCommunications satellite\n\tComputer network\n\tDrums\n\tElectrical telegraph\n\tFax\n\tHeliographs\n\tHydraulic telegraph\n\tInternet\n\tMass media\n\tMobile phone\n\tOptical telecommunication\n\tOptical telegraphy\n\tPager\n\tPhotophone\n\tPrepaid mobile phone\n\tRadio\n\tRadiotelephone\n\tSatellite communications\n\tSemaphore\n\tSmartphone\n\tSmoke signals\n\tTelecommunications history\n\tTelautograph\n\tTelegraphy\n\tTeleprinter (teletype)\n\tTelephone\n\tThe Telephone Cases\n\tTelevision\n\tUndersea telegraph line\n\tVideoconferencing\n\tVideophone\n\tVideotelephony\n\tWhistled language\n\n\n\n\t\n\n\tPioneers\t\n\tEdwin Howard Armstrong\n\tJohn Logie Baird\n\tPaul Baran\n\tAlexander Graham Bell\n\tTim Berners-Lee\n\tJagadish Chandra Bose\n\tVint Cerf\n\tClaude Chappe\n\tDonald Davies\n\tLee de Forest\n\tPhilo Farnsworth\n\tReginald Fessenden\n\tElisha Gray\n\tErna Schneider Hoover\n\tCharles K. Kao\n\tHedy Lamarr\n\tInnocenzo Manzetti\n\tGuglielmo Marconi\n\tAntonio Meucci\n\tRadia Perlman\n\tAlexander Stepanovich Popov\n\tJohann Philipp Reis\n\tHenry Sutton\n\tNikola Tesla\n\tCamille Tissot\n\tAlfred Vail\n\tCharles Wheatstone\n\tVladimir K. Zworykin\n\n\n\n\n\tTransmission\nmedia\t\n\tCoaxial cable\n\tFiber-optic communication\n\tOptical fiber\n\n\n\tFree-space optical communication\n\tMolecular communication\n\tRadio waves\n\tTransmission line\n\n\n\n\n\tNetwork topology\nand switching\t\n\tLinks\n\tNodes\n\tTerminal node\n\tNetwork switching (circuit\n\tpacket)\n\tTelephone exchange\n\n\n\n\n\tMultiplexing\t\n\tSpace-division\n\tFrequency-division\n\tTime-division\n\tPolarization-division\n\tOrbital angular-momentum\n\tCode-division\n\n\n\n\n\tNetworks\t\n\tARPANET\n\tBITNET\n\tCellular network\n\tComputer\n\tCYCLADES\n\tEthernet\n\tFidoNet\n\tInternet\n\tInternet2\n\tISDN\n\tLAN\n\tMobile\n\tNGN\n\tNPL network\n\tPublic Switched Telephone\n\tRadio\n\tTelecommunications equipment\n\tTelevision\n\tTelex\n\tWAN\n\tWireless network\n\tWorld Wide Web\n\n\n\n\n\t\n\t Category\n\t Outline\n\t Portal\n\t Commons\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Coaxial_cable&oldid=918897434\"\n\n\t\t\n\t\tCategories: \tEnglish inventions\n\tSignal cables\n\tAntennas (radio)\n\tTransmission lines\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tAll articles with dead external links\n\tArticles with dead external links from July 2019\n\tArticles with permanently dead external links\n\tWebarchive template wayback links\n\tArticles with short description\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from April 2019\n\tArticles needing additional references from March 2016\n\tAll articles needing additional references\n\tArticles with unsourced statements from April 2012\n\tArticles lacking in-text citations from June 2009\n\tAll articles lacking in-text citations\n\tArticles needing additional references from June 2009\n\tArticles needing additional references from February 2017\n\tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tAzərbaycanca\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\tગુજરાતી\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tLatviešu\n\tLietuvių\n\tMagyar\n\tМакедонски\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tNorsk\n\tਪੰਜਾਬੀ\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tShqip\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t吴语\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 30 September 2019, at 19:49 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "19", "dc:title": "Coaxial cable - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/7/73/RG-59.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-coaxial_cable", "title": "Coaxial cable - Wikipedia"}}