{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nConservation law - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tConservation law\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Conservation law (physics))\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about conservation in physics. For the legal aspects of environmental conservation, see Environmental law and Conservation movement. For other uses, see Conservation (disambiguation).\n\nIn physics, a conservation law states that a particular measurable property of an isolated physical system does not change as the system evolves over time. Exact conservation laws include conservation of energy, conservation of linear momentum, conservation of angular momentum, and conservation of electric charge. There are also many approximate conservation laws, which apply to such quantities as mass, parity, lepton number, baryon number, strangeness, hypercharge, etc.  These quantities are conserved in certain classes of physics processes, but not in all.\n\nA local conservation law is usually expressed mathematically as a continuity equation, a partial differential equation which gives a relation between the amount of the quantity and the \"transport\" of that quantity.    It states that the amount of the conserved quantity at a point or within a volume can only change by the amount of the quantity which flows in or out of the volume.\n\nFrom Noether's theorem, each conservation law is associated with a symmetry in the underlying physics.\n\n\nContents\n\n\n\t1 Conservation laws as fundamental laws of nature\n\t2 Exact laws\n\t3 Approximate laws\n\t4 Global and local conservation laws\n\t5 Differential forms\n\t6 Integral and weak forms\n\t7 See also\n\t7.1 Examples and applications\n\n\n\n\t8 Notes\n\t9 References\n\t10 External links\n\n\n\n\n\nConservation laws as fundamental laws of nature[edit]\n\nConservation laws are fundamental to our understanding of the physical world, in that they describe which processes can or cannot occur in nature.  For example, the conservation law of energy states that the total quantity of energy in an isolated system does not change, though it may change form.  In general, the total quantity of the property governed by that law remains unchanged during physical processes.  With respect to classical physics, conservation laws include conservation of energy, mass (or matter), linear momentum, angular momentum, and electric charge.  With respect to particle physics, particles cannot be created or destroyed except in pairs, where one is ordinary and the other is an antiparticle.  With respect to symmetries and invariance principles, three special conservation laws have been described, associated with inversion or reversal of space, time, and charge.\n\nConservation laws are considered to be fundamental laws of nature, with broad application in physics, as well as in other fields such as chemistry, biology, geology, and engineering.\n\nMost conservation laws are exact, or absolute, in the sense that they apply to all possible processes.  Some conservation laws are partial, in that they hold for some processes but not for others.\n\nOne particularly important result concerning conservation laws is Noether's theorem, which states that there is a one-to-one correspondence between each one of them and a differentiable symmetry of nature.  For example, the conservation of energy follows from the time-invariance of physical systems, and the conservation of angular momentum arises from the fact that physical systems behave the same regardless of how they are oriented in space.\n\n\nExact laws[edit]\n\nA partial listing of physical conservation equations due to symmetry that are said to be exact laws, or more precisely have never been proven to be violated:\n\n\n\tConservation Law\tRespective Noether symmetry invariance\tNumber of dimensions\n\n\tConservation of mass-energy\n\tTime invariance\n\tLorentz invariance symmetry\n\t1\n\ttranslation about time axis\n\n\tConservation of linear momentum\n\tTranslation symmetry\n\t3\n\ttranslation about x,y,z position\n\n\tConservation of angular momentum\n\tRotation invariance\n\t3\n\trotation about x,y,z axes\n\n\tCPT symmetry (combining charge conjugation, parity and time reversal)\n\tLorentz invariance\n\t1 + 1 + 1\n\t(charge inversion q → −q) + (position inversion r → −r) + (time inversion t → −t)\n\n\tConservation of electric charge\n\tGauge invariance\n\t1⊗4\n\tscalar field (1D) in 4D spacetime (x,y,z + time evolution)\n\n\tConservation of color charge\n\tSU(3) Gauge invariance\n\t3\n\tr,g,b\n\n\tConservation of weak isospin\n\tSU(2)L Gauge invariance\n\t1\n\tweak charge\n\n\tConservation of probability\n\tProbability invariance[1]\n\t1 ⊗ 4\n\ttotal probability always = 1 in whole x,y,z space, during time evolution\n\n\n\nApproximate laws[edit]\n\nThere are also approximate conservation laws.  These are approximately true in particular situations, such as low speeds, short time scales, or certain interactions.\n\n\n\tConservation of rest mass\n\tConservation of baryon number (See chiral anomaly and sphaleron)\n\tConservation of lepton number (In the Standard Model)\n\tConservation of flavor (violated by the weak interaction)\n\tConservation of parity\n\tInvariance under charge conjugation\n\tInvariance under time reversal\n\tCP symmetry, the combination of charge conjugation and parity (equivalent to time reversal if CPT holds)\n\n\nGlobal and local conservation laws[edit]\n\nThe total amount of some conserved quantity in the universe could remain unchanged if an equal amount were to appear at one point A and simultaneously disappear from another separate point B.  For example, an amount of energy could appear on Earth without changing the total amount in the Universe if the same amount of energy were to disappear from a remote region of the Universe.  This weak form of \"global\" conservation is really not a conservation law because it is not Lorentz invariant, so phenomena like the above do not occur in nature.[2][3]  Due to special relativity, if the appearance of the energy at A and disappearance of the energy at B are simultaneous in one inertial reference frame, they will not be simultaneous in other inertial reference frames moving with respect to the first.  In a moving frame one will occur before the other; either the energy at A will appear before or after the energy at B disappears.  In both cases, during the interval energy will not be conserved.  \n\nA stronger form of conservation law requires that, for the amount of a conserved quantity at a point to change, there must be a flow, or flux of the quantity into or out of the point.  For example, the amount of electric charge in a volume is never found to change without an electric current into or out of the volume that carries the difference in charge.  Since it only involves continuous local changes, this stronger type of conservation law is Lorentz invariant; a quantity conserved in one reference frame is conserved in all moving reference frames.[2][3]  This is called a local conservation law.[2][3]  Local conservation also implies global conservation; that the total amount of the conserved quantity in the Universe remains constant.  All of the conservation laws listed above are local conservation laws. A local conservation law is expressed mathematically by a continuity equation, which states that the change in the quantity in a volume is equal to the total net  \"flux\" of the quantity through the surface of the volume.  The following sections discuss continuity equations in general.\n\n\nDifferential forms[edit]\n\nSee also: conservation form and continuity equation\n\nIn continuum mechanics, the most general form of an exact conservation law is given by a continuity equation. For example, conservation of electric charge q is\n\n\n\t\n  \n    \n      \n        \n          \n            \n              ∂\n              ρ\n            \n            \n              ∂\n              t\n            \n          \n        \n        =\n        −\n        ∇\n        ⋅\n        \n          j\n        \n        \n      \n    \n    {\\displaystyle {\\frac {\\partial \\rho }{\\partial t}}=-\\nabla \\cdot \\mathbf {j} \\,}\n  \n\n\n\nwhere ∇⋅ is the divergence operator, ρ is the density of q (amount per unit volume), j is the flux of q (amount crossing a unit area in unit time), and t is time.\n\nIf we assume that the motion u of the charge is a continuous function of position and time, then\n\n\n\t\n  \n    \n      \n        \n          j\n        \n        =\n        ρ\n        \n          u\n        \n      \n    \n    {\\displaystyle \\mathbf {j} =\\rho \\mathbf {u} }\n  \n\n\t\n  \n    \n      \n        \n          \n            \n              ∂\n              ρ\n            \n            \n              ∂\n              t\n            \n          \n        \n        =\n        −\n        ∇\n        ⋅\n        (\n        ρ\n        \n          u\n        \n        )\n        \n        .\n      \n    \n    {\\displaystyle {\\frac {\\partial \\rho }{\\partial t}}=-\\nabla \\cdot (\\rho \\mathbf {u} )\\,.}\n  \n\n\n\nIn one space dimension this can be put into the form of a homogeneous first-order quasilinear hyperbolic equation:[4]\n\n\n\t\n  \n    \n      \n        \n          y\n          \n            t\n          \n        \n        +\n        A\n        (\n        y\n        )\n        \n          y\n          \n            x\n          \n        \n        =\n        0\n      \n    \n    {\\displaystyle y_{t}+A(y)y_{x}=0}\n  \n\n\n\nwhere the dependent variable y is called the density of a conserved quantity, and A(y) is called the current jacobian, and the subscript notation for partial derivatives has been employed. The more general inhomogeneous case:\n\n\n\t\n  \n    \n      \n        \n          y\n          \n            t\n          \n        \n        +\n        A\n        (\n        y\n        )\n        \n          y\n          \n            x\n          \n        \n        =\n        s\n      \n    \n    {\\displaystyle y_{t}+A(y)y_{x}=s}\n  \n\n\n\nis not a conservation equation but the general kind of balance equation describing a dissipative system. The dependent variable y is called a nonconserved quantity, and the inhomogeneous term s(y,x,t) is the-source, or dissipation. For example, balance equations of this kind are the momentum and energy Navier-Stokes equations, or the entropy balance for a general isolated system.\n\nIn the one-dimensional space a conservation equation is a first-order quasilinear hyperbolic equation that can be put into the advection form:\n\n\n\t\n  \n    \n      \n        \n          y\n          \n            t\n          \n        \n        +\n        a\n        (\n        y\n        )\n        \n          y\n          \n            x\n          \n        \n        =\n        0\n      \n    \n    {\\displaystyle y_{t}+a(y)y_{x}=0}\n  \n\n\n\nwhere the dependent variable y(x,t) is called the density of the conserved (scalar) quantity (c.q.(d.) = conserved quantity (density)), and a(y) is called the current coefficient, usually corresponding to the partial derivative in the conserved quantity of a current density (c.d.) of the conserved quantity j(y):[4]\n\n\n\t\n  \n    \n      \n        a\n        (\n        y\n        )\n        =\n        \n          j\n          \n            y\n          \n        \n        (\n        y\n        )\n      \n    \n    {\\displaystyle a(y)=j_{y}(y)}\n  \n\n\n\nIn this case since the chain rule applies:\n\n\n\t\n  \n    \n      \n        \n          j\n          \n            x\n          \n        \n        =\n        \n          j\n          \n            y\n          \n        \n        (\n        y\n        )\n        \n          y\n          \n            x\n          \n        \n        =\n        a\n        (\n        y\n        )\n        \n          y\n          \n            x\n          \n        \n      \n    \n    {\\displaystyle j_{x}=j_{y}(y)y_{x}=a(y)y_{x}}\n  \n\n\n\nthe conservation equation can be put into the current density form:\n\n\n\t\n  \n    \n      \n        \n          y\n          \n            t\n          \n        \n        +\n        \n          j\n          \n            x\n          \n        \n        (\n        y\n        )\n        =\n        0\n      \n    \n    {\\displaystyle y_{t}+j_{x}(y)=0}\n  \n\n\n\nIn a space with more than one dimension the former definition can be extended to an equation that can be put into the form:\n\n\n\t\n  \n    \n      \n        \n          y\n          \n            t\n          \n        \n        +\n        \n          a\n        \n        (\n        y\n        )\n        ⋅\n        ∇\n        y\n        =\n        0\n      \n    \n    {\\displaystyle y_{t}+\\mathbf {a} (y)\\cdot \\nabla y=0}\n  \n\n\n\nwhere the conserved quantity is y(r,t), \n  \n    \n      \n        ⋅\n      \n    \n    {\\displaystyle \\cdot }\n  \n denotes the scalar product, ∇ is the nabla operator, here indicating a gradient, and a(y) is a vector of current coefficients, analogously corresponding to the divergence of a vector c.d. associated to the c.q. j(y):\n\n\n\t\n  \n    \n      \n        \n          y\n          \n            t\n          \n        \n        +\n        ∇\n        ⋅\n        \n          j\n        \n        (\n        y\n        )\n        =\n        0\n      \n    \n    {\\displaystyle y_{t}+\\nabla \\cdot \\mathbf {j} (y)=0}\n  \n\n\n\nThis is the case for the continuity equation:\n\n\n\t\n  \n    \n      \n        \n          ρ\n          \n            t\n          \n        \n        +\n        ∇\n        ⋅\n        (\n        ρ\n        \n          u\n        \n        )\n        =\n        0\n      \n    \n    {\\displaystyle \\rho _{t}+\\nabla \\cdot (\\rho \\mathbf {u} )=0}\n  \n\n\n\nHere the conserved quantity is the mass, with density ρ(r,t) and current density  ρu, identical to the momentum density, while u(r,t) is the flow velocity.\n\nIn the general case a conservation equation can be also a system of this kind of equations (a vector equation) in the form:[4]\n\n\n\t\n  \n    \n      \n        \n          \n            y\n          \n          \n            t\n          \n        \n        +\n        \n          A\n        \n        (\n        \n          y\n        \n        )\n        ⋅\n        ∇\n        \n          y\n        \n        =\n        \n          0\n        \n      \n    \n    {\\displaystyle \\mathbf {y} _{t}+\\mathbf {A} (\\mathbf {y} )\\cdot \\nabla \\mathbf {y} =\\mathbf {0} }\n  \n\n\n\nwhere y is called the conserved (vector) quantity, ∇ y is its gradient, 0 is the zero vector, and A(y) is called the Jacobian of the current density. In fact as in the former scalar case, also in the vector case A(y) usually corresponding to the Jacobian of a current density matrix J(y):\n\n\n\t\n  \n    \n      \n        \n          A\n        \n        (\n        \n          y\n        \n        )\n        =\n        \n          \n            J\n          \n          \n            \n              y\n            \n          \n        \n        (\n        \n          y\n        \n        )\n      \n    \n    {\\displaystyle \\mathbf {A} (\\mathbf {y} )=\\mathbf {J} _{\\mathbf {y} }(\\mathbf {y} )}\n  \n\n\n\nand the conservation equation can be put into the form:\n\n\n\t\n  \n    \n      \n        \n          \n            y\n          \n          \n            t\n          \n        \n        +\n        ∇\n        ⋅\n        \n          J\n        \n        (\n        \n          y\n        \n        )\n        =\n        \n          0\n        \n      \n    \n    {\\displaystyle \\mathbf {y} _{t}+\\nabla \\cdot \\mathbf {J} (\\mathbf {y} )=\\mathbf {0} }\n  \n\n\n\nFor example, this the case for Euler equations (fluid dynamics). In the simple incompressible case they are:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                ∇\n                ⋅\n                \n                  u\n                \n                =\n                0\n              \n            \n            \n              \n                \n                  \n                    \n                      ∂\n                      \n                        u\n                      \n                    \n                    \n                      ∂\n                      t\n                    \n                  \n                \n                +\n                \n                  u\n                \n                ⋅\n                ∇\n                \n                  u\n                \n                +\n                ∇\n                s\n                =\n                \n                  0\n                \n                ,\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}\\nabla \\cdot \\mathbf {u} =0\\\\[1.2ex]{\\partial \\mathbf {u}  \\over \\partial t}+\\mathbf {u} \\cdot \\nabla \\mathbf {u} +\\nabla s=\\mathbf {0} ,\\end{aligned}}}\n  \n\n\n\nwhere:\n\n\n\tu is the flow velocity vector, with components in a N-dimensional space u1, u2 ... uN,\n\ts is the specific pressure (pressure per unit density) giving the source term,\n\n\nSee also: Euler equations (fluid dynamics)\n\nIt can be shown that the conserved (vector) quantity and the c.d. matrix for these equations are respectively:\n\n\n\t\n  \n    \n      \n        \n          \n            y\n          \n        \n        =\n        \n          \n            (\n            \n              \n                \n                  1\n                \n              \n              \n                \n                  \n                    u\n                  \n                \n              \n            \n            )\n          \n        \n        ;\n        \n        \n          \n            J\n          \n        \n        =\n        \n          \n            (\n            \n              \n                \n                  \n                    u\n                  \n                \n              \n              \n                \n                  \n                    u\n                  \n                  ⊗\n                  \n                    u\n                  \n                  +\n                  s\n                  \n                    I\n                  \n                \n              \n            \n            )\n          \n        \n        ;\n        \n      \n    \n    {\\displaystyle {\\mathbf {y} }={\\begin{pmatrix}1\\\\\\mathbf {u} \\end{pmatrix}};\\qquad {\\mathbf {J} }={\\begin{pmatrix}\\mathbf {u} \\\\\\mathbf {u} \\otimes \\mathbf {u} +s\\mathbf {I} \\end{pmatrix}};\\qquad }\n  \n\n\n\nwhere \n  \n    \n      \n        ⊗\n      \n    \n    {\\displaystyle \\otimes }\n  \n denotes the outer product.\n\n\nIntegral and weak forms[edit]\n\nConservation equations can be also expressed in integral form: the advantage of the latter is substantially that it requires less smoothness of the solution, which paves the way to weak form, extending the class of admissible solutions to include discontinuous solutions.[5] By integrating in any space-time domain the current density form in 1-D space:\n\n\n\t\n  \n    \n      \n        \n          y\n          \n            t\n          \n        \n        +\n        \n          j\n          \n            x\n          \n        \n        (\n        y\n        )\n        =\n        0\n      \n    \n    {\\displaystyle y_{t}+j_{x}(y)=0}\n  \n\n\n\nand by using Green's theorem, the integral form is:\n\n\n\t\n  \n    \n      \n        \n          ∫\n          \n            −\n            ∞\n          \n          \n            ∞\n          \n        \n        y\n        \n        d\n        x\n        +\n        \n          ∫\n          \n            0\n          \n          \n            ∞\n          \n        \n        j\n        (\n        y\n        )\n        \n        d\n        t\n        =\n        0\n      \n    \n    {\\displaystyle \\int _{-\\infty }^{\\infty }y\\,dx+\\int _{0}^{\\infty }j(y)\\,dt=0}\n  \n\n\n\nIn a similar fashion, for the scalar multidimensional space, the integral form is:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              ∮\n              \n            \n          \n          \n        \n        ⁡\n        [\n        y\n        \n        \n          d\n          \n            N\n          \n        \n        r\n        +\n        j\n        (\n        y\n        )\n        \n        d\n        t\n        ]\n        =\n        0\n      \n    \n    {\\displaystyle \\oint [y\\,d^{N}r+j(y)\\,dt]=0}\n  \n\n\n\nwhere the line integration is performed along the boundary of the domain, in an anticlock-wise manner.[5]\n\nMoreover, by defining a test function φ(r,t) continuously differentiable both in time and space with compact support, the weak form can be obtained pivoting on the initial condition. In 1-D space it is:\n\n\n\t\n  \n    \n      \n        \n          ∫\n          \n            0\n          \n          \n            ∞\n          \n        \n        \n          ∫\n          \n            −\n            ∞\n          \n          \n            ∞\n          \n        \n        \n          ϕ\n          \n            t\n          \n        \n        y\n        +\n        \n          ϕ\n          \n            x\n          \n        \n        j\n        (\n        y\n        )\n        \n        d\n        x\n        \n        d\n        t\n        =\n        −\n        \n          ∫\n          \n            −\n            ∞\n          \n          \n            ∞\n          \n        \n        ϕ\n        (\n        x\n        ,\n        0\n        )\n        y\n        (\n        x\n        ,\n        0\n        )\n        \n        d\n        x\n      \n    \n    {\\displaystyle \\int _{0}^{\\infty }\\int _{-\\infty }^{\\infty }\\phi _{t}y+\\phi _{x}j(y)\\,dx\\,dt=-\\int _{-\\infty }^{\\infty }\\phi (x,0)y(x,0)\\,dx}\n  \n\n\n\nNote that in the weak form all the partial derivatives of the density and current density have been passed on to the test function, which with the former hypothesis is sufficiently smooth to admit these derivatives.[5]\n\n\nSee also[edit]\n\n\tInvariant (physics)\n\tConserved quantity\n\tSome kinds of helicity are conserved in dissipationless limit: hydrodynamical helicity, magnetic helicity, cross-helicity.\n\n\n\tConservation law of the Stress–energy tensor\n\tRiemann invariant\n\tPhilosophy of physics\n\tTotalitarian principle\n\tConvection–diffusion equation\n\n\nExamples and applications[edit]\n\n\tAdvection\n\tMass conservation, or Continuity equation\n\tCharge conservation\n\tEuler equations (fluid dynamics)\n\tinviscid Burgers equation\n\tKinematic wave\n\tConservation of energy\n\tTraffic flow\n\n\nNotes[edit]\n\n\t^ \"The gauge-invariance of the probability current\". Physics Stack Exchange. Archived from the original on 18 August 2017. Retrieved 4 May 2018.\n\n\t^ a b c Aitchison, Ian J. R.; Hey, Anthony J.G. (2012). Gauge Theories in Particle Physics: A Practical Introduction: From Relativistic Quantum Mechanics to QED, Fourth Edition, Vol. 1. CRC Press. p. 43. ISBN 978-1466512993. Archived from the original on 2018-05-04.\n\n\n\t^ a b c Will, Clifford M. (1993). Theory and Experiment in Gravitational Physics. Cambridge Univ. Press. p. 105. ISBN 978-0521439732. Archived from the original on 2017-02-20.\n\n\n\t^ a b c see Toro, p.43\n\n\t^ a b c see Toro, p.62-63\n\n\n\n\nReferences[edit]\n\n\tPhilipson, Schuster, Modeling by Nonlinear Differential Equations: Dissipative and Conservative Processes, World Scientific Publishing Company 2009.\n\tVictor J. Stenger, 2000. Timeless Reality: Symmetry, Simplicity, and Multiple Universes. Buffalo NY: Prometheus Books. Chpt. 12 is a gentle introduction to symmetry, invariance, and conservation laws.\n\tToro, E.F. (1999). \"Chapter 2. Notions on Hyperbolic PDEs\". Riemann Solvers and Numerical Methods for Fluid Dynamics. Springer-Verlag. ISBN 978-3-540-65966-2.\n\n\tE. Godlewski and P.A. Raviart, Hyperbolic systems of conservation laws, Ellipses, 1991.\n\n\nExternal links[edit]\n\n\tConservation Laws — Ch. 11-15 in an online textbook\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Conservation_law&oldid=916104384\"\n\n\t\t\n\t\tCategories: \tSymmetry\n\tConservation laws\n\tConcepts in physics\n\tPhysical systems\n\tScientific laws\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tБеларуская\n\tBosanski\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tქართული\n\tҚазақша\n\tLietuvių\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tਪੰਜਾਬੀ\n\tPolski\n\tPortuguês\n\tРусский\n\tScots\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 17 September 2019, at 01:34 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "7", "dc:title": "Conservation law - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-conservation_law_-physics", "title": "Conservation law - Wikipedia"}}