{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDigital electronics - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tDigital electronics\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Digital circuit)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tElectronic circuits that utilize digital signals\n\n\t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Digital electronics\" – news · newspapers · books · scholar · JSTOR  (March 2016) (Learn how and when to remove this template message)\n\n\n\nDigital electronics\n\n\nA digital signal has two or more distinguishable waveforms, in this example, high voltage and low voltages, each of which can be mapped onto a digit.\n\n\n\nAn industrial digital controller\n\n\n\n\n\nDigital electronics, digital technology or digital (electronic) circuits are electronics that operate on digital signals. In contrast, analog circuits manipulate analog signals whose performance is more subject to manufacturing tolerance, signal attenuation and noise. Digital techniques are helpful because it is a lot easier to get an electronic device to switch into one of a number of known states than to accurately reproduce a continuous range of values.\n\nDigital electronic circuits are usually made from large assemblies of logic gates (often printed on integrated circuits), simple electronic representations of Boolean logic functions.[1]\n\n\nContents\n\n\n\t1 History\n\t2 Properties\n\t3 Construction\n\t4 Design\n\t4.1 Representation\n\t4.2 Combinational vs. Sequential\n\t4.3 Synchronous systems\n\t4.4 Asynchronous systems\n\t4.5 Register transfer systems\n\t4.6 Computer design\n\t4.7 Computer architecture\n\t4.8 Design issues in digital circuits\n\t4.9 Automated design tools\n\t4.10 Design for testability\n\t4.11 Trade-offs\n\t4.11.1 Cost\n\t4.11.2 Reliability\n\t4.11.3 Fanout\n\t4.11.4 Speed\n\n\n\n\n\n\n\t5 Logic families\n\t6 Recent developments\n\t7 See also\n\t8 Notes\n\t9 References\n\t10 External links\n\n\n\n\n\nHistory[edit]\n\nThe binary number system was refined by Gottfried Wilhelm Leibniz (published in 1705) and he also established that by using the binary system, the principles of arithmetic and logic could be joined. Digital logic as we know it was the brain-child of George Boole in the mid 19th century. In an 1886 letter, Charles Sanders Peirce described how logical operations could be carried out by electrical switching circuits.[2] Eventually, vacuum tubes replaced relays for logic operations. Lee De Forest's modification, in 1907, of the Fleming valve can be used as an AND gate. Ludwig Wittgenstein introduced a version of the 16-row truth table as proposition 5.101 of Tractatus Logico-Philosophicus (1921). Walther Bothe, inventor of the coincidence circuit, shared the 1954 Nobel Prize in physics, for the first modern electronic AND gate in 1924.\n\nMechanical analog computers started appearing in the first century and were later used in the medieval era for astronomical calculations. In World War II, mechanical analog computers were used for specialized military applications such as calculating torpedo aiming. During this time the first electronic digital computers were developed. Originally they were the size of a large room, consuming as much power as several hundred modern personal computers (PCs).[3]\n\nThe Z3 was an electromechanical computer designed by Konrad Zuse. Finished in 1941, it was the world's first working programmable, fully automatic digital computer.[4] Its operation was facilitated by the invention of the vacuum tube in 1904 by John Ambrose Fleming.\n\nAt the same time that digital calculation replaced analog, purely electronic circuit elements soon replaced their mechanical and electromechanical equivalents. William Shockley, John Bardeen and Walter Brattain invented the point-contact transistor in 1947, followed by the bipolar junction transistor in 1948.[5][6]\n\nAt the University of Manchester, a team under the leadership of Tom Kilburn designed and built a machine using the newly developed transistors instead of vacuum tubes.[7] Their first transistorised computer and the first in the world, was operational by 1953, and a second version was completed there in April 1955. From 1955 onwards, transistors replaced vacuum tubes in computer designs, giving rise to the \"second generation\" of computers. Compared to vacuum tubes, transistors have many advantages: they are smaller, and require less power than vacuum tubes, so give off less heat. Silicon junction transistors were much more reliable than vacuum tubes and had longer, indefinite, service life. Transistorized computers could contain tens of thousands of binary logic circuits in a relatively compact space.\n\nWhile working at Texas Instruments in July 1958, Jack Kilby recorded his initial ideas concerning the integrated circuit (IC), then successfully demonstrated the first working integrated on 12 September 1958.[8] Kilby's chip was made of germanium. The following year, Robert Noyce at Fairchild Semiconductor invented the silicon integrated circuit. The basis for Noyce's silicon IC was the planar process, developed in early 1959 by Jean Hoerni, who was in turn building on Mohamed Atalla's silicon surface passivation method developed in 1957.[9] This new technique, the integrated circuit, allowed for quick, low-cost fabrication of complex circuits by having a set of electronic circuits on one small plate (\"chip\") of semiconductor material, normally silicon.\n\nThe MOSFET (metal-oxide-semiconductor field-effect transistor), also known as the MOS transistor, was invented by Mohamed Atalla and Dawon Kahng at Bell Labs in 1959.[10][11][12][13] The MOS transistor's advantages include high scalability,[14] affordability,[15] low power consumption, and high density.[16] The MOS transistor revolutionized the electronics industry,[17][18] and is the most common semiconductor device in the world.[12][19] The MOS transistor has been the fundamental building block of digital electronics since the late 20th century.[13][20]\n\nIn the early days of integrated circuits, each chip was limited to only a few transistors, and the low degree of integration meant the design process was relatively simple. Manufacturing yields were also quite low by today's standards. The wide adoption of the MOSFET transistor by the early 1970s led to the first large-scale integration ICs with more than 10,000 transistors on a single chip.[21] Following the wide adoption of CMOS, a type of MOSFET logic, by the 1980s, millions and then billions of MOS transistors could be placed on one chip as the technology progressed,[22] and good designs required thorough planning, giving rise to new design methods. As of 2013, billions of MOS transistors are manufactured every day.[12]\n\n\nProperties[edit]\n\nAn advantage of digital circuits when compared to analog circuits is that signals represented digitally can be transmitted without degradation caused by noise.[23] For example, a continuous audio signal transmitted as a sequence of 1s and 0s, can be reconstructed without error, provided the noise picked up in transmission is not enough to prevent identification of the 1s and 0s.\n\nIn a digital system, a more precise representation of a signal can be obtained by using more binary digits to represent it.  While this requires more digital circuits to process the signals, each digit is handled by the same kind of hardware, resulting in an easily scalable system. In an analog system, additional resolution requires fundamental improvements in the linearity and noise characteristics of each step of the signal chain.\n\nWith computer-controlled digital systems, new functions to be added through software revision and no hardware changes.  Often this can be done outside of the factory by updating the product's software.  So, the product's design errors can be corrected after the product is in a customer's hands.\n\nInformation storage can be easier in digital systems than in analog ones.  The noise immunity of digital systems permits data to be stored and retrieved without degradation.  In an analog system, noise from aging and wear degrade the information stored.  In a digital system, as long as the total noise is below a certain level, the information can be recovered perfectly. Even when more significant noise is present, the use of redundancy permits the recovery of the original data provided too many errors do not occur.\n\nIn some cases, digital circuits use more energy than analog circuits to accomplish the same tasks, thus producing more heat which increases the complexity of the circuits such as the inclusion of heat sinks.  In portable or battery-powered systems this can limit use of digital systems. For example, battery-powered cellular telephones often use a low-power analog front-end to amplify and tune in the radio signals from the base station.  However, a base station has grid power and can use power-hungry, but very flexible software radios.  Such base stations can be easily reprogrammed to process the signals used in new cellular standards.\n\nMany useful digital systems must translate from continuous analog signals to discrete digital signals.  This causes quantization errors. Quantization error can be reduced if the system stores enough digital data to represent the signal to the desired degree of fidelity.  The Nyquist-Shannon sampling theorem provides an important guideline as to how much digital data is needed to accurately portray a given analog signal.\n\nIn some systems, if a single piece of digital data is lost or misinterpreted, the meaning of large blocks of related data can completely change. For example, a single-bit error in audio data stored directly as linear pulse code modulation causes, at worst, a single click. Instead, many people use audio compression to save storage space and download time, even though a single bit error may cause a larger disruption.\n\nBecause of the cliff effect, it can be difficult for users to tell if a particular system is right on the edge of failure, or if it can tolerate much more noise before failing. Digital fragility can be reduced by designing a digital system for robustness.  For example, a parity bit or other error management method can be inserted into the signal path.  These schemes help the system detect errors, and then either correct the errors, or request retransmission of the data.\n\n\nConstruction[edit]\n\n  \nA binary clock, hand-wired on breadboards\n\n\n\nA digital circuit is typically constructed from small electronic circuits called logic gates that can be used to create combinational logic.  Each logic gate is designed to perform a function of boolean logic when acting on logic signals.  A logic gate is generally created from one or more electrically controlled switches, usually transistors but thermionic valves have seen historic use. The output of a logic gate can, in turn, control or feed into more logic gates.\n\nAnother form of digital circuit is constructed from lookup tables, (many sold as \"programmable logic devices\", though other kinds of PLDs exist).  Lookup tables can perform the same functions as machines based on logic gates, but can be easily reprogrammed without changing the wiring.  This means that a designer can often repair design errors without changing the arrangement of wires.  Therefore, in small volume products, programmable logic devices are often the preferred solution.  They are usually designed by engineers using electronic design automation software.\n\nIntegrated circuits consist of multiple transistors on one silicon chip, and are the least expensive way to make large number of interconnected logic gates. Integrated circuits are usually interconnected on a printed circuit board which is a board which holds electrical components, and connects them together with copper traces.\n\n\nDesign[edit]\n\nEngineers use many methods to minimize logic redundancy in order to reduce the circuit complexity. Reduced complexity reduces component count and potential errors and therefore typically reduces cost. Logic redundancy can be removed by several well-known techniques, such as binary decision diagrams, Boolean algebra, Karnaugh maps, the Quine–McCluskey algorithm, and the heuristic computer method. These operations are typically performed within a computer-aided design system.\n\nWhen the volumes are medium to large, and the logic can be slow, or involves complex algorithms or sequences, often a small microcontroller is programmed to make an embedded system.  These are usually programmed by software engineers.\n\nWhen only one digital circuit is needed, and its design is totally customized, as for a factory production line controller, the conventional solution is a programmable logic controller, or PLC.  These are usually programmed by electricians, using ladder logic.\n\n\nRepresentation[edit]\n\nRepresentations are crucial to an engineer's design of digital circuits.  Some analysis methods only work with particular representations.\n\nThe classical way to represent a digital circuit is with an equivalent set of logic gates. Each logic symbol is represented by a different shape. The actual set of shapes was introduced in 1984 under IEEE/ANSI standard 91-1984. \"The logic symbol given under this standard are being increasingly used now and have even started appearing in the literature published by manufacturers of digital integrated circuits.\"[24]  \n\nAnother way, often with the least electronics, is to construct an equivalent system of electronic switches (usually transistors).  One of the easiest ways is to simply have a memory containing a truth table.  The inputs are fed into the address of the memory, and the data outputs of the memory become the outputs.\n\nFor automated analysis, these representations have digital file formats that can be processed by computer programs.  Most digital engineers are very careful to select computer programs (\"tools\") with compatible file formats.\n\n\nCombinational vs. Sequential[edit]\n\nTo choose representations, engineers consider types of digital systems.  Most digital systems divide into \"combinational systems\" and \"sequential systems.\"  A combinational system always presents the same output when given the same inputs.  It is basically a representation of a set of logic functions, as already discussed.\n\nA sequential system is a combinational system with some of the outputs fed back as inputs.  This makes the digital machine perform a \"sequence\" of operations.  The simplest sequential system is probably a flip flop, a mechanism that represents a binary digit or \"bit\".\n\nSequential systems are often designed as state machines.  In this way, engineers can design a system's gross behavior, and even test it in a simulation, without considering all the details of the logic functions.\n\nSequential systems divide into two further subcategories. \"Synchronous\" sequential systems change state all at once, when a \"clock\" signal changes state.  \"Asynchronous\" sequential systems propagate changes whenever inputs change.  Synchronous sequential systems are made of well-characterized asynchronous circuits such as flip-flops, that change only when the clock changes, and which have carefully designed timing margins.\n\n\nSynchronous systems[edit]\n\n  \nA 4-bit ring counter using D-type flip flops is an example of synchronous logic. Each device is connected to the clock signal, and update together.\n\n\n\nMain article: synchronous logic\n\nThe usual way to implement a synchronous sequential state machine is to divide it into a piece of combinational logic and a set of flip flops called a \"state register.\"  Each time a clock signal ticks, the state register captures the feedback generated from the previous state of the combinational logic, and feeds it back as an unchanging input to the combinational part of the state machine.  The fastest rate of the clock is set by the most time-consuming logic calculation in the combinational logic.\n\nThe state register is just a representation of a binary number.  If the states in the state machine are numbered (easy to arrange), the logic function is some combinational logic that produces the number of the next state.\n\n\nAsynchronous systems[edit]\n\nAs of 2014, most digital logic is synchronous because it is easier to create and verify a synchronous design. However, asynchronous logic is thought can be superior because its speed is not constrained by an arbitrary clock; instead, it runs at the maximum speed of its logic gates. Building an asynchronous system using faster parts makes the circuit faster.\n\nNevertherless, most systems need circuits that allow external unsynchronized signals to enter synchronous logic circuits.  These are inherently asynchronous in their design and must be analyzed as such. Examples of widely used asynchronous circuits include synchronizer flip-flops, switch debouncers and arbiters.\n\nAsynchronous logic components can be hard to design because all possible states, in all possible timings must be considered.  The usual method is to construct a table of the minimum and maximum time that each such state can exist, and then adjust the circuit to minimize the number of such states.  Then the designer must force the circuit to periodically wait for all of its parts to enter a compatible state (this is called \"self-resynchronization\"). Without such careful design, it is easy to accidentally produce asynchronous logic that is \"unstable,\" that is, real electronics will have unpredictable results because of the cumulative delays caused by small variations in the values of the electronic components.\n\n\nRegister transfer systems[edit]\n\n  \nExample of a simple circuit with a toggling output. The inverter forms the combinational logic in this circuit, and the register holds the state.\n\n\n\nMany digital systems are data flow machines.  These are usually designed using synchronous register transfer logic, using hardware description languages such as VHDL or Verilog.\n\nIn register transfer logic, binary numbers are stored in groups of flip flops called registers.  The outputs of each register are a bundle of wires called a \"bus\" that carries that number to other calculations.  A calculation is simply a piece of combinational logic.  Each calculation also has an output bus, and these may be connected to the inputs of several registers.  Sometimes a register will have a multiplexer on its input, so that it can store a number from any one of several buses.  Alternatively, the outputs of several items may be connected to a bus through buffers that can turn off the output of all of the devices except one.  A sequential state machine controls when each register accepts new data from its input.\n\nAsynchronous register-transfer systems (such as computers) have a general solution. In the 1980s, some researchers discovered that almost all synchronous register-transfer machines could be converted to asynchronous designs by using first-in-first-out synchronization logic.  In this scheme, the digital machine is characterized as a set of data flows.  In each step of the flow, an asynchronous \"synchronization circuit\" determines when the outputs of that step are valid, and presents a signal that says, \"grab the data\" to the  stages that use that stage's inputs.  It turns out that just a few relatively simple synchronization circuits are needed.\n\n\nComputer design[edit]\n\n  \nIntel 80486DX2 microprocessor\n\n\n\nThe most general-purpose register-transfer logic machine is a computer.  This is basically an automatic binary abacus. The control unit of a computer is usually designed as a microprogram run by a microsequencer.  A microprogram is much like a  player-piano roll.  Each table entry or \"word\" of the microprogram commands the state of every bit that controls the computer.  The sequencer then counts, and the count addresses the memory or combinational logic machine that contains the microprogram.  The bits from the microprogram control the arithmetic logic unit, memory and other parts of the computer, including the microsequencer itself. A \"specialized computer\" is usually a conventional computer with special-purpose control logic or microprogram.\n\nIn this way, the complex task of designing the controls of a computer is reduced to a simpler task of programming a collection of much simpler logic machines.\n\nAlmost all computers are synchronous.  However, true asynchronous computers have also been designed. One example is the Aspida DLX core.[25] Another was offered by ARM Holdings. Speed advantages have not materialized, because modern computer designs already run at the speed of their slowest component, usually memory.  These do use somewhat less power because a clock distribution network is not needed.  An unexpected advantage is that asynchronous computers do not produce spectrally-pure radio noise, so they are used in some mobile-phone base-station controllers. They may be more secure in cryptographic applications because their electrical and radio emissions can be more difficult to decode.[26]\n\n\nComputer architecture[edit]\n\nComputer architecture is a specialized engineering activity that tries to arrange the registers, calculation logic, buses and other parts of the computer in the best way for some purpose.  Computer architects have applied large amounts of ingenuity to computer design to reduce the cost and increase the speed and immunity to programming errors of computers.  An increasingly common goal is to reduce the power used in a battery-powered computer system, such as a cell-phone.  Many computer architects serve an extended apprenticeship as microprogrammers.\n\n\nDesign issues in digital circuits[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Digital electronics\" – news · newspapers · books · scholar · JSTOR  (September 2015) (Learn how and when to remove this template message)\n\n\n\nDigital circuits are made from analog components.  The design must assure that the analog nature of the components doesn't dominate the desired digital behavior.  Digital systems must manage noise and timing margins, parasitic inductances and capacitances, and filter power connections.\n\nBad designs have intermittent problems such as \"glitches\", vanishingly fast pulses that may trigger some logic but not others, \"runt pulses\" that do not reach valid \"threshold\" voltages, or unexpected  (\"undecoded\") combinations of logic states.\n\nAdditionally, where clocked digital systems interface to analog systems or systems that are driven from a different clock, the digital system can be subject to metastability where a change to the input violates the set-up time for a digital input latch. This situation will self-resolve, but will take a random time, and while it persists can result in invalid signals being propagated within the digital system for a short time.\n\nSince digital circuits are made from analog components, digital circuits calculate more slowly than low-precision analog circuits that use a similar amount of space and power.  However, the digital circuit will calculate more repeatably, because of its high noise immunity.  On the other hand, in the high-precision domain (for example, where 14 or more bits of precision are needed), analog circuits require much more power and area than digital equivalents.\n\n\nAutomated design tools[edit]\n\nTo save costly engineering effort, much of the effort of designing large logic machines has been automated.  The computer programs are called \"electronic design automation tools\" or just \"EDA.\"\n\nSimple truth table-style descriptions of logic are often optimized with EDA that automatically produces reduced systems of logic gates or smaller lookup tables that still produce the desired outputs. The most common example of this kind of software is the Espresso heuristic logic minimizer.\n\nMost practical algorithms for optimizing large logic systems use algebraic manipulations or binary decision diagrams, and there are promising experiments with genetic algorithms and annealing optimizations.\n\nTo automate costly engineering processes, some EDA can take state tables that describe state machines and automatically produce a truth table or a function table for the combinational logic of a state machine.  The state table is a piece of text that lists each state, together with the conditions controlling the transitions between them and the belonging output signals.\n\nIt is common for the function tables of such computer-generated state-machines to be optimized with logic-minimization software such as Minilog.\n\nOften, real logic systems are designed as a series of sub-projects, which are combined using a \"tool flow.\"  The tool flow is usually a \"script,\" a simplified computer language that can invoke the software design tools in the right order.\n\nTool flows for large logic systems such as microprocessors can be thousands of commands long, and combine the work of hundreds of engineers.\n\nWriting and debugging tool flows is an established engineering specialty in companies that produce digital designs.  The tool flow usually terminates in a detailed computer file or set of files that describe how to physically construct the logic.  Often it consists of instructions to draw the transistors and wires on an integrated circuit or a printed circuit board.\n\nParts of tool flows are \"debugged\" by verifying the outputs of simulated logic against expected inputs.  The test tools take computer files with sets of inputs and outputs, and highlight discrepancies between the simulated behavior and the expected behavior.\n\nOnce the input data is believed correct, the design itself must still be verified for correctness.  Some tool flows verify designs by first producing a design, and then scanning the design to produce compatible input data for the tool flow.  If the scanned data matches the input data, then the tool flow has probably not introduced errors.\n\nThe functional verification data are usually called \"test vectors\". The functional test vectors may be preserved and used in the factory to test that newly constructed logic works correctly.  However, functional test patterns don't discover common fabrication faults.  Production tests are often designed by software tools called \"test pattern generators\". These generate test vectors by examining the structure of the logic and systematically generating tests for particular faults. This way the fault coverage can closely approach 100%, provided the design is properly made testable (see next section).\n\nOnce a design exists, and is verified and testable, it often needs to be processed to be manufacturable as well.  Modern integrated circuits have features smaller than the wavelength of the light used to expose the photoresist.  Manufacturability software adds interference patterns to the exposure masks to eliminate open-circuits, and enhance the masks' contrast.\n\n\nDesign for testability[edit]\n\nThere are several reasons for testing a logic circuit. When the circuit is first developed, it is necessary to verify that the design circuit meets the required functional and timing specifications. When multiple copies of a correctly designed circuit are being manufactured, it is essential to test each copy to ensure that the manufacturing process has not introduced any flaws.[27]\n\nA large logic machine (say, with more than a hundred logical variables) can have an astronomical number of possible states.  Obviously, in the factory, testing every state is impractical if testing each state takes a microsecond, and there are more states than the number of microseconds since the universe began.  This ridiculous-sounding case is typical.\n\nLarge logic machines are almost always designed as assemblies of smaller logic machines.  To save time, the smaller sub-machines are isolated by permanently installed \"design for test\" circuitry, and are tested independently.\n\nOne common test scheme known as \"scan design\" moves test bits serially (one after another) from external test equipment through one or more serial shift registers known as \"scan chains\".  Serial scans have only one or two wires to carry the data, and minimize the physical size and expense of the infrequently used test logic.\n\nAfter all the test data bits are in place, the design is reconfigured to be in \"normal mode\" and one or more clock pulses are applied, to test for faults (e.g. stuck-at low or stuck-at high) and capture the test result into flip-flops and/or latches in the scan shift register(s).  Finally, the result of the test is shifted out to the block boundary and compared against the predicted \"good machine\" result.\n\nIn a board-test environment, serial to parallel testing has been formalized with a standard called \"JTAG\" (named after the \"Joint Test Action Group\" that made it).\n\nAnother common testing scheme provides a test mode that forces some part of the logic machine to enter a \"test cycle.\"  The test cycle usually exercises large independent parts of the machine.\n\n\nTrade-offs[edit]\n\nSeveral numbers determine the practicality of a system of digital logic: cost, reliability, fanout and speed.  Engineers explored numerous electronic devices to get a favourable combination of these personalities.\n\n\nCost[edit]\n\nThe cost of a logic gate is crucial, primarily because very many gates are needed to build a computer or other advanced digital system and because the more gates can be used, the more able and/or respondent the machine can become. Since the bulk of a digital computer is simply an interconnected network of logic gates, the overall cost of building a computer correlates strongly with the price per logic gate. In the 1930s, the earliest digital logic systems were constructed from telephone relays because these were inexpensive and relatively reliable. After that, electrical engineers always used the cheapest available electronic switches that could still fulfill the requirements.\n\nThe earliest integrated circuits were a happy accident. They were constructed not to save money, but to save weight, and permit the Apollo Guidance Computer to control an inertial guidance system for a spacecraft. The first integrated circuit logic gates cost nearly $50 (in 1960 dollars, when an engineer earned $10,000/year). To everyone's surprise, by the time the circuits were mass-produced, they had become the least-expensive method of constructing digital logic. Improvements in this technology have driven all subsequent improvements in cost.\n\nWith the rise of integrated circuits, reducing the absolute number of chips used represented another way to save costs. The goal of a designer is not just to make the simplest circuit, but to keep the component count down. Sometimes this results in more complicated designs with respect to the underlying digital logic but nevertheless reduces the number of components, board size, and even power consumption.  A major motive for reducing component count on printed circuit boards is to reduce the manufacturing defect rate and increase reliability, as every soldered connection is a potentially bad one, so the defect and failure rates tend to increase along with the total number of component pins.\n\nFor example, in some logic families, NAND gates are the simplest digital gate to build.  All other logical operations can be implemented by NAND gates. If a circuit already required a single NAND gate, and a single chip normally carried four NAND gates, then the remaining gates could be used to implement other logical operations like logical and.  This could eliminate the need for a separate chip containing those different types of gates.\n\n\nReliability[edit]\n\nThe \"reliability\" of a logic gate describes its mean time between failure (MTBF).  Digital machines often have millions of logic gates.  Also, most digital machines are \"optimized\" to reduce their cost.  The result is that often, the failure of a single logic gate will cause a digital machine to stop working.  It is possible to design machines to be more reliable by using redundant logic which will not malfunction as a result of the failure of any single gate (or even any two, three, or four gates), but this necessarily entails using more components, which raises the financial cost and also usually increases the weight of the machine and may increase the power it consumes.\n\nDigital machines first became useful when the MTBF for a switch got above a few hundred hours.  Even so, many of these machines had complex, well-rehearsed repair procedures, and would be nonfunctional for hours because a tube burned-out, or a moth got stuck in a relay.  Modern transistorized integrated circuit logic gates have MTBFs greater than 82 billion hours (8.2 · 1010 hours),[28] and need them because they have so many logic gates.\n\n\nFanout[edit]\n\nFanout describes how many logic inputs can be controlled by a single logic output without exceeding the electrical current ratings of the gate outputs.[29]  The minimum practical fanout is about five.  Modern electronic logic gates using CMOS transistors for switches have fanouts near fifty, and can sometimes go much higher.\n\n\nSpeed[edit]\n\nThe \"switching speed\" describes how many times per second an inverter (an electronic representation of  a \"logical not\" function) can change from true to false and back.  Faster logic can accomplish more operations in less time.  Digital logic first became useful when switching speeds got above 50 Hz, because that was faster than a team of humans operating mechanical calculators.  Modern electronic digital logic routinely switches at 5 GHz (5 · 109 Hz), and some laboratory systems switch at more than 1 THz (1 · 1012 Hz)[citation needed].\n\n\n\n\n\nLogic families[edit]\n\nMain article: logic family\n\nDesign started with relays. Relay logic was relatively inexpensive and reliable, but slow. Occasionally a mechanical failure would occur. Fanouts were typically about 10, limited by the resistance of the coils and arcing on the contacts from high voltages.\n\nLater, vacuum tubes were used. These were very fast, but generated heat, and were unreliable because the filaments would burn out. Fanouts were typically 5...7, limited by the heating from the tubes' current. In the 1950s, special \"computer tubes\" were developed with filaments that omitted volatile elements like silicon. These ran for hundreds of thousands of hours.\n\nThe first semiconductor logic family was resistor–transistor logic. This was a thousand times more reliable than tubes, ran cooler, and used less power, but had a very low fan-in of 3. Diode–transistor logic improved the fanout up to about 7, and reduced the power. Some DTL designs used two power-supplies with alternating layers of NPN and PNP transistors to increase the fanout.\n\nTransistor–transistor logic (TTL) was a great improvement over these. In early devices, fanout improved to 10, and later variations reliably achieved 20. TTL was also fast, with some variations achieving switching times as low as 20 ns. TTL is still used in some designs.\n\nEmitter coupled logic is very fast but uses a lot of power. It was extensively used for high-performance computers made up of many medium-scale components (such as the Illiac IV).\n\nBy far, the most common digital integrated circuits built today use CMOS logic, which is fast, offers high circuit density and low-power per gate. This is used even in large, fast computers, such as the IBM System z.\n\n\nRecent developments[edit]\n\nIn 2009, researchers discovered that memristors can implement a boolean state storage (similar to a flip flop, implication and logical inversion), providing a complete logic family with very small amounts of space and power, using familiar CMOS semiconductor processes.[30]\n\nThe discovery of superconductivity has enabled the development of rapid single flux quantum (RSFQ) circuit technology, which uses Josephson junctions instead of transistors. Most recently, attempts are being made to construct purely optical computing systems capable of processing digital information using nonlinear optical elements.\n\n\nSee also[edit]\n\n\n\tBoolean algebra\n\tCombinational logic\n\tDe Morgan's laws\n\tFormal verification\n\tHardware description language\n\tIntegrated circuit\n\tLogical effort\n\tLogic family\n\tLogic gate\n\tLogic minimization\n\tLogic simulation\n\tMicroelectronics\n\tRinging\n\tSequential logic\n\tClaude E. Shannon\n\tTransparent latch\n\tUnconventional computing\n\n\n\n\nNotes[edit]\n\n\n\t^ Null, Linda; Lobur, Julia (2006). The essentials of computer organization and architecture. Jones & Bartlett Publishers. p. 121. ISBN 978-0-7637-3769-6. We can build logic diagrams (which in turn lead to digital circuits) for any Boolean expression...\n\n\t^ Peirce, C. S., \"Letter, Peirce to A. Marquand\", dated 1886, Writings of Charles S. Peirce, v. 5, 1993, pp. 541–3. Google Preview. See Burks, Arthur W., \"Review: Charles S. Peirce, The new elements of mathematics\", Bulletin of the American Mathematical Society v. 84, n. 5 (1978), pp. 913–18, see 917. PDF Eprint.\n\n\t^ In 1946, ENIAC required an estimated 174 kW. By comparison, a modern laptop computer may use around 30 W; nearly six thousand times less. \"Approximate Desktop & Notebook Power Usage\". University of Pennsylvania. Archived from the original on 3 June 2009. Retrieved 20 June 2009.\n\n\n\t^ \"A Computer Pioneer Rediscovered, 50 Years On\". The New York Times. April 20, 1994.\n\n\n\t^ Lee, Thomas H. (2003). The Design of CMOS Radio-Frequency Integrated Circuits (PDF). Cambridge University Press. ISBN 9781139643771.\n\n\n\t^ Puers, Robert; Baldi, Livio; Voorde, Marcel Van de; Nooten, Sebastiaan E. van (2017). Nanoelectronics: Materials, Devices, Applications, 2 Volumes. John Wiley & Sons. p. 14. ISBN 9783527340538.\n\n\n\t^ Lavington, Simon (1998), A History of Manchester Computers (2 ed.), Swindon: The British Computer Society, pp. 34–35\n\n\n\t^ \"The Chip that Jack Built\". Texas Instruments. 2008. Retrieved 29 May 2008.\n\n\n\t^ Bassett, Ross Knox (2007). To the Digital Age: Research Labs, Start-up Companies, and the Rise of MOS Technology. Johns Hopkins University Press. p. 46. ISBN 9780801886393.\n\n\n\t^ \"1960 - Metal Oxide Semiconductor (MOS) Transistor Demonstrated\". The Silicon Engine. Computer History Museum.\n\n\n\t^ Lojek, Bo (2007). History of Semiconductor Engineering. Springer Science & Business Media. pp. 321–3. ISBN 9783540342588.\n\n\n\t^ a b c \"Who Invented the Transistor?\". Computer History Museum. 4 December 2013. Retrieved 20 July 2019.\n\n\n\t^ a b \"Triumph of the MOS Transistor\". YouTube. Computer History Museum. 6 August 2010. Retrieved 21 July 2019.\n\n\n\t^ Motoyoshi, M. (2009). \"Through-Silicon Via (TSV)\" (PDF). Proceedings of the IEEE. 97 (1): 43–48. doi:10.1109/JPROC.2008.2007462. ISSN 0018-9219.\n\n\n\t^ \"Tortoise of Transistors Wins the Race - CHM Revolution\". Computer History Museum. Retrieved 22 July 2019.\n\n\n\t^ \"Transistors Keep Moore's Law Alive\". EETimes. 12 December 2018. Retrieved 18 July 2019.\n\n\n\t^ Chan, Yi-Jen (1992). Studies of InAIAs/InGaAs and GaInP/GaAs heterostructure FET's for high speed applications. University of Michigan. p. 1. The Si MOSFET has revolutionized the electronics industry and as a result impacts our daily lives in almost every conceivable way.\n\n\n\t^ Grant, Duncan Andrew; Gowar, John (1989). Power MOSFETS: theory and applications. Wiley. p. 1. ISBN 9780471828679. The metal-oxide-semiconductor field-effect transistor (MOSFET) is the most commonly used active device in the very large-scale integration of digital integrated circuits (VLSI). During the 1970s these components revolutionized electronic signal processing, control systems and computers.\n\n\n\t^ Golio, Mike; Golio, Janet (2018). RF and Microwave Passive and Active Technologies. CRC Press. p. 18–2. ISBN 9781420006728.\n\n\n\t^ Raymer, Michael G. (2009). The Silicon Web: Physics for the Internet Age. CRC Press. p. 365. ISBN 9781439803127.\n\n\n\t^ Hittinger, William C. (1973). \"METAL-OXIDE-SEMICONDUCTOR TECHNOLOGY\". Scientific American. 229 (2): 48–59. Bibcode:1973SciAm.229b..48H. doi:10.1038/scientificamerican0873-48. ISSN 0036-8733. JSTOR 24923169.\n\n\n\t^ Peter Clarke (14 October 2005). \"Intel enters billion-transistor processor era\". EE Times.\n\n\n\t^ Paul Horowitz and Winfield Hill, The Art of Electronics 2nd Ed. Cambridge University Press, Cambridge, 1989 \nISBN 0-521-37095-7 page 471\n\n\t^ Maini. A.K. (2007). Digital Electronics Principles, Devices and Applications. Chichester, England.: John Wiley & Sons Ltd.\n\n\t^ \"ASODA sync/async DLX Core\". OpenCores.org. Retrieved September 5, 2014.\n\n\n\t^ Clarke, Peter. \"ARM Offers First Clockless Processor Core\". eetimes.com. UBM Tech (Universal Business Media). Retrieved 5 September 2014.\n\n\n\t^ Brown S & Vranesic Z. (2009). Fundamentals of Digital Logic with VHDL Design. 3rd ed. New York, N.Y.: Mc Graw Hill.\n\n\t^ MIL-HDBK-217F notice 2, section 5.3, for 100,000 gate 0.8 micrometre CMOS commercial ICs at 40C; failure rates in 2010 are better, because line sizes have decreased to 0.045 micrometres, and fewer off-chip connections are needed per gate.\n\n\t^ Kleitz , William. (2002). Digital and Microprocessor Fundamentals: Theory and Application. 4th ed. Upper Saddler Reviver, NJ: Pearson/Prentice Hall\n\n\t^ Eero Lehtonen, Mika Laihom, \"Stateful implication logic with memristors\", Proceedings of the 2009 IEEE/ACM International Symposium on Nanoscale Architectures\nIEEE Computer Society Washington, DC, USA ©2009 Accessed 2011-12-11\n\n\n\n\n\nReferences[edit]\n\n\tDouglas Lewin, Logical Design of Switching Circuits, Nelson,1974.\n\tR. H. Katz, Contemporary Logic Design, The Benjamin/Cummings Publishing Company, 1994.\n\tP. K. Lala, Practical Digital Logic Design and Testing, Prentice Hall, 1996.\n\tY. K. Chan and S. Y. Lim, Progress In Electromagnetics Research B, Vol. 1, 269–290, 2008, \"Synthetic Aperture Radar (SAR) Signal Generation, Faculty of Engineering & Technology, Multimedia University, Jalan Ayer Keroh Lama, Bukit Beruang, Melaka 75450, Malaysia.\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Digital electronics.\n\n\n\tDigital Circuit Projects: An Overview of Digital Circuits Through Implementing Integrated Circuits (2014)\n\tLessons in Electric Circuits - Volume IV (Digital)\n\tMIT OpenCourseWare introduction to digital design class materials (\"6.004: Computation Structures\")\n\n\n\t\tv\n\tt\n\te\n\n\nDigital electronics\n\n\tComponents\t\n\tCombinational logic\n\tSequential logic\n\tIntegrated circuit (IC)\n\tLogic gate\n\n\n\n\n\tTheory\t\n\tDigital signal\n\tBoolean algebra\n\tLogic synthesis\n\tLogic in computer science\n\tComputer architecture\n\tDigital signal\n\tDigital signal processing\n\n\n\tCircuit minimization\n\tSwitching circuit theory\n\n\n\n\n\tDesign\t\n\tLogic synthesis\n\tPlace and route\n\tPlacement\n\tRouting\n\n\n\tRegister-transfer level\n\tHardware description language\n\tHigh-level synthesis\n\n\n\tFormal equivalence checking\n\tSynchronous logic\n\tAsynchronous logic\n\tFinite-state machine\n\tHierarchical state machine\n\n\n\n\n\n\n\tApplications\t\n\tComputer hardware\n\tHardware acceleration\n\n\n\tDigital audio\n\tradio\n\n\n\tDigital photography\n\tDigital telephone\n\tDigital video\n\tcinema\n\ttelevision\n\n\n\tElectronic literature\n\n\n\n\n\tDesign issues\t\n\tMetastability\n\tRunt pulse\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nElectronic components\n\n\tSemiconductor\ndevices\t\n\tMOS transistors\t\n\tBiCMOS\n\tComplementary MOS (CMOS)\n\tDepletion-load NMOS\n\tFin field-effect transistor (FinFET)\n\tFloating-gate MOSFET (FGMOS)\n\tInsulated-gate bipolar transistor (IGBT)\n\tLateral diffused MOS (LDMOS)\n\tMOS field-effect transistor (MOSFET)\n\tMulti-gate field-effect transistor (MuGFET)\n\tNMOS\n\tPMOS\n\tPower MOSFET\n\tThin-film transistor (TFT)\n\tVMOS\n\n\n\n\n\tOther transistors\t\n\tBipolar junction transistor (BJT)\n\tDarlington transistor\n\tDiffusion transistor\n\tField-effect transistor (FET)\n\tJFET\n\tLight-emitting transistor (LET)\n\tOrganic field-effect transistor (OFET)\n\tOrganic light-emitting transistor (OLET)\n\tPentode transistor\n\tPoint-contact transistor\n\tProgrammable unijunction transistor (PUT)\n\tStatic induction transistor (SIT)\n\tTetrode transistor\n\tUnijunction transistor (UJT)\n\n\n\n\n\tDiodes\t\n\tAvalanche diode\n\tConstant-current diode (CLD, CRD)\n\tLaser diode (LD)\n\tLight-emitting diode (LED)\n\tOrganic light-emitting diode (OLED)\n\tPhotodiode\n\tPIN diode\n\tSchottky diode\n\tStep recovery diode\n\tZener diode\n\n\n\n\n\tOther devices\t\n\tDIAC\n\tHeterostructure barrier varactor\n\tIntegrated circuit (IC)\n\tMemistor\n\tMemory cell\n\tMemristor\n\tOrganic semiconductor\n\tPhotodetector\n\tSolaristor\n\tQuantum circuit\n\tSilicon controlled rectifier (SCR)\n\tStatic induction thyristor (SITh)\n\tThree-dimensional integrated circuit (3D IC)\n\tThyristor\n\tTRIAC\n\tVaricap\n\n\n\n\n\n\n\n\tVoltage regulators\t\n\tLinear regulator\n\tLow-dropout regulator\n\tSwitching regulator\n\tBuck\n\tBoost\n\tBuck–boost\n\tSplit-pi\n\tĆuk\n\tSEPIC\n\tCharge pump\n\tSwitched capacitor\n\n\n\n\n\tVacuum tubes\t\n\tAcorn tube\n\tAudion\n\tBeam tetrode\n\tBarretter\n\tCompactron\n\tDiode\n\tFleming valve\n\tNonode\n\tNuvistor\n\tPentagrid (Hexode, Heptode, Octode)\n\tPentode\n\tPhotomultiplier\n\tPhototube\n\tTetrode\n\tTriode\n\n\n\n\n\tVacuum tubes (RF)\t\n\tBackward-wave oscillator (BWO)\n\tCavity magnetron\n\tCrossed-field amplifier (CFA)\n\tGyrotron\n\tInductive output tube (IOT)\n\tKlystron\n\tMaser\n\tSutton tube\n\tTraveling-wave tube (TWT)\n\n\n\n\n\tCathode ray tubes\t\n\tBeam deflection tube\n\tCharactron\n\tIconoscope\n\tMagic eye tube\n\tMonoscope\n\tSelectron tube\n\tStorage tube\n\tTrochotron\n\tVideo camera tube\n\tWilliams tube\n\n\n\n\n\tGas-filled tubes\t\n\tCold cathode\n\tCrossatron\n\tDekatron\n\tIgnitron\n\tKrytron\n\tMercury-arc valve\n\tNeon lamp\n\tNixie tube\n\tThyratron\n\tTrigatron\n\tVoltage-regulator tube\n\n\n\n\n\tAdjustable\t\n\tPotentiometer\n\tdigital\n\n\n\tVariable capacitor\n\tVaricap\n\n\n\n\n\tPassive\t\n\tConnector\n\taudio and video\n\telectrical power\n\tRF\n\n\n\tElectrolytic detector\n\tFerrite\n\tFuse\n\tresettable\n\n\n\tResistor\n\tSwitch\n\tThermistor\n\tTransformer\n\tVaristor\n\tWire\n\tWollaston wire\n\n\n\n\n\n\n\tReactive\t\n\tCapacitor\n\ttypes\n\n\n\tCeramic resonator\n\tCrystal oscillator\n\tInductor\n\tParametron\n\tRelay\n\treed relay\n\tmercury switch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Digital_electronics&oldid=919069667\"\n\n\t\t\n\t\tCategories: \tDigital electronics\n\tElectronic design\n\tElectronic design automation\n\n\nHidden categories: \tArticles with short description\n\tArticles needing additional references from March 2016\n\tAll articles needing additional references\n\tArticles needing additional references from September 2015\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from June 2019\n\tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\tWikibooks\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tবাংলা\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEuskara\n\tفارسی\n\tFrançais\n\tGalego\n\tGĩkũyũ\n\t한국어\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tInterlingua\n\tÍslenska\n\tItaliano\n\tעברית\n\tქართული\n\tKiswahili\n\tKurdî\n\tLatina\n\tമലയാളം\n\tBahasa Melayu\n\tMirandés\n\tМонгол\n\t日本語\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSimple English\n\tSlovenčina\n\tŚlůnski\n\tСрпски / srpski\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 October 2019, at 17:42 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "7", "dc:title": "Digital electronics - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/4/47/Imagen_4.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-digital_circuit", "title": "Digital electronics - Wikipedia"}}