{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEEPROM - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tEEPROM\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tNot to be confused with EPROM.\n\n\tComputer memory types\n\t\nVolatile\n\t\nRAM\n\t\n\tDRAM\n\tSDRAM\n\n\n\tSRAM\n\n\n\t\nHistorical\n\t\n\tWilliams–Kilburn tube (1946–47)\n\tDelay line memory (1947)\n\tMellon optical memory (1951)\n\tSelectron tube (1952)\n\tDekatron\n\tT-RAM (2009)\n\tZ-RAM (2002–2010)\n\n\n\t\nNon-volatile\n\t\nROM\n\t\n\tMask ROM\n\tPROM\n\tEPROM\n\tEEPROM\n\tFlash memory\n\n\n\t\nNVRAM\n\t\n\tReRAM\n\n\n\t\nEarly stage NVRAM\n\t\n\tFeRAM\n\tMRAM\n\tPCM (3D XPoint)\n\tFeFET memory\n\n\n\t\nMagnetic\n\t\n\tMagnetic tape\n\tHard disk drive\n\n\n\t\nOptical\n\t\n\tOptical disc\n\n\n\t\nIn development\n\t\n\tCBRAM\n\tRacetrack memory\n\tNRAM\n\tMillipede memory\n\tFJG RAM\n\n\n\t\nHistorical\n\t\n\tPaper data storage (1725)\n\tDrum memory (1932)\n\tMagnetic-core memory (1949)\n\tPlated wire memory (1957)\n\tCore rope memory (1960s)\n\tThin-film memory (1962)\n\tDisk pack (1962)\n\tTwistor memory (~1968)\n\tBubble memory (~1970)\n\tFloppy disk (1971)\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\n  \nSTMicro M24C02 I²C serial type EEPROM\n\n\n\n  \nAtmel AT93C46A die\n\n\n\n  \nAT90USB162 MCU integrates 512 Byte EEPROM\n\n\n\n  \nA cross section of legacy UV-EPROM structure\nUpper insulator: ONO†\nLower insulator: Tunnel oxide\n†: Oxide/Nitride/Oxide\n\n\n\nEEPROM (also E2PROM) stands for electrically erasable programmable read-only memory and is a type of non-volatile memory used in computers, integrated in microcontrollers for smart cards and remote keyless systems, and other electronic devices to store relatively small amounts of data but allowing individual bytes to be erased and reprogrammed.\n\nEEPROMs are organized as arrays of floating-gate transistors. EEPROMs can be programmed and erased in-circuit, by applying special programming signals. Originally, EEPROMs were limited to single byte operations, which made them slower, but modern EEPROMs allow multi-byte page operations. An EEPROM has a limited life for erasing and reprogramming, now reaching a million operations in modern EEPROMs. In an EEPROM that is frequently reprogrammed, the life of the EEPROM is an important design consideration.\n\nFlash memory is a type of EEPROM designed for high speed and high density, at the expense of large erase blocks (typically 512 bytes or larger) and limited number of write cycles (often 10,000).  There is no clear boundary dividing the two, but the term \"EEPROM\" is generally used to describe non-volatile memory with small erase blocks (as small as one byte) and a long lifetime (typically 1,000,000 cycles).  Many microcontrollers include both: flash memory for the firmware, and a small EEPROM for parameters and history.\n\n\nContents\n\n\n\t1 History\n\t2 Theoretical basis of FLOTOX structure\n\t3 Today's EEPROM structure\n\t4 Security protections\n\t5 Electrical interface\n\t5.1 Serial bus devices\n\t5.2 Parallel bus devices\n\t5.3 Other devices\n\n\n\n\t6 Failure modes\n\t7 Related types\n\t7.1 Comparison with EPROM and EEPROM/flash\n\n\n\n\t8 In popular culture\n\t9 See also\n\t10 References\n\t11 External links\n\n\n\n\n\nHistory[edit]\n\nIn early 1970s, some studies, inventions, and development for electrically re-programmable non-volatile memories were performed by various companies and organizations.\nIn 1971, the earliest research report was presented at the 3rd Conference on Solid State Devices, Tokyo in Japan by Yasuo Tarui, Yutaka Hayashi, and Kiyoko Nagai at Electrotechnical Laboratory; a Japanese national research institute.[1]\nThey fabricated an EEPROM device in 1972,[2] and continued this study for more than 10 years.[3]\nThese papers have been repeatedly cited by later papers and patents.[4][5]\n\nOne of their research includes MONOS (metal-oxide-nitride-oxide-semiconductor) technology,[6]\nwhich is used Renesas Electronics' flash memory integrated in single-chip microcontrollers.[7][8][9]\n\nIn 1972, a type of electrically re-programmable non-volatile memory was invented by Fujio Masuoka at Toshiba, who is also known as the inventor of flash memory.[10]\nMost of major semiconductor manufactures, such as\nToshiba,[10][4]\nSanyo (later, ON Semiconductor),[11]\nIBM,[12]\nIntel,[13][14]\nNEC (later, Renesas Electronics),[15]\nPhilips (later, NXP Semiconductors),[16]\nSiemens (later, Infineon Technologies),[17]\nHoneywell (later, Atmel),[18]\nTexas Instruments,[19]\nstudied, invented, and manufactured some electrically re-programmable non-volatile devices until 1977.\n\nThe theoretical basis of these devices is Avalanche hot-carrier injection. But in general, programmable memories, including EPROM, of early 1970s had reliability problems such as the data retention periods and the number of erase/write cycle endurance.[20]\n\nIn 1975, NEC's semiconductor operations unit, later NEC Electronics, currently Renesas Electronics, applied the trademark name EEPROM® to Japan Patent Office.[21][22]\nIn 1978, this trademark right is granted and registered as No.1,342,184 in Japan, and still survives as of March 2018.\n\nIn February 1977, Eliyahou Harari at Hughes Aircraft Company invented a new EEPROM technology using Fowler-Nordheim tunnelling through a thin silicon dioxide layer between the floating-gate and the wafer. \nHughes went on to produce this new EEPROM devices.[23]\nBut this patent[24]\ncited NEC's EEPROM® invention.[15]\n\nIn May 1977, some important research result was disclosed by Fairchild and Siemens. They used SONOS (polysilicon-oxynitride-nitride-oxide-silicon) structure with thickness of silicon dioxide less than 30 Å, and SIMOS (stacked-gate injection MOS) structure, respectively, for using Fowler-Nordheim tunnelling hot-carrier injection.[25][26]\n\nAround 1976 to 1978, Intel's team, including George Perlegos, made some inventions to improve this tunneling E2PROM technology.[27][28]\nIn 1978, they developed a 16K (2K word × 8) bit Intel 2816 device with a thin silicon dioxide layer, which was less than 200 Å.[29]\nIn 1980. this structure was publicly introduced as FLOTOX; floating gate tunnel oxide.[30]\nThe FLOTOX structure improved reliability of erase/write cycles per byte up to 10,000 times.[31]\nBut this device required additional 20–22V VPP bias voltage supply for byte erase, except for 5V read operations.[32]:5-86\nIn 1981, Perlegos and 2 other members left Intel to form Seeq Technology,[33]\nwhich used on-device charge pumps to supply the high voltages necessary for programming E2PROMs.\nIn 1984, Perlogos left Seeq Technology to found Atmel, then Seeq Technology was acquired by Atmel.[34][35]\n\n\nTheoretical basis of FLOTOX structure[edit]\n\n  \nCharging mechanism of today's NOR-type FLASH memory cell\n\n\n\n  \nDischarging mechanism of today's NOR-type FLASH memory cell\n\n\n\nAs is described in former section, old EEPROMs are based on Avalanche breakdown-based hot-carrier injection with high reverse breakdown voltage. But FLOTOX's theoretical basis is Fowler–Nordheim tunneling hot-carrier injection through a thin silicon dioxide layer between the floating-gate and the wafer. In other words, it uses tunnel junction.[36]\n\nTheoretical basis of the physical phenomenon itself is the same as today's flash memory. But each FLOTOX structure is in conjunction with another read-control transistor because the floating gate itself is just programming and erasing one data bit.[37]\n\nIntel's FLOTOX device structure improved EEPROM's reliability, in other words, the write and erase cycles endurance, and the data retention period. A material of study for single event effect about FLOTOX is available.[38]\n\nToday, detailed academical explanation of FLOTOX device structure can be found in various materials.[39][40][41]\n\n\nToday's EEPROM structure[edit]\n\nNowadays, EEPROM is used for embedded microcontrollers as well as standard EEPROM products. \nEEPROM still requires 2 transistors structure per bit to erase a dedicated byte in the memory, while flash memory has 1 transistor per bit to erase a region of the memory.[42]:245, PDF:2\n\n\nSecurity protections[edit]\n\n  \nInside of a SIM card\n\n\n\nBecause EEPROM technology is used for some security gadgets, such as credit card, SIM card, key-less entry, etc., some devices have security protection mechanisms.[42][43]\n\n\nElectrical interface[edit]\n\nEEPROM devices use a serial or parallel interface for data input/output.\n\n\nSerial bus devices[edit]\n\nThe common serial interfaces are SPI, I²C, Microwire, UNI/O, and 1-Wire. These use from 1 to 4 device pins and allow devices to use packages with 8-pins or less.\n\nA typical EEPROM serial protocol consists of three phases: OP-Code Phase, Address Phase and Data Phase. The OP-Code is usually the first 8-bits input to the serial input pin of the EEPROM device (or with most I²C devices, is implicit); followed by 8 to 24 bits of addressing depending on the depth of the device, then the read or write data.\n\nEach EEPROM device typically has its own set of OP-Code instructions mapped to different functions. Common operations on SPI EEPROM devices are:\n\n\n\tWrite Enable (WRENAL)\n\tWrite Disable (WRDI)\n\tRead Status Register (RDSR)\n\tWrite Status Register (WRSR)\n\tRead Data (READ)\n\tWrite Data (WRITE)\n\n\nOther operations supported by some EEPROM devices are:\n\n\n\tProgram\n\tSector Erase\n\tChip Erase commands\n\n\nParallel bus devices[edit]\n\nParallel EEPROM devices typically have an 8-bit data bus and an address bus wide enough to cover the complete memory. Most devices have chip select and write protect pins. Some microcontrollers also have integrated parallel EEPROM.\n\nOperation of a parallel EEPROM is simple and fast when compared to serial EEPROM, but these devices are larger due to the higher pin count (28 pins or more) and have been decreasing in popularity in favor of serial EEPROM or flash.\n\n\nOther devices[edit]\n\nEEPROM memory is used to enable features in other types of products that are not strictly memory products. Products such as real-time clocks, digital potentiometers, digital temperature sensors, among others, may have small amounts of EEPROM to store calibration information or other data that needs to be available in the event of power loss.\nIt was also used on video game cartridges to save game progress and configurations, before the usage of external and internal flash memories.\n\n\nFailure modes[edit]\n\nThere are two limitations of stored information; endurance, and data retention.\n\nDuring rewrites, the gate oxide in the floating-gate transistors gradually accumulates trapped electrons. The electric field of the trapped electrons adds to the electrons in the floating gate, lowering the window between threshold voltages for zeros vs ones. After sufficient number of rewrite cycles, the difference becomes too small to be recognizable, the cell is stuck in programmed state, and endurance failure occurs. The manufacturers usually specify the maximum number of rewrites being 1 million or more.[44]\n\nDuring storage, the electrons injected into the floating gate may drift through the insulator, especially at increased temperature, and cause charge loss, reverting the cell into erased state. The manufacturers usually guarantee data retention of 10 years or more.[45]\n\n\nRelated types[edit]\n\nFlash memory is a later form of EEPROM. In the industry, there is a convention to reserve the term EEPROM to byte-wise erasable memories compared to block-wise erasable flash memories. EEPROM occupies more die area than flash memory for the same capacity, because each cell usually needs a read, a write, and an erase transistor, while flash memory  erase circuits are shared by large blocks of cells (often 512×8).\n\nNewer non-volatile memory technologies such as FeRAM and MRAM are slowly replacing EEPROMs in some applications, but are expected to remain a small fraction of the EEPROM market for the foreseeable future.\n\n\nComparison with EPROM and EEPROM/flash[edit]\n\nThe difference between EPROM and EEPROM lies in the way that the memory programs and erases. EEPROM can be programmed and erased electrically using field electron emission (more commonly known in the industry as \"Fowler–Nordheim tunneling\").\n\nEPROMs can't be erased electrically and are programmed via hot carrier injection onto the floating gate. Erase is via an ultraviolet light source, although in practice many EPROMs are encapsulated in plastic that is opaque to UV light, making them \"one-time programmable\".\n\nMost NOR flash memory is a hybrid style—programming is through hot carrier injection and erase is through Fowler–Nordheim tunneling.\n\n\n\tType\n\tInject electrons onto gate\n(mostly interpreted as Bit=0)\n\tDuration\n\tRemove electrons from gate\n(mostly interpreted as Bit=1)\n\tDuration/Mode\n\n\tEEPROM\tfield electron emission\t0,1 ... 5 ms, bytewise\tfield electron emission\t0,1 ... 5 ms, blockwise\n\n\tNOR Flash memory\thot carrier injection\t0,01 ... 1 ms\tfield electron emission\t0,01 ... 1 ms, blockwise\n\n\tEPROM\thot carrier injection\t3 ... 50 ms, bytewise\tUV light\t5 ... 30 minutes, whole chip\n\n\n\n\n\n\n\nIn popular culture[edit]\n\nThe Stanford Graduate Students in Electrical Engineering (GSEE) has annually hosted a dance (i.e. prom) called EEPROM[46] since 2012.\n\n\nSee also[edit]\n\n\tAvalanche breakdown\n\tDataFlash\n\tEPROM\n\tField electron emission § Fowler–Nordheim tunneling\n\tFlash memory\n\tFloating-gate MOSFET\n\tIntel HEX – file format\n\tProgrammer (hardware)\n\tQuantum tunnelling\n\tSREC – file format\n\tTunnel junction\n\n\nReferences[edit]\n\n\n\t^ \nTarui, Yasuo; Hayashi, Yutaka; Nagai, Kiyoko (1971-09-01). \"Proposal of electrically reprogrammable non-volatile semiconductor memory\". Proceedings of the 3rd Conference on Solid State Devices, Tokyo. The Japan Society of Applied Physics: 155–162.\n\n\t^ \nTarui, Y.; Hayashi, Y.; Nagai, K. (1972). \"Electrically reprogrammable nonvolatile semiconductor memory\". IEEE Journal of Solid-State Circuits. 7 (5): 369–375. Bibcode:1972IJSSC...7..369T. doi:10.1109/JSSC.1972.1052895. ISSN 0018-9200.\n\n\n\t^ \nTarui, Yasuo; Nagai, Kiyoko; Hayashi, Yutaka (1974-07-19). \"Nonvolatile Semiconductor Memory\" (PDF). Oyobuturi. 43 (10): 990–1002. doi:10.11470/oubutsu1932.43.990. ISSN 2188-2290. Archived (PDF) from the original on 2018-03-12.\n\n\n\t^ a b \nIizuka, H.; Masuoka, F.; Sato, Tai; Ishikawa, M. (1976). \"Electrically alterable avalanche-injection-type MOS READ-ONLY memory with stacked-gate structure\". IEEE Transactions on Electron Devices. 23 (4): 379–387. Bibcode:1976ITED...23..379I. doi:10.1109/T-ED.1976.18415. ISSN 0018-9383.\n\n\n\t^ \nRossler, B. (1977). \"Electrically erasable and reprogrammable read-only memory using the n-channel SIMOS one-transistor cell\". IEEE Transactions on Electron Devices. 24 (5): 606–610. Bibcode:1977ITED...24..606R. doi:10.1109/T-ED.1977.18788. ISSN 0018-9383.\n\n\n\t^ \nSuzuki, E.; Hiraishi, H.; Ishii, K.; Hayashi, Y. (1983). \"A low-voltage alterable EEPROM with metal—oxide-nitride—oxide—semiconductor (MONOS) structures\". IEEE Transactions on Electron Devices. 30 (2): 122–128. Bibcode:1983ITED...30..122S. doi:10.1109/T-ED.1983.21085. ISSN 0018-9383.\n\n\n\t^ \nXTECH, NIKKEI. \"Renesas Embeds 40nm Flash Memory on Chip\". NIKKEI XTECH. Archived from the original on 2018-03-13.\n\n\n\t^ \n\"Renesas Electronics Develops 90 nm One-Transistor MONOS Flash Memory Technology to Accelerate Intelligence in Automotive Control Systems\". Business Wire. 2016-01-03. Archived from the original on 2018-03-13.\n\n\n\t^ \nTaito, Y.; Kono, T.; Nakano, M.; Saito, T.; Ito, T.; Noguchi, K.; Hidaka, H.; Yamauchi, T. (2015). \"A 28 nm Embedded Split-Gate MONOS (SG-MONOS) Flash Macro for Automotive Achieving 6.4 GB/s Read Throughput by 200 MHz No-Wait Read Operation and 2.0 MB/s Write Throughput at Tj of 170circ$ C\". IEEE Journal of Solid-State Circuits. 51 (1): 213–221. Bibcode:2016IJSSC..51..213.. doi:10.1109/JSSC.2015.2467186. ISSN 0018-9200. Archived from the original on 2018-05-03.\n\n\n\t^ a b \nMasuoka, Fujio (31 August 1972). \"Avalanche injection type mos memory\". Cite journal requires |journal= (help)\n\n\n\t^ \nRai, Yasuki; Sasami, Terutoshi; Hasegawa, Yuzuru; Okazoe, Masaru (1973-05-18). \"Electrically reprogrammable nonvolatile floating gate semi-conductor memory device and method of operation\". Archived from the original on 2018-05-03. Cite journal requires |journal= (help)\n\n\n\t^ \nAbbas, Shakir A.; Barile, Conrad A.; Lane, Ralph D.; Liu., Peter T (1973-03-16). \"US3836992A; Electrically erasable floating gate fet memory cell\". pdfpiw.uspto.gov. United States Patent and Trademark Office. Archived from the original on 2018-03-09.\n\n\n\t^ \nFrohman, Bentchkowsky D (19 October 1973). \"Electrically alterable floating gate device and method for altering same\". Cite journal requires |journal= (help)\n\n\n\t^ \nChou, Sunlin (26 February 1973). \"Erasable floating gate device\". Cite journal requires |journal= (help)\n\n\n\t^ a b \nOhya, Shuichi; Kikuchi, Masanori (1974-12-27). \"Non-volatile semiconductor memory device\". Cite journal requires |journal= (help)\n\n\n\t^ \nVerwey, J. F.; Kramer, R. P. (1974). \"Atmos—An electrically reprogrammable read-only memory device\". IEEE Transactions on Electron Devices. 21 (10): 631–636. Bibcode:1974ITED...21..631V. doi:10.1109/T-ED.1974.17981. ISSN 0018-9383.\n\n\n\t^ \nB., Roessler; R. G., Mueller (1975). \"Erasable and electrically reprogrammable read-only memory using the N-channel SIMOS one-transistor cell\". Siemens Forschungs und Entwicklungsberichte. 4 (6): 345–351. Bibcode:1975SiFoE...4..345R.\n\n\n\t^ \nJack, S; Huang, T. (8 September 1975). \"Semiconductor memory cell\". Cite journal requires |journal= (help)\n\n\n\t^ \nGosney, W. M. (1977). \"DIFMOS—A floating-gate electrically erasable nonvolatile semiconductor memory technology\". IEEE Transactions on Electron Devices. 24 (5): 594–599. Bibcode:1977ITED...24..594G. doi:10.1109/T-ED.1977.18786. ISSN 0018-9383.\n\n\n\t^ \nMoskowitz, Sanford L. (2016). \"reliability%20problems\"+EPROM+1970s Advanced Materials Innovation: Managing Global Technology in the 21st century. John Wiley & Sons. ISBN 9781118986097.\n\n\n\t^ \n\"EEPROM\". TMview. Archived from the original on 2018-03-10.\n\n\n\t^ \"Reg. No.1342184 – LIVE – REGISTRATION – Issued and Active\".\n\n\n\t^ \"1027459330501acc.pdf\" (PDF). Archived (PDF) from the original on 2015-02-07. Retrieved 2015-02-05.\n\n\n\t^ \nHarari, Eliyahou (22 February 1977). \"Electrically erasable non-volatile semiconductor memory\". Archived from the original on 3 May 2018. Cite journal requires |journal= (help)\n\n\n\t^ \nChen, P. C. Y. (May 1977). \"Threshold-alterable Si-gate MOS devices\". IEEE Transactions on Electron Devices. 24 (5): 584–586. Bibcode:1977ITED...24..584C. doi:10.1109/T-ED.1977.18783. ISSN 0018-9383.\n\n\n\t^ \nRossler, B. (May 1977). \"Electrically erasable and reprogrammable read-only memory using the n-channel SIMOS one-transistor cell\". IEEE Transactions on Electron Devices. 24 (5): 606–610. Bibcode:1977ITED...24..606R. doi:10.1109/T-ED.1977.18788. ISSN 0018-9383.\n\n\n\t^ \nSimko, Richard T. (17 March 1977). \"Electrically programmable and electrically erasable MOS memory cell\".\n\n\n\t^ \nFrohman-Bentchkowsky, Dov; Mar, Jerry; Perlegos, George; Johnson, William S. (15 December 1978). \"Electrically programmable and erasable MOS floating gate memory device employing tunneling and method of fabricating same\".\n\n\n\t^ \nDummer, G. W. A. (2013). Electronic Inventions and Discoveries: Electronics from Its Earliest Beginnings to the Present Day. Elsevier. ISBN 9781483145211.\n\n\n\t^ \nJohnson, W.; Perlegos, G.; Renninger, A.; Kuhn, G.; Ranganath, T. (1980). \"A 16Kb electrically erasable nonvolatile memory\". 1980 IEEE International Solid-State Circuits Conference. Digest of Technical Papers. XXIII: 152–153. doi:10.1109/ISSCC.1980.1156030.\n\n\n\t^ \nEuzent, B.; Boruta, N.; Lee, J.; Jenq, C. (1981). \"Reliability Aspects of a Floating Gate E2 PROM\". 19th International Reliability Physics Symposium: 11–16. doi:10.1109/IRPS.1981.362965. Archived from the original on 2018-03-13. \nThe Intel 2816 uses the FLOTOX structure, which has been discussed in detail in the literaturel. Basically, it uses an oxide of less than 200A thick between the floating polysilicon gate and the N+ region as shown in Figure 1.\n\n\n\t^ \n2816A-2 PDF Datasheet - Intel Corporation - Datasheets360.com. Intel. October 1983.\n\n\n\t^ \n\"Seeq Technology » AntiqueTech\". Archived from the original on 2014-10-02.\n\n\n\t^ Rostky, George (July 2, 2002). \"Remembering the PROM knights of Intel\". EE Times. Archived from the original on September 29, 2007. Retrieved 2007-02-08.\n\n\n\t^ \nAtmel AT28C16 datasheet (PDF) (0540B ed.). October 1998. Archived (PDF) from the original on 2017-08-29.\n\n\n\t^ \nGutmann, Peter (2001-08-15). \"Data Remanence in Semiconductor Devices\". 10th USENIX SECURITY SYMPOSIUM. IBM T.J.Watson Research Center: 39–54. Archived from the original on 2016-10-12.\n\n\n\t^ \nJanwadkar, Sudhanshu (2017-10-24). \"Fabrication of Floating Gate MOS (FLOTOX)\". www.slideshare.net.\n\n\n\t^ \nKoga, R.; Tran, V.; George, J.; Crawford, K.; Crain, S.; Zakrzewski, M.; Yu, P. \"SEE Sensitivities of Selected Advanced Flash and First-In-First-Out Memories\" (PDF). The Aerospace Corporation. Archived (PDF) from the original on 2018-03-14.\n\n\n\t^ \nFuller, Dr. Lynn (2012-02-22). CMOS Process Variations EEPROM Fabrication Technology. Microelectronic Engineering, Rochester Institute of Technology.\n\n\n\t^ \nGroeseneken, G.; Maes, H.E.; VanHoudt, J.; Witters, J.S. Basics of Nonvolatile Semiconductor Memory Devices. CiteSeerX 10.1.1.111.9431.\n\n\n\t^ \nBergemont, Albert; Chi, Min-Hwa (1997-05-05). \"US Patent 5856222: Method of fabricating a high density EEPROM cell\". patents.google.com. National Semiconductor Corp.\n\n\n\t^ a b \nSkorobogatov, Sergei (2017). How Microprobing Can Attack Encrypted Memory (PDF). 2017 Euromicro Conference on Digital System Design (DSD). Vienna. pp. 244–251. doi:10.1109/DSD.2017.69. ISBN 978-1-5386-2146-2.\n\n\n\t^ \n\"Breaking copy protection in microcontrollers\". www.cl.cam.ac.uk. Archived from the original on 2017-10-22.\n\n\n\t^ \"Frequently Asked Questions -ROHM Semiconductor\". Archived from the original on 2011-02-19.\n\n\n\t^ System Integration - From Transistor Design to Large Scale Integrated Circuits\n\n\t^ \"Stanford Graduate Students in Electrical Engineering (GSEE) - Facebook\". Archived from the original on 2017-12-07.\n\n\n\n\n\n\nExternal links[edit]\n\n\tGutmann (2001) papaer: \"Data Remanence in Semiconductor Devices\" | USENIX\n\n\n\tAuthority control \t\n\tGND: 4151060-4\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=EEPROM&oldid=918946545\"\n\n\t\t\n\t\tCategories: \tJapanese inventions\n\tNon-volatile memory\n\tComputer memory\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tWikipedia articles with GND identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tБеларуская\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEuskara\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tMagyar\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tShqip\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSuomi\n\tதமிழ்\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t吴语\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 October 2019, at 01:08 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "6", "dc:title": "EEPROM - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/AT24C02_EEPROM_1480355_6_7_HDR_Enhancer.jpg/1200px-AT24C02_EEPROM_1480355_6_7_HDR_Enhancer.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-eeprom", "title": "EEPROM - Wikipedia"}}