{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nElectric sail - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tElectric sail\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tNot to be confused with magnetic sail or photon sail.\n\n  \nThe Heliopause Electrostatic Rapid Transit System (HERTS) is a spacecraft concept using an electric sail\n\n\n\nAn electric sail (also known as an electric solar wind sail or an E-sail) is a proposed form of spacecraft propulsion using the dynamic pressure of the solar wind as a source of thrust. It creates a \"virtual\" sail by using small wires to form an electric field that deflects solar wind protons and extracts their momentum. The idea was first conceptualised by Pekka Janhunen in 2006 at the Finnish Meteorological Institute.[1]\n\n\nContents\n\n\n\t1 Principles of operation and design\n\t2 Development history\n\t3 Intrinsic limitations\n\t4 Applications\n\t4.1 Fast missions to planet Uranus\n\n\n\n\t5 See also\n\t6 References\n\t7 Sources\n\t8 External links\n\n\n\n\n\nPrinciples of operation and design[edit]\n\nThe electric sail consists of a number of thin, long and conducting tethers which are kept in a high positive potential by an onboard electron gun.[2] The positively charged tethers deflect solar wind protons, thus extracting momentum from them. Simultaneously they attract electrons from the solar wind plasma, producing an electron current. The electron gun compensates for the arriving electric current.\n\nOne way to deploy the tethers is to rotate the spacecraft, using centrifugal force to keep them stretched. By fine-tuning the potentials of individual tethers and thus the solar wind force individually, the spacecraft's attitude can be controlled.\n\nE-sail missions can be launched at almost any time with only minor variations in travel time. By contrast, conventional slingshot missions must wait for the planets to reach a particular alignment.[3]\n\n\n  \nArtist's rendering of ESTCube-1, launched in May 2013, which was intended to be the first satellite to test an electric sail.\n\n\n\nThe electric solar wind sail has little in common with the traditional solar sail. The E-sail gets its momentum from the solar wind ions, whilst a photonic sail is propelled by photons. Thus, the available pressure is only about 1% of photon pressure; however, this may be compensated by the simplicity of scale-up. In the E-sail, the part of the sail is played by straightened conducting tethers (made of wires) which are placed radially around the host ship. The wires are electrically charged and thus an electric field is created around the wires. The electric field of the wires extends a few dozen metres into the surrounding solar wind plasma. The penetration distance depends on the solar wind plasma density and it scales as the plasma Debye length. Because the solar wind electrons affect the electric field (similarly to the photons on a traditional solar sail), the effective electric radius of the tethers is based on the electric field that is generated around the tether rather than the actual tether itself. This fact also makes it possible to manoeuvre by regulating the tethers' electric charge.\n\nA full-sized sail would have 50–100 straightened tethers with a length of about 20 km each.[citation needed] Compared to a reflective solar light sail, another propellantless deep space propulsion system, the electric solar wind sail could continue to accelerate at greater distances from the Sun, still developing thrust as it cruises toward the outer planets. By the time it reaches the ice giants, it may have accumulated as much as 20 km/s velocity, which is on par with the New Horizons probe, but without gravity assists.\n\nIn order to minimise damage to the thin tethers from micrometeoroids, the tethers would be formed from multiple strands, 25–50 micrometers in diameter, welded together at regular intervals. Thus, even if one wire were severed, a conducting path along the full length of the braided wire would remain in place. The feasibility of using ultrasonic welding was demonstrated at the University of Helsinki in January 2013.[4]\n\n\nDevelopment history[edit]\n\nAcademy of Finland has been funding electric sail development since 2007.[5] \n\nTo test the technology, a new European Union-backed electric sail study project was announced by the FMI in December 2010.[6]  The EU funding contribution was 1.7 million euros. Its goal was to build laboratory prototypes of the key components, it involved five European countries and ended in November 2013.[7] In the EU evaluation, the project got the highest marks in its category.[8][9] An attempt was made to test the working principles of the electric sail in low Earth orbit in the Estonian nanosatellite ESTCube-1 (2013-2015), but there was a technical failure and the attempt was unsuccessful. The piezoelectric motor used to unfurl the sail failed to turn the reel. In subsequent ground-based testing, a likely reason for the failure was found in a slipring contact which was likely physically damaged by launch vibration.\n\nAn international research team that includes Janhunen received funding through a 2015 NIAC Phase II solicitation for further development at NASA's Marshall Space Flight Center.[2][10] Their research project is called 'Heliopause Electrostatic Rapid Transit System' (HERTS).[2][11] The Heliopause Electrostatic Rapid Transit System (HERTS) concept is currently being tested. For HERTS, it might take only 10 to 15 years to make the trip of over 100 astronomical units (15 billion kilometers). In the HERTS concept, multiple, 20 kilometer or so long, 1 millimeter thin, positively charged wires would be extended from a rotating spacecraft.\n\nA new satellite launched in June 2017,[12][13] the Finnish Aalto-1 nanosatellite, currently in orbit, will test the electric sail for deorbiting in 2019.[14][15][16][17][18]\n\nIn 2017, Academy of Finland granted Centre of Excellence funding for 2018-2025 to a team that includes Janhunen and members from universities, to establish a Finnish Centre of Excellence in Research of Sustainable Space.[19][20]\n\n\nIntrinsic limitations[edit]\n\nAlmost all Earth-orbiting satellites are inside Earth's magnetosphere.  However, the electric sail cannot be used inside planetary magnetospheres because the solar wind does not penetrate them, allowing only slower plasma flows and magnetic fields.[citation needed] Instead, inside a planetary magnetosphere, the electric sail may function as a brake, allowing deorbiting of satellites.[21]\n\nLike for other solar sail technologies, while modest variation of the thrust direction can be achieved by inclining the sail, the thrust vector always points more or less radially outward from the Sun.[citation needed] It has been estimated[by whom?] that maximum operational inclination would be 60°, resulting in a thrusting angle of 30° from the outward radial direction. However, like with the sails of a ship, tacking could be used for changing the trajectory. Interstellar ships approaching a sun might use solar wind flow for braking.[21]\n\n\nApplications[edit]\n\n\tFast missions (>50 km/s or 10 AU/year) out of the Solar system and heliosphere with small or modest payload\n\tAs a brake for a small interstellar probe which has been accelerated to high speed by some other means such as laser lightsail[22]\n\tInward-spiralling missions to study the Sun at a closer distance\n\tTwo-way missions to inner Solar System objects such as asteroids\n\tOff-Lagrange point solar wind monitoring spacecraft for predicting space weather with a longer warning time than 1 hour\n\n\nFast missions to planet Uranus[edit]\n\nJanhunen et al. have proposed a mission to Uranus powered by an electric sail. The mission could reach its destination in about the same time that the earlier Galileo space probe required to arrive at Jupiter, just over one fourth as far away. Galileo took 6 years to reach Jupiter at a cost of $1.6 billion, while Cassini-Huygens took 7 years to get to Saturn and cost almost as much. The sail is expected to consume 540 watts, producing about 0.5 newtons accelerating the craft by about 1 mm/s2. The craft would reach a velocity of about 20 km/s by the time it reaches Uranus, 6 years after launch.[3]\n[23] The downside is that the electric sail cannot be used as a brake, so the craft arrives at a speed of 20 km/s, limiting the missions to flybys or atmospheric entry missions. Braking would require a conventional chemical rocket.\n\nThe proposed craft has three parts: the E-sail module with solar panels and reels to hold the wires; the main body, including chemical thrusters for adjusting trajectory en route and at destination and communications equipment; and a research module to enter Uranus's atmosphere and make measurements for relay to Earth via the main body.[3]\n\n\nSee also[edit]\n\n\tElectrodynamic tether\n\tMagnetic sail\n\n\nReferences[edit]\n\n\n\t^ Electric Sail For Producing Spacecraft Propulsion. Patent filed on 2 February 2007; PatentScope.\n\n\t^ a b c Wall, Mike (9 November 2015). \"'Electric Sails' Could Propel Superfast Spacecraft by 2025\". Space.com. Retrieved 2015-11-10.\n\n\t^ a b c Emerging Technology From the arXiv January 9, 2014. \"New Form of Spacecraft Propulsion Proposed For Uranus Mission | MIT Technology Review\". Technologyreview.com. Retrieved 2014-01-12.\n\n\n\t^ Superthin wire for electric sail space propulsion engineered, Mark Hoffman, Science World Report, 10 Jan 2013.\n\n\t^ http://webfocus.aka.fi/ibi_apps/WFServlet?ekaLataus=0&IBIF_ex=x_RahPaatYht_report2&IBIAPP_app=aka_ext&UILANG=fi&SANAHAKU=&ETUNIMI=Pekka&SUKUNIMI=Janhunen&SUKUPUOLI=FOC_NONE&HAKU=FOC_NONE&ORGANIS=FOC_NONE&TUTKDI=FOC_NONE&TMK=FOC_NONE&PAATVUOSI_A=2001&PAATVUOSI_L=2017&LAJITTELU=PAATOS&TULOSTE=HTML\n\n\t^ Dillow, Clay (December 9, 2010). \"EU-Backed 'Electric Sail' Could Be the Fastest Man-Made Device Ever Built\". Popular Science.\n\n\n\t^ Electric Solar Wind Sail EU FP7 project\n\n\t^ Electric solar wind sail spacecraft propulsion\n\n\t^ \"EU project to build Electric Solar Wind Sail\". Physorg.com. Retrieved 2014-01-12.\n\n\n\t^ \"Electric Solar Sail Concept Introduction\". NASA. SpaceRef. 17 August 2015. Retrieved 2015-08-18.\n\n\n\t^ HERTS program at NASA (2015)\n\n\t^ \"Aalto-1 is the first Finnish nanosatellite project\". Aalto University. Archived from the original on 2014-12-23. Retrieved 2016-04-25.\n\n\n\t^ http://aalto1.fi/tarina.html\n\n\t^ https://www.iltalehti.fi/kotimaa/a/cb58c54f-8c93-437b-ac78-340878478946\n\n\t^ EU project to build Electric Solar Wind Sail\n\n\t^ Eesti esimene satelliit on valmimas Archived 2013-01-31 at the Wayback Machine\n\n\t^ \"Aalto-1 satellite is ready for space\". Aalto.fi. 2 March 2016. Retrieved 25 April 2015.\n\n\n\t^ курс, The Baltic Course - Балтийский. \"ESTCube-1 sends its last words: \"Long live Estonia!\"\". The Baltic Course | Baltic States news & analytics. Retrieved 2016-04-24.\n\n\n\t^ http://www.aka.fi/globalassets/40akatemia/coes-2018-2025.pdf\n\n\t^ http://www.aalto.fi/fi/current/news/2017-06-20-005/\n\n\t^ a b Ashley, Steven. \"Sail E-way: Spacecraft Riding the Solar Wind on Electric-Field Sails Could Cruise at 180,000 Kph\". Scientific American. Retrieved 2018-07-21.\n\n\n\t^ Perakis, N., & Hein, A. M. (2016). Combining Magnetic and Electric Sails for Interstellar Deceleration. arXiv preprint arXiv:1603.03015.[1]\n\n\t^ https://arxiv.org/abs/1312.6554 Fast E-sail Uranus entry probe mission\n\n\n\n\nSources[edit]\n\n\tJanhunen, P. (2004). \"Electric Sail for Spacecraft Propulsion\". Journal of Propulsion and Power. 20 (4): 763–764. doi:10.2514/1.8580.\n\n\tJanhunen, P. and A. Sandroos, Simulation study of solar wind push on a charged wire: basis of solar wind electric sail propulsion, Janhunen, P.; Sandroos, A. (2007). \"Simulation study of solar wind push on a charged wire: Basis of solar wind electric sail propulsion\" (PDF). Annales Geophysicae. 25 (3): 755. Bibcode:2007AnGeo..25..755J. doi:10.5194/angeo-25-755-2007.\n\n\t\"The electric solar wind sail by Pekka Janhunen\". Retrieved 2008-04-18.\n\n\n\nExternal links[edit]\n\n\tHeliopause Electrostatic Rapid Transit System\n\tFMI's official E-sail page\n\tList of original scientific publications\n\tFinnish Meteorological Institute/Space Research\n\t\"Electric Solar Wind Sail Could Power Future Space Travel In Solar System\". ScienceDaily. 2008-04-17. Retrieved 2008-10-15.\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft propulsion\n\n\tChemical\nrockets\t\n\tState\t\n\tLiquid-propellant rocket\n\tSolid-propellant rocket\n\tHybrid-propellant rocket\n\n\n\n\n\tPropellants\t\n\tLiquid propellant\n\tCryogenic\n\tHypergolic\n\n\n\tMonopropellant\n\tBipropellant\n\tStaged combustion cycle\n\tExpander cycle\n\tGas-generator cycle\n\tTap-off cycle\n\tPressure-fed engine\n\tPump-fed engine\n\tElectric-pump-fed engine\n\n\n\tTripropellant\n\n\n\n\n\n\n\n\tElectrical\nthrusters\t\n\tElectrostatic\t\n\tColloid thruster\n\tIon thruster\n\tGridded\n\tHall-effect thruster\n\tField-emission electric propulsion\n\n\n\n\n\n\n\tElectromagnetic\t\n\tPulsed inductive thruster\n\tMagnetoplasmadynamic thruster\n\tElectrodeless plasma thruster\n\n\n\n\n\tElectrothermal\t\n\tPulsed plasma thruster\n\tHelicon double-layer thruster\n\tArcjet rocket\n\tResistojet rocket\n\tVASIMR\n\n\n\n\n\tOther\t\n\tAtmosphere-breathing electric propulsion\n\tHigh Power Electric Propulsion\n\tMagBeam\n\tMass driver\n\n\n\n\n\n\n\n\tNuclear\npropulsion\t\n\tClosed system\t\n\tDirect Fusion Drive\n\tNuclear electric rocket\n\tNuclear thermal rocket\n\tRadioisotope\n\tSalt-water\n\tGas core\n\t\"Lightbulb\"\n\n\n\n\n\n\n\tOpen system\t\n\tNuclear pulse propulsion\n\tAntimatter-catalyzed\n\n\n\tPulsed nuclear thermal rocket‎\n\tFusion rocket\n\tBussard ramjet\n\n\n\tFission-fragment rocket\n\tFission sail\n\n\n\tNuclear photonic rocket\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tBeam-powered propulsion\n\tCold gas thruster\n\tGravity assist\n\tSolar sail\n\tElectric sail\n\tMagnetic sail\n\n\n\tSolar thermal rocket\n\tTethers\n\tSteam thruster\n\n\n\n\n\tSpaceflight portal\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Electric_sail&oldid=918505336\"\n\n\t\t\n\t\tCategories: \tCubeSats\n\tFinnish inventions\n\tSpacecraft propulsion\n\tSolar sailing\n\tInterstellar travel\n\n\nHidden categories: \tWebarchive template wayback links\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from May 2015\n\tArticles with unsourced statements from January 2016\n\tArticles with specifically marked weasel-worded phrases from January 2016\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tČeština\n\tEesti\n\tEspañol\n\tLatviešu\n\tРусский\n\tSuomi\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 29 September 2019, at 00:35 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "7", "dc:title": "Electric sail - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/4/44/Heliopause_Electrostatic_Rapid_Transit_System_-_HERTS.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-electric_sail", "title": "Electric sail - Wikipedia"}}