{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEuropean Space Agency - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tEuropean Space Agency\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tIntergovernmental organisation dedicated to the exploration of space\n\n\"ESA\" redirects here. For other uses, see ESA (disambiguation).\n\n\n\nCoordinates: 48°50′54″N 2°18′15″E﻿ / ﻿48.8482°N 2.3042°E﻿ / 48.8482; 2.3042\n\n\nEuropean Space Agency\t\n\n\n\tCzech: Evropská kosmická agentura\n  \n\tDanish: Den Europæiske Rumfartsorganisation\n  \n\tGerman: Europäische Weltraumorganisation\n  \n\tEstonian: Euroopa Kosmoseagentuur\n  \n\tFrench: Agence spatiale européenne\n  \n\tFinnish: Euroopan avaruusjärjestö\n  \n\tGreek: Ευρωπαϊκός Οργανισμός Διαστήματος\n  \n\tHungarian: Európai Űrügynökség\n  \n\tIrish: Gníomhaireacht Spáis na hEorpa\n  \n\tItalian: Agenzia Spaziale Europea\n  \n\tLuxembourgish: Europäesch Weltraumorganisatioun\n  \n\tDutch: Europese Ruimtevaartorganisatie\n  \n\tNorwegian: Den europeiske romfartsorganisasjon\n  \n\tNynorsk: Den europeiske romfartsorganisasjonen\n  \n\tPolish: Europejska Agencja Kosmiczna\n  \n\tPortuguese: Agência Espacial Europeia\n  \n\tRomanian: Agenția Spațială Europeană\n  \n\tRomansh: Agenzia spaziala europeica\n  \n\tSpanish: Agencia Espacial Europea\n  \n\tSwedish: Europeiska rymdorganisationen\n\n\n\n\n\n\n\t\n\tESA Headquarters in Paris, France\n\n\tAbbreviation\t\tESA\n\tASE\n\n\n\n\tFormation\t30 May 1975; 44 years ago (1975-05-30)\n\tHeadquarters\tParis, Île-de-France, France\n\tOfficial language \n\tEnglish, French and German[1][2]\n\tAdministrator\n\tJohann-Dietrich Wörner\nDirector General\n\tPrimary spaceport\n\tGuiana Space Centre\n\tParent organisation\n\t\n22 European states\n\n\t Austria\n  \n\t Belgium\n  \n\t Czech Republic\n  \n\t Denmark\n  \n\t Estonia\n  \n\t Finland\n  \n\t France\n  \n\t Germany\n  \n\t Greece\n  \n\t Hungary\n  \n\t Ireland\n  \n\t Italy\n  \n\t Luxembourg\n  \n\t Netherlands\n  \n\t Norway\n  \n\t Poland\n  \n\t Portugal\n  \n\t Romania\n  \n\t Spain\n  \n\t Sweden\n  \n\t  Switzerland\n  \n\t United Kingdom\n\n\n\n\n\n\tBudget  \n\t €5.72 billion \n(~US$6.43 billion) (2019)[3]\n\tWebsite\twww.esa.int\n\n\nThe European Space Agency pronunciation (help·info) (ESA; French: Agence spatiale européenne pronunciation (help·info), ASE;[4][5] German: Europäische Weltraumorganisation) is an intergovernmental organisation of 22 member states[6] dedicated to the exploration of space. Established in 1975 and headquartered in Paris, ESA has a worldwide staff of about 2,200 in 2018[7] and an annual budget of about €5.72 billion (~US$6.43 billion) in 2019.[3]\n\nESA's space flight programme includes human spaceflight (mainly through participation in the International Space Station program); the launch and operation of unmanned exploration missions to other planets and the Moon; Earth observation, science and telecommunication; designing launch vehicles; and maintaining a major spaceport, the Guiana Space Centre at Kourou, French Guiana. The main European launch vehicle Ariane 5 is operated through Arianespace with ESA sharing in the costs of launching and further developing this launch vehicle. The agency is also working with NASA to manufacture the Orion Spacecraft service module, that will fly on the Space Launch System.[8][9]\n\nThe agency's facilities are distributed among the following centres:\n\n\n\tESA science missions are based at ESTEC in Noordwijk, Netherlands;\n\tEarth Observation missions at ESA Centre for Earth Observation in Frascati, Italy;\n\tESA Mission Control (ESOC) is in Darmstadt, Germany;\n\tthe European Astronaut Centre (EAC) that trains astronauts for future missions is situated in Cologne, Germany;\n\tthe European Centre for Space Applications and Telecommunications (ECSAT), a research institute created in 2009, is located in Harwell, England;\n\tand the European Space Astronomy Centre (ESAC) is located in Villanueva de la Cañada, Madrid, Spain.\n\n\nThe European Space Agency Science Programme is a long-term programme of space science and space exploration missions.\n\n\nContents\n\n\n\t1 History\n\t1.1 Foundation\n\t1.2 Later activities\n\n\n\n\t2 Mission\n\t3 Activities and programmes\n\t3.1 Activities\n\t3.2 Programmes\n\t3.2.1 Mandatory\n\t3.2.2 Optional\n\t3.2.3 ESA_LAB@\n\n\n\n\n\n\n\t4 Member states, funding and budget\n\t4.1 Membership and contribution to ESA\n\t4.2 Non-full member states\n\t4.2.1 Slovenia\n\t4.2.2 Canada\n\n\n\n\t4.3 Budget appropriation and allocation\n\t4.4 Enlargement\n\t4.5 EU and the European Space Agency\n\n\n\n\t5 Launch vehicle fleet\n\t5.1 Ariane 5\n\t5.2 Soyuz\n\t5.3 Vega\n\t5.4 Ariane launch vehicle development funding\n\n\n\n\t6 Human space flight\n\t6.1 History\n\t6.2 Astronaut names\n\t6.3 Crew vehicles\n\n\n\n\t7 Cooperation with other countries and organisations\n\t7.1 European Union\n\t7.2 National space organisations of member states\n\t7.3 NASA\n\t7.4 Cooperation with other space agencies\n\t7.5 International Space Station\n\t7.6 Languages\n\t7.7 Facilities\n\n\n\n\t8 ESA and the EU institutions\n\t8.1 Guaranteeing European access to space\n\n\n\n\t9 Incidents\n\t10 See also\n\t10.1 European Union matters\n\n\n\n\t11 References\n\t12 Further reading\n\t13 External links\n\n\n\n\n\nHistory[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"European Space Agency\" – news · newspapers · books · scholar · JSTOR  (May 2019) (Learn how and when to remove this template message)\n\n\n\nFoundation[edit]\n\nMain article: ESRO\n\nSee also: ELDO\n\n  \nESTEC buildings in Noordwijk, Netherlands. ESTEC was the main technical centre of ESRO and remains so for the successor organisation, ESA.\n\n\n\nAfter World War II, many European scientists left Western Europe in order to work with the United States. Although the 1950s boom made it possible for Western European countries to invest in research and specifically in space-related activities, Western European scientists realised solely national projects would not be able to compete with the two main superpowers. In 1958, only months after the Sputnik shock, Edoardo Amaldi (Italy) and Pierre Auger (France), two prominent members of the Western European scientific community, met to discuss the foundation of a common Western European space agency. The meeting was attended by scientific representatives from eight countries, including Harrie Massey (United Kingdom).\n\nThe Western European nations decided to have two agencies: one concerned with developing a launch system, ELDO (European Launch Development Organization), and the other the precursor of the European Space Agency, ESRO (European Space Research Organisation). The latter was established on 20 March 1964 by an agreement signed on 14 June 1962. From 1968 to 1972, ESRO launched seven research satellites.\n\nESA in its current form was founded with the ESA Convention in 1975, when ESRO was merged with ELDO. ESA had ten founding member states: Belgium, Denmark, France, West Germany, Italy, the Netherlands, Spain, Sweden, Switzerland, and the United Kingdom.[10] These signed the ESA Convention in 1975 and deposited the instruments of ratification by 1980, when the convention came into force. During this interval the agency functioned in a de facto fashion. ESA launched its first major scientific mission in 1975, Cos-B, a space probe monitoring gamma-ray emissions in the universe, which was first worked on by ESRO.\n\n\nLater activities[edit]\n\n  \nMock-up of the Ariane 1\n\n\n\nESA collaborated with NASA on the International Ultraviolet Explorer (IUE), the world's first high-orbit telescope, which was launched in 1978 and operated successfully for 18 years. A number of successful Earth-orbit projects followed, and in 1986 ESA began Giotto, its first deep-space mission, to study the comets Halley and Grigg–Skjellerup. Hipparcos, a star-mapping mission, was launched in 1989 and in the 1990s SOHO, Ulysses and the Hubble Space Telescope were all jointly carried out with NASA. Later scientific missions in cooperation with NASA include the Cassini–Huygens space probe, to which ESA contributed by building the Titan landing module Huygens.\n\nAs the successor of ELDO, ESA has also constructed rockets for scientific and commercial payloads. Ariane 1, launched in 1979, carried mostly commercial payloads into orbit from 1984 onward. The next two versions of the Ariane rocket were intermediate stages in the development of a more advanced launch system, the Ariane 4, which operated between 1988 and 2003 and established ESA as the world leader[11] in commercial space launches in the 1990s. Although the succeeding Ariane 5 experienced a failure on its first flight, it has since firmly established itself within the heavily competitive commercial space launch market with 82 successful launches until 2018. The successor launch vehicle of Ariane 5, the Ariane 6, is under development and is envisioned to enter service in the 2020s.\n\nThe beginning of the new millennium saw ESA become, along with agencies like NASA, JAXA, ISRO, the CSA and Roscosmos, one of the major participants in scientific space research. Although ESA had relied on co-operation with NASA in previous decades, especially the 1990s, changed circumstances (such as tough legal restrictions on information sharing by the United States military) led to decisions to rely more on itself and on co-operation with Russia. A 2011 press issue thus stated:[12]\n\n\nRussia is ESA's first partner in its efforts to ensure long-term access to space. There is a framework agreement between ESA and the government of the Russian Federation on cooperation and partnership in the exploration and use of outer space for peaceful purposes, and cooperation is already underway in two different areas of launcher activity that will bring benefits to both partners.\n\n\n\nNotable ESA programs include SMART-1, a probe testing cutting-edge space propulsion technology, the Mars Express and Venus Express missions, as well as the development of the Ariane 5 rocket and its role in the ISS partnership. ESA maintains its scientific and research projects mainly for astronomy-space missions such as Corot, launched on 27 December 2006, a milestone in the search for exoplanets.\n\nOn 21 January 2019, ArianeGroup and Arianespace announced a one-year contract with ESA to study and prepare for a mission to mine the moon for lunar regolith.[13]\n\n\nMission[edit]\n\nThe treaty establishing the European Space Agency reads:[14]\n\n\n\nESA's purpose shall be to provide for, and to promote, for exclusively peaceful purposes, cooperation among the European States in space research and technology and their space applications, with a view to their being used for scientific purposes and for operational space applications systems\n\n\n\nESA is responsible for setting a unified space and related industrial policy, recommending space objectives to the member states, and integrating national programs like satellite development, into the European program as much as possible.[14]\n\nJean-Jacques Dordain – ESA's Director General (2003-2015) – outlined the European Space Agency's mission in a 2003 interview:[15]\n\n\n\nToday space activities have pursued the benefit of citizens, and citizens are asking for a better quality of life on Earth. They want greater security and economic wealth, but they also want to pursue their dreams, to increase their knowledge, and they want younger people to be attracted to the pursuit of science and technology.\n\nI think that space can do all of this: it can produce a higher quality of life, better security, more economic wealth, and also fulfill our citizens' dreams and thirst for knowledge, and attract the young generation. This is the reason space exploration is an integral part of overall space activities. It has always been so, and it will be even more important in the future.\n\n\n\n\nActivities and programmes[edit]\n\nMain article: List of European Space Agency programs and missions\n\nESA describes its work in two overlapping ways: \n\n\n\tFor the general public, the various fields of work are described as Activities.\n\tBudgets are organized as Programmes (British spelling retained because it is a term of official documents). These are either Mandatory or Optional.\n\n\nActivities[edit]\n\nAccording to the ESA website, the activities are:\n\n\n\tObserving the Earth\n\tHuman Spaceflight\n\tLaunchers\n\tNavigation\n\tSpace Science\n\tSpace Engineering & Technology\n\tOperations\n\tTelecommunications & Integrated Applications\n\tPreparing for the Future\n\tSpace for Climate\n\n\nProgrammes[edit]\n\n\tCopernicus Programme[16]\n\tCosmic Vision\n\tExoMars[17]\n\tFAST20XX\n\tGalileo[18]\n\tHorizon 2000\n\tLiving Planet Programme\n\n\nMandatory[edit]\n\nEvery member country must contribute to these programmes:[19]\n\n\n\tTechnology Development Element Programme[20]\n\tScience Core Technology Programme\n\tGeneral Study Programme\n\tEuropean Component Initiative\n\n\nOptional[edit]\n\nDepending on their individual choices the countries can contribute to the following programmes, listed according to:[21]\n\n\n\tLaunchers\n\tEarth Observation\n\tHuman Spaceflight and Exploration\n\tTelecommunications\n\tNavigation\n\tSpace Situational Awareness\n\tTechnology\n\n\nESA_LAB@[edit]\n\nESA has formed partnerships with universitites. ESA_LAB@ refers to research laboratories at universities. Currently there are ESA_LAB@\n\n\n\tTechnische Universität Darmstadt[22]\n\tÉcole des hautes études commerciales de Paris (HEC Paris)[23]\n\tUniversité de recherche Paris Sciences et Lettres[24]\n\tUniversity of Central Lancashire[25]\n\n\nMember states, funding and budget[edit]\n\nMembership and contribution to ESA[edit]\n\n\n\n\n\n  ESA member states\n  ESA associate members\n  ECS states\n  Signatories of the Cooperation Agreement\n\n\n\n\n\n\nBy 2015, ESA was an intergovernmental organisation of 22 member states.[6] Member states participate to varying degrees in the mandatory (25% of total expenditures in 2008) and optional space programmes (75% of total expenditures in 2008).[26] The 2008 budget amounted to €3.0 billion the 2009 budget to €3.6 billion.[27] The total budget amounted to about €3.7 billion in 2010, €3.99 billion in 2011, €4.02 billion in 2012, €4.28 billion in 2013, €4.10 billion in 2014 and €4.33 billion in 2015.[28][29][30][31][32] English is the main language within ESA. Additionally, official documents are also provided in German and documents regarding the Spacelab are also provided in Italian. If found appropriate, the agency may conduct its correspondence in any language of a member state.\n\nThe following table lists all the member states and adjunct members, their ESA convention ratification dates, and their contributions in 2019:[3]\n\n\n\tMember state/Source\n\tESA convention\n\tNational programme\n\tContr.\n(mill. €)\n\tContr.\n(%)\n\tContr. per capita (€)[33]\n\n\t Austria[note 1]\t30 December 1986\tFFG\t57.0\t1.4%\n\t5.37\n\n\t Belgium[note 2]\t3 October 1978\tBELSPO\t191.4\t4.6%\n\t17.82\n\n\t Czech Republic[note 3]\t12 November 2008\tMinistry of Transport\t33.1\t0.8%\n\t3.06\n\n\t Denmark[note 2]\t15 September 1977\tDTU Space\t31.5\t0.8%\n\t5.47\n\n\t Estonia[note 3]\t4 February 2015\tESO\t2.7\t0.1%\n\t1.97\n\n\t Finland[note 3]\t1 January 1995\tBusiness Finland\t19.5\t0.5%\n\t3.52\n\n\t France[note 2]\t30 October 1980\tCNES\t1,174.4\t28.1%\n\t14.30\n\n\t Germany[note 2]\t26 July 1977\tDLR\t927.1\t22.2%\n\t11.11\n\n\t Greece[note 3]\t9 March 2005\tHSA\t10.5\t0.3%\n\t0.98\n\n\t Hungary[note 3]\t24 February 2015\tHSO\t5.2\t0.1%\n\t0.63\n\n\t Ireland[note 1]\t10 December 1980\tEI\t19.5\t0.5%\n\t3.60\n\n\t Italy[note 2]\t20 February 1978\tASI\t420.2\t10.1%\n\t7.77\n\n\t Luxembourg[note 3]\t30 June 2005\tLuxinnovation\t29.9\t0.7%\n\t44.19\n\n\t Netherlands[note 2]\t6 February 1979\tNSO\t77.7\t1.9%\n\t5.32\n\n\t Norway[note 1]\t30 December 1986\tNSA\t64.4\t1.5%\n\t12.09\n\n\t Poland[note 3]\t19 November 2012\tPOLSA\t34.6\t0.8%\n\t0.91\n\n\t Portugal[note 3]\t14 November 2000\tFCT\t18.0\t0.4%\n\t1.77\n\n\t Romania[note 3]\t22 December 2011\tROSA\t45.4\t1.1%\n\t2.18\n\n\t Spain[note 2]\t7 February 1979\tINTA\t201.8\t4.8%\n\t4.39\n\n\t Sweden[note 2]\t6 April 1976\tSNSA\t74.4\t1.8%\n\t7.15\n\n\t  Switzerland[note 2]\t19 November 1976\tSSO\t158.4\t3.8%\n\t17.61\n\n\t United Kingdom[note 2]\t28 March 1978\tUKSA\t369.6\t8.8%\n\t5.05\n\n\tOther\t—\t—\t199.6\t4.8%\n\t\n\n\tNon-full members\t\t\t\t\n\t\n\n\t Canada[note 4]\t1 January 1979[42]\tCSA\t11.8\t0.3%\n\t0.53\n\n\t Slovenia\n\t5 July 2016[44]\t\t2.4\t0.1%\n\t1.31\n\n\tTotal members and associates\t\t\t4,180.0\t100%\n\t\n\n\t European Union[note 5]\t28 May 2004[45]\tESP\t1,249.7\t81.3%\n\t2.56\n\n\tEUMETSAT\t—\t—\t187.2\t12.2%\n\t\n\n\tOther income\t—\t—\t99.5\t6.5%\n\t\n\n\tTotal other institutional partners\t\t\t1,540.0\t100%\n\t\n\n\tTotal ESA\t\t\t5,720.0\t\n\t\n\n\n\n\n\t^ a b c These nations are considered initial signatories, but since they were members of neither ESRO nor ELDO (the precursor organisations to ESA) the Convention could only enter into force when the last of the other 10 founders ratified it.\n\n\t^ a b c d e f g h i j Founding members and initial signatories drafted the ESA charter which entered into force on 30 October 1980. These nations were also members of either ELDO or ESRO.[34]\n\n\t^ a b c d e f g h i Acceded members became ESA member states upon signing an accession agreement.[35][36][37][38][39][40][41] \n\n\t^ Canada is a Cooperating State of ESA.[42][43]\n\n\t^ Framework Agreement establishing the legal basis for cooperation between ESA and the European Union came into force in May 2004.\n\n\n\n\n\nNon-full member states[edit]\n\nSlovenia[edit]\n\nCurrently the only associated member state is Slovenia.[44] Previously associated members were Austria, Norway and Finland, all of which later joined ESA as full members.\n\n\nCanada[edit]\n\nSince 1 January 1979, Canada has had the special status of a Cooperating State within ESA. By virtue of this accord, the Canadian Space Agency takes part in ESA's deliberative bodies and decision-making and also in ESA's programmes and activities. Canadian firms can bid for and receive contracts to work on programmes. The accord has a provision ensuring a fair industrial return to Canada.[46] The most recent Cooperation Agreement was signed on 2010-12-15 with a term extending to 2020.[47][48] For 2014, Canada's annual assessed contribution to the ESA general budget was €6,059,449 (CAD$8,559,050).[49] For 2017, Canada has increased its annual contribution to €21,600,000 (CAD$30,000,000).[50]\n\n\nBudget appropriation and allocation[edit]\n\n  \nEuropean Space Agency 2016 budget by domain out of a total budget is 5250M€.\n\n\n\nESA is funded from annual contributions by national governments as well as from an annual contribution by the European Union (EU).[51]\n\nThe budget of ESA was €5.250 billion in 2016.[52] Every 3–4 years, ESA member states agree on a budget plan for several years at an ESA member states conference. This plan can be amended in future years, however provides the major guideline for ESA for several years.[citation needed] The 2016 budget allocations for major areas of ESA activity are shown in the chart on the right.[52]\n\nCountries typically have their own space programmes that differ in how they operate organisationally and financially with ESA. For example, the French space agency CNES has a total budget of €2015 million, of which €755 million is paid as direct financial contribution to ESA.[53] Several space-related projects are joint projects between national space agencies and ESA (e.g. COROT). Also, ESA is not the only European governmental space organisation (for example European Union Satellite Centre).\n\n\nEnlargement[edit]\n\nSee also: Enlargement of the European Space Agency\n\nAfter the decision of the ESA Council of 21/22 March 2001, the procedure for accession of the European states was detailed as described the document titled \"The Plan for European Co-operating States (PECS)\".[54]\nNations that want to become a full member of ESA do so in 3 stages. First a Cooperation Agreement is signed between the country and ESA. In this stage, the country has very limited financial responsibilities. If a country wants to co-operate more fully with ESA, it signs a European Cooperating State (ECS) Agreement. The ECS Agreement makes companies based in the country eligible for participation in ESA procurements. The country can also participate in all ESA programmes, except for the Basic Technology Research Programme. While the financial contribution of the country concerned increases, it is still much lower than that of a full member state. The agreement is normally followed by a Plan For European Cooperating State (or PECS Charter). This is a 5-year programme of basic research and development activities aimed at improving the nation's space industry capacity. At the end of the 5-year period, the country can either begin negotiations to become a full member state or an associated state or sign a new PECS Charter.[55] Many countries, most of which joined the EU in both 2004 and 2007, have started to co-operate with ESA on various levels:\n\n\n\tApplicant state\n\tEU membership\n\tCooperation Agreement\n\tECS Agreement\n\tPECS Charter(s)\n\tNational Programme\n\n\t Turkey\tNo\t15 July 2004[56]\t\t\tTUSA\n\n\t Ukraine\tNo\t25 January 2008[57]\t\t\tSSAU\n\n\t Slovenia\t2004\t28 May 2008[58]\t22 January 2010[59]\t30 November 2010[60]\tthrough MoHEST\n\n\t Latvia\t2004\t23 July 2009[61]\t19 March 2013[62]\t30 January 2015[63]\tthrough MoES\n\n\t Cyprus\t2004\t27 August 2009[64]\t6 July 2016[65]\t\tthrough MoCW\n\n\t Slovakia\t2004\t28 April 2010[66]\t16 February 2015[67]\t\tthrough MoE\n\n\t Lithuania\t2004\t7 October 2010[68]\t10 October 2014[69]\t\tLSA[70][71]\n\n\t Israel\tNo\t30 January 2011[72]\t\t\tISA\n\n\t Malta\t2004\t20 February 2012[73]\t\t\tMCST[74]\n\n\t Bulgaria\t2007\t\t8 April 2015[75]\t4 February 2016[76]\tSRTI\n\n\t Croatia\n\t2013\n\t19 February 2018[77]\n\t\n\t\n\tthrough MoSE\n\n\n\nDuring the Ministerial Meeting in December 2014, ESA ministers approved a resolution calling for discussions to begin with Israel, Australia and South Africa on future association agreements. The ministers noted that “concrete cooperation is at an advanced stage” with these nations and that “prospects for mutual benefits are existing”.[78]\n\nA separate space exploration strategy resolution calls for further co-operation with the United States, Russia and China on \"LEO exploration, including a continuation of ISS cooperation and the development of a robust plan for the coordinated use of space transportation vehicles and systems for exploration purposes, participation in robotic missions for the exploration of the Moon, the robotic exploration of Mars, leading to a broad Mars Sample Return mission in which Europe should be involved as a full partner, and human missions beyond LEO in the longer term.\"[78]\n\n\nEU and the European Space Agency[edit]\n\nThe political perspective of the European Union (EU) was to make ESA an agency of the EU by 2014,[79] although this date was not met. The EU is already the largest single donor to ESA's budget and non-ESA EU states are observers at ESA.\n\n\nLaunch vehicle fleet[edit]\n\nESA has a fleet of different launch vehicles in service with which it competes in all sectors of the launch market. ESA's fleet consists of three major rocket designs: Ariane 5, Soyuz-2 and Vega. Rocket launches are carried out by Arianespace, which has 23 shareholders representing the industry that manufactures the Ariane 5 as well as CNES, at ESA's Guiana Space Centre. Because many communication satellites have equatorial orbits, launches from French Guiana are able to take larger payloads into space than from spaceports at higher latitudes. In addition, equatorial launches give spacecraft an extra 'push' of nearly 500 m/s due to the higher rotational velocity of the Earth at the equator compared to near the Earth's poles where rotational velocity approaches zero.\n\n\nAriane 5[edit]\n\nMain article: Ariane 5\n\n  \nAriane 5 ECA transported to the ELA-3 launch pad\n\n\n\nThe Ariane 5 rocket is ESA's primary launcher. It has been in service since 1997 and replaced Ariane 4. Two different variants are currently in use. The heaviest and most used version, the Ariane 5 ECA, delivers two communications satellites of up to 10 tonnes into GTO. It failed during its first test flight in 2002, but has since made 82 consecutive successful flights until a partial failure in January 2018. The other version, Ariane 5 ES, was used to launch the Automated Transfer Vehicle (ATV) to the International Space Station (ISS) and will be used to launch four Galileo navigational satellites at a time.[80][81]\n\nIn November 2012, ESA agreed to build an upgraded variant called Ariane 5 ME (Mid-life Evolution) which would increase payload capacity to 11.5 tonnes to GTO and feature a restartable second stage to allow more complex missions. Ariane 5 ME was scheduled to fly in 2018,[82] but the whole project was scrapped in favor of Ariane 6, planned to replace Ariane 5 in the 2020s.\n\nESA's Ariane 1, 2, 3 and 4 launchers (the last of which was ESA's long-time workhorse) have been retired.\n\n\nSoyuz[edit]\n\nMain article: Soyuz at the Guiana Space Centre\n\n  \nSoyuz Launch Complex\n\n\n\nSoyuz-2 (also called the Soyuz-ST or Soyuz-STK) is a Russian medium payload launcher (ca. 3 metric tons to GTO) which was brought into ESA service in October 2011.[83][84] ESA entered into a €340 million joint venture with the Russian Federal Space Agency over the use of the Soyuz launcher.[12] Under the agreement, the Russian agency manufactures Soyuz rocket parts for ESA, which are then shipped to French Guiana for assembly.\n\nESA benefits because it gains a medium payload launcher, complementing its fleet while saving on development costs. In addition, the Soyuz rocket—which has been the Russian's space launch workhorse for some 40 years—is proven technology with a very good safety record. Russia benefits in that it gets access to the Kourou launch site. Due to its proximity to the equator, launching from Kourou rather than Baikonur nearly doubles Soyuz's payload to GTO (3.0 tonnes vs. 1.7 tonnes).\n\nSoyuz first launched from Kourou on 21 October 2011, and successfully placed two Galileo satellites into orbit 23,222 kilometres above Earth.[83]\n\n\nVega[edit]\n\n  \nVega rocket\n\n\n\nMain article: Vega (rocket)\n\nVega is ESA's carrier for small satellites. Developed by seven ESA members led by Italy, it is capable of carrying a payload with a mass of between 300 and 1500 kg to an altitude of 700 km, for low polar orbit. Its maiden launch from Kourou was on 13 February 2012.[85] Vega began full commercial exploitation in December 2015 [86]\n\nThe rocket has three solid propulsion stages and a liquid propulsion upper stage (the AVUM) for accurate orbital insertion and the ability to place multiple payloads into different orbits.[87][88]\n\n\nAriane launch vehicle development funding[edit]\n\nHistorically, the Ariane family rockets have been funded primarily \"with money contributed by ESA governments seeking to participate in the program rather than through competitive industry bids. This [has meant that] governments commit multiyear funding to the development with the expectation of a roughly 90% return on investment in the form of industrial workshare.\"  ESA is proposing changes to this scheme by moving to competitive bids for the development of the Ariane 6.[89]\n\n\nHuman space flight[edit]\n\nHistory[edit]\n\n  \nUlf Merbold became the first ESA astronaut to fly into space.\n\n\n\nAt the time ESA was formed, its main goals did not encompass human space flight; rather it considered itself to be primarily a scientific research organisation for unmanned space exploration in contrast to its American and Soviet counterparts. It is therefore not surprising that the first non-Soviet European in space was not an ESA astronaut on a European space craft; it was Czechoslovak Vladimír Remek who in 1978 became the first non-Soviet or American in space (the first man in space being Yuri Gagarin of the Soviet Union) – on a Soviet Soyuz spacecraft, followed by the Pole Mirosław Hermaszewski and East German Sigmund Jähn in the same year. This Soviet co-operation programme, known as Intercosmos, primarily involved the participation of Eastern bloc countries. In 1982, however, Jean-Loup Chrétien became the first non-Communist Bloc astronaut on a flight to the Soviet Salyut 7 space station.\n\nBecause Chrétien did not officially fly into space as an ESA astronaut, but rather as a member of the French CNES astronaut corps, the German Ulf Merbold is considered the first ESA astronaut to fly into space. He participated in the STS-9 Space Shuttle mission that included the first use of the European-built Spacelab in 1983. STS-9 marked the beginning of an extensive ESA/NASA joint partnership that included dozens of space flights of ESA astronauts in the following years. Some of these missions with Spacelab were fully funded and organizationally and scientifically controlled by ESA (such as two missions by Germany and one by Japan) with European astronauts as full crew members rather than guests on board. Beside paying for Spacelab flights and seats on the shuttles, ESA continued its human space flight co-operation with the Soviet Union and later Russia, including numerous visits to Mir.\n\nDuring the latter half of the 1980s, European human space flights changed from being the exception to routine and therefore, in 1990, the European Astronaut Centre in Cologne, Germany was established. It selects and trains prospective astronauts and is responsible for the co-ordination with international partners, especially with regard to the International Space Station. As of 2006, the ESA astronaut corps officially included twelve members, including nationals from most large European countries except the United Kingdom.\n\nIn the summer of 2008, ESA started to recruit new astronauts so that final selection would be due in spring 2009. Almost 10,000 people registered as astronaut candidates before registration ended in June 2008. 8,413 fulfilled the initial application criteria. Of the applicants, 918 were chosen to take part in the first stage of psychological testing, which narrowed down the field to 192. After two-stage psychological tests and medical evaluation in early 2009, as well as formal interviews, six new members of the European Astronaut Corps were selected - five men and one woman.[90]\n\n\nAstronaut names[edit]\n\nSee also: European Astronaut Corps\n\nThe astronauts of the European Space Agency are:\n\n\n\n\t Jean-François Clervoy[note 1]\n\t   Samantha Cristoforetti[note 2][note 3]\n\t Frank De Winne[note 3]\n\t   Pedro Duque[note 3]\n\t Reinhold Ewald[note 1]\n\t Léopold Eyharts[note 1][note 3]\n\t Alexander Gerst[note 2][note 3]\n\t   Umberto Guidoni[note 4][note 3]\n\t Christer Fuglesang[note 3]\n\t André Kuipers[note 3]\n\t Matthias Maurer[note 2]\n\t Andreas Mogensen[note 2]\n\t Paolo Nespoli[note 3]\n\t Claude Nicollier[note 4]\n\t Luca Parmitano[note 2][note 3]\n\t Timothy Peake[note 2][note 3]\n\t Philippe Perrin[note 4][note 3]\n\t   Thomas Pesquet[note 2]\n\t Thomas Reiter[note 1][note 3]\n\t Hans Schlegel[note 3]\n\t Gerhard Thiele[note 4]\n\t Michel Tognini[note 4][note 1]\n\t Roberto Vittori[note 3]\n\n\n\n\n\n\t^ a b c d e have visited Mir\n\n\t^ a b c d e f g 2009 selection\n\n\t^ a b c d e f g h i j k l m n o have visited the International Space Station\n\n\t^ a b c d e now retired\n\n\n\n\n\nCrew vehicles[edit]\n\nIn the 1980s, France pressed for an independent European crew launch vehicle. Around 1978 it was decided to pursue a reusable spacecraft model and starting in November 1987 a project to create a mini-shuttle by the name of Hermes was introduced. The craft was comparable to early proposals for the Space Shuttle and consisted of a small reusable spaceship that would carry 3 to 5 astronauts and 3 to 4 metric tons of payload for scientific experiments. With a total maximum weight of 21 metric tons it would have been launched on the Ariane 5 rocket, which was being developed at that time. It was planned solely for use in low Earth orbit space flights. The planning and pre-development phase concluded in 1991; the production phase was never fully implemented because at that time the political landscape had changed significantly. With the fall of the Soviet Union ESA looked forward to co-operation with Russia to build a next-generation space vehicle. Thus the Hermes programme was cancelled in 1995 after about 3 billion dollars had been spent. The Columbus space station programme had a similar fate.\n\nIn the 21st century, ESA started new programmes in order to create its own crew vehicles, most notable among its various projects and proposals is Hopper, whose prototype by EADS, called Phoenix, has already been tested. While projects such as Hopper are neither concrete nor to be realised within the next decade, other possibilities for human spaceflight in co-operation with the Russian Space Agency have emerged. Following talks with the Russian Space Agency in 2004 and June 2005,[95] a co-operation between ESA and the Russian Space Agency was announced to jointly work on the Russian-designed Kliper, a reusable spacecraft that would be available for space travel beyond LEO (e.g. the moon or even Mars). It was speculated that Europe would finance part of it. A €50 million participation study for Kliper, which was expected to be approved in December 2005, was finally not approved by the ESA member states. The Russian state tender for the project was subsequently cancelled in 2006.\n\nIn June 2006, ESA member states granted 15 million to the Crew Space Transportation System (CSTS) study, a two-year study to design a spacecraft capable of going beyond Low-Earth orbit based on the current Soyuz design. This project was pursued with Roskosmos instead of the cancelled Kliper proposal. A decision on the actual implementation and construction of the CSTS spacecraft was contemplated for 2008.\nIn mid-2009 EADS Astrium was awarded a €21 million study into designing a crew vehicle based on the European ATV which is believed to now be the basis of the Advanced Crew Transportation System design.[96]\n\nIn November 2012, ESA decided to join NASA's Orion programme. The ATV would form the basis of a propulsion unit for NASA's new manned spacecraft. ESA may also seek to work with NASA on Orion's launch system as well in order to secure a seat on the spacecraft for its own astronauts.[97]\n\nIn September 2014, ESA signed an agreement with Sierra Nevada Corporation for co-operation in Dream Chaser project. Further studies on the Dream Chaser for European Utilization or DC4EU project were funded, including the feasibility of launching a Europeanized Dream Chaser onboard Ariane 5.[98][99]\n\n\nCooperation with other countries and organisations[edit]\n\nESA has signed co-operation agreements with the following states that currently neither plan to integrate as tightly with ESA institutions as Canada, nor envision future membership of ESA: Argentina,[100] Brazil,[101] China,[102] India[103] (for the Chandrayan mission), Russia[104] and Turkey.[105]\n\nAdditionally, ESA has joint projects with the European Union, NASA of the United States and is participating in the International Space Station together with the United States (NASA), Russia and Japan (JAXA).\n\n\nEuropean Union[edit]\n\n  \n  ESA and EU member states\n  ESA-only members\n  EU-only members\n\n\n\n\nESA is not an agency or body of the European Union (EU), and has non-EU countries (Norway, and Switzerland) as members. There are however ties between the two, with various agreements in place and being worked on, to define the legal status of ESA with regard to the EU.[106]\n\nThere are common goals between ESA and the EU. ESA has an EU liaison office in Brussels. On certain projects, the EU and ESA co-operate, such as the upcoming Galileo satellite navigation system. Space policy has since December 2009 been an area for voting in the European Council. Under the European Space Policy of 2007, the EU, ESA and its Member States committed themselves to increasing co-ordination of their activities and programmes and to organising their respective roles relating to space.[107]\n\nThe Lisbon Treaty of 2009 reinforces the case for space in Europe and strengthens the role of ESA as an R&D space agency. Article 189 of the Treaty gives the EU a mandate to elaborate a European space policy and take related measures, and provides that the EU should establish appropriate relations with ESA.\n\nFormer Italian astronaut Umberto Guidoni, during his tenure as a Member of the European Parliament from 2004 to 2009, stressed the importance of the European Union as a driving force for space exploration, \"since other players are coming up such as India and China it is becoming ever more important that Europeans can have an independent access to space. We have to invest more into space research and technology in order to have an industry capable of competing with other international players.\"[108]\n\nThe first EU-ESA International Conference on Human Space Exploration took place in Prague on 22 and 23 October 2009.[109] A road map which would lead to a common vision and strategic planning in the area of space exploration was discussed. Ministers from all 29 EU and ESA members as well as members of parliament were in attendance.[110]\n\n\nNational space organisations of member states[edit]\n\n\tThe Centre National d'Études Spatiales (CNES) (National Centre for Space Study) is the French government space agency (administratively, a \"public establishment of industrial and commercial character\"). Its headquarters are in central Paris. CNES is the main participant on the Ariane project. Indeed, CNES designed and tested all Ariane family rockets (mainly from its centre in Évry near Paris)\n\tThe UK Space Agency is a partnership of the UK government departments which are active in space. Through the UK Space Agency, the partners provide delegates to represent the UK on the various ESA governing bodies. Each partner funds its own programme.\n\tThe Italian Space Agency (Agenzia Spaziale Italiana or ASI) was founded in 1988 to promote, co-ordinate and conduct space activities in Italy. Operating under the Ministry of the Universities and of Scientific and Technological Research, the agency cooperates with numerous entities active in space technology and with the president of the Council of Ministers. Internationally, the ASI provides Italy's delegation to the Council of the European Space Agency and to its subordinate bodies.\n\tThe German Aerospace Center (DLR) (German: Deutsches Zentrum für Luft- und Raumfahrt e. V.) is the national research centre for aviation and space flight of the Federal Republic of Germany and of other member states in the Helmholtz Association. Its extensive research and development projects are included in national and international cooperative programmes. In addition to its research projects, the centre is the assigned space agency of Germany bestowing headquarters of German space flight activities and its associates.\n\tThe Instituto Nacional de Técnica Aeroespacial (INTA) (National Institute for Aerospace Technique) is a Public Research Organization specialised in aerospace research and technology development in Spain. Among other functions, it serves as a platform for space research and acts as a significant testing facility for the aeronautic and space sector in the country.\n\n\nNASA[edit]\n\nESA has a long history of collaboration with NASA. Since ESA's astronaut corps was formed, the Space Shuttle has been the primary launch vehicle used by ESA's astronauts to get into space through partnership programmes with NASA. In the 1980s and 1990s, the Spacelab programme was an ESA-NASA joint research programme that had ESA develop and manufacture orbital labs for the Space Shuttle for several flights on which ESA participate with astronauts in experiments.\n\nIn robotic science mission and exploration missions, NASA has been ESA's main partner. Cassini–Huygens was a joint NASA-ESA mission, along with the Infrared Space Observatory, INTEGRAL, SOHO, and others. Also, the Hubble Space Telescope is a joint project of NASA and ESA. Future ESA-NASA joint projects include the James Webb Space Telescope and the proposed Laser Interferometer Space Antenna.[citation needed] NASA has committed to provide support to ESA's proposed MarcoPolo-R mission to return an asteroid sample to Earth for further analysis.[citation needed] NASA and ESA will also likely join together for a Mars Sample Return Mission.[111]\n\n\nCooperation with other space agencies[edit]\n\nSince China has started to invest more money into space activities, the Chinese Space Agency has sought international partnerships. ESA is, beside the Russian Space Agency, one of its most important partners. Two space agencies cooperated in the development of the Double Star Mission.[112] In 2017, ESA sent two astronauts to China for two weeks sea survival training with Chinese astronauts in Yantai, Shandong.[113]\n\nESA entered into a major joint venture with Russia in the form of the CSTS, the preparation of French Guiana spaceport for launches of Soyuz-2 rockets and other projects. With India, ESA agreed to send instruments into space aboard the ISRO's Chandrayaan-1 in 2008.[114] ESA is also co-operating with Japan, the most notable current project in collaboration with JAXA is the BepiColombo mission to Mercury.\n\nSpeaking to reporters at an air show near Moscow in August 2011, ESA head Jean-Jacques Dordain said ESA and Russia's Roskosmos space agency would \"carry out the first flight to Mars together.\"[115]\n\n\nInternational Space Station[edit]\n\nSee also: European contribution to the International Space Station\n\n  \nISS module Columbus at Kennedy Space Center's Space Station Processing Facility\n\n\n\nWith regard to the International Space Station (ISS) ESA is not represented by all of its member states:[116] 10 of the 21 ESA member states currently participate in the project: Belgium, Denmark, France, Germany, Italy, Netherlands, Norway, Spain, Sweden and Switzerland. Austria, Finland and Ireland chose not to participate, because of lack of interest or concerns about the expense of the project. The United Kingdom withdrew from the preliminary agreement because of concerns about the expense of the project. Portugal, Luxembourg, Greece, the Czech Republic, Romania and Poland joined ESA after the agreement had been signed. ESA is taking part in the construction and operation of the ISS with contributions such as Columbus, a science laboratory module that was brought into orbit by NASA's STS-122 Space Shuttle mission and the Cupola observatory module that was completed in July 2005 by Alenia Spazio for ESA. The current estimates for the ISS are approaching €100 billion in total (development, construction and 10 years of maintaining the station) of which ESA has committed to paying €8 billion.[117] About 90% of the costs of ESA's ISS share will be contributed by Germany (41%), France (28%) and Italy (20%). German ESA astronaut Thomas Reiter was the first long-term ISS crew member.\n\nESA has developed the Automated Transfer Vehicle for ISS resupply. Each ATV has a cargo capacity of 7,667 kilograms (16,903 lb).[118] The first ATV, Jules Verne, was launched on 9 March 2008 and on 3 April 2008 successfully docked with the ISS. This manoeuvre, considered a major technical feat, involved using automated systems to allow the ATV to track the ISS, moving at 27,000 km/h, and attach itself with an accuracy of 2 cm.\n\nAs of 2013, the spacecraft establishing supply links to the ISS are the Russian Progress and Soyuz, European ATV, Japanese Kounotori (HTV), and the USA COTS program vehicles Dragon and Cygnus.\n\nEuropean Life and Physical Sciences research on board the International Space Station (ISS) is mainly based on the European Programme for Life and Physical Sciences in Space programme that was initiated in 2001.\n\n\nLanguages[edit]\n\nAccording to Annex 1, Resolution No. 8 of the ESA Convention and Council Rules of Procedure,[4] English, French and German may be used in all meetings of the Agency, with interpretation provided into these three languages. All official documents are available in English and French with all documents concerning the ESA Council being available in German as well.\n\n\nFacilities[edit]\n\n  \nESA Mission Control at ESOC in Darmstadt, Germany\n\n\n\n\tESA Headquarters (HQ), Paris, France\n\tEuropean Space Operations Centre (ESOC), Darmstadt, Germany\n\tEuropean Space Research and Technology Centre (ESTEC), Noordwijk, The Netherlands\n\tEuropean Space Astronomy Centre (ESAC), Madrid, Spain[119]\n\tEuropean Centre for Space Applications and Telecommunications (ECSAT), Oxfordshire, United Kingdom[120]\n\tEuropean Astronaut Centre (EAC), Cologne, Germany\n\tESA Centre for Earth Observation (ESRIN), Frascati, Italy\n\tGuiana Space Centre (CSG), Kourou, French Guiana\n\tEuropean Space Tracking Network (ESTRACK)\n\tEuropean Data Relay System\n\n\nESA and the EU institutions[edit]\n\nThe Flag of Europe is the one to be flown in space during missions (for example it was flown by ESA's Andre Kuipers during Delta mission)\n\nThe Commission is increasingly working together towards common objectives. Some 20 per cent of the funds managed by ESA now originate from the supranational budget of the European Union.\n\nHowever, in recent years the ties between ESA and the European institutions have been reinforced by the increasing role that space plays in supporting Europe's social, political and economic policies.\n\nThe legal basis for the EU/ESA co-operation is provided by a Framework Agreement which entered into force in May 2004. According to this agreement, the European Commission and ESA co-ordinate their actions through the Joint Secretariat, a small team of EC's administrators and ESA executive. The Member States of the two organisations meet at ministerial level in the Space Council, which is a concomitant meeting of the EU and ESA Councils, prepared by Member States representatives in the High-level Space Policy Group (HSPG).\n\nESA maintains a liaison office in Brussels to facilitate relations with the European institutions.\n\n\nGuaranteeing European access to space[edit]\n\nIn May 2007, the 29 European countries expressed their support for the European Space Policy in a resolution of the Space Council, unifying the approach of ESA with those of the European Union and their member states.\n\nPrepared jointly by the European Commission and ESA's Director General, the European Space Policy sets out a basic vision and strategy for the space sector and addresses issues such as security and defence, access to space and exploration.\n\nThrough this resolution, the EU, ESA and their Member States all commit to increasing co-ordination of their activities and programmes and their respective roles relating to space.[121]\n\n\nIncidents[edit]\n\nOn 3 August 1984 ESA's Paris headquarters were severely damaged and six people were hurt when a bomb exploded, planted by the far-left armed Action Directe group.[122]\n\nOn 14 December 2015, hackers from Anonymous breached ESA's subdomains and leaked thousands of login credentials.[123]\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\tList of government space agencies\n\tList of directors general of the European Space Agency\n\tList of projects of the European Space Agency\n\tEuropean Launcher Development Organisation (ELDO)\n\tEuropean Space Research Organisation (ESRO)\n\tEuropean integration#Space\n\tEurospace\n\n\nEuropean Union matters[edit]\n\n\tAgencies of the European Union\n\tSpace policy of the European Union\n\tEuropean Union Agency for the Space Programme\n\tDirectorate-General for Defence Industry and Space\n\tEnhanced co-operation\n\n\nReferences[edit]\n\n\n\t^ \"Languages\". Retrieved 5 November 2017.\n\n\t^ esa. \"Frequently asked questions\". Retrieved 20 August 2017.\n\n\n\t^ a b c \"ESA budget 2019\". esa.int. 3 February 2019.\n\n\n\t^ a b \"Annex 1 Resolution 8\". ESA Convention and Council Rules of Procedure (PDF) (5th ed.). European Space Agency. March 2010. p. 116. ISBN 92-9092-965-0.\n\n\n\t^ \"Agence spatiale européenne (ASE)\" [European Space Agency (ESA)]. 23 February 2017. Archived from the original on 10 October 2017. Retrieved 23 February 2017.\n\n\n\t^ a b \"Welcome to ESA: New Member States\". ESA. Retrieved 26 July 2017.\n\n\n\t^ esa. \"What is ESA?\". European Space Agency. Retrieved 8 January 2019.\n\n\n\t^ \"Orion\". European Space Agency.\n\n\n\t^ \"European Service Module\". European Space Agency.\n\n\n\t^ \"ESA turns 30! A successful track record for Europe in space\" (Press release). European Space Agency. 31 May 2005.\n\n\n\t^ \"Ariane 4 / Launchers / Our Activities / ESA\". European Space Agency. 14 May 2004. Retrieved 13 June 2015.\n\n\n\t^ a b \"Launchers Home: International cooperation\". ESA. Retrieved 6 September 2014.\n\n\n\t^ Wehner, Mike (23 January 2019). \"Mining on the moon could be a reality as early as 2025\". New York Post. Retrieved 23 January 2019.\n\n\n\t^ a b Article II, Purpose, Convention of establishment of a European Space Agency, SP-1271(E) from 2003 .\"ESA's Purpose\". European Space Agency. 14 June 2007. Retrieved 6 September 2014.\n\n\n\t^ \"Launching a New Era with JAXA: Interview with Jean-Jacques Dordain\". JAXA. 31 October 2003. Archived from the original on 6 July 2005.\n\n\n\t^ http://www.esa.int/Our_Activities/Observing_the_Earth/Copernicus\n\n\t^ http://exploration.esa.int/mars/46048-programme-overview/\n\n\t^ http://www.esa.int/Our_Activities/Navigation/Galileo/What_is_Galileo\n\n\t^ \"Mandatory activities - ITS, Space Activities and R&D Department\". www.czechspaceportal.cz.\n\n\n\t^ esa. \"About the Technology Development Element programme (TDE)\". European Space Agency. Retrieved 4 September 2019.\n\n\n\t^ \"FACT SHEET\". European Space Agency.\n\n\n\t^ esa. \"Gemeinsame Mission\". European Space Agency (in German). Retrieved 1 August 2019.\n\n\n\t^ \"The creation of ESA_Lab@HEC, the first ESA_Lab@ between ESA and HEC Paris\". European Space Agency. Retrieved 1 August 2019.\n\n\n\t^ esa. \"ESA and Université PSL agree plans for new ESA_Lab@ programme\". European Space Agency. Retrieved 1 August 2019.\n\n\n\t^ esa. \"Setting Up an ESA_LAB\". European Space Agency. Retrieved 1 August 2019.\n\n\n\t^ \"ESA programmes with Czech participation\" (PDF). Czech Space Office. 2009. Archived from the original (PDF) on 11 May 2013.\n\n\n\t^ \"ESA budget for 2009\" (PDF). ESA. January 2009. Retrieved 6 September 2014.\n\n\n\t^ \"ESA Budget for 2013\". esa.int. 24 January 2013.\n\n\n\t^ \"ESA budget for 2011\" (PPT). ESA. Retrieved 6 September 2014.\n\n\n\t^ \"ESA budget for 2013\" (JPG). ESA. Retrieved 6 September 2014.\n\n\n\t^ \"ESA Budget for 2014\". esa.int. 29 January 2015.\n\n\n\t^ \"ESA Budget for 2015\". esa.int. 16 January 2015.\n\n\n\t^ For European states, population is taken from the 2018 column of https://ec.europa.eu/eurostat/tgm/table.do?tab=table&init=1&language=en&pcode=tps00001&plugin=1. For Canada, see https://www150.statcan.gc.ca/n1/daily-quotidien/180322/dq180322c-eng.htm.\n\n\t^ ESA Convention (7th ed.). European Space Agency Communications, ESTEC. December 2010. ISBN 978-92-9221-410-4. ISSN 0379-4067.\n\n\n\t^ Poncelet, Jean-Pol; Fonseca-Colomb, Anabela; Grilli, Giulio (November 2004). \"Enlarging ESA? After the Accession of Luxembourg and Greece\" (PDF). ESA Bulletin (120): 48–53.\n\n\n\t^ \"New Member States\". esa.int. ESA. Retrieved 25 July 2012.\n\n\n\t^ \"Polish flag raised at ESA\". esa.int. ESA. Retrieved 6 September 2014.\n\n\n\t^ \"Luxembourg becomes ESA's 17th Member State\". esa.int. ESA. Retrieved 6 September 2014.\n\n\n\t^ \"Greece becomes 16th ESA Member State\". esa.int. ESA. Retrieved 6 September 2014.\n\n\n\t^ \"Portugal becomes ESA's 15th Member State\". esa.int. ESA. Retrieved 6 September 2014.\n\n\n\t^ \"N° 9-1994:  Finland becomes ESA's 14th Member State\". esa.int. ESA. Retrieved 25 July 2012.\n\n\n\t^ a b Leclerc, G.; Lessard, S. (November 1998). \"Canada and ESA: 20 Years of Cooperation\" (PDF). ESA Bulletin (96). ISBN 92-9092-533-7.\n\n\n\t^ Dotto, Lydia (May 2002). Canada and The European Space Agency: Three Decades of Cooperation (PDF). European Space Agency.\n\n\n\t^ a b esa. \"Slovenia signs Association Agreement\".\n\n\n\t^ \"Framework Agreement between the European Community and the European Space Agency\". Consilium.europa.eu. Retrieved 29 August 2011.\n\n\n\t^ \"ESA and Canada renew cooperation agreement, building on long-term partnership\" (Press release). European Space Agency. 21 June 2000. Retrieved 6 September 2014.\n\n\n\t^ \"Minister Clement Welcomes Extension of Historic Partnership with European Space Agency\" (Press release). Industry Canada. 15 December 2010.\n\n\n\t^ \"Europe and Canada: Partners in Space A Model of International Co-Operation\" (Press release). Canadian Space Agency. 15 December 2010. Archived from the original on 15 May 2016.\n\n\n\t^ \"Disclosure of grants and contributions awards Fiscal Year 2013-2014 4th quarter\". Canadian Space Agency. 2 January 2014.\n\n\n\t^ media, Government of Canada, Canadian Space Agency, Directions of communications, Information services and new. \"2016-17 Report on Plans and Priorities\". Canadian Space Agency website.\n\n\n\t^ \nde Selding, Peter B. (29 July 2015). \"Tough Sledding for Proposed ESA Reorganization\". Space News. Retrieved 28 July 2015. The four biggest ESA contributors, Germany and France followed by Italy and Britain – together account for 67 percent of the agency’s funding – and more if the annual contribution from the European Union is taken into account.\n\n\n\t^ a b \"ESA 2016 Budget by domain\". European Space Agency. 14 January 2016.\n\n\n\t^ \"Le CNES en bref\". Centre National D'etudes Spatiales. CNES. Archived from the original on 6 August 2013. Retrieved 11 August 2013.\n\n\n\t^ Zufferey, Bernard (22 November 2006). \"The Plan for European Co-operating States (PECS): Towards an enlarged ESA Partnership\" (PDF). European Space Agency. Retrieved 21 July 2014.\n\n\n\t^ \"PECS: General Overview\". European Space Agency. Archived from the original on 23 May 2009.\n\n\n\t^ \"ESA signs Cooperation Agreement with Turkey\". European Space Agency. 6 September 2004. Retrieved 6 September 2014.\n\n\n\t^ \"A cooperation agreement between the Government of Ukraine and the European Space Agency was signed in Paris\". State Space Agency of Ukraine. Retrieved 25 January 2008.\n\n\n\t^ \"Slovenian Government and ESA Sign Cooperation Agreement\". Slovenian Government Communication Office. 28 May 2008. Archived from the original on 8 June 2008.\n\n\n\t^ \"Slovenia becomes sixth ESA European Cooperating State\". ESA. 25 January 2010. Retrieved 6 September 2014.\n\n\n\t^ \"European Space Agency selects and confirms ten Slovenian proposals\". Ministry of Higher Education, Science and Technology of Slovenia. 3 December 2010. Archived from the original on 10 May 2011. Retrieved 6 December 2010.\n\n\n\t^ \"Līgums ar Kosmosa aģentūru liks tiekties pēc augstākiem rezultātiem\". Diena.lv (in Latvian). 23 July 2009. Retrieved 24 July 2009.\n\n\n\t^ \"Latvia becomes seventh ESA European Cooperating State\". esa.int. ESA. Retrieved 19 March 2013.\n\n\n\t^ \"Signature of the PECS Charter between ESA and Latvia\". ESA. 31 January 2015. Retrieved 31 January 2015.\n\n\n\t^ \"Cyprus signs space agreement\". Famagusta Gazette Online. 28 August 2009. Retrieved 30 August 2009.\n[permanent dead link]\n\n\t^ \"Cyprus becomes 11th ESA European Cooperating State\".\n\n\n\t^ \"Slovak Republic signs Cooperation Agreement\". ESA. 4 May 2010. Retrieved 6 September 2014.\n\n\n\t^ esa. \"Slovakia becomes ninth ESA European Cooperating State\". European Space Agency. Retrieved 3 October 2015.\n\n\n\t^ Danuta Pavilenene (7 October 2010). \"Lithuania signs agreement with European Space Agency\". The Baltic Course.\n\n\n\t^ ESA (10 October 2014). \"Lithuania becomes eighth ESA European Cooperating State\".\n\n\n\t^ \"Lithuanian Space Association\". Lietuvos Kosmoso Asociacija. Retrieved 4 July 2014.\n\n\n\t^ \"Lithuania Signs Cooperation Agreement\". European Space Agency. 12 October 2010. Retrieved 4 July 2014.\n\n\n\t^ \"Israel signs Cooperation Agreement\". ESA.int. 31 January 2011. Retrieved 6 September 2014.\n\n\n\t^ \"Malta signs Cooperation Agreement\". ESA. 23 February 2012. Retrieved 6 September 2014.\n\n\n\t^ \"Malta exploring ways of collaborating with European Space Agency\". EARSC. 20 June 2009.\n\n\n\t^ esa. \"Bulgaria becomes tenth ESA European Cooperating State\". European Space Agency. Retrieved 3 October 2015.\n\n\n\t^ MoE. \"Bulgaria signs PECS Charter\". Ministry of Economics of Bulgaria. Retrieved 4 February 2016.\n\n\n\t^ esa. \"Croatia signs Cooperation Agreement\". European Space Agency. Retrieved 19 February 2018.\n\n\n\t^ a b \"ESA Looks Toward Expansion, Deeper International Cooperation\". Parabolicarc.com. Retrieved 20 August 2017.\n\n\n\t^ \"Archived copy\" (PDF). Archived from the original (PDF) on 3 March 2016. Retrieved 11 February 2016.CS1 maint: archived copy as title (link)\n\n\n\t^ \"Launch vehicles - Ariane 5\". www.esa.int. Retrieved 20 May 2014.\n\n\n\t^ \"Ariane 5 ES\". ESA. Retrieved 8 September 2014.\n\n\n\t^ \"Launch vehicle Ariane 5 ME\". www.esa.int. Retrieved 20 May 2014.\n\n\n\t^ a b \"Liftoff! Soyuz begins its maiden mission from the Spaceport\". 21 October 2011. Retrieved 23 August 2014.\n\n\n\t^ \"Russia ships Soyuz carrier rockets to Kourou spaceport\". RIA Novosti. 7 November 2009. Retrieved 6 September 2014.\n\n\n\t^ \"ESA's new Vega launcher scores success on maiden flight\". Archived from the original on 31 October 2014. Retrieved 6 September 2014.\n\n\n\t^ \"Vega\". Retrieved 13 June 2018.\n\n\n\t^ \"Vega - Launch Vehicle\". ESA. 10 May 2013. Retrieved 1 May 2014.\n\n\n\t^ \"VEGA - A European carrier for small satellites\". ASI. 2012. Archived from the original on 2 May 2014.\n\n\n\t^ \nSvitak, Amy (10 March 2014). \"SpaceX Says Falcon 9 To Compete For EELV This Year\". Aviation Week. Retrieved 11 March 2014. ESA Director General Jean-Jacques Dordain is aiming to reduce the agency's development and operational costs in a stark departure from past practice: Until now, the Ariane family of rockets has been built largely with money contributed by ESA governments seeking to participate in the program rather than through competitive industry bids. This means governments commit multiyear funding to the development with the expectation of a roughly 90% return on investment in the form of industrial workshare.  But in July, when Dordain presents ESA's member states with industry proposals for building the Ariane 6, he will seek government contributions based on the best value for money, not geographic return on investment. 'To have competitive launchers, we need to rethink the launch sector in Europe.'\n\n\n\t^ \"Closing in on new astronauts\". European Space Agency. 24 September 2008. Retrieved 6 September 2014.\n\n\n\t^ McKie, Robin (22 May 2005). \"Europe to hitch space ride on Russia's rocket\". The Observer.\n\n\n\t^ Coppinger, Rob. \"EADS Astrium wins €21 million reentry vehicle study\". Flightglobal.com. Retrieved 29 August 2011.\n\n\n\t^ Robin McKie (17 November 2012). \"Project Orion raises hopes that Britain could have its own man on the moon\". The Observer. Retrieved 3 September 2014.\n\n\n\t^ \nClark, Stephen (8 January 2014). \"Europe eyes cooperation on Dream Chaser space plane\". Spaceflight Now. Archived from the original on 9 January 2014. Retrieved 9 January 2014.\n\n\n\t^ \"One docking ring to rule them all\". ESA. 3 June 2014. Retrieved 3 September 2014.\n\n\n\t^ \"ESA and Argentina sign extension of Cooperation Agreement\". European Space Agency. 20 May 2008. Retrieved 6 September 2014.\n\n\n\t^ \"ESA on the world stage – international agreements with Brazil, Poland and India\". European Space Agency. 1 February 2002. Retrieved 6 September 2014.\n\n\n\t^ \"Closer relations between ESA and China\". Space Daily. 21 November 2005. Retrieved 6 September 2014.\n\n\n\t^ \"Agreement signed for European instruments on Chandrayaan-1\". European Space Agency. 1 July 2005. Retrieved 6 September 2014.\n\n\n\t^ \"Agreements 2003\". ESA Annual Report 2003 (PDF). European Space Agency. pp. 112–113.\n\n\n\t^ esa. \"ESA signs Cooperation Agreement with Turkey\". European Space Agency. Retrieved 3 October 2015.\n\n\n\t^ \"ESA and the EU\". European Space Agency. 9 October 2008.\n\n\n\t^ Millett, Lucy (29 August 2009). \"Opening up the gate to space\". Cyprus Mail. Archived from the original on 15 February 2013. Retrieved 30 August 2009.\n\n\n\t^ \"Former astronaut MEP backs Europe's stellar ambitions\". European Parliament. 28 November 2008. Archived from the original on 1 December 2008. Retrieved 28 November 2008.\n\n\n\t^ Coppinger, Rob (14 October 2009). \"2010 to see European Union human spaceflight decision\". Flightglobal.com. Retrieved 18 October 2009.\n\n\n\t^ \"Space exploration: European Ministers in Prague prepare a roadmap towards a common vision\". European Space Agency. 14 October 2009. Retrieved 6 September 2014.\n\n\n\t^ European Space Policy and Programs Handbook. International Business Publications. 2013. p. 32. ISBN 978-1-4330-1532-8.\n\n\n\t^ An interview with David Southwood, ESA Science Director (Video). Space.co.uk. 29 March 2008.\n\n\n\t^ \"Why Europe's astronauts are learning Chinese\". BBC News. 26 June 2018.\n\n\n\t^ \"David Southwood at the 2008 UK Space Conference\". Space.co.uk. 29 March 2008. Archived from the original on 8 December 2008.\n\n\n\t^ \"Russian, European space agencies to team up for Mars mission | RIA Novosti\". En.rian.ru. 17 August 2011. Retrieved 29 August 2011.\n\n\n\t^ \"International Space Station legal framework\". European Space Agency. 19 November 2013. Retrieved 6 September 2014.\n\n\n\t^ \"International Space Station: How much does it cost?\". European Space Agency. 9 August 2005. Retrieved 6 September 2014.\n\n\n\t^ \"Automated Transfer Vehicle (ATV) Utilisation Relevant Data Rev. 1.2\" (PDF). ESA ERASMUS User Centre.\n\n\n\t^ \"Contact ESAC\". European Space Agency. 14 October 2009.\n\n\n\t^ \"Esa opens its doors in uk\" (Press release). European Space Agency. 14 May 2013. Retrieved 29 July 2013.\n\n\n\t^ esa. \"ESA and the EU\". European Space Agency. Retrieved 3 October 2015.\n\n\n\t^ \"Bomb Shatters Office Of Europe Space Unit\". The New York Times.\n\n\n\t^ https://www.hackread.com/anonymous-hacks-european-space-agency-domains/\n\n\n\n\n\nFurther reading[edit]\n\n\n\tESA Bulletin ([1]) is a quarterly magazine about the work of ESA that can be subscribed to [2] free of charge.\n\tBonnet, Roger; Manno, Vittorio (1994). International Cooperation in Space: The Example of the European Space Agency (Frontiers of Space). Harvard University Press. \nISBN 0-674-45835-4.\n\tJohnson, Nicholas (1993). Space technologies and space science activities of member states of the European Space Agency. \nOCLC 29768749 .\n\tPeeters, Walter (2000). Space Marketing: A European Perspective (Space Technology Library). \nISBN 0-7923-6744-8.\n\tZabusky, Stacia (1995 and 2001). Launching Europe: An Ethnography of European Cooperation in Space Science. ISBN B00005OBX2.\n\tHarvey, Brian (2003). Europe's Space Programme: To Ariane and Beyond. \nISBN 1-85233-722-2.\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to European Space Agency.\n\n\n\t\tWikinews has news related to:\n  European Space Agency   \n\n\n\n\tOfficial website \n\tA European strategy for space – Europa\n\tConvention for the establishment of a European Space Agency, September 2005\n\tConvention for the Establishment of a European Space Agency, Annex I: Privileges and Immunities\n\tEuropean Space Agency fonds and 'Oral History of Europe in Space' project run by the European Space Agency at the Historical Archives of the EU in Florence\n\tOpen access at the European Space Agency\n\n\n\t\tv\n\tt\n\te\n\n\nEuropean Space Agency\n\n\t\n\tSpaceports\t\n\tGuiana Space Centre\n\tEsrange\n\n\n\n\n\tLaunch vehicles\t\n\tAriane 5\n\tAriane 6\n\tArianespace Soyuz\n\tVega\n\n\n\n\n\tFacilities\t\n\tSpace Operations Centre\n\tSpace Research and Technology Centre\n\tESA Centre for Earth Observation\n\tEuropean Astronaut Centre\n\tSpace Astronomy Centre\n\tSpace Applications and Telecommunications Centre\n\tConcurrent Design Facility\n\tSpace Telescope European Coordinating Facility\n\n\n\n\n\tCommunications\t\n\tESTRACK\n\tEuropean Data Relay System\n\n\n\n\n\tProgrammes\t\n\tAurora\n\tATV\n\tCopernicus\n\tSentinel\n\n\n\tColumbus\n\tCryoSat\n\tEGNOS\n\tGALILEO\n\tELIPS\n\tExoMars\n\tFLPP\n\tLiving Planet Programme\n\tOrion\n\tSpace Situational Awareness Programme\n\tScience Programme\n\tHorizon 2000\n\tCosmic Vision\n\n\n\tPride\n\n\n\n\n\tPredecessors\t\n\tEuropean Launcher Development Organisation\n\tEuropean Space Research Organisation\n\n\n\n\n\tRelated topics\t\n\tArianespace\n\tESA Television\n\tEUMETSAT\n\tEuropean Space Camp\n\tGEWEX\n\tPlanetary Science Archive\n\n\n\n\n\n\n\n\t\n\tProjects and missions\n\n\tScience\t\n\tSolar physics\t\n\tISEE-2 (1977–87)\n\tUlysses (1990–2009)\n\tSOHO (1995–present)\n\tCluster II (2000–present)\n\tSolar Orbiter (2020)\n\tLagrange (2020s)\n\n\n\n\n\tPlanetary science\t\n\tGiotto (1985–92)\n\tHuygens (1997–2005)\n\tSMART-1 (2003–06)\n\tMars Express (2003–present)\n\tRosetta/Philae (2004–16)\n\tVenus Express (2005–14)\n\tExoMars Trace Gas Orbiter (2016–present)\n\tBepiColombo (2018–present)\n\tRosalind Franklin rover (2020)\n\tJupiter Icy Moons Explorer (2022)\n\tComet Interceptor (2028)\n\n\n\n\n\tAstronomy and\ncosmology\n\t\n\tCos-B (1975–82)\n\tIUE (1978–96)\n\tEXOSAT (1983–86)\n\tHipparcos (1989–93)\n\tHubble (1990–present)\n\tEureca (1992–93)\n\tISO (1995–98)\n\tXMM-Newton (1999–present)\n\tINTEGRAL (2002–present)\n\tCoRoT (2006–13)\n\tPlanck (2009–13)\n\tHerschel (2009–13)\n\tGaia (2013–present)\n\tCHEOPS (2019)\n\tJames Webb (2021)\n\tEuclid (2022)\n\tPLATO (2026)\n\tARIEL (2028)\n\tATHENA (2031)\n\tLISA (2034)\n\n\n\n\n\tEarth observation\t\n\tCopernicus (1988–)\n\tMeteosat First Generation (1977–97)\n\tERS-1 (1991–2000)\n\tERS-2 (1995–2011)\n\tMeteosat Second Generation (2002–present)\n\tEnvisat (2002–12)\n\tDouble Star (2003–07)\n\tMetOp (2006–present)\n\tGOCE (2009–13)\n\tSMOS (2009–present)\n\tCryoSat-2 (2010–present)\n\tSwarm (2013–present)\n\tSentinel-1 / 1A / 1B (2014–present)\n\tSentinel-2 / 2A / 2B (2015–present)\n\tSentinel-3 / 3A / 3B (2016–present)\n\tSentinel-5 Precursor (2017–present)\n\tADM-Aeolus (2018–present)\n\tMeteosat Third Generation (Sentinel-4) (2019)\n\tEarthCARE (2021)\n\tMetOp-SG-A (2021)\n\tBiomass (2022)\n\tMetOp-SG-B (2022)\n\tFLEX (2023)\n\tSMILE (2023)\n\tFORUM (2026)\n\n\n\n\n\n\n\n\tISS spaceflight\t\n\tISS contribution (1998–present)\n\tColumbus (2008–present)\n\tJules Verne (2008)\n\tCupola (2010–present)\n\tJohannes Kepler (2011)\n\tEdoardo Amaldi (2012)\n\tAlbert Einstein (2013)\n\tGeorges Lemaître (2014)\n\tEuropean Robotic Arm (2019)\n\n\n\n\n\n\n\n\tTelecommunications\t\n\tGEOS 2 (1978)\n\tOlympus-1 (1989–93)\n\tArtemis (2001–present)\n\tGIOVE-A (2005–present)\n\tGIOVE-B (2008–present)\n\tHYLAS-1 (2010–present)\n\tGalileo IOV (2011–present)\n\tGalileo FOC (2014–present)\n\tEGNOS\n\tEuropean Data Relay System (2016–present)\n\n\n\n\n\tTechnology\ndemonstrators\n\t\n\tARD (1998)\n\tPROBA-1 (2001–present)\n\tYES2 (2007)\n\tPROBA-2 (2009–present)\n\tPROBA-V (2013–present)\n\tIXV (2015)\n\tLISA Pathfinder (2015–17)\n\tOPS-SAT (2019)\n\tPROBA-3 (2020)\n\tAIDA (2023)\n\n\n\n\n\tCancelled and proposed\t\n\tALTIUS\n\tAriane 5 ME\n\tColumbus Man-Tended Free Flyer\n\tCSTS\n\tDarwin Mission\n\tDon Quijote\n\te.Deorbit\n\tEChO\n\tEddington\n\tEnVision\n\tEXPERT\n\tHermes\n\tHopper\n\tLOFT\n\tLuna 27\n\tLunar Lander\n\tMarco Polo\n\tMarcoPolo-R\n\tMars sample return mission\n\tODINUS\n\tSPICA\n\tSTE-QUEST\n\tTHESEUS\n\tTHOR\n\tXIPE\n\n\n\n\n\tFailed\t\n\tCluster\n\tCryoSat-1\n\tGEOS 1\n\tSchiaparelli EDM\n\n\n\n\n\tFuture missions in italics\n\t Category\n\t Commons\n\t Wikinews\n\t WikiProject\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nAriane (rocket family)\n\n\tOrganizations\t\n\tArianespace\n\tAérospatiale\n\tAirbus Defence and Space\n\tSafran Aircraft Engines\n\tEuropean Space Agency\n\n\n\n\t\n\n\tRockets\t\n\tAriane 1\n\tAriane 2\n\tAriane 3\n\tAriane 4\n\tAriane 5\n\tAriane 6 (future)\n\n\n\n\n\tLaunch sites\t\n\tGuiana Space Centre (Kourou)\n\tELA-1\n\tELA-2\n\tELA-3\n\n\n\n\n\n\n\tEngines\t\n\tAestus\n\tHM7B\n\tViking\n\tVinci\n\tVulcain\n\n\n\n\n\tLaunches\t\n\tList of launches\n\t1979–1989\n\t1990–1999\n\t2000–2009\n\t2010–2019\n\n\n\n\n\n\n\tFlights\t\n\tVA240\n\tVA241\n\tVA242\n\tVA243\n\tVA244\n\tVA245\n\tVA246\n\tVA247\n\n\n\n\n\tRelated\t\n\tAutomated Transfer Vehicle\n\tEuropa\n\tHermes\n\tVega\n\n\n\n\n\t\n\t Category\n\t Multimedia\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nPublic-sector space agencies\n\n\tAfrica\t\n\t ASAL\n\t GSSTC\n\t NARRS\n\t ESSTI\n\t NASRDA\n\t SANSA\n\n\n\n\n\tAmericas\t\n\tNorth America\t\n\t CSA\n\t AEM\n\t NASA\n\tAFSPC\n\n\n\n\n\tSouth America\t\n\t CONAE\n\t ABE\n\t AEB\n\tDCTA\n\tINPE\n\tITA\n\n\n\t CCE\n\t\n\tABAE\n\tIVIC\n\n\n\n\n\n\n\n\n\n\tAsia\t\n\tEast Asia\t\n\t CNSA\n\tCALT\n\tCAST\n\tCCF\n\tCGWIC\n\tCOSTIND\n\n\n\t JAXA\n\tISAS\n\tNAL\n\tNASDA\n\n\n\tNICT\n\tUSEF\n\t NADA\n\t KARI\n\tSaTReC\n\t NSPO\n\n\n\n\n\tSoutheast Asia\t\n\t LAPAN\n\t MNSA\n\t PhilSA\n\t SSTA\n\t GISTDA\n\n\n\n\n\tSouth Asia\t\n\t SPARRSO\n\t ISRO\n\tAntrix Corp\n\tDoS\n\tNRSC\n\n\n\t SUPARCO\n\n\n\n\n\tSouthwest Asia\t\n\t MAKA1\n\t IAIO\n\tISA\n\tSAHA\n\n\n\t ISA\n\tNCSR\n\n\n\t GORS\n\t TÜBİTAK UZAY\n\t UAESA\n\n\n\n\n\tCentral Asia\t\n\t KazCosmos\n\t TNSA\n\n\n\n\n\n\n\n\tEurope\t\n\t ASA\n\t MAKA1\n\t BSA1\n\t BelSPo\n\t SRTI\n\t CSO\n\t DTU Space\n\t ECSS\n\tESA\n\tEUMETSAT\n\tEUSC\n\t CNES\n\t DLR\n\t HSA\n\t HSO\n\t ASI\n\t Luxinnovation\n\t SRON\n\t NSC\n\t PSA\n\t ROSA\n\t RKA1\n\tSRI1\n\tVKO\n\n\n\t SSP\n\t INTA\n\t SNSA\n\t SSO\n\t TÜBİTAK UZAY\n\t UKSA\n\t SSAU1\n\n\n\n\n\tOceania\t\n\t ASA\n\tCSIRO\n\t NZSA\n\n\n\n\n\tWorld\t\n\tAPSCO\n\tCOSPAR\n\tIAA\n\tINTELSAT\n\tInterkosmos\n\tIntersputnik\n\t UNCOPUOS\n\tUNOOSA\n\n\n\n\n\t\n\tSee also: Timeline of first orbital launches by country\n\t1 Preceded by the Soviet space program\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nAgencies of the European Union\n\n\tOperating\t\n\tSafety and Health at Work\n\tVocational Training Centre\n\tLiving and Working Conditions\n\tEnvironment\n\tTraining Foundation\n\tDrug Addiction\n\tMedicines\n\tIntellectual Property\n\tPlant Variety\n\tTranslation\n\tFood Safety\n\tMaritime Safety\n\tAviation Safety\n\tInformation Security\n\tDisease Prevention and Control\n\tSatellite Navigation\n\tRailways\n\tBorder and Coast Guard\n\tAsylum Support Office\n\tFisheries\n\tChemicals\n\tGender Equality\n\tFundamental Rights\n\tDefence\n\tSecurity Studies\n\tSatellite Centre\n\tLaw Enforcement Training\n\tLaw Enforcement Cooperation\n\tJudicial co-operation\n\tEnergy Regulators\n\tElectronic Communications Regulators\n\tBanking Authority\n\tSecurities and Markets Authority\n\tInsurance and Pensions Authority\n\tInnovation and Technology\n\n\n\n\t\n\n\n\tProposed\t\n\tEuropean Labour Authority\n\tEuropean Public Prosecutor's Office\n\tEuropean Union Agency for the Space Programme (from GNSS)\n\n\n\n\n\tExecutive\t\n\tCompetitiveness and Innovation\n\tEducation, Audiovisual and Culture\n\tHealth and Consumers\n\tInnovation and Networks (Transport)\n\tResearch Council\n\n\n\n\n\tEuratom\t\n\tEuratom Supply Agency\n\n\n\n\n\tFormer\t\n\tReconstruction (transferred to DG Enlargement)\n\n\n\n\n\n\n\n\tAuthority control \t\n\tBNF: cb118727952 (data)\n\tGND: 13253-6\n\tISNI: 0000 0004 0623 6946\n\tLCCN: n50079617\n\tNKC: kn20091016010\n\tSELIBR: 114436\n\tSUDOC: 026489155\n\tVIAF: 135528965\n\t WorldCat Identities (via VIAF): 135528965\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=European_Space_Agency&oldid=916693551\"\n\n\t\t\n\t\tCategories: \tEuropean Space Agency\n\tOrganizations established in 1975\n\tInternational scientific organizations based in Europe\n\tOrganizations based in Paris\n\t1975 establishments in Europe\n\tEuropean astronauts\n\tEuropean space programmes\n\tSpace agencies\n\tSpace policy of the European Union\n\n\nHidden categories: \tCS1 German-language sources (de)\n\tCS1 Latvian-language sources (lv)\n\tAll articles with dead external links\n\tArticles with dead external links from August 2019\n\tArticles with permanently dead external links\n\tCS1 maint: archived copy as title\n\tArticles with short description\n\tEngvarB from December 2016\n\tUse dmy dates from July 2018\n\tCoordinates not on Wikidata\n\tArticles containing Czech-language text\n\tArticles containing Danish-language text\n\tArticles containing German-language text\n\tArticles containing Estonian-language text\n\tArticles containing French-language text\n\tArticles containing Finnish-language text\n\tArticles containing Greek-language text\n\tArticles containing Hungarian-language text\n\tArticles containing Irish-language text\n\tArticles containing Italian-language text\n\tArticles containing Luxembourgish-language text\n\tArticles containing Dutch-language text\n\tArticles containing Norwegian-language text\n\tArticles containing Nynorsk-language text\n\tArticles containing Polish-language text\n\tArticles containing Portuguese-language text\n\tArticles containing Romanian-language text\n\tArticles containing Romansh-language text\n\tArticles containing Spanish-language text\n\tArticles containing Swedish-language text\n\tPages using collapsible list with both background and text-align in titlestyle\n\tArticles with hAudio microformats\n\tArticles needing additional references from May 2019\n\tAll articles needing additional references\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from July 2015\n\tArticles with unsourced statements from September 2017\n\tWikipedia articles with BNF identifiers\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with ISNI identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NKC identifiers\n\tWikipedia articles with SELIBR identifiers\n\tWikipedia articles with SUDOC identifiers\n\tWikipedia articles with VIAF identifiers\n\tWikipedia articles with WorldCat-VIAF identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\tWikinews\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAragonés\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBosanski\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFøroyskt\n\tFrançais\n\tFurlan\n\tGaeilge\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tInterlingua\n\tÍslenska\n\tItaliano\n\tעברית\n\tქართული\n\tKiswahili\n\tLatina\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tLimburgs\n\tLumbaart\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tमराठी\n\tمازِرونی\n\tBahasa Melayu\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tPlattdüütsch\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSardu\n\tScots\n\tSeeltersk\n\tShqip\n\tSicilianu\n\tසිංහල\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tТатарча/tatarça\n\tไทย\n\tТоҷикӣ\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t吴语\n\t粵語\n\tZazaki\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 20 September 2019, at 04:14 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "16", "dc:title": "European Space Agency - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/ESA_Headquarters_in_Paris%2C_France.JPG/1200px-ESA_Headquarters_in_Paris%2C_France.JPG", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-european_space_agency", "title": "European Space Agency - Wikipedia"}}