{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGalileo (spacecraft) - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tGalileo (spacecraft)\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about the Jupiter probe. For the navigation satellites, see Galileo (satellite navigation). For the Star Trek shuttle, see Galileo (Star Trek).\n\nUnmanned NASA spacecraft which studied the planet Jupiter and its moons\n\nGalileo\tArtist's concept of Galileo at Io with Jupiter in the background; the high-gain antenna is fully deployed\n\n\tNames\tJupiter Orbiter Probe\n\t\n\tMission type\tJupiter orbiter\n\tOperator\tNASA\n\tCOSPAR ID\t1989-084B\n\tSATCAT no.\t20298\n\tWebsite\tsolarsystem.nasa.gov/galileo/\n\tMission duration\t\n\tPlanned: 8 years, 1 month, 19 days\n\tIn orbit: 7 years, 9 months, 13 days\n\tFinal: 13 years, 11 months, 3 days\n\n\n\n\n\tDistance travelled\t4,631,778,000 km (2.88 billion mi)[1]\n\t\n\n\t\n\tSpacecraft properties\n\tManufacturer\t\n\tJet Propulsion Laboratory[2]\n\tMesserschmitt-Bölkow-Blohm[2]\n\tGeneral Electric[2]\n\tHughes Aircraft Company[2]\n\n\n\n\n\tLaunch mass\t\n\tTotal: 2,562 kg (5,648 lb)[2]\n\tOrbiter: 2,223 kg (4,901 lb)[2]\n\tProbe: 339 kg (747 lb)[2]\n\n\n\n\n\tDry mass\t\n\tOrbiter: 1,884 kg (4,154 lb)[2]\n\tProbe: 339 kg (747 lb)[2]\n\n\n\n\n\tPayload mass\t\n\tOrbiter: 118 kg (260 lb)[2]\n\tProbe: 30 kg (66 lb)[2]\n\n\n\n\n\tPower\t\n\tOrbiter: 570 watts[2]\n\tProbe: 730 watt-hours[2]\n\n\n\n\n\t\n\n\t\n\tStart of mission\n\tLaunch date\tOctober 18, 1989, 16:53:40 (1989-10-18UTC16:53:40) UTC[4]\n\tRocket\tSpace Shuttle Atlantis \n STS-34 / IUS\n\tLaunch site\tKennedy LC-39B\n\tEntered service\tDecember 8, 1995, 01:16 UTC SCET[3]\n\t\n\n\t\n\tEnd of mission\n\tDisposal\tControlled entry into Jupiter\n\tDecay date\tSeptember 21, 2003, 18:57:18 (2003-09-21UTC18:57:19) GMT SCET;\nSeptember 21, 2003, 19:49:36 (2003-09-21UTC19:49:37) GMT ERT[1]\n\t\n\n\t\n\tJupiter orbiter\n\tSpacecraft component\tOrbiter\n\tOrbital insertion\tDecember 8, 1995, 01:16 UTC SCET[3]\n\tJupiter atmospheric probe\n\tSpacecraft component\tProbe\n\tAtmospheric entry\tDecember 7, 1995, 22:04 UTC SCET[3]\n\tImpact site\t06°05′N 04°04′W﻿ / ﻿6.083°N 4.067°W﻿ / 6.083; -4.067﻿ (Galileo Probe) \n at entry interface\n\t\n\n\t\tInstruments\n\tSSI\tSolid-State Imager\n\tNIMS\tNear-Infrared Mapping Spectrometer\n\tUVS\tUltraviolet Spectrometer\n\tPPR\tPhotopolarimeter-Radiometer\n\tDDS\tDust Detector Subsystem\n\tEPD\tEnergetic Particles Detector\n\tHIC\tHeavy Ion Counter\n\tMAG\tMagnetometer\n\tPLS\tPlasma Subsystem\n\tPWS\tPlasma Wave Subsystem\n\n\n\t\nNASA Flagship Program\n← Voyager program\nCassini–Huygens →\n\n \n\n\nGalileo was an American unmanned spacecraft that studied the planet Jupiter and its moons, as well as several other Solar System bodies. Named after the Italian astronomer Galileo Galilei, it consisted of an orbiter and an entry probe. It was delivered into Earth orbit on October 18, 1989 by Space Shuttle Atlantis. Galileo arrived at Jupiter on December 7, 1995, after gravitational assist flybys of Venus and Earth, and became the first spacecraft to orbit Jupiter. It launched the first probe into Jupiter, directly measuring its atmosphere.[5] Despite suffering major antenna problems, Galileo achieved the first asteroid flyby, of 951 Gaspra, and discovered the first asteroid moon, Dactyl, around 243 Ida. In 1994, Galileo observed Comet Shoemaker–Levy 9's collision with Jupiter.[5]\n\nJupiter's atmospheric composition and ammonia clouds were recorded, the clouds possibly created by outflows from the lower depths of the atmosphere. Io's volcanism and plasma interactions with Jupiter's atmosphere were also recorded. The data Galileo collected supported the theory of a liquid ocean under the icy surface of Europa, and there were indications of similar liquid-saltwater layers under the surfaces of Ganymede and Callisto. Ganymede was shown to possess a magnetic field and the spacecraft found new evidence for exospheres around Europa, Ganymede, and Callisto.[5] Galileo also discovered that Jupiter's faint ring system consists of dust from impacts on the four small inner moons. The extent and structure of Jupiter's magnetosphere was also mapped.[5]\n\nOn September 21, 2003, after 14 years in space and 8 years in the Jovian system, Galileo's mission was terminated by sending it into Jupiter's atmosphere at a speed of over 48 kilometers per second (30 mi/s), eliminating the possibility of contaminating local moons with terrestrial bacteria.\n\n\nContents\n\n\n\t1 Background\n\t2 Mission overview\n\t3 Spacecraft\n\t3.1 Command and Data Handling (CDH)\n\t3.2 Propulsion\n\t3.3 Electrical power\n\t3.4 Instrumentation overview\n\t3.5 Instrumentation details\n\t3.5.1 Despun section\n\t3.5.1.1 Solid State Imager (SSI)\n\t3.5.1.2 Near-Infrared Mapping Spectrometer (NIMS)\n\t3.5.1.3 Ultraviolet Spectrometer / Extreme Ultraviolet Spectrometer (UVS/EUV)\n\t3.5.1.4 Photopolarimeter-Radiometer (PPR)\n\n\n\n\t3.5.2 Spun section\n\t3.5.2.1 Dust Detector Subsystem (DDS)\n\t3.5.2.2 Energetic Particles Detector (EPD)\n\t3.5.2.3 Heavy Ion Counter (HIC)\n\t3.5.2.4 Magnetometer (MAG)\n\t3.5.2.5 Plasma Subsystem (PLS)\n\t3.5.2.6 Plasma Wave Subsystem (PWS)\n\n\n\n\n\n\n\n\n\n\t4 Galileo Probe\n\t5 Jupiter science\n\t6 Other science conducted by Galileo\n\t6.1 Remote detection of life on Earth\n\t6.2 Galileo Optical Experiment\n\t6.3 Lunar observations\n\t6.4 Star scanner\n\t6.5 Asteroid encounters\n\t6.5.1 First asteroid encounter: 951 Gaspra\n\t6.5.2 Second asteroid encounter: 243 Ida and Dactyl\n\n\n\n\n\n\n\t7 Mission challenges\n\t7.1 Radiation-related anomalies\n\t7.2 Main antenna problem\n\t7.3 Tape recorder anomalies and remote repair\n\t7.4 Probe parachute deployment\n\n\n\n\t8 End of mission and deorbit\n\t9 Follow-on missions\n\t9.1 Juno\n\t9.2 Europa Orbiter (canceled)\n\t9.3 Jupiter Icy Moons Explorer\n\t9.4 Europa Clipper\n\t9.5 Europa Lander\n\n\n\n\t10 Galileo team\n\t11 Gallery of Jupiter system images\n\t12 See also\n\t13 References\n\t14 External links\n\n\n\n\n\nBackground[edit]\n\nJupiter was rated as the number one priority in the Planetary Science Decadal Survey published in the summer of 1968.[6] In the early 1970s the first flybys of Jupiter were achieved by Pioneer 10 and Pioneer 11, and before the decade was out it was also visited by the more advanced Voyager 1 and Voyager 2 spacecraft.\n\n\nMission overview[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Galileo\" spacecraft – news · newspapers · books · scholar · JSTOR  (December 2011) (Learn how and when to remove this template message)\n\n\n\n\nLaunch of STS-34\n\n\nGalileo is prepared for release from Space Shuttle Atlantis. The Inertial Upper Stage (white) is attached.\n\n\n\n\n\nWork on the spacecraft began at Jet Propulsion Laboratory in 1977, while the Voyager 1 and 2 missions were still being prepared for launch. Early plans called for a launch on Space Shuttle Columbia on what was then codenamed STS-23 in January 1982, but delays in the development of the Space Shuttle allowed more time for development of the probe. As the shuttle program got underway, Galileo was scheduled for launch in 1984, but this later slipped to 1985 and then to 1986.[7] The mission was initially called the Jupiter Orbiter Probe; it was christened Galileo in 1978.[8]\n\nOnce the spacecraft was complete, its launch was scheduled for STS-61-G on-board  Atlantis in 1986. The Inertial Upper Stage booster was going to be used at first, but this changed to the Centaur booster, then back to IUS after Challenger.[7]\n\nThe Centaur-G liquid hydrogen-fueled booster stage allowed a direct trajectory to Jupiter. The mission was further delayed by the hiatus in launches that occurred after the Space Shuttle Challenger disaster. New safety protocols introduced as a result of the disaster prohibited the use of the Centaur-G stage on the Shuttle, forcing Galileo to use a lower-powered Inertial Upper Stage solid-fuel booster. The mission was re-profiled in 1987 to use several gravitational slingshots, referred to as the Venus-Earth-Earth Gravity Assist or VEEGA maneuvers, to provide the additional velocity required to reach its destination. It was finally launched on October 18, 1989, by Space Shuttle Atlantis on the STS-34 mission.\n\n\n\n\nAnimation of Galileo's trajectory from October 19, 1989, to September 30, 2003 \n   Galileo ·   Jupiter ·   Earth ·   Venus ·   951 Gaspra ·   243 Ida\n\n\nAnimation of Galileo's trajectory around Jupiter from August 1, 1995, to September 30, 2003 \n   Galileo ·   Jupiter ·   Io ·   Europa ·   Ganymede ·   Callisto\n\n\n\n\n\n  \nGalileo's prime and extended mission orbits\n\n\n\nGalileo flew by Venus at 05:58:48 UTC on February 10, 1990, at a range of 16,106 km (10,008 mi). Having gained 8,030 km/h (4,990 mph) in speed, the spacecraft flew by Earth twice, the first time at a range of 960 km (600 mi) at 20:34:34 UTC on December 8, 1990, before approaching the S-type asteroid 951 Gaspra to a distance of 1,604 km (997 mi) at 22:37 UTC on October 29, 1991. Galileo then performed a second flyby of Earth at 303.1 km (188.3 mi) at 15:09:25 UTC on December 8, 1992, adding 13,320 km/h (8,280 mph) to its cumulative speed. Galileo performed close observations of a second asteroid, 243 Ida, at 16:51:59 UTC on August 28, 1993, at a range of 2,410 km (1,500 mi). The spacecraft discovered Ida has a moon, Dactyl, the first discovery of a natural satellite orbiting an asteroid. In 1994, Galileo was perfectly positioned to watch the fragments of Comet Shoemaker–Levy 9 crash into Jupiter, whereas terrestrial telescopes had to wait to see the impact sites as they rotated into view. After releasing its atmospheric probe on July 13, 1995, the Galileo orbiter became the first man-made satellite of Jupiter at 01:16 UTC on December 8, 1995,[3] after it fired its main engine to enter a 198-day parking orbit.[9]\n\nGalileo's prime mission was a two-year study of the Jovian system. The spacecraft traveled around Jupiter in elongated ellipses, each orbit lasting about two months. The differing distances from Jupiter afforded by these orbits allowed Galileo to sample different parts of the planet's extensive magnetosphere. The orbits were designed for close-up flybys of Jupiter's largest moons. Once the prime mission concluded, an extended mission started on December 7, 1997; the spacecraft made several flybys of Europa and Io. The closest approach was 180 km (110 mi) on October 15, 2001. The radiation environment near Io was very unhealthy for Galileo's systems, and so these flybys were saved for the extended mission when loss of the spacecraft would be more acceptable.\n\nGalileo's cameras were deactivated on January 17, 2002, after they had sustained irreparable radiation damage. NASA engineers were able to recover the damaged tape recorder electronics, and Galileo continued to return scientific data until it was deorbited in 2003, performing one last scientific experiment: a measurement of the moon Amalthea's mass as the spacecraft swung by it.\n\nOn December 11, 2013, NASA reported, based on results from the Galileo mission, the detection of \"clay-like minerals\" (specifically, phyllosilicates), often associated with organic materials, on the icy crust of Europa.[10] The presence of the minerals may have been the result of a collision with an asteroid or comet, according to the scientists.[10]\n\n\nSpacecraft[edit]\n\n  \nA diagram of Galileo's main components\n\n\n\n  \nGalileo with its main antenna open\n\n\n\nThe Jet Propulsion Laboratory built the Galileo spacecraft and managed the Galileo mission for NASA. West Germany's Messerschmitt-Bölkow-Blohm supplied the propulsion module. NASA's Ames Research Center managed the atmospheric probe, which was built by Hughes Aircraft Company.[2]\n\nAt launch, the orbiter and probe together had a mass of 2,562 kg (5,648 lb) and stood 6.15 m (20.2 ft) tall.[2] One section of the spacecraft rotated at three rpm, keeping Galileo stable and holding six instruments that gathered data from many different directions, including the fields and particles instruments. The other section of the spacecraft was a 4.8-meter (16-foot) wide, umbrella-like high-gain antenna, and data were periodically transmitted to it. Back on the ground, the mission operations team used software containing 650,000 lines of programming code in the orbit sequence design process; 1,615,000 lines in the telemetry interpretation; and 550,000 lines of code in navigation.\n\n\nCommand and Data Handling (CDH)[edit]\n\nThe CDH subsystem was actively redundant, with two parallel data system buses running at all times.[11] Each data system bus (a.k.a. string) was composed of the same functional elements, consisting of multiplexers (MUX), high-level modules (HLM), low-level modules (LLM), power converters (PC), bulk memory (BUM), data management subsystem bulk memory (DBUM), timing chains (TC), phase locked loops (PLL), Golay coders (GC), hardware command decoders (HCD) and critical controllers (CRC).\n\nThe CDH subsystem was responsible for maintaining the following functions:\n\n\n\tdecoding of uplink commands\n\texecution of commands and sequences\n\texecution of system-level fault-protection responses\n\tcollection, processing, and formatting of telemetry data for downlink transmission\n\tmovement of data between subsystems via a data system bus\n\n\nThe spacecraft was controlled by six RCA 1802 COSMAC microprocessor CPUs: four on the spun side and two on the despun side. Each CPU was clocked at about 1.6 MHz, and fabricated on sapphire (silicon on sapphire), which is a radiation-and static-hardened material ideal for spacecraft operation. This microprocessor was the first low-power CMOS processor chip, quite on a par with the 8-bit 6502 that was being built into the Apple II desktop computer at that time.\n\nThe Galileo Attitude and Articulation Control System (AACSE) was controlled by two Itek Advanced Technology Airborne Computers (ATAC), built using radiation-hardened 2901s. The AACSE could be reprogrammed in flight by sending the new program through the Command and Data Subsystem. Galileo's attitude control system software was written in the HAL/S programming language,[7] also used in the Space Shuttle program.\n\nMemory capacity provided by each BUM was 16K of RAM, while the DBUMs each provided 8K of RAM. There were two BUMs and two DBUMs in the CDH subsystem and they all resided on the spun side of the spacecraft. The BUMs and DBUMs provided storage for sequences and contain various buffers for telemetry data and interbus communication.\n\nEvery HLM and LLM was built up around a single 1802 microprocessor and 32K of RAM (for HLMs) or 16K of RAM (for LLMs). Two HLMs and two LLMs resided on the spun side while two LLMs were on the despun side.\n\nThus, total memory capacity available to the CDH subsystem was 176K of RAM: 144K allocated to the spun side and 32K to the despun side.\n\nEach HLM was responsible for the following functions:\n\n\n\tuplink command processing\n\tmaintenance of the spacecraft clock\n\tmovement of data over the data system bus\n\texecution of stored sequences (time-event tables)\n\ttelemetry control\n\terror recovery including system fault-protection monitoring and response\n\n\nEach LLM was responsible for the following functions:\n\n\n\tcollect and format engineering data from the subsystems\n\tprovide the capability to issue coded and discrete commands to spacecraft users\n\trecognize out-of-tolerance conditions on status inputs\n\tperform some system fault-protection functions\n\n\nThe HCD received command data from the modulation/demodulation subsystem, decoded these data and transferred them to the HLMs and CRCs.\n\nThe CRC controlled the configuration of CDH subsystem elements. It also controlled access to the two data system buses by other spacecraft subsystems. In addition, the CRC supplied signals to enable certain critical events (e.g. probe separation).\n\nThe GCs provided Golay encoding of data via hardware.\n\nThe TCs and PLLs established timing within the CDH subsystem.\n\n\nPropulsion[edit]\n\n  \nGalileo's propulsion module\n\n\n\nThe propulsion subsystem consisted of a 400 N main engine and twelve 10 N thrusters, together with propellant, storage and pressurizing tanks and associated plumbing. The 10 N thrusters were mounted in groups of six on two 2-meter booms. The fuel for the system was 925 kg (2,039 lb) of monomethylhydrazine and nitrogen tetroxide. Two separate tanks held another 7 kg (15 lb) of helium pressurant. The propulsion subsystem was developed and built by Messerschmitt-Bölkow-Blohm and provided by West Germany, the major international partner in Project Galileo.[12]\n\n\nElectrical power[edit]\n\nAt the time, solar panels were not practical at Jupiter's distance from the Sun; the spacecraft would have needed a minimum of 65 square meters (700 sq ft) of panels. Chemical batteries would likewise be prohibitively large due to technological limitations. The solution was two radioisotope thermoelectric generators (RTGs) which powered the spacecraft through the radioactive decay of plutonium-238. The heat emitted by this decay was converted into electricity through the solid-state Seebeck effect. This provided a reliable and long-lasting source of electricity unaffected by the cold environment and high-radiation fields in the Jovian system.\n\nEach GPHS-RTG, mounted on a 5-meter long (16 ft) boom, carried 7.8 kilograms (17 pounds) of 238\nPu.[13] Each RTG contained 18 separate heat source modules, and each module encased four pellets of plutonium(IV) oxide, a ceramic material resistant to fracturing. The modules were designed to survive a range of potential accidents: launch vehicle explosion or fire, re-entry into the atmosphere followed by land or water impact, and post-impact situations. An outer covering of graphite provided protection against the structural, thermal, and eroding environments of a potential re-entry. Additional graphite components provided impact protection, while iridium cladding of the fuel cells provided post-impact containment. The RTGs produced about 570 watts at launch. The power output initially decreased at the rate of 0.6 watts per month and was 493 watts when Galileo arrived at Jupiter.\n\nAs the launch of Galileo neared, anti-nuclear groups, concerned over what they perceived as an unacceptable risk to the public's safety from Galileo's RTGs, sought a court injunction prohibiting Galileo's launch. RTGs had been used for years in planetary exploration without mishap: the Lincoln Experimental Satellites 8/9, launched by the U.S. Department of Defense, had 7% more plutonium on board than Galileo, and the two Voyager spacecraft each carried 80% as much plutonium as Galileo. Activists remembered the messy crash of the Soviet Union's nuclear-powered Kosmos 954 satellite in Canada in 1978, and the 1986 Challenger accident, which did not involve nuclear fuel but raised public awareness about spacecraft failures. In addition, no RTGs had ever done a non-orbital swing past the Earth at close range and high speed, as Galileo's Venus-Earth-Earth gravity assist trajectory required it to do. This created a novel mission failure modality that might plausibly have entailed total dispersal of Galileo's plutonium in the Earth's atmosphere. Scientist Carl Sagan, for example, a strong supporter of the Galileo mission, said in 1989 that \"there is nothing absurd about either side of this argument.\"[14]\n\nAfter the Challenger accident, a study considered additional shielding but rejected it, in part because such a design significantly increased the overall risk of mission failure and only shifted the other risks around. For example, if a failure on orbit had occurred, additional shielding would have significantly increased the consequences of a ground impact.[13]\n\n\nInstrumentation overview[edit]\n\n  \nImage mosaic of Europa produced from the multiple Galileo images\n\n\n\nScientific instruments to measure fields and particles were mounted on the spinning section of the spacecraft, together with the main antenna, power supply, the propulsion module and most of Galileo's computers and control electronics. The sixteen instruments, weighing 118 kg (260 lb) altogether, included magnetometer sensors mounted on an 11 m (36 ft) boom to minimize interference from the spacecraft; a plasma instrument for detecting low-energy charged particles and a plasma-wave detector to study waves generated by the particles; a high-energy particle detector; and a detector of cosmic and Jovian dust. It also carried the Heavy Ion Counter, an engineering experiment to assess the potentially hazardous charged particle environments the spacecraft flew through, and an extreme ultraviolet detector associated with the UV spectrometer on the scan platform.\n\nThe despun section's instruments included the camera system; the near infrared mapping spectrometer to make multi-spectral images for atmospheric and moon surface chemical analysis; the ultraviolet spectrometer to study gases; and the photopolarimeter-radiometer to measure radiant and reflected energy. The camera system was designed to obtain images of Jupiter's satellites at resolutions 20 to 1,000 times better than Voyager's best, because Galileo flew closer to the planet and its inner moons, and because the more modern CCD sensor in Galileo's camera was more sensitive and had a broader color detection band than the vidicons of Voyager.\n\n\nInstrumentation details[edit]\n\nThe following information was taken directly from NASA's Galileo legacy site.[15]\n\n\nDespun section[edit]\n\nSolid State Imager (SSI)[edit]\n\n  \nSolid-State Imager\n\n\n\nThe SSI was an 800-by-800-pixel solid state camera consisting of an array of silicon sensors called a charge-coupled device (CCD). Galileo was one of the first spacecraft to be equipped with a CCD camera.[citation needed]  The optical portion of the camera was built as a Cassegrain telescope. Light was collected by the primary mirror and directed to a smaller secondary mirror that channeled it through a hole in the center of the primary mirror and onto the CCD. The CCD sensor was shielded from radiation, a particular problem within the harsh Jovian magnetosphere. The shielding was accomplished by means of a 10 mm (0.4 in) thick layer of tantalum surrounding the CCD except where the light enters the system. An eight-position filter wheel was used to obtain images at specific wavelengths. The images were then combined electronically on Earth to produce color images. The spectral response of the SSI ranged from about 0.4 to 1.1 micrometers. The SSI weighed 29.7 kg (65 lb) and consumed, on average, 15 watts of power.[16][17]\n\n\nNear-Infrared Mapping Spectrometer (NIMS)[edit]\n\n  \nNear-Infrared Mapping Spectrometer\n\n\n\nThe NIMS instrument was sensitive to 0.7-to-5.2-micrometer wavelength infrared light, overlapping the wavelength range of the SSI. The telescope associated with NIMS was all reflective (using only mirrors and no lenses) with an aperture of 229 mm (9 in). The spectrometer of NIMS used a grating to disperse the light collected by the telescope. The dispersed spectrum of light was focused on detectors of indium, antimonide and silicon. The NIMS weighed 18 kg (40 lb) and used 12 watts of power on average.[18][19]\n\n\nUltraviolet Spectrometer / Extreme Ultraviolet Spectrometer (UVS/EUV)[edit]\n\n  \nUltraviolet Spectrometer\n\n\n\nThe Cassegrain telescope of the UVS had a 250 mm (9.8 in) aperture and collected light from the observation target. Both the UVS and EUV instruments used a ruled grating to disperse this light for spectral analysis. This light then passed through an exit slit into photomultiplier tubes that produced pulses or \"sprays\" of electrons. These electron pulses were counted, and these count numbers constituted the data that were sent to Earth. The UVS was mounted on Galileo's scan platform and could be pointed to an object in inertial space. The EUV was mounted on the spun section. As Galileo rotated, EUV observed a narrow ribbon of space perpendicular to the spin axis. The two instruments combined weighed about 9.7 kg (21 lb) and used 5.9 watts of power.[20][21]\n\n\nPhotopolarimeter-Radiometer (PPR)[edit]\n\nThe PPR had seven radiometry bands. One of these used no filters and observed all incoming radiation, both solar and thermal. Another band allowed only solar radiation through. The difference between the solar-plus-thermal and the solar-only channels gave the total thermal radiation emitted. The PPR also measured in five broadband channels that spanned the spectral range from 17 to 110 micrometers. The radiometer provided data on the temperatures of Jupiter's atmosphere and satellites. The design of the instrument was based on that of an instrument flown on the Pioneer Venus spacecraft. A 100 mm (4 in) aperture reflecting telescope collected light and directed it to a series of filters, and, from there, measurements were performed by the detectors of the PPR. The PPR weighed 5.0 kg (11.0 lb) and consumed about 5 watts of power.[22][23]\n\n\nSpun section[edit]\n\nDust Detector Subsystem (DDS)[edit]\n\n  \nDust Detector Subsystem\n\n\n\nThe Dust Detector Subsystem (DDS) was used to measure the mass, electric charge, and velocity of incoming particles. The masses of dust particles that the DDS could detect go from 10−16 to 10−7 grams. The speed of these small particles could be measured over the range of 1 to 70 kilometers per second (0.6 to 43.5 mi/s). The instrument could measure impact rates from 1 particle per 115 days (10 megaseconds) to 100 particles per second. Such data was used to help determine dust origin and dynamics within the magnetosphere. The DDS weighed 4.2 kg (9.3 lb) and used an average of 5.4 watts of power.[24][25]\n\n\nEnergetic Particles Detector (EPD)[edit]\n\nThe Energetic Particles Detector (EPD) was designed to measure the numbers and energies of ions and electrons whose energies exceeded about 20 keV (3.2 fJ). The EPD could also measure the direction of travel of such particles and, in the case of ions, could determine their composition (whether the ion is oxygen or sulfur, for example). The EPD used silicon solid-state detectors and a time-of-flight detector system to measure changes in the energetic particle population at Jupiter as a function of position and time. These measurements helped determine how the particles got their energy and how they were transported through Jupiter's magnetosphere. The EPD weighed 10.5 kg (23 lb) and used 10.1 watts of power on average.[26][27]\n\n\nHeavy Ion Counter (HIC)[edit]\n\n  \nHeavy Ion Counter\n\n\n\nThe HIC was, in effect, a repackaged and updated version of some parts of the flight spare of the Voyager Cosmic Ray System. The HIC detected heavy ions using stacks of single crystal silicon wafers. The HIC could measure heavy ions with energies as low as 6 MeV (1 pJ) and as high as 200 MeV (32 pJ) per nucleon. This range included all atomic substances between carbon and nickel. The HIC and the EUV shared a communications link and, therefore, had to share observing time. The HIC weighed 8.0 kg (17.6 lb) and used an average of 2.8 watts of power.[28][29]\n\n\nMagnetometer (MAG)[edit]\n\n  \nMagnetometer\n\n\n\nThe magnetometer (MAG) used two sets of three sensors. The three sensors allowed the three orthogonal components of the magnetic field section to be measured. One set was located at the end of the magnetometer boom and, in that position, was about 11 m (36 ft) from the spin axis of the spacecraft. The second set, designed to detect stronger fields, was 6.7 m (22 ft) from the spin axis. The boom was used to remove the MAG from the immediate vicinity of Galileo to minimize magnetic effects from the spacecraft. However, not all these effects could be eliminated by distancing the instrument. The rotation of the spacecraft was used to separate natural magnetic fields from engineering-induced fields. Another source of potential error in measurement came from the bending and twisting of the long magnetometer boom. To account for these motions, a calibration coil was mounted rigidly on the spacecraft to generate a reference magnetic field during calibrations. The magnetic field at the surface of the Earth has a strength of about 50,000 nT. At Jupiter, the outboard (11 m) set of sensors could measure magnetic field strengths in the range from ±32 to ±512 nT, while the inboard (6.7 m) set was active in the range from ±512 to ±16,384 nT. The MAG experiment weighed 7.0 kg (15.4 lb) and used 3.9 watts of power.[30][31]\n\n\n  \nPlasma Wave Subsystem\n\n\n\nPlasma Subsystem (PLS)[edit]\n\nThe PLS used seven fields of view to collect charged particles for energy and mass analysis. These fields of view covered most angles from 0 to 180 degrees, fanning out from the spin axis. The rotation of the spacecraft carried each field of view through a full circle. The PLS measured particles in the energy range from 0.9 to 52,000 eV (0.14 to 8,300 aJ). The PLS weighed 13.2 kg (29 lb) and used an average of 10.7 watts of power.[32][33]\n\n\nPlasma Wave Subsystem (PWS)[edit]\n\nAn electric dipole antenna was used to study the electric fields of plasmas, while two search coil magnetic antennas studied the magnetic fields. The electric dipole antenna was mounted at the tip of the magnetometer boom. The search coil magnetic antennas were mounted on the high-gain antenna feed. Nearly simultaneous measurements of the electric and magnetic field spectrum allowed electrostatic waves to be distinguished from electromagnetic waves. The PWS weighed 7.1 kg (16 lb) and used an average of 9.8 watts.[34][35]\n\n\n\n\nGalileo Probe[edit]\n\n\n\nIllustration of the Galileo Probe\n\n\nDiagram of the Galileo Probe\n\n\n\n\n\nMain article: Galileo Probe\n\nThe Galileo Probe was an atmospheric-entry probe carried by the main Galileo spacecraft on its way to Jupiter. It separated from the main spacecraft on July 10, 1995, five months before its rendezvous with the planet on December 7.[3] After a rough deceleration, the Descent Module started to return data to the main spacecraft orbiting high above Jupiter.[36] The 339-kilogram (747 lb) probe was built by Hughes Aircraft Company[37] at its El Segundo, California plant and measured about 1.3 meters (4.3 ft) across. Inside the probe's heat shield, the Descent Module with its scientific instruments was protected from extreme heat and pressure during its high-speed journey into the Jovian atmosphere, entering at 47.8 kilometers per second (29.7 mi/s).\n\nDuring the 57 minutes of data collecting, the Galileo Probe returned data on Jupiter's atmospheric conditions and composition and achieved some new discoveries.[36]\n\n\nJupiter science[edit]\n\nMain article: Timeline of Galileo (spacecraft)\n\n  \nTvashtar Catena on Io, showing changes in hot spots between 1999 and 2000\n\n\n\nAfter arriving on December 8, 1995 (UTC), and completing 35 orbits around Jupiter throughout a nearly eight-year mission, the Galileo orbiter was destroyed during a controlled impact with Jupiter on September 21, 2003. During that intervening time, Galileo changed the way scientists saw Jupiter and provided a wealth of information on the moons orbiting the planet which will be studied for years to come. Culled from NASA's press kit, the top orbiter scientific results were:\n\n\n\tGalileo made the first observation of ammonia clouds in another planet's atmosphere. The atmosphere creates ammonia ice particles from material coming up from lower depths.\n\tThe moon Io was confirmed to have extensive volcanic activity that is 100 times greater than that found on Earth. The heat and frequency of eruptions are reminiscent of early Earth.\n\tComplex plasma interactions in Io's atmosphere create immense electrical currents which couple to Jupiter's atmosphere.\n\tSeveral lines of evidence from Galileo support the theory that liquid oceans exist under Europa's icy surface.\n\tGanymede possesses its own, substantial magnetic field – the first satellite known to have one.\n\tGalileo magnetic data provided evidence that Europa, Ganymede and Callisto have a liquid salt water layer under the visible surface.\n\tEvidence exists that Europa, Ganymede, and Callisto all have a thin atmospheric layer known as a 'surface-bound exosphere'.\n\tJupiter's ring system is formed by dust kicked up as interplanetary meteoroids smash into the planet's four small inner moons. The outermost ring is actually two rings, one embedded with the other. There is probably a separate ring along Amalthea's orbit, as well.\n\tThe Galileo spacecraft identified the global structure and dynamics of a giant planet's magnetosphere.\n\n\nOther science conducted by Galileo[edit]\n\nRemote detection of life on Earth[edit]\n\n  \nGalileo image of Earth, taken in December 1990\n\n\n\nThe astronomer Carl Sagan, pondering the question of whether life on Earth could be easily detected from space, devised a set of experiments in the late 1980s using Galileo's remote sensing instruments during the mission's first Earth flyby in December 1990. After data acquisition and processing, Sagan et al. published a paper in Nature in 1993 detailing the results of the experiment. Galileo had indeed found what are now referred to as the \"Sagan criteria for life\". These included strong absorption of light at the red end of the visible spectrum (especially over continents) which was caused by absorption by chlorophyll in photosynthesizing plants, absorption bands of molecular oxygen which is also a result of plant activity, infrared absorption bands caused by the ~1 micromole per mole (µmol/mol) of methane in Earth's atmosphere (a gas which must be replenished by either volcanic or biological activity), and modulated narrowband radio wave transmissions uncharacteristic of any known natural source. Galileo's experiments were thus the first ever controls in the newborn science of astrobiological remote sensing.[38]\n\n\nGalileo Optical Experiment[edit]\n\n  \nAn image of Earth taken by Galileo during the GOPEX test, showing laser pulses coming from a transmitting telescope on the night side. Galileo's imager was panned downward during the exposure to separate the pulses, thus blurring Earth's image on the right.\n\n\n\nIn December 1992, during Galileo's second gravity-assist planetary flyby of Earth, another groundbreaking experiment was performed. Optical communications in space were assessed by detecting light pulses from powerful lasers with Galileo's CCD. The experiment, dubbed Galileo Optical Experiment or GOPEX,[39] used two separate sites to beam laser pulses to the spacecraft, one at Table Mountain Observatory in California and the other at the Starfire Optical Range in New Mexico. The Table Mountain site used a frequency doubled neodymium-yttrium-aluminium garnet (Nd:YAG) laser operating at 532 nm with a repetition rate of ~15 to 30 Hz and a pulse power (FWHM) in the tens of megawatts range, which was coupled to a 0.6 m (2.0 ft) Cassegrain telescope for transmission to Galileo. The Starfire range site used a similar setup with a larger, 1.5 m (4.9 ft), transmitting telescope. Long exposure (~0.1 to 0.8 s) images using Galileo's 560 nm centered green filter produced images of Earth clearly showing the laser pulses even at distances of up to 6 million km (3.7 million mi). Adverse weather conditions, restrictions placed on laser transmissions by the U.S. Space Defense Operations Center (SPADOC) and a pointing error caused by the scan platform acceleration on the spacecraft being slower than expected (which prevented laser detection on all frames with less than 400 ms exposure times) all contributed to the reduction of the number of successful detections of the laser transmission to 48 of the total 159 frames taken. Nonetheless, the experiment was considered a resounding success and the data acquired will likely be used in the future to design laser \"downlinks\" which will send large volumes of data very quickly from spacecraft to Earth. The scheme was already being studied (as of 2004) for a data link to a future Mars orbiting spacecraft.[40]\n\n\nLunar observations[edit]\n\n\t\n\t\t\t\n\n\n\t\t\t\nGalileo shot of Earth's Moon\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nFalse color mosaic by Galileo showing compositional variations of the Moon's surface\n\n\n\t\t\t\n\n\t\t\n\n\n\n\n\nStar scanner[edit]\n\nGalileo's star scanner was a small optical telescope that provided an absolute attitude reference. It also made several scientific discoveries serendipitously.[41] In the prime mission, it was found that the star scanner was able to detect high-energy particles as a noise signal. This data was eventually calibrated to show the particles were predominantly >2 MeV (0.32 pJ) electrons that were trapped in the Jovian magnetic belts, and released to the Planetary Data System.\n\nA second discovery occurred in 2000. The star scanner was observing a set of stars which included the second magnitude star Delta Velorum. At one point, this star dimmed for 8 hours below the star scanner's detection threshold. Subsequent analysis of Galileo data and work by amateur and professional astronomers showed that Delta Velorum is the brightest known eclipsing binary, brighter at maximum than even Algol.[42] It has a primary period of 45 days and the dimming is just visible with the naked eye.\n\nA final discovery occurred during the last two orbits of the mission. When the spacecraft passed the orbit of Jupiter's moon Amalthea, the star scanner detected unexpected flashes of light that were reflections from moonlets. None of the individual moonlets were reliably sighted twice, hence no orbits were determined and the moonlets did not meet the International Astronomical Union requirements to receive designations.[43] It is believed that these moonlets most likely are debris ejected from Amalthea and form a tenuous, and perhaps temporary, ring.[44]\n\n\nAsteroid encounters[edit]\n\n\n\n951 Gaspra (enhanced colorization)\n\n\n243 Ida, with its moon Dactyl to the right\n\n\n\n\n\nFirst asteroid encounter: 951 Gaspra[edit]\n\nOn October 29, 1991, two months after entering the asteroid belt, Galileo performed the first asteroid encounter by a spacecraft, passing approximately 1,600 kilometers (990 mi) from 951 Gaspra at a relative speed of about 8 kilometers per second (5.0 mi/s). Several pictures of Gaspra were taken, along with measurements using the NIMS instrument to indicate composition and physical properties. The last two images were relayed back to Earth in November 1991 and June 1992. The imagery revealed a cratered and very irregular body, measuring about 19 by 12 by 11 kilometers (11.8 by 7.5 by 6.8 miles). The remainder of data taken, including low-resolution images of more of the surface, were transmitted in late November 1992.[45]\n\n\nSecond asteroid encounter: 243 Ida and Dactyl[edit]\n\nMain article: 243 Ida\n\nOn August 28, 1993, Galileo flew within 2,400 kilometers (1,500 mi) of the asteroid 243 Ida. The probe discovered that Ida had a small moon, dubbed Dactyl, measuring around 1.4 kilometers (0.87 mi) in diameter; this was the first asteroid moon discovered. Measurements using Galileo's Solid State Imager, Magnetometer and NIMS instrument were taken. From subsequent analysis of this data, Dactyl appears to be an SII-subtype S-type asteroid, and is spectrally different from 243 Ida. It is hypothesized that Dactyl may have been produced by partial melting within a Koronis parent body, while the 243 Ida region escaped such igneous processing.\n\n\nMission challenges[edit]\n\nSome of the mission challenges that had to be overcome included intense radiation at Jupiter and hardware wear-and-tear, as well as dealing with unexpected technical difficulties.\n\n\nRadiation-related anomalies[edit]\n\n  \nJupiter's inner magnetosphere and radiation belts\n\n\n\nJupiter's uniquely harsh radiation environment caused over 20 anomalies over the course of Galileo's mission, in addition to the incidents expanded upon below. Despite having exceeded its radiation design limit by at least a factor of three, the spacecraft survived all these anomalies. Work-arounds were found eventually for all of these problems, and Galileo was never rendered entirely non-functional by Jupiter's radiation. The radiation limits for Galileo's computers were based on data returned from Pioneers 10 and 11, since much of the design work was underway before the two Voyagers arrived at Jupiter in 1979.[46]\n\nA typical effect of the radiation was that several of the science instruments suffered increased noise while within about 700,000 km (430,000 mi) of Jupiter. The SSI camera began producing totally white images when the spacecraft was hit by the exceptional 'Bastille Day' coronal mass ejection in 2000, and did so again on subsequent close approaches to Jupiter. The quartz crystal used as the frequency reference for the radio suffered permanent frequency shifts with each Jupiter approach. A spin detector failed, and the spacecraft gyro output was biased by the radiation environment.\n\nThe most severe effect of the radiation were current leakages somewhere in the spacecraft's power bus, most likely across brushes at a spin bearing connecting rotor and stator sections of the orbiter. These current leakages triggered a reset of the onboard computer and caused it to go into safe mode. The resets occurred when the spacecraft was either close to Jupiter or in the region of space magnetically downstream of the Jupiter. A change to the software was made in April 1999 that allowed the onboard computer to detect these resets and autonomously recover, so as to avoid safe mode.[47]\n\n\nMain antenna problem[edit]\n\n  \nProposed configuration of antenna problem\n\n\n\nGalileo's high-gain antenna failed to fully deploy after its first flyby of Earth.[48] The antenna had 18 ribs, like an umbrella and when the driver motor started and put pressure on the ribs, they were supposed to pop out of the cup their tips were held in. Only 15 popped out, leaving the antenna looking like a lop-sided, half-open umbrella. Investigators concluded that during the 4.5 years that Galileo spent in storage after the 1986 Challenger disaster, the lubricants between the tips of the ribs and the cup were eroded and worn away from vibration during three cross-country journeys by truck between California and Florida for the spacecraft.[49] The failed ribs were those closest to the flat-bed trailers carrying Galileo on these trips, which were used instead of air transport to cut costs.  The antenna lubricants were not checked or replaced before launch.\n\nTo fix this malfunction, engineers tried thermal-cycling the antenna, rotating the spacecraft up to its maximum spin rate of 10.5 rpm, and \"hammering\" the antenna deployment motor—turning it on and off repeatedly—over 13,000 times, but all attempts failed to open the high-gain antenna.\n\n\n  \nIllustration of Galileo with antenna not fully deployed\n\n\n\nThe associated problem mission managers faced was if one rib popped free, there would be increased pressure on the remaining two, and if one of them popped out the last would be under so much pressure it would never release. The second part of the problem was due to Galileo's revised flight plan. The probe had never been intended to approach the Sun any closer than the orbit of Earth, but sending it to Venus would expose it to temperatures at least 50 degrees higher than at Earth distance. So the probe had to be protected from that extra heat, part of which involved adapting some of the computer functions. Forty-one device drivers had been programmed into the computer, but with no room for any more, the mission planners had to decide which driver they could use in association with the heat protection. They chose the antenna motor reverse driver.\n\nFortunately, Galileo possessed an additional low-gain antenna that was capable of transmitting information back to Earth, although since it transmitted a signal isotropically, the low-gain antenna's bandwidth was significantly less than what the high-gain antenna's would have been; the high-gain antenna was to have transmitted at 134 kilobits per second, whereas the low-gain antenna was only intended to transmit at about 8 to 16 bits per second. Galileo's low-gain antenna transmitted with a power of about 15 to 20 watts, which, by the time it reached Earth and had been collected by one of the large aperture (70 m) NASA Deep Space Network antennas, had a total power of about −170 dBm or 10 zeptowatts (10−20 watts).[50] Through the implementation of sophisticated technologies, the arraying of several Deep Space Network antennas and sensitivity upgrades to the receivers used to listen to Galileo's signal, data throughput was increased to a maximum of 160 bits per second.[48][51] By further using data compression, the effective data rate could be raised to 1,000 bits per second.[51][52] The data collected on Jupiter and its moons was stored in the spacecraft's onboard tape recorder, and transmitted back to Earth during the long apoapsis portion of the probe's orbit using the low-gain antenna. At the same time, measurements were made of Jupiter's magnetosphere and transmitted back to Earth. The reduction in available bandwidth reduced the total amount of data transmitted throughout the mission, although 70% of Galileo's science goals could still be met.[48][53]\n\n\nTape recorder anomalies and remote repair[edit]\n\nThe failure of Galileo's high-gain antenna meant that data storage to the tape recorder for later compression and playback was absolutely crucial in order to obtain any substantial information from the flybys of Jupiter and its moons. In October 1995, Galileo's four-track, 114-megabyte digital tape recorder,[54] which was manufactured by Odetics Corporation, remained stuck in rewind mode for 15 hours before engineers learned what had happened and were able to send commands to shut it off. Though the recorder itself was still in working order, the malfunction possibly damaged a length of tape at the end of the reel. This section of tape was subsequently declared \"off limits\" to any future data recording, and was covered with 25 more turns of tape to secure the section and reduce any further stresses, which could tear it. Because it happened only weeks before Galileo entered orbit around Jupiter, the anomaly prompted engineers to sacrifice data acquisition of almost all of the Io and Europa observations during the orbit insertion phase, in order to focus solely on recording data sent from the Jupiter probe descent.[55]\n\n\n  \nWind tunnel test of the atmospheric probe's parachute\n\n\n\nIn November 2002, after the completion of the mission's only encounter with Jupiter's moon Amalthea, problems with playback of the tape recorder again plagued Galileo. About 10 minutes after the closest approach of the Amalthea flyby, Galileo stopped collecting data, shut down all of its instruments, and went into safe mode, apparently as a result of exposure to Jupiter's intense radiation environment. Though most of the Amalthea data was already written to tape, it was found that the recorder refused to respond to commands telling it to play back data.[56] After weeks of troubleshooting of an identical flight spare of the recorder on the ground, it was determined that the cause of the malfunction was a reduction of light output in three infrared Optek OP133 light-emitting diodes located in the drive electronics of the recorder's motor encoder wheel. The GaAs LEDs had been particularly sensitive to proton-irradiation-induced atomic lattice displacement defects, which greatly decreased their effective light output and caused the drive motor's electronics to falsely believe the motor encoder wheel was incorrectly positioned. Galileo's flight team then began a series of \"annealing\" sessions, where current was passed through the LEDs for hours at a time to heat them to a point where some of the crystalline lattice defects would be shifted back into place, thus increasing the LED's light output. After about 100 hours of annealing and playback cycles, the recorder was able to operate for up to an hour at a time. After many subsequent playback and cooling cycles, the complete transmission back to Earth of all recorded Amalthea flyby data was successful.\n\n\nProbe parachute deployment[edit]\n\nThe atmospheric probe deployed its parachute fifty-three seconds later than anticipated, resulting in a small loss of upper atmospheric readings. This was attributed to wiring problems with an accelerometer that determined when to begin the parachute deployment sequence.[57]\n\n\nEnd of mission and deorbit[edit]\n\n  \nIllustration of Galileo entering Jupiter's atmosphere\n\n\n\nTwo years of Jupiter's intense radiation took its toll on the spacecraft's systems, and its fuel supply was running low in the early 2000s. Galileo had not been sterilized prior to launch and could have carried bacteria from Earth. Therefore, a plan was formulated to send the probe directly into Jupiter, in an intentional crash to eliminate the possibility of any impact with Jupiter's moons and prevent a forward contamination.\n\nGalileo flew by Amalthea on November 5, 2002,[58] during its 34th orbit, allowing a measurement of the moon's mass as it passed within 163 ± 11.7 km (101.3 ± 7.3 mi) of its surface. On April 14, 2003, Galileo reached its greatest orbital distance from Jupiter for the entire mission since orbital insertion, 26 million km (16 million mi), before plunging back towards the gas giant for its final impact.[59] At the completion of its 35th and final circuit around the Jovian system, Galileo impacted the gas giant in darkness just south of the equator on September 21, 2003, at 18:57 UTC. Its impact speed was approximately 173,700 km/h (108,000 mph).[60] The total mission cost was about US$1.4 billion.[61][62]\n\n\nFollow-on missions[edit]\n\n  \nConcept art of the Europa Clipper spacecraft\n\n\n\nWhile Galileo was operating, Cassini–Huygens coasted by the planet in 2000 en route to Saturn, and it also collected data on Jupiter. Ulysses passed by Jupiter in 1992 and 2004 on its mission to study the Sun's polar regions. New Horizons also passed close by Jupiter in 2007 for a gravity assist en route to Pluto, and it too collected data on the planet. The next mission to orbit Jupiter was the Juno spacecraft in July 2016.\n\n\nJuno[edit]\n\nNASA's Juno spacecraft, launched in 2011 and planned for a two-year tour of the Jovian system, successfully completed Jupiter orbital insertion on July 4, 2016.[63]\n\n\nEuropa Orbiter (canceled)[edit]\n\nThere was a spare Galileo spacecraft that was considered by the NASA-ESA Outer Planets Study Team in 1983 for a mission to Saturn, but it was passed over in favor of a newer design which became Cassini–Huygens.[64] Even before Galileo concluded, NASA considered the Europa Orbiter,[65] which was a mission to Jupiter's moon Europa, but it was canceled in 2002.[66]\n\n\nJupiter Icy Moons Explorer[edit]\n\nESA also is planning to return to the Jovian system with the Jupiter Icy Moons Explorer (JUICE), which is designed to orbit Ganymede in the 2020s.[67] There have been several other attempts at missions that were dedicated to, or included, the Jupiter system as part of their mission plan but did not make it out of the planning stages.\n\n\nEuropa Clipper[edit]\n\nFollowing the cancellation of Europa Orbiter, a lower-cost version was studied. This led to the Europa Clipper being approved in 2015; it is currently planned for launch in the mid-2020s.\n\n\nEuropa Lander[edit]\n\nA lander concept, simply called Europa Lander is being assessed by the Jet Propulsion Laboratory. As of 2019, this lander mission to Europa remains a concept, and some funds have been released for instrument development and maturation.[68][69]\n\n\nGalileo team[edit]\n\n  \nGalileo floating free in space after release from Space Shuttle Atlantis, 1989\n\n\n\n  \nPatch for the STS-34 mission\n\n\n\nInvestigators and researchers came from the following institutions, and included famous scientists such as Carl Sagan and James Van Allen.[70]\n\n\n\tAmes Research Center\n\tBell Particles Laboratory\n\tUniversity of Bonn (Germany)\n\tBrown University\n\tCornell University\n\tCalifornia Institute of Technology (a.k.a. Caltech)\n\tGoddard Institute for Space Studies\n\tGoddard Space Flight Center\n\tHarvard University\n\tJet Propulsion Laboratory\n\tMax Planck Institute for Chemistry\n\tNational Optical Astronomy Observatory\n\tState University of New York\n\tUniversity of Arizona\n\tUniversity of Colorado\n\tUniversity of California, Los Angeles (UCLA)\n\tUniversity of Hawaii\n\tUniversity of Iowa\n\tUniversity of Wisconsin–Madison\n\tJohns Hopkins University Applied Physics Laboratory (APL)\n\n\nBuilders:[70]\n\n\n\tAmes Research Center\n\tGeneral Electric\n\tJet Propulsion Laboratory\n\tMesserschmitt-Bölkow-Blohm\n\tUnited States Department of Energy\n\n\nCrew of STS-34:[71]\n\n\n\tDonald E. Williams\n\tMichael J. McCulley\n\tShannon W. Lucid\n\tFranklin R. Chang Díaz\n\tEllen S. Baker\n\n\nGallery of Jupiter system images[edit]\n\n\n\nTrue and false color images of Jupiter's cloud layers\n\n\nGreat Red Spot at 757 nm, 415 nm, 732 nm, and 886 nm\n\n\nJovian lightning amidst clouds lit by Io's moonlight\n\n\n\n\n\n\n\nThe four Galilean moons: Io, Europa, Ganymede, and Callisto\n\n\n\n\n\n\n\nJupiter's rings. Enhanced top image shows the halo of ring particles suspended by Jupiter's powerful electromagnetic field.\n\n\nInner moon Amalthea\n\n\nInner moon Thebe\n\n\n\n\n\nSee also[edit]\n\n\n\tSolar System portal\n\tSpaceflight portal\n\n\n\n\tExploration of Jupiter\n\tList of missions to the outer planets\n\tList of missions to Venus\n\n\nReferences[edit]\n\n\n\t^ a b \"The Final Day on Galileo - Sunday, September 21, 2003\". NASA / Jet Propulsion Laboratory via Spaceref.com. September 19, 2003. Retrieved December 18, 2016. Italic or bold markup not allowed in: |work= (help)\n\n\t^ a b c d e f g h i j k l m n o \"Galileo Jupiter Arrival\" (PDF) (Press Kit). NASA / Jet Propulsion Laboratory. December 1995.\n\n\n\t^ a b c d e D'Amario, Louis A.; Bright, Larry E.; Wolf, Aron A. (May 1992). \"Galileo Trajectory Design\". Space Science Reviews. 60 (1–4): 23–78. Bibcode:1992SSRv...60...23D. doi:10.1007/BF00216849.\n\n\n\t^ Beyer, P. E.; O'Connor, R. C.; Mudgway, D. J. (May 15, 1992). \"Galileo Early Cruise, Including Venus, First Earth, and Gaspra Encounters\" (PDF). The Telecommunications and Data Acquisition Report. NASA / Jet Propulsion Laboratory: 265–281. TDA Progress Report 42-109.\n\n\n\t^ a b c d \"Galileo End of Mission Press Kit\" (PDF). Archived from the original (PDF) on July 21, 2011. Retrieved May 15, 2011.\n\n\n\t^ Report on Space Science. Space Studies Board. 1968. OCLC 254442711.\n\n\n\t^ a b c Tomayko, James E. (March 1988). \"Computers in Spaceflight: The NASA Experience\". NASA History Office. Retrieved November 7, 2012.\n\n\n\t^ Why We Explore. NASA.gov. May 29, 2007. Retrieved November 12, 2012.\n\n\t^ Solar System Exploration – Galileo. NASA. Retrieved April 24, 2012.\n\n\t^ a b Cook, Jia-Rui c. (December 11, 2013). \"Clay-Like Minerals Found on Icy Crust of Europa\". NASA. Retrieved December 11, 2013.\n\n\n\t^ Siewiorek, Daniel (1998). Reliable Computer Systems. Natick, Massachusetts, USA: A K Peters. p. 683. ISBN 1-56881-092-X.\n\n\n\t^ Engineering Archived June 13, 2008, at the Wayback Machine\n\n\t^ a b \"What's in an RTG?\". .jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ Sagan, Carl. \"Benefit outweighs risk: Launch Galileo craft,\" USA Today, Inquiry Page, Tuesday, October 10, 1989 [1]\n\n\t^ \"Solar System Exploration: Galileo Legacy Site\". Galileo.jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ \"SSI – Solid State Imaging\". .jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ SSI Imaging Team site.\n\n\t^ \"NIMS – Near-Infrared Mapping Spectrometer\". .jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ NIMS Team site.\n\n\t^ \"EUVS – Extreme Ultraviolet Spectrometer\". .jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ EUV Team site.\n\n\t^ \"PPR – Photopolarimeter-Radiometer\". .jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ PPR Team site Archived July 21, 2004, at the Wayback Machine.\n\n\t^ \"DDS – Dust Detector Subsystem\". .jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ \"Cosmic Dust: Messengers from Distant Worlds\". mpi-hd.mpg.de. High Energy Stereoscopic System. Retrieved December 10, 2012. DSI via Stuttgart University\n\n\n\t^ \"EPD – Energetic Particles Detector\". JPL. Retrieved May 15, 2011.\n\n\n\t^ Galileo EPD. JHUAPL.edu.\n\n\t^ \"HIC – Heavy Ion Counter\". .jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ HIC Team site.\n\n\t^ \"MAG – Magnetometer\". .jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ MAG Team site Archived July 21, 2004, at the Wayback Machine.\n\n\t^ \"PLS – Plasma Subsystem\". .jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ PLS Team site.\n\n\t^ \"PWS – Plasma Wave Subsystem\". .jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ \"Galileo PWS\". UIowa.edu. Retrieved December 4, 2012.\n\n\t^ a b Douglas Isbell and David Morse (January 22, 1996). \"Galileo Probe Science Results\". JPL. Retrieved March 4, 2016.CS1 maint: uses authors parameter (link)\n\n\n\t^ \"Hughes Science/Scope Press Release and Advertisement, retrieved from Flight Global Archives May 23, 2010\". flightglobal.com. Retrieved May 15, 2011.\n\n\n\t^ C. Sagan; W. R. Thompson; R. Carlson; D. Gurnett; C. Hord (1993). \"A search for life on Earth from the Galileo spacecraft\". Nature. 365 (6448): 715–721. Bibcode:1993Natur.365..715S. doi:10.1038/365715a0. PMID 11536539.\n\n\n\t^ \"GOPEX SPIE 1993 (Edited)\" (PDF). Archived from the original (PDF) on July 21, 2011. Retrieved May 15, 2011.\n\n\n\t^ \"NASA To Test Laser Communications With Mars Spacecraft\". Space.com. November 15, 2004. Retrieved May 15, 2011.\n\n\n\t^ \"Science with The Galileo Star Scanner\". Mindspring.com. Retrieved December 8, 2012.\n\n\t^ \"IBVS 4999 (7 December 2000)\". Konkoly.hu. Retrieved May 15, 2011.\n\n\n\t^ Fieseler, P. D.; Ardalan, S. M. (April 4, 2003). \"Objects near Jupiter V (Amalthea)\". IAU Circular. Central Bureau for Astronomical Telegrams. 8107. 2. Bibcode:2003IAUC.8107....2F. Archived from the original on March 2, 2014. Retrieved October 12, 2014.\n\n\n\t^ Fieseler, P. D.; Adams, O. W.; Vandermey, N.; Theilig, E. E.; Schimmels, K. A.; Lewis, G. D.; Ardalan, S. M.; Alexander, C. J. (2004). \"The Galileo star scanner observations at Amalthea\". Icarus. 169 (2): 390. Bibcode:2004Icar..169..390F. doi:10.1016/j.icarus.2004.01.012.\n\n\n\t^ Veverka, J.; Belton, M.; Klaasen, K.; Chapman, C. (1994). \"Galileo's Encounter with 951 Gaspra: Overview\". Icarus. 107 (1): 2–17. Bibcode:1994Icar..107....2V. doi:10.1006/icar.1994.1002.\n\n\n\t^ Tomayko, James (1988). Computers in Spaceflight: The NASA Experience. NASA History Office. p. 200.\n\n\n\t^ \"Instrument Host Overview\". NASA. 1999. Retrieved November 29, 2012.\n\n\t^ a b c Sarkissian, John M. (November 1997). \"The Parkes Galileo Tracks\". Trinity College Dublin. Retrieved December 20, 2016.\n\n\n\t^ \"Spaceflight Now - Galileo - The Galileo trials\".\n\n\n\t^ \"Galileo FAQ – Galileo's Antennas\". .jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ a b \"Advanced Systems Program and the Galileo Mission to Jupiter\". Archived from the original on June 14, 2011.\n\n\n\t^ \"NASA - NSSDCA - Spacecraft - PDMP Details\".\n\n\n\t^ Galileo’s Telecom Using The Low-Gain Spacecraft Antenna (PDF) Archived November 24, 2011, at the Wayback Machine. NASA/JPL, 1996 (cached). Retrieved January 29, 2012.\n\n\t^ \"Galileo FAQ – Tape Recorder\". jpl.nasa.gov. Retrieved May 15, 2011.\n\n\n\t^ \"Galileo on Track After Tape Recorder Recovery\". jpl.nasa.gov. October 26, 1995. Retrieved November 13, 2018.\n\n\n\t^ \"Galileo data recorder still not working\". Spaceflight Now. November 25, 2002. Retrieved November 13, 2018.\n\n\n\t^ David M. Harland (October 1, 2000). Jupiter Odyssey: The Story of NASA's Galileo Mission. Springer Science & Business Media. pp. 105–. ISBN 978-1-85233-301-0.\n\n\n\t^ Michael Meltzer, Mission to Jupiter: a History of the Galileo Project, NASA SP 2007–4231, p. 238\n\n\t^ Galileo Legacy Site. NASA, 2010. Retrieved April 24, 2012.\n\n\t^ Peter Bond, Spaceflight Now, September 21, 2003.\n\n\t^ Kathy Sawyer (17 December 1991). \"Galileo Antenna Apparently Still Stuck\". Washington Post: A14; Kathy Sawyer (18 December 1991). \"$1.4 Billion Galileo Mission Appears Crippled.\" Washington Post: A3 in Mission to Jupiter. p.180.\n\n\t^ Galileo: Facts & Figures. NASA.gov. Retrieved November 12, 2012.\n\n\t^ \"NASA's Shuttle and Rocket Launch Schedule\". NASA. Archived from the original on February 18, 2011. Retrieved February 17, 2011.\n\n\n\t^ National Research Council; European Space Science Committee (1998). \"Case Studies of U.S.-European Missions\". U.S.-European Collaboration in Space Science. National Academies Press. p. 61. doi:10.17226/5981. ISBN 978-0-309-05984-8.\n\n\n\t^ Ludwinski, Jan M.; Guman, Mark D.; Johannesen, Jennie R.; Mitchell, Robert T.; Staehle, Robert L. (1998). The Europa Orbiter Mission Design. 49th International Astronomical Congress. September 28 – October 2, 1998. Melbourne, Australia. IAF 98-Q.2.02.\n\n\n\t^ Berger, Brian (February 4, 2002). \"NASA Kills Europa Orbiter; Revamps Planetary Exploration\". Space.com. Archived from the original on May 24, 2009.\n\n\n\t^ \"JUICE mission gets green light for next stage of development\". European Space Agency. November 27, 2014.\n\n\n\t^ Europa Lander JPL, NASA. Accessed on 24 September 2019.\n\n\t^ Europa Lander Mission Concept Overview. (PDF) Grace Tan-Wang, Steve Sell. Jet Propulsion Laboratory, NASA.  AbSciCon2019, Bellevue, WA  - June 26, 2019.\n\n\t^ a b Hamilton, Calvin J. \"Galileo Project: Interdisciplinary Investigators\". Federal University of Rio Grande do Sul. Retrieved January 7, 2017.\n\n\n\t^ \"Mission Archives: STS-34\". NASA. February 18, 2010. Retrieved January 7, 2017.\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Galileo mission.\n\n\n\tGalileo mission site by NASA's Solar System Exploration\n\tGalileo legacy site by NASA's Solar System Exploration\n\tGalileo Satellite Image Mosaics by Arizona State University\n\tTaylor, Jim; Cheung, Kar-Ming; Seo, Dongae (July 2002). Galileo Telecommunications (PDF). DESCANSO Design and Performance Summary Series. NASA / Jet Propulsion Laboratory.\n\n\tGalileo image album by Kevin M. Gill\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft missions to Jupiter\n\n\tFlybys\t\n\tPioneer program\n\tPioneer 10\n\t11\n\n\n\tVoyager program\n\tVoyager 1\n\t2\n\n\n\tUlysses\n\tCassini–Huygens\n\tNew Horizons\n\n\n\n\t\n\n\tOrbiters\t\n\tGalileo\n\tJuno (active)\n\n\n\n\n\tAtmospheric probes\t\n\tGalileo Probe\n\n\n\n\n\tPlanned missions\t\n\tJupiter Icy Moons Explorer (JUICE) (2022)\n\tEuropa Clipper (2023)\n\n\n\n\n\tProposed missions\t\n\tIo Volcano Observer (2021)\n\tLaplace-P (2023)\n\tEuropa Lander (2024)\n\tFIRE (2024)\n\tOKEANOS (2027)\n\tSmara (2030)\n\n\n\n\n\tCancelled / Concepts\t\n\tArgo (proposed)\n\tEuropa Jupiter System Mission-Laplace\n\tJupiter Europa Orbiter\n\tJupiter Ganymede Orbiter\n\tJupiter Magnetospheric Orbiter\n\n\n\tEuropa Orbiter\n\tInnovative Interstellar Explorer\n\tJovian Europa Orbiter\n\tJupiter Icy Moons Orbiter\n\tNeptune Orbiter\n\tNew Horizons 2\n\tPioneer H\n\tTsiolkovsky mission\n\n\n\n\n\tRelated topics\t\n\tExploration of Jupiter\n\tAtmosphere of Jupiter\n\tMagnetosphere of Jupiter\n\tMoons of Jupiter\n\tIo\n\tExploration\n\n\n\tEuropa\n\tColonization\n\n\n\tGanymede\n\tCallisto\n\n\n\tRings of Jupiter\n\tDeep Space Network\n\tMissions to the outer planets\n\tColonization of the outer Solar System\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft missions to Venus\n\n\tActive missions\t\n\tOrbiters\t\n\tAkatsuki\n\n\n\n\n\tFlybys\t\n\tParker Solar Probe (en route)\n\tBepiColombo (en route)\n\n\n\n\n\n\n\t\n\n\n\n\tPast missions\t\n\tOrbiters\t\n\tMagellan\n\tPioneer Venus Orbiter\n\tVenera 9\n\t10\n\t15\n\t16\n\tVenus Express\n\n\n\n\n\tFlybys\t\n\tVenera 1†\n\tMariner 2\n\tZond 1†\n\tVenera 2†\n\tMariner 5\n\t10\n\tVenera 11\n\t12\n\t13\n\t14\n\tVega 1\n\t2\n\tGalileo\n\tCassini–Huygens\n\tMESSENGER\n\tIKAROS\n\tShin-en†\n\n\n\n\n\tDescent probes\t\n\tVenera 3†\n\t4\n\t5\n\t6\n\tPioneer Venus Multiprobe\n\n\n\n\n\tLanders\t\n\tVenera 7\n\t8\n\t9\n\t10\n\t11\n\t12\n\t13\n\t14\n\tVega 1\n\t2\n\tPioneer Venus Small Probes\n\n\n\n\n\tBalloon probes\t\n\tVega 1\n\t2\n\n\n\n\n\tFailed launches\t\n\tTyazhely Sputnik\n\tMariner 1\n\t2MV-1 No.1\n\t2MV-1 No.2\n\t2MV-2 No.1\n\tKosmos 21\n\t3MV-1 No.2\n\tKosmos 27\n\t96\n\t167\n\t482\n\n\n\n\n\n\n\n\tPlanned missions\t\n\tFlybys\t\n\tSolar Orbiter (2020, flyby)\n\tJupiter Icy Moons Explorer (2022, flyby)\n\tDragonfly (2026, flyby)\n\n\n\n\n\n\n\n\tProposed missions\t\n\tVenus missions\t\n\tCUVE\n\tDAVINCI\n\tEnVision\n\tHAVOC\n\tHOVER\n\tShukrayaan-1\n\tVAMP\n\tVenera-D\n\tVERITAS\n\tVICI\n\tVISAGE\n\tVISE\n\tVOX\n\tZephyr\n\n\n\n\n\tFlybys\t\n\tEuropa Clipper\n\tMercury-P\n\tLaplace-P\n\tNASA Uranus orbiter and probe\n\n\n\n\n\n\n\n\tCancelled / concepts\t\n\tEuropean Venus Explorer\n\tInspiration Mars\n\tTMK-Mavr\n\tVenus Orbiting Imaging Radar\n\tVesta\n\n\n\n\n\tProgram overviews\t\n\tVenera\n\t3MV\n\n\n\tMariner\n\tPioneer Venus\n\tVega\n\n\n\n\n\tRelated\t\n\tColonization\n\tObservations and explorations\n\tList of artificial objects on Venus\n\tList of missions\n\tManned Venus flyby\n\tTerraforming\n\tVeSpR\n\n\n\n\n\t\n\tMissions are ordered by launch date. † indicates failure en route or before any data returned.\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft missions to the Moon\n\n\tExploration\nprograms\t\n\tAmerican\n\tApollo\n\tArtemis\n\tCommercial Lunar Payload Services\n\tLunar Orbiter\n\tLunar Precursor\n\tPioneer\n\tRanger\n\tSurveyor\n\n\n\tChinese (Chang'e)\n\tIndian (Chandrayaan)\n\tJapanese\n\tRussian\n\tLuna-Glob\n\n\n\tSoviet\n\tCrewed\n\tLuna\n\tLunokhod\n\tZond\n\n\n\n\n\n\t\n\t\n\t\n\t\n\n\n\n\n\n\tActive\nmissions\t\n\tOrbiters\t\n\tARTEMIS\n\tChang'e 5-T1 (service module)\n\tLunar Reconnaissance Orbiter\n\tQueqiao (relay satellite at L2)\n\tChandrayaan-2\n\n\n\n\n\tLanders\t\n\tChang'e 3\n\tChang'e 4\n\n\n\n\n\tRovers\t\n\tYutu-2\n\n\n\n\n\n\n\n\tPast\nmissions\t\n\tCrewed landings\t\n\tApollo 11\n\t12\n\t14\n\t15\n\t16\n\t17\n\t(List of Apollo astronauts)\n\n\n\n\n\tOrbiters\t\n\tApollo 8\n\t10\n\tChang'e 1\n\t2\n\tChandrayaan-1\n\tClementine\n\tExplorer 35\n\t49\n\tGRAIL\n\tHiten\n\tLADEE\n\tLongjiang-2\n\tLuna 10\n\t11\n\t12\n\t14\n\t19\n\t22\n\tLunar Orbiter 1\n\t2\n\t3\n\t4\n\t5\n\tLunar Prospector\n\tPFS-1\n\tPFS-2\n\tSMART-1\n\tSELENE (Kaguya, Okina, Ouna)\n\n\n\n\n\tImpactors\t\n\tLCROSS\n\tLuna 2\n\tMoon Impact Probe\n\tRanger 4\n\t6\n\t7\n\t8\n\t9\n\n\n\n\n\tLanders\t\n\tApollo Lunar Module ×6\n\tLuna 9\n\t13\n\t16\n\t17\n\t20\n\t21\n\t23\n\t24\n\tSurveyor 1\n\t3\n\t5\n\t6\n\t7\n\n\n\n\n\tRovers\t\n\tLunar Roving Vehicle\n\tApollo 15\n\t16\n\t17\n\n\n\tLunokhod 1\n\t2\n\tYutu\n\n\n\n\n\tSample return\t\n\tApollo 11\n\t12\n\t14\n\t15\n\t16\n\t17\n\tLuna 16\n\t20\n\t24\n\n\n\n\n\tFailed landings\t\n\tSurveyor 2\n\t4\n\tLuna 5\n\t7\n\t8\n\t15\n\t18\n\tBeresheet\n\tVikram / Pragyan\n\n\n\n\n\tFlybys\t\n\t4M\n\tApollo 13\n\tAsiaSat-3 / HGS-1\n\tChang'e 5-T1 / Xiaofei\n\tGeotail\n\tICE\n\tLongjiang-1\n\tLuna 1\n\t3\n\t4\n\t6\n\tMariner 10\n\tNozomi\n\tPioneer 4\n\tRanger 5\n\tSTEREO\n\tTESS\n\tWMAP\n\tWIND\n\tZond 3\n\t5\n\t6\n\t7\n\t8\n\tPAS-22\n\n\n\n\n\n\n\n\tPlanned\nmissions\t\n\tArtemis\t\n\tArtemis 1 (2020–2021)\n\tArgoMoon\n\tBioSentinel\n\tCislunar Explorers\n\tCU-E3\n\tCuSP\n\tEQUULEUS\n\tLunaH-Map\n\tLunar Flashlight\n\tLunar IceCube\n\tNEA Scout\n\tOMOTENASHI\n\tSkyFire\n\tTeam Miles\n\n\n\tArtemis 2 (2022–2023)\n\tArtemis 3 (2024)\n\tArtemis 4 (2025)\n\tArtemis 5 (2026)\n\tArtemis 6 (2027)\n\tArtemis 7 (2028)\n\tArtemis 8 (2028)\n\tCAPSTONE\n\n\n\n\n\tLuna-Glob\t\n\tLuna 25 (2021)\n\tLuna 26 (2024)\n\tLuna 27 (2025)\n\tLuna 28 (2027)\n\tLuna 29 (2028)\n\tLuna 30 (2028)\n\tLuna 31 (2028)\n\n\n\n\n\tCLEP\t\n\tChang'e 5 (mid-2020)\n\tChang'e 6 (2023–2024)\n\tChang'e 7 (2023)\n\tChang'e 8 (2027)\n\n\n\n\n\tCLPS\t\n\tPeregrine M1 (Jul 2021)\n\tNova-C (2021)\n\n\n\n\n\tChandrayaan\t\n\tChandrayaan-3 (2024)\n\n\n\n\n\tOthers\t\n\tMoon Express Lunar Scout (Jul 2020)\n\tInternational Lunar Observatory\n\tMoonLIGHT\n\n\n\tALINA (2021)\n\tCubeRover\n\tUni\n\n\n\tHakuto-R M1 (Oct 2021)\n\tMoonRanger (2022)\n\tSLIM (Jan 2022)\n\tKPLO (Jul 2022)\n\tDESTINY+ (2022)\n\tHakuto-R M2 (Mar 2023)\n\tdearMoon project (2023)\n\n\n\n\n\n\n\n\tProposed\nmissions\t\n\tRobotic\t\n\tArtemis-7\n\tBlue Moon\n\tBOLAS\n\tGaratéa-L\n\tISOCHRON\n\tLunar Pathfinder\n\tMcCandless\n\tMoon Diver\n\tSynergy Moon\n\tXL-1\n\n\n\n\n\tCrewed\t\n\tDSE-Alpha\n\tLunar Orbital Platform-Gateway (Lockheed Martin Lunar Lander)\n\tLunar Orbital Station\n\n\n\n\n\n\n\n\tCancelled /\nconcepts\t\n\tAltair\n\tBaden-Württemberg 1\n\tEuropean Lunar Explorer\n\tInternational Lunar Network\n\tLEO\n\tLK\n\tLunar-A\n\tLunar Lander\n\tLunar Mission One\n\tLunar Observer\n\tLunokhod 3\n\tMoonLITE\n\tMoonRise\n\tProspector\n\tResource Prospector\n\tSELENE-2\n\tUkrselena\n\n\n\n\n\tSee also\t\n\tColonization of the Moon\n\tGoogle Lunar X Prize\n\tList of lunar probes\n\tList of missions to the Moon\n\tList of artificial objects on the Moon\n\tLunar resources\n\tApollo 17 Moon mice\n\tMoon landing conspiracy theories\n\tApollo 11 anniversaries\n\n\n\n\n\t\n\tMissions are ordered by launch date. Crewed missions are in italics.\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft missions to minor planets and comets\n\n\t\n\tList of minor planets and comets visited by spacecraft\n\n\n\n\n\tFlybys\t\n\tCassini–Huygens\n\tChang'e 2\n\tClementine†\n\tCONTOUR†\n\tDeep Impact\n\tEPOXI\n\n\n\tDeep Space 1\n\tGalileo\n\tHalley Armada\n\tGiotto\n\tSakigake\n\tSuisei\n\tVega 1\n\tVega 2\n\n\n\tInternational Cometary Explorer\n\tNEAR Shoemaker\n\tNew Horizons\n\tPioneer 7\n\tPROCYON†\n\tRosetta\n\tStardust/NExT\n\tUlysses\n\n\n\n\t\n\n\n\n\n\tOrbiters\t\n\tDawn\n\tHayabusa\n\tHayabusa2\n\tNEAR Shoemaker\n\tOSIRIS-REx\n\tRosetta\n\tTimeline\n\n\n\n\n\n\n\tLanders\t\n\tHayabusa\n\tMINERVA†\n\n\n\tHayabusa2\n\tHIBOU\n\tMASCOT\n\tMINERVA-II 2\n\tOWL\n\n\n\tNEAR Shoemaker\n\tPhilae\n\n\n\n\n\tImpactors\t\n\tDeep Impact\n\n\n\n\n\tSample return\t\n\tHayabusa\n\tHayabusa2\n\tOSIRIS-REx\n\tStardust\n\n\n\n\n\tPlanned\t\n\tNEA Scout (flyby, 2020)\n\tASTER (orbiter, 2021)\n\tLucy (multiple flybys, 2021)\n\tDART (impactor, 2021)\n\tDESTINY+ (multiple flybys, 2022)\n\tPsyche (orbiter, 2022)\n\tComet Interceptor (flyby, 2028)\n\n\n\n\n\tProposed\t\n\tHera (orbiter and landers, 2023)\n\tAthena (flyby of Pallas)\n\tCAESAR (sample return, 2024)\n\tZhengHe (multiple flybys and sample return, 2024)\n\tHAMMER (nuclear impactor concept)\n\tOKEANOS (multiple flybys and sample return, 2026)\n\n\n\n\n\tCancelled or \nnot developed\t\n\tAGORA\n\tAIM\n\tAsteroid Redirect Mission\n\tCastalia\n\tClementine 2\n\tComet Hopper\n\tCONDOR\n\tCORSAIR\n\tCRAF\n\tDon Quijote\n\tHayabusa Mk2\n\tMAOSEP\n\tMarco Polo\n\tNew Horizons 2\n\tVesta\n\n\n\n\n\tRelated\t\n\tAsteroid belt\n\tAsteroid capture\n\tAsteroid mining\n\tColonization of asteroids\n\tCeres\n\tColonization\n\n\n\tList of artificial objects on extra-terrestrial surfaces\n\tPluto\n\tExploration\n\n\n\tSmall Solar System bodies\n\tNear-Earth object\n\tTrans-Neptunian object\n\tColonization\n\n\n\tTrojan\n\n\n\tVesta\n\n\n\n\n\t\n\tProbes are listed in chronological order of launch. Italics indicate currently active missions. † indicates mission failures.\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n21st-century space probes\n\n\tActive space probes\n(deep space missions)\t\n\tMoon\t\n\tARTEMIS\n\tChandrayaan-2\n\tChang'e 3\n\tChang'e 4 (Yutu-2)\n\tLunar Reconnaissance Orbiter\n\n\n\n\n\tMars\t\n\tExoMars TGO\n\tInSight\n\tMars Orbiter Mission\n\tMars Express\n\t2001 Mars Odyssey\n\tMAVEN\n\tMRO\n\tMSL Curiosity\n\n\n\n\n\tVenus\t\n\tAkatsuki\n\n\n\n\n\tMinor planet\t\n\tChang'e 2\n\tHayabusa2 / MINERVA-II\n\tNew Horizons\n\tOSIRIS-REx\n\n\n\n\n\tSolar science\t\n\tACE\n\tDSCOVR\n\tParker Solar Probe\n\tSOHO\n\tSTEREO\n\tWind\n\n\n\n\n\tOthers\t\n\tBepiColombo\n\tGaia\n\tJuno\n\tTHEMIS\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\n\n\n\tCompleted after 2000\n(by termination date)\t\n\t2000s\t\n\t2001\n\tNEAR Shoemaker\n\tDeep Space 1\n\n\n\t2003\n\tPioneer 10\n\tGalileo\n\tNozomi\n\n\n\t2004\n\tGenesis\n\n\n\t2005\n\tHuygens\n\n\n\t2006\n\tMars Global Surveyor\n\n\n\t2008\n\tPhoenix\n\n\n\t2009\n\tChang'e 1\n\tUlysses\n\tChandrayaan-1\n\tSELENE\n\tLCROSS\n\n\n\n\n\n\n\t2010s\t\n\t2010\n\tHayabusa\n\tMER Spirit\n\n\n\t2011\n\tStardust\n\n\n\t2012\n\tGRAIL\n\n\n\t2013\n\tDeep Impact\n\n\n\t2014\n\tLADEE\n\tVenus Express\n\tChang'e 5-T1\n\n\n\t2015\n\tMESSENGER\n\tPROCYON\n\tIKAROS\n\n\n\t2016\n\tRosetta / Philae\n\tYutu\n\tExoMars Schiaparelli\n\n\n\t2017\n\tLISA Pathfinder\n\tCassini\n\n\n\t2018\n\tMASCOT\n\tDawn\n\tLongjiang-1\n\n\n\t2019\n\tMarCO\n\tMER Opportunity\n\tBeresheet\n\tLongjiang-2\n\tVikram / Pragyan\n\n\n\n\n\n\n\n\n\n\t\n\tList of Solar System probes\n\tList of lunar probes\n\tList of space telescopes\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNASA\n\n\tPolicy and history\t\n\tHistory\t\n\tNACA (1915)\n\tNational Aeronautics and Space Act (1958)\n\tSpace Task Group (1958)\n\tPaine (1986)\n\tRogers (1986)\n\tRide (1987)\n\tSpace Exploration Initiative (1989)\n\tAugustine (1990)\n\tU.S. National Space Policy (1996)\n\tCFUSAI (2002)\n\tCAIB (2003)\n\tVision for Space Exploration (2004)\n\tAldridge (2004)\n\tAugustine (2009)\n\n\n\n\n\tGeneral\t\n\tSpace Race\n\tAdministrator and Deputy Administrator\n\tChief Scientist\n\tAstronaut Corps\n\tRanks and positions\n\tChief\n\n\n\tBudget\n\tSpin-off technologies\n\tNASA TV\n\tNASA Social\n\tLaunch Services Program\n\tMercury Control Center\n\tKennedy Space Center\n\tVehicle Assembly Building\n\tLaunch Complex 39\n\tLaunch Control Center\n\tOperations and Checkout Building\n\n\n\tJohnson Space Center\n\tMission Control\n\tLunar Sample Laboratory\n\n\n\n\n\n\n\n\n\t\n\n\tRobotic programs\t\n\tPast\t\n\tHitchhiker\n\tMariner\n\tMariner Mark II\n\tMESUR\n\tMars Surveyor '98\n\tNew Millennium\n\tLunar Orbiter\n\tPioneer\n\tPlanetary Observer\n\tRanger\n\tSurveyor\n\tViking\n\tProject Prometheus\n\tMars Scout\n\tMars Exploration Rover\n\n\n\n\n\tCurrent\t\n\tLiving With a Star\n\tLunar Precursor Robotic Program\n\tEarth Observing System\n\tGreat Observatories program\n\tExplorer\n\tSmall explorer\n\tVoyager\n\tDiscovery\n\tNew Frontiers\n\tSolar Terrestrial Probes\n\tCommercial Lunar Payload Services\n\n\n\n\n\n\n\n\tHuman spaceflight\nprograms\t\n\tPast\t\n\tX-15 (suborbital)\n\tMercury\n\tGemini\n\tApollo\n\tApollo–Soyuz Test Project (with the Soviet space program)\n\tSkylab\n\tSpace Shuttle\n\tShuttle–Mir (with Roscosmos State Corporation)\n\tConstellation\n\n\n\n\n\tCurrent\t\n\tInternational Space Station\n\tCommercial Orbital Transportation Services\n\tCommercial Crew Development\n\tOrion\n\tArtemis\n\tLunar Gateway\n\n\n\n\n\n\n\n\tIndividual featured\n missions\n(human and robotic)\t\n\tPast\t\n\tCOBE\n\tMercury 3\n\tMercury-Atlas 6\n\tMagellan\n\tPioneer 10\n\tPioneer 11\n\tGalileo\n\tGALEX\n\tGRAIL\n\tWMAP\n\tSpace Shuttle\n\tSojourner rover\n\tSpirit rover\n\tLADEE\n\tMESSENGER\n\tAquarius\n\tCassini\n\tDawn\n\tKepler space telescope\n\tOpportunity rover\n\tRHESSI\n\tobserved\n\n\n\n\n\n\n\tCurrently\noperating\t\n\tMars Reconnaissance Orbiter\n\t2001 Mars Odyssey\n\tNew Horizons\n\tInternational Space Station\n\tHubble Space Telescope\n\tSpitzer\n\tSwift\n\tTHEMIS\n\tMars Exploration Rover\n\tCuriosity rover\n\ttimeline\n\n\n\tInSight\n\tGOES 14\n\tLunar Reconnaissance Orbiter\n\tGOES 15\n\tVan Allen Probes\n\tSolar Dynamics Observatory\n\tJuno\n\tMars Science Laboratory\n\ttimeline\n\n\n\tNuSTAR\n\tVoyager 1\n\tVoyager 2\n\tWISE\n\tMAVEN\n\tMMS\n\tOSIRIS-REx\n\tTransiting Exoplanet Survey Satellite\n\n\n\n\n\tFuture\t\n\tJoint Polar Satellite System\n\tJames Webb Space Telescope\n\tWide Field Infrared Survey Telescope\n\tMars 2020\n\tNISAR\n\tEuropa Clipper\n\n\n\n\n\n\n\n\tCommunications\nand navigation\t\n\tNear Earth Network\n\tSpace Network\n\tDeep Space Network (Goldstone\n\tMadrid\n\tCanberra\n\tSpace Flight Operations Facility)\n\tDeep Space Atomic Clock\n\n\n\n\n\tNASA lists\t\n\tAstronauts\n\tby name\n\tby year\n\tGemini astronauts\n\tApollo astronauts\n\n\n\tList of NASA aircraft\n\tList of NASA missions\n\tuncrewed missions\n\n\n\tList of NASA contractors\n\tList of United States rockets\n\tList of NASA cancellations\n\tList of Space Shuttle missions\n\tcrews\n\n\n\tList of NASA cameras on spacecraft\n\n\n\n\n\tNASA images\nand artwork\t\n\tEarthrise\n\tThe Blue Marble\n\tFamily Portrait\n\tPale Blue Dot\n\n\n\tPillars of Creation\n\tMystic Mountain\n\tSolar System Family Portrait\n\tThe Day the Earth Smiled\n\tFallen Astronaut\n\tLunar plaques\n\tPioneer plaques\n\tVoyager Golden Record\n\tApollo 11 goodwill messages\n\tNASA insignia\n\tGemini and Apollo medallions\n\tMission patches\n\n\n\n\n\tRelated\t\n\tApollo 15 postal covers incident\n\tSpace Mirror Memorial\n\tThe Astronaut Monument\n\tU.S. Astronaut Hall of Fame\n\tSpace program on U.S. stamps\n\tApollo 17 Moon mice\n\tOther primates in space\n\tNASA spinoff technologies\n\n\n\n\n\t\n\t Category\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nJet Propulsion Laboratory\n\n\tCurrent missions\t\n\tACRIMSAT\n\tASTER\n\tAtmospheric infrared sounder (AIRS)\n\tDeep Space Atomic Clock\n\tGRACE-FO\n\tInSight\n\tJuno\n\tKeck observatory\n\tLarge Binocular Telescope (LBT)\n\tMars Odyssey\n\tMars Reconnaissance Orbiter (MRO)\n\tMars Science Laboratory (MSL)\n\tMicrowave limb sounder (MLS)\n\tMulti-angle imaging spectroradiometer (MISR)\n\tSpitzer Space Telescope\n\tTropospheric Emission Spectrometer (TES)\n\tVoyager program\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\n\n\tPlanned\t\n\tMars 2020 rover\n\tPsyche\n\tEuclid\n\tEuropa Clipper\n\tLunar Flashlight\n\tNEA Scout\n\tSPHEREx\n\tSWOT\n\tWFIRST\n\n\n\n\n\tProposed\t\n\tEuropa Lander\n\tFINESSE\n\n\n\n\n\tPast\t\n\tCassini-Huygens\n\tDawn\n\tDeep Impact\n\tDeep Space 1\n\tDeep Space 2\n\tExplorers\n\tGALEX\n\tGalileo\n\tGenesis\n\tGRACE\n\tHerschel\n\tIRAS\n\tJason-1\n\tKepler\n\tMagellan\n\tMariner\n\tMars Climate Orbiter\n\tMars Cube One (MarCO)\n\tMars Observer\n\tMars Pathfinder\n\tMars Polar Lander\n\tMars Global Surveyor\n\tMars Exploration Rover (MER)\n\tNSCAT\n\tPhoenix\n\tPioneer\n\tQuikSCAT\n\tRanger\n\tRosetta\n\tSeasat\n\tShuttle Radar Topography Mission (SRTM)\n\tSolar Mesosphere Explorer (SME)\n\tSpaceborne Imaging Radar (SIR)\n\tStardust\n\tSurveyor\n\tSVLBI\n\tTOPEX/Poseidon\n\tUlysses\n\tViking\n\tWide Field and Planetary Camera (WFPC)\n\tWide Field Infrared Explorer (WIRE)\n\n\n\n\n\tCancelled missions\t\n\tAstrobiology Field Laboratory (AFL)\n\tMars Astrobiology Explorer-Cacher (MAX-C)\n\n\n\n\n\tRelated organizations\t\n\tNASA\n\tCaltech\n\tNASA Deep Space Network\n\tGoldstone Complex\n\tTable Mountain Observatory\n\tSolar System Ambassadors\n\n\n\n\n\t\n\tJet Propulsion Laboratory Science Division\n\tNear-Earth Asteroid Tracking\n\tSpace Flight Operations Facility\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n← 1988  ·  Orbital launches in 1989  ·  1990 →\n\n\tKosmos 1987 ·  Kosmos 1988 ·  Kosmos 1989 | Kosmos 1990 | Kosmos 1991 | Gorizont No.29L | Kosmos 1992 | Intelsat VA F-15 | Kosmos 1993 | Progress 40 | Kosmos 1994 ·  Kosmos 1995 ·  Kosmos 1996 ·  Kosmos 1997 ·  Kosmos 1998 ·  Kosmos 1999 | Kosmos 2000 | Kosmos 2001 | Kosmos 2002 | USA-35 | Molniya-1 No.84 | Kosmos 2003 | Akebono | Kosmos 2004 | Meteor-2 No.22 | Kosmos 2005 | JCSAT-1 ·  Meteosat 4 | STS-29 (TDRS-4) | Kosmos 2006 | Progress 41 | Kosmos 2007 | Kosmos 2008 ·  Kosmos 2009 ·  Kosmos 2010 ·  Kosmos 2011 ·  Kosmos 2012 ·  Kosmos 2013 ·  Kosmos 2014 ·  Kosmos 2015 | USA-36 | Tele-X | Kosmos 2016 | Kosmos 2017 | Gran' No.33L | Kosmos 2018 | Foton No.5L | STS-30 (Magellan) | Kosmos 2019 | USA-37 | Kosmos 2020 | Kosmos 2021 | Resurs-F1 No.45 ·  Pion 1 ·  Pion 2 | Kosmos 2022 ·  Kosmos 2023 ·  Kosmos 2024 | Kosmos 2025 | Superbird-A ·  DFS Kopernikus 1 | Kosmos 2026 | Molniya-3 No.45 | Okean-O1 No.4 | USA-38 | Kosmos 2027 | USA-39 | Kosmos 2028 | Globus No.11 | Resurs-F1 No.46 | Nadezhda No.403 | Kosmos 2029 | Gorizont No.27L | Olympus F1 | Kosmos 2030 | Resurs-F1 No.47 ·  Pion 3 ·  Pion 4 | Kosmos 2031 | Kosmos 2032 | Kosmos 2033 | Kosmos 2034 | Kosmos 2035 | STS-28 (USA-40 ·  USA-41) | TV-SAT-2 ·  Hipparcos | Resurs-F2 No.4 | USA-42 | Kosmos 2036 | Progress M-1 | Marco Polo 1 | Kosmos 2037 | USA-43 ·  USA-44 | Himawari 4 | Soyuz TM-8 | USA-45 | Resurs-F1 No.48 | Kosmos 2038 ·  Kosmos 2039 ·  Kosmos 2040 ·  Kosmos 2041 ·  Kosmos 2042 ·  Kosmos 2043 | Kosmos 2044 | Kosmos 2045 | USA-46 | Molniya-1 No.69 | Kosmos 2046 | Interkosmos 24 ·  Magion 2 | Gorizont No.31L | Kosmos 2047 | Kosmos 2048 | STS-34 (Galileo) | USA-47 | Meteor-3 No.4 | Intelsat VI F-2 | Kosmos 2049 | COBE | STS-33 (USA-48) | Kosmos 2050 | Kosmos 2051 | Kvant 2 | Molniya-3 No.46 | Kosmos 2052 | Granat | USA-49 | Gran' No.36L | Progress M-2 | Kosmos 2053 | Kosmos 2054\n\n\tPayloads are separated by bullets ( · ), launches by pipes ( | ). Manned flights are indicated in bold text. Uncatalogued launch failures are listed in italics. Payloads deployed from other spacecraft are denoted in (brackets).\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nGalileo Galilei\n\n\tScientific career\t\n\tObservational astronomy\n\tGalileo affair\n\tGalileo's escapement\n\tGalilean invariance\n\tGalilean moons\n\tGalilean transformation\n\tLeaning Tower of Pisa experiment\n\tPhases of Venus\n\tCelatone\n\tThermoscope\n\n\n\n\t\n\n\n\tWorks\t\n\tDe Motu Antiquiora (1589-1592, pub. 1687)\n\tSidereus Nuncius (1610)\n\tLetters on Sunspots (1613)\n\tLetter to Benedetto Castelli (1613)\n\t\"Letter to the Grand Duchess Christina\" (1615)\n\t\"Discourse on the Tides\" (1616)\n\tDiscourse on Comets (1619)\n\tThe Assayer (1623)\n\tDialogue Concerning the Two Chief World Systems (1632)\n\tTwo New Sciences (1638)\n\n\n\n\n\tFamily\t\n\tVincenzo Galilei (father)\n\tMichelagnolo Galilei (brother)\n\tVincenzo Gamba (son)\n\tMaria Celeste (daughter)\n\tMarina Gamba (mistress)\n\n\n\n\n\tRelated\t\n\t\"And yet it moves\"\n\tVilla Il Gioiello\n\tGalileo's paradox\n\tSector\n\tMuseo Galileo\n\tGalileo's telescopes\n\tGalileo's objective lens\n\n\n\tTribune of Galileo\n\tGalileo thermometer\n\tGalileo spacecraft\n\tGalileo Galileo Airport\n\n\n\n\n\tIn popular culture\t\n\tLife of Galileo (1943 play)\n\tLamp At Midnight (1947 play)\n\tGalileo (1968 film)\n\tGalileo (1975 film)\n\tStarry Messenger (1996 book)\n\tGalileo's Daughter: A Historical Memoir of Science, Faith, and Love (1999 book)\n\tGalileo Galilei (2002 opera)\n\tGalileo's Dream (2009 novel)\n\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4292796-1\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Galileo_(spacecraft)&oldid=919040545\"\n\n\t\t\n\t\tCategories: \tGalileo (spacecraft)\n\tLaser communication in space\n\tLunar flybys\n\tMissions to Jupiter\n\tMissions to main-belt asteroids\n\tNASA space probes\n\tOrbiters (space probe)\n\tSpacecraft launched by the Space Shuttle\n\tSpacecraft launched in 1989\n\tSpacecraft which reentered in 2003\n\tDestroyed space probes\n\tGalileo Galilei\n\tNuclear-powered robots\n\n\nHidden categories: \tCS1 errors: markup\n\tWebarchive template wayback links\n\tCS1 maint: uses authors parameter\n\tArticles with short description\n\tArticles needing additional references from December 2011\n\tAll articles needing additional references\n\tPages using multiple image with auto scaled images\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from February 2011\n\tPages using multiple image with manual scaled images\n\tCommons category link is on Wikidata\n\tWikipedia articles with GND identifiers\n\tUse mdy dates from July 2018\n\tUse American English from March 2018\n\tAll Wikipedia articles written in American English\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAlemannisch\n\tالعربية\n\tAzərbaycanca\n\tБеларуская\n\tБългарски\n\tBosanski\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tEspañol\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\t한국어\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tLumbaart\n\tMagyar\n\tBahasa Melayu\n\tMirandés\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tУкраїнська\n\tTiếng Việt\n\t吴语\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 October 2019, at 14:28 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "15", "dc:title": "Galileo (spacecraft) - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Artwork_Galileo-Io-Jupiter.JPG/1200px-Artwork_Galileo-Io-Jupiter.JPG", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-galileo_-spacecraft", "title": "Galileo (spacecraft) - Wikipedia"}}