{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEarth's magnetic field - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\n\n\tEarth's magnetic field\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Geomagnetic field)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tMagnetic field that extends from the Earth’s inner core to where it meets the solar wind\n\n\n\n\n  \nComputer simulation of the Earth's field in a period of normal polarity between reversals.[1] The lines represent magnetic field lines, blue when the field points towards the center and yellow when away. The rotation axis of the Earth is centered and vertical. The dense clusters of lines are within the Earth's core.[2]\n\n\n\nEarth's magnetic field, also known as the geomagnetic field, is the magnetic field that extends from the Earth's interior out into space, where it interacts with the solar wind, a stream of charged particles emanating from the Sun. The magnetic field is generated by electric currents due to the motion of convection currents of molten iron in the Earth's outer core: these convection currents are caused by heat escaping from the core, a natural process called a geodynamo. The magnitude of the Earth's magnetic field  at its surface ranges from 25 to 65 microteslas (0.25 to 0.65 gauss).[3] As an approximation, it is represented by a field of a magnetic dipole currently tilted at an angle of about 11 degrees with respect to Earth's rotational axis, as if there were a bar magnet placed at that angle at the center of the Earth. The North geomagnetic pole, currently located near Greenland in the northern hemisphere, is actually the south pole of the Earth's magnetic field, and conversely.\n\nWhile the North and South magnetic poles are usually located near the geographic poles, they slowly and continuously move over geological time scales, but sufficiently slowly for ordinary compasses to remain useful for navigation. However, at irregular intervals averaging several hundred thousand years, the Earth's field reverses and the North and South Magnetic Poles respectively, abruptly switch places. These reversals of the geomagnetic poles leave a record in rocks that are of value to paleomagnetists in calculating geomagnetic fields in the past. Such information in turn is helpful in studying the motions of continents and ocean floors in the process of plate tectonics.\n\nThe magnetosphere is the region above the ionosphere that is defined by the extent of the Earth's magnetic field in space. It extends several tens of thousands of kilometers into space, protecting the Earth from the charged particles of the solar wind and cosmic rays that would otherwise strip away the upper atmosphere, including the ozone layer that protects the Earth from harmful ultraviolet radiation.\n\n\nContents\n\n\n\t1 Significance\n\t2 Characteristics\n\t2.1 Description\n\t2.1.1 Intensity\n\t2.1.2 Inclination\n\t2.1.3 Declination\n\n\n\n\t2.2 Geographical variation\n\t2.3 Dipolar approximation\n\t2.4 Magnetic poles\n\n\n\n\t3 Magnetosphere\n\t4 Time dependence\n\t4.1 Short-term variations\n\t4.2 Secular variation\n\t4.3 Magnetic field reversals\n\t4.4 Earliest appearance\n\t4.5 Future\n\n\n\n\t5 Physical origin\n\t5.1 Earth's core and the geodynamo\n\t5.2 Numerical models\n\t5.3 Currents in the ionosphere and magnetosphere\n\n\n\n\t6 Measurement and analysis\n\t6.1 Detection\n\t6.2 Crustal magnetic anomalies\n\t6.3 Statistical models\n\t6.3.1 Spherical harmonics\n\t6.3.2 Radial dependence\n\t6.3.3 Global models\n\n\n\n\n\n\n\t7 Biomagnetism\n\t8 See also\n\t9 References\n\t10 Further reading\n\t11 External links\n\n\n\n\n\nSignificance[edit]\n\nThe Earth's magnetic field serves to deflect most of the solar wind, whose charged particles would otherwise strip away the ozone layer that protects the Earth from harmful ultraviolet radiation.[4] One stripping mechanism is for gas to be caught in bubbles of magnetic field, which are ripped off by solar winds.[5] Calculations of the loss of carbon dioxide from the atmosphere of Mars, resulting from scavenging of ions by the solar wind, indicate that the dissipation of the magnetic field of Mars caused a near total loss of its atmosphere.[6][7]\n\nThe study of past magnetic field of the Earth is known as paleomagnetism.[8] The polarity of the Earth's magnetic field is recorded in igneous rocks, and reversals of the field are thus detectable as \"stripes\" centered on mid-ocean ridges where the sea floor is spreading, while the stability of the geomagnetic poles between reversals has allowed paleomagnetists to track the past motion of continents. Reversals also provide the basis for magnetostratigraphy, a way of dating rocks and sediments.[9] The field also magnetizes the crust, and magnetic anomalies can be used to search for deposits of metal ores.[10]\n\nHumans have used compasses for direction finding since the 11th century A.D. and for navigation since the 12th century.[11] Although the magnetic declination does shift with time, this wandering is slow enough that a simple compass remains useful for navigation. Using magnetoreception various other organisms, ranging from some types of bacteria to pigeons, use the Earth's magnetic field for orientation and navigation.\n\n\nCharacteristics[edit]\n\nDescription[edit]\n\nAt any location, the Earth's magnetic field can be represented by a three-dimensional vector. A typical procedure for measuring its direction is to use a compass to determine the direction of magnetic North. Its angle relative to true North is the declination (D) or variation. Facing magnetic North, the angle the field makes with the horizontal is the inclination (I) or magnetic dip. The intensity (F) of the field is proportional to the force it exerts on a magnet. Another common representation is in X (North), Y (East) and Z (Down) coordinates.[12]\n\n\n  \nCommon coordinate systems used for representing the Earth's magnetic field.\n\n\n\n\nIntensity[edit]\n\nThe intensity of the field is often measured in gauss (G), but is generally reported in nanoteslas (nT), with 1 G = 100,000 nT. A nanotesla is also referred to as a gamma (γ).[13]   The tesla is the SI unit of the magnetic field, B.  The Earth's field ranges between approximately 25,000 and 65,000 nT (0.25–0.65 G). By comparison, a strong refrigerator magnet has a field of about 10,000,000 nanoteslas (100 G).[14]\n\nA map of intensity contours is called an isodynamic chart. As the World Magnetic Model shows, the intensity tends to decrease from the poles to the equator. A minimum intensity occurs in the South Atlantic Anomaly over South America while there are maxima over northern Canada, Siberia, and the coast of Antarctica south of Australia.[15]\n\n\nInclination[edit]\n\nMain article: Magnetic dip\n\nThe inclination is given by an angle that can assume values between -90° (up) to 90° (down). In the northern hemisphere, the field points downwards. It is straight down at the North Magnetic Pole and rotates upwards as the latitude decreases until it is horizontal (0°) at the magnetic equator. It continues to rotate upwards until it is straight up at the South Magnetic Pole. Inclination can be measured with a dip circle.\n\nAn isoclinic chart (map of inclination contours) for the Earth's magnetic field is shown below.\n\n\nDeclination[edit]\n\nMain article: Magnetic declination\n\nDeclination is positive for an eastward deviation of the field relative to true north. It can be estimated by comparing the magnetic north/south heading on a compass with the direction of a celestial pole. Maps typically include information on the declination as an angle or a small diagram showing the relationship between magnetic north and true north. Information on declination for a region can be represented by a chart with isogonic lines (contour lines with each line representing a fixed declination).\n\n\nGeographical variation[edit]\n\n\nComponents of the Earth's magnetic field at the surface from the World Magnetic Model for 2015.[15]\n\n\n\n\t\n\t\t\t\n\n\n\t\t\t\nIntensity\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nInclination\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nDeclination\n\n\n\t\t\t\n\n\t\t\n\n\n\nDipolar approximation[edit]\n\n  \nThe variation between magnetic north (Nm) and \"true\" north (Ng).\n\n\n\nSee also: Dipole model of the Earth's magnetic field\n\nNear the surface of the Earth, its magnetic field can be closely approximated by the field of a magnetic dipole positioned at the center of the Earth and tilted at an angle of about 11° with respect to the rotational axis of the Earth.[13] The dipole is roughly equivalent to a powerful bar magnet, with its south pole pointing towards the geomagnetic North Pole.[16] This may seem surprising, but the north pole of a magnet is so defined because, if allowed to rotate freely, it points roughly northward (in the geographic sense). Since the north pole of a magnet attracts the south poles of other magnets and repels the north poles, it must be attracted to the south pole of Earth's magnet. The dipolar field accounts for 80–90% of the field in most locations.[12]\n\n\n\n\nMagnetic poles[edit]\n\nMain article: Geomagnetic pole\n\n  \nThe movement of Earth's North Magnetic Pole across the Canadian arctic.\n\n\n\nHistorically, the north and south poles of a magnet were first defined by the Earth's magnetic field, not vice versa, since one of the first uses for a magnet was as a compass needle. A magnet's  North pole is defined as the pole that is attracted by the Earth's North Magnetic Pole when the magnet is suspended so it can turn freely. Since opposite poles attract, the North Magnetic Pole of the Earth is really the south pole of its magnetic field (the place where the field is directed downward into the Earth).[17][18][19][20]  \n\nThe positions of the magnetic poles can be defined in at least two ways: locally or globally.[21] The local definition is the point where the magnetic field is vertical.[22] This can be determined by measuring the inclination. The inclination of the Earth's field is 90° (downwards) at the North Magnetic Pole and -90° (upwards) at the South Magnetic Pole. The two poles wander independently of each other and are not directly opposite each other on the globe.  Movements of up to 40 kilometres (25 mi) per year have been observed for the North Magnetic Pole. Over the last 180 years, the North Magnetic Pole has been migrating northwestward, from Cape Adelaide in the Boothia Peninsula in 1831 to 600 kilometres (370 mi) from Resolute Bay in 2001.[23] The magnetic equator is the line where the inclination is zero (the magnetic field is horizontal).\n\nThe global definition of the Earth's field is based on a mathematical model. If a line is drawn through the center of the Earth, parallel to the moment of the best-fitting magnetic dipole, the two positions where it intersects the Earth's surface are called the North and South geomagnetic poles. If the Earth's magnetic field were perfectly dipolar, the geomagnetic poles and magnetic dip poles would coincide and compasses would point towards them. However, the Earth's field has a significant non-dipolar contribution, so the poles do not coincide and compasses do not generally point at either.\n\n\n\n\nMagnetosphere[edit]\n\n  \nAn artist's rendering of the structure of a magnetosphere. 1) Bow shock. 2) Magnetosheath. 3) Magnetopause. 4) Magnetosphere. 5) Northern tail lobe. 6) Southern tail lobe. 7) Plasmasphere.\n\n\n\nMain article: Magnetosphere\n\nEarth's magnetic field, predominantly dipolar at its surface, is distorted further out by the solar wind. This is a stream of charged particles leaving the Sun's corona and accelerating to a speed of 200 to 1000 kilometres per second. They carry with them a magnetic field, the interplanetary magnetic field (IMF).[24]\n\nThe solar wind exerts a pressure, and if it could reach Earth's atmosphere it would erode it. However, it is kept away by the pressure of the Earth's magnetic field. The magnetopause, the area where the pressures balance, is the boundary of the magnetosphere. Despite its name, the magnetosphere is asymmetric, with the sunward side being about 10 Earth radii out but the other side stretching out in a magnetotail that extends beyond 200 Earth radii.[25]\nSunward of the magnetopause is the bow shock, the area where the solar wind slows abruptly.[24]\n\nInside the magnetosphere is the plasmasphere, a donut-shaped region containing low-energy charged particles, or plasma. This region begins at a height of 60 km, extends up to 3 or 4 Earth radii, and includes the ionosphere. This region rotates with the Earth.[25] There are also two concentric tire-shaped regions, called the Van Allen radiation belts, with high-energy ions (energies from 0.1 to 10 million electron volts (MeV)). The inner belt is 1–2 Earth radii out while the outer belt is at 4–7 Earth radii. The plasmasphere and Van Allen belts have partial overlap, with the extent of overlap varying greatly with solar activity.[26]\n\nAs well as deflecting the solar wind, the Earth's magnetic field deflects cosmic rays, high-energy charged particles that are mostly from outside the Solar System. Many cosmic rays are kept out of the Solar System by the Sun's magnetosphere, or heliosphere.[27]) By contrast, astronauts on the Moon risk exposure to radiation. Anyone who had been on the Moon's surface during a particularly violent solar eruption in 2005 would have received a lethal dose.[24]\n\nSome of the charged particles do get into the magnetosphere. These spiral around field lines, bouncing back and forth between the poles several times per second. In addition, positive ions slowly drift westward and negative ions drift eastward, giving rise to a ring current. This current reduces the magnetic field at the Earth's surface.[24] Particles that penetrate the ionosphere and collide with the atoms there give rise to the lights of the aurorae and also emit X-rays.[25]\n\nThe varying conditions in the magnetosphere, known as space weather, are largely driven by solar activity. If the solar wind is weak, the magnetosphere expands; while if it is strong, it compresses the magnetosphere and more of it gets in. Periods of particularly intense activity, called geomagnetic storms, can occur when a coronal mass ejection erupts above the Sun and sends a shock wave through the Solar System. Such a wave can take just two days to reach the Earth. Geomagnetic storms can cause a lot of disruption; the \"Halloween\" storm of 2003 damaged more than a third of NASA's satellites. The largest documented storm occurred in 1859. It induced currents strong enough to short out telegraph lines, and aurorae were reported as far south as Hawaii.[24][28]\n\n\nTime dependence[edit]\n\nShort-term variations[edit]\n\n  \nBackground: a set of traces from magnetic observatories showing a magnetic storm in 2000.\n Globe: map showing locations of observatories and contour lines giving horizontal magnetic intensity in μ T.\n\n\n\nThe geomagnetic field changes on time scales from milliseconds to millions of years. Shorter time scales mostly arise from currents in the ionosphere (ionospheric dynamo region) and magnetosphere, and some changes can be traced to geomagnetic storms or daily variations in currents. Changes over time scales of a year or more mostly reflect changes in the Earth's interior, particularly the iron-rich core.[12]\n\nFrequently, the Earth's magnetosphere is hit by solar flares causing geomagnetic storms, provoking displays of aurorae. The short-term instability of the magnetic field is measured with the K-index.[29]\n\nData from THEMIS show that the magnetic field, which interacts with the solar wind, is reduced when the magnetic orientation is aligned between Sun and Earth – opposite to the previous hypothesis. During forthcoming solar storms, this could result in blackouts and disruptions in artificial satellites.[30]\n\n\nSecular variation[edit]\n\nMain article: Geomagnetic secular variation\n\n  \nEstimated declination contours by year, 1590 to 1990 (click to see variation).\n\n\n\n  \nStrength of the axial dipole component of Earth's magnetic field from 1600 to 2020.\n\n\n\nChanges in Earth's magnetic field on a time scale of a year or more are referred to as secular variation. Over hundreds of years, magnetic declination is observed to vary over tens of degrees.[12] The animation shows how global declinations have changed over the last few centuries.[31]\n\nThe direction and intensity of the dipole change over time. Over the last two centuries the dipole strength has been decreasing at a rate of about 6.3% per century.[12] At this rate of decrease, the field would be negligible in about 1600 years.[32] However, this strength is about average for the last 7 thousand years, and the current rate of change is not unusual.[33]\n\nA prominent feature in the non-dipolar part of the secular variation is a westward drift at a rate of about 0.2 degrees per year.[32] This drift is not the same everywhere and has varied over time. The globally averaged drift has been westward since about 1400 AD but eastward between about 1000 AD and 1400 AD.[34]\n\nChanges that predate magnetic observatories are recorded in archaeological and geological materials. Such changes are referred to as paleomagnetic secular variation or paleosecular variation (PSV). The records typically include long periods of small change with occasional large changes reflecting geomagnetic excursions and reversals.[35]\n\n\nMagnetic field reversals[edit]\n\n  \nGeomagnetic polarity during the late Cenozoic Era. Dark areas denote periods where the polarity matches today's polarity, light areas denote periods where that polarity is reversed.\n\n\n\nMain article: Geomagnetic reversal\n\nAlthough generally Earth's field is approximately dipolar, with an axis that is nearly aligned with the rotational axis, occasionally the North and South geomagnetic poles trade places. Evidence for these geomagnetic reversals can be found in basalts, sediment cores taken from the ocean floors, and seafloor magnetic anomalies.[36] Reversals occur nearly randomly in time, with intervals between reversals ranging from less than 0.1 million years to as much as 50 million years. The most recent geomagnetic reversal, called the Brunhes–Matuyama reversal, occurred about 780,000 years ago.[23][37] A related phenomenon, a geomagnetic excursion, amounts to an incomplete reversal, with no change in polarity.[38][39] The Laschamp event is an example of an excursion, it having occurred during the last ice age (41,000 years ago).\n\nThe past magnetic field is recorded mostly by strongly magnetic minerals, particularly iron oxides such as magnetite, that can carry a permanent magnetic moment. This remanent magnetization, or remanence, can be acquired in more than one way. In lava flows, the direction of the field is \"frozen\" in small minerals as they cool, giving rise to a thermoremanent magnetization. In sediments, the orientation of magnetic particles acquires a slight bias towards the magnetic field as they are deposited on an ocean floor or lake bottom. This is called detrital remanent magnetization.[8]\n\nThermoremanent magnetization is the main source of the magnetic anomalies around mid-ocean ridges. As the seafloor spreads, magma wells up from the mantle, cools to form new basaltic crust on both sides of the ridge, and is carried away from it by seafloor spreading. As it cools, it records the direction of the Earth's field. When the Earth's field reverses, new basalt records the reversed direction. The result is a series of stripes that are symmetric about the ridge. A ship towing a magnetometer on the surface of the ocean can detect these stripes and infer the age of the ocean floor below. This provides information on the rate at which seafloor has spread in the past.[8]\n\nRadiometric dating of lava flows has been used to establish a geomagnetic polarity time scale, part of which is shown in the image. This forms the basis of magnetostratigraphy, a geophysical correlation technique that can be used to date both sedimentary and volcanic sequences as well as the seafloor magnetic anomalies.[8]\n\nStudies of lava flows on Steens Mountain, Oregon, indicate that the magnetic field could have shifted at a rate of up to 6 degrees per day at some time in Earth's history, which significantly challenges the popular understanding of how the Earth's magnetic field works.[40] This finding was later attributed to unusual rock magnetic properties of the lava flow under study, not rapid field change, by one of the original authors of the 1995 study.[41]\n\nTemporary dipole tilt variations that take the dipole axis across the equator and then back to the original polarity are known as excursions.[39]\n\n\nEarliest appearance[edit]\n\nPaleomagnetic studies of Paleoarchean lava in Australia and conglomerate in South Africa have concluded that the magnetic field has been present since at least about 3,450 million years ago.[42][43][44]\n\n\nFuture[edit]\n\n  \nVariations in virtual axial dipole moment since the last reversal.\n\n\n\nAt present, the overall geomagnetic field is becoming weaker; the present strong deterioration corresponds to a 10–15% decline over the last 150 years and has accelerated in the past several years; geomagnetic intensity has declined almost continuously from a maximum 35% above the modern value achieved approximately 2,000 years ago. The rate of decrease and the current strength are within the normal range of variation, as shown by the record of past magnetic fields recorded in rocks.\n\nThe nature of Earth's magnetic field is one of heteroscedastic fluctuation. An instantaneous measurement of it, or several measurements of it across the span of decades or centuries, are not sufficient to extrapolate an overall trend in the field strength. It has gone up and down in the past for unknown reasons. Also, noting the local intensity of the dipole field (or its fluctuation) is insufficient to characterize Earth's magnetic field as a whole, as it is not strictly a dipole field. The dipole component of Earth's field can diminish even while the total magnetic field remains the same or increases.\n\nThe Earth's magnetic north pole is drifting from northern Canada towards Siberia with a presently accelerating rate—10 kilometres (6.2 mi) per year at the beginning of the 20th century, up to 40 kilometres (25 mi) per year in 2003,[23] and since then has only accelerated.[45]\n\n\nPhysical origin[edit]\n\nMain article: Dynamo theory\n\nEarth's core and the geodynamo[edit]\n\nThe Earth's magnetic field is believed to be generated by electric currents in the conductive iron alloys of its core, created by convection currents due to heat escaping from the core.  However the process is complex, and computer models that reproduce some of its features have only been developed in the last few decades.\n\n\n  \nA schematic illustrating the relationship between motion of conducting fluid, organized into rolls by the Coriolis force, and the magnetic field the motion generates.[46]\n\n\n\nThe Earth and most of the planets in the Solar System, as well as the Sun and other stars, all generate magnetic fields through the motion of electrically conducting fluids.[47] The Earth's field originates in its core. This is a region of iron alloys extending to about 3400 km (the radius of the Earth is 6370 km). It is divided into a solid inner core, with a radius of 1220 km, and a liquid outer core.[48] The motion of the liquid in the outer core is driven by heat flow from the inner core, which is about 6,000 K (5,730 °C; 10,340 °F), to the core-mantle boundary, which is about 3,800 K (3,530 °C; 6,380 °F).[49]  The heat is generated by potential energy released by heavier materials sinking toward the core (planetary differentiation, the iron catastrophe) as well as decay of radioactive elements in the interior.  The pattern of flow is organized by the rotation of the Earth and the presence of the solid inner core.[50]\n\nThe mechanism by which the Earth generates a magnetic field is known as a dynamo.[47] The magnetic field is generated by a feedback loop: current loops generate magnetic fields (Ampère's circuital law); a changing magnetic field generates an electric field (Faraday's law); and the electric and magnetic fields exert a force on the charges that are flowing in currents (the Lorentz force).[51] These effects can be combined in a partial differential equation for the magnetic field called the magnetic induction equation,\n\n\n\t\n  \n    \n      \n        \n          \n            \n              ∂\n              \n                B\n              \n            \n            \n              ∂\n              t\n            \n          \n        \n        =\n        η\n        \n          ∇\n          \n            2\n          \n        \n        \n          B\n        \n        +\n        ∇\n        ×\n        (\n        \n          u\n        \n        ×\n        \n          B\n        \n        )\n        ,\n      \n    \n    {\\displaystyle {\\frac {\\partial \\mathbf {B} }{\\partial t}}=\\eta \\nabla ^{2}\\mathbf {B} +\\nabla \\times (\\mathbf {u} \\times \\mathbf {B} ),}\n  \n\n\n\nwhere u is the velocity of the fluid; B is the magnetic B-field; and η=1/σμ is the magnetic diffusivity, which is inversely proportional to the product of the electrical conductivity σ and the permeability μ .[52]  The term ∂B/∂t is the time derivative of the field; ∇2 is the Laplace operator and ∇× is the curl operator.\n\nThe first term on the right hand side of the induction equation is a diffusion term. In a stationary fluid, the magnetic field declines and any concentrations of field spread out. If the Earth's dynamo shut off, the dipole part would disappear in a few tens of thousands of years.[52]\n\nIn a perfect conductor (\n  \n    \n      \n        σ\n        =\n        ∞\n        \n      \n    \n    {\\displaystyle \\sigma =\\infty \\;}\n  \n), there would be no diffusion. By Lenz's law, any change in the magnetic field would be immediately opposed by currents, so the flux through a given volume of fluid could not change. As the fluid moved, the magnetic field would go with it. The theorem describing this effect is called the frozen-in-field theorem. Even in a fluid with a finite conductivity, new field is generated by stretching field lines as the fluid moves in ways that deform it. This process could go on generating new field indefinitely, were it not that as the magnetic field increases in strength, it resists fluid motion.[52]\n\nThe motion of the fluid is sustained by convection, motion driven by buoyancy. The temperature increases towards the center of the Earth, and the higher temperature of the fluid lower down makes it buoyant. This buoyancy is enhanced by chemical separation: As the core cools, some of the molten iron solidifies and is plated to the inner core. In the process, lighter elements are left behind in the fluid, making it lighter. This is called compositional convection. A Coriolis effect, caused by the overall planetary rotation, tends to organize the flow into rolls aligned along the north-south polar axis.[50][52]\n\nA dynamo can amplify a magnetic field, but it needs a \"seed\" field to get it started.[52] For the Earth, this could have been an external magnetic field. Early in its history the Sun went through a T-Tauri phase in which the solar wind would have had a magnetic field orders of magnitude larger than the present solar wind.[53] However, much of the field may have been screened out by the Earth's mantle. An alternative source is currents in the core-mantle boundary driven by chemical reactions or variations in thermal or electric conductivity. Such effects may still provide a small bias that are part of the boundary conditions for the geodynamo.[54]\n\nThe average magnetic field in the Earth's outer core was calculated to be 25 gausses, 50 times stronger than the field at the surface.[55]\n\n\nNumerical models[edit]\n\nSimulating the geodynamo requires numerically solving a set of nonlinear partial differential equations for the magnetohydrodynamics (MHD) of the Earth's interior. Simulation of the MHD equations is performed on a 3D grid of points and the fineness of the grid, which in part determines the realism of the solutions, is limited mainly by computer power. For decades, theorists were confined to creating kinematic dynamo computer models in which the fluid motion is chosen in advance and the effect on the magnetic field calculated. Kinematic dynamo theory was mainly a matter of trying different flow geometries and testing whether such geometries could sustain a dynamo.[56]\n\nThe first self-consistent dynamo models, ones that determine both the fluid motions and the magnetic field, were developed by two groups in 1995, one in Japan[57] and one in the United States.[1][58] The latter received attention because it successfully reproduced some of the characteristics of the Earth's field, including geomagnetic reversals.[56]\n\n\nCurrents in the ionosphere and magnetosphere[edit]\n\nElectric currents induced in the ionosphere generate magnetic fields (ionospheric dynamo region). Such a field is always generated near where the atmosphere is closest to the Sun, causing daily alterations that can deflect surface magnetic fields by as much as one degree. Typical daily variations of field strength are about 25 nanoteslas (nT) (one part in 2000), with variations over a few seconds of typically around 1 nT (one part in 50,000).[59]\n\n\nMeasurement and analysis[edit]\n\nDetection[edit]\n\nThe Earth's magnetic field strength was measured by Carl Friedrich Gauss in 1832[60] and has been repeatedly measured since then, showing a relative decay of about 10% over the last 150 years.[61] The Magsat satellite and later satellites have used 3-axis vector magnetometers to probe the 3-D structure of the Earth's magnetic field. The later Ørsted satellite allowed a comparison indicating a dynamic geodynamo in action that appears to be giving rise to an alternate pole under the Atlantic Ocean west of South Africa.[62]\n\nGovernments sometimes operate units that specialize in measurement of the Earth's magnetic field. These are geomagnetic observatories, typically part of a national Geological survey, for example the British Geological Survey's Eskdalemuir Observatory. Such observatories can measure and forecast magnetic conditions such as magnetic storms that sometimes affect communications, electric power, and other human activities.\n\nThe International Real-time Magnetic Observatory Network, with over 100 interlinked geomagnetic observatories around the world, has been recording the Earth's magnetic field since 1991.\n\nThe military determines local geomagnetic field characteristics, in order to detect anomalies in the natural background that might be caused by a significant metallic object such as a submerged submarine. Typically, these magnetic anomaly detectors are flown in aircraft like the UK's Nimrod or towed as an instrument or an array of instruments from surface ships.\n\nCommercially, geophysical prospecting companies also use magnetic detectors to identify naturally occurring anomalies from ore bodies, such as the Kursk Magnetic Anomaly.\n\n\nCrustal magnetic anomalies[edit]\n\n  \nA model of short-wavelength features of Earth's magnetic field, attributed to lithospheric anomalies[63]\n\n\n\nMagnetometers detect minute deviations in the Earth's magnetic field caused by iron artifacts, kilns, some types of stone structures, and even ditches and middens in archaeological geophysics. Using magnetic instruments adapted from airborne magnetic anomaly detectors developed during World War II to detect submarines,[64] the magnetic variations across the ocean floor have been mapped. Basalt — the iron-rich, volcanic rock making up the ocean floor[65] — contains a strongly magnetic mineral (magnetite) and can locally distort compass readings. The distortion was recognized by Icelandic mariners as early as the late 18th century.[66] More important, because the presence of magnetite gives the basalt measurable magnetic properties, these magnetic variations have provided another means to study the deep ocean floor. When newly formed rock cools, such magnetic materials record the Earth's magnetic field.[66]\n\n\nStatistical models[edit]\n\nEach measurement of the magnetic field is at a particular place and time. If an accurate estimate of the field at some other place and time is needed, the measurements must be converted to a model and the model used to make predictions.\n\n\nSpherical harmonics[edit]\n\nSee also: Multipole expansion\n\n  \nSchematic representation of spherical harmonics on a sphere and their nodal lines. Pℓ m is equal to 0 along m great circles passing through the poles, and along ℓ-m circles of equal latitude. The function changes sign each ℓtime it crosses one of these lines.\n\n\n\n  \nExample of a quadrupole field. This can also be constructed by moving two dipoles together.\n\n\n\nThe most common way of analyzing the global variations in the Earth's magnetic field is to fit the measurements to a set of spherical harmonics. This was first done by Carl Friedrich Gauss.[67] Spherical harmonics are functions that oscillate over the surface of a sphere. They are the product of two functions, one that depends on latitude and one on longitude. The function of longitude is zero along zero or more great circles passing through the North and South Poles; the number of such nodal lines is the absolute value of the order m. The function of latitude is zero along zero or more latitude circles; this plus the order is equal to the degree ℓ. Each harmonic is equivalent to a particular arrangement of magnetic charges at the center of the Earth. A monopole is an isolated magnetic charge, which has never been observed. A dipole is equivalent to two opposing charges brought close together and a quadrupole to two dipoles brought together. A quadrupole field is shown in the lower figure on the right.[12]\n\nSpherical harmonics can represent any scalar field (function of position) that satisfies certain properties. A magnetic field is a vector field, but if it is expressed in Cartesian components X, Y, Z, each component is the derivative of the same scalar function called the magnetic potential. Analyses of the Earth's magnetic field use a modified version of the usual spherical harmonics that differ by a multiplicative factor. A least-squares fit to the magnetic field measurements gives the Earth's field as the sum of spherical harmonics, each multiplied by the best-fitting  Gauss coefficient gmℓ or hmℓ.[12]\n\nThe lowest-degree Gauss coefficient, g00, gives the contribution of an isolated magnetic charge, so it is zero. The next three coefficients – g10, g11, and h11 – determine the direction and magnitude of the dipole contribution. The best fitting dipole is tilted at an angle of about 10° with respect to the rotational axis, as described earlier.[12]\n\n\nRadial dependence[edit]\n\nSpherical harmonic analysis can be used to distinguish internal from external sources if measurements are available at more than one height (for example, ground observatories and satellites). In that case, each term with coefficient gmℓ or hmℓ can be split into two terms: one that decreases with radius as 1/rℓ+1 and one that increases with radius as rℓ. The increasing terms fit the external sources (currents in the ionosphere and magnetosphere). However, averaged over a few years the external contributions average to zero.[12]\n\nThe remaining terms predict that the potential of a dipole source (ℓ=1) drops off as 1/r2. The magnetic field, being a derivative of the potential, drops off as 1/r3. Quadrupole terms drop off as 1/r4, and higher order terms drop off increasingly rapidly with the radius. The radius of the outer core is about half of the radius of the Earth. If the field at the core-mantle boundary is fit to spherical harmonics, the dipole part is smaller by a factor of about 8 at the surface, the quadrupole part by a factor of 16, and so on. Thus, only the components with large wavelengths can be noticeable at the surface. From a variety of arguments, it is usually assumed that only terms up to degree 14 or less have their origin in the core. These have wavelengths of about 2,000 kilometres (1,200 mi) or less. Smaller features are attributed to crustal anomalies.[12]\n\n\nGlobal models[edit]\n\nThe International Association of Geomagnetism and Aeronomy maintains a standard global field model called the International Geomagnetic Reference Field. It is updated every five years. The 11th-generation model, IGRF11, was developed using data from satellites (Ørsted, CHAMP and SAC-C) and a world network of geomagnetic observatories.[68] The spherical harmonic expansion was truncated at degree 10, with 120 coefficients, until 2000. Subsequent models are truncated at degree 13 (195 coefficients).[69]\n\nAnother global field model, called the World Magnetic Model, is produced jointly by the United States National Centers for Environmental Information (formerly the National Geophysical Data Center) and the British Geological Survey. This model truncates at degree 12 (168 coefficients) with an approximate spatial resolution of 3,000 kilometers. It is the model used by the United States Department of Defense, the Ministry of Defence (United Kingdom), the United States Federal Aviation Administration (FAA), the North Atlantic Treaty Organization (NATO), and the International Hydrographic Office as well as in many civilian navigation systems.[70]\n\nA third model, produced by the Goddard Space Flight Center (NASA and GSFC) and the Danish Space Research Institute, uses a \"comprehensive modeling\" approach that attempts to reconcile data with greatly varying temporal and spatial resolution from ground and satellite sources.[71]\n\nFor users with higher accuracy needs, the United States National Centers for Environmental Information developed  the Enhanced Magnetic Model (EMM), which extends to degree and order 790 and resolves magnetic anomalies down to a wavelength of 56 kilometers. It was compiled from satellite, marine, aeromagnetic and ground magnetic surveys. As of 2018[update], the latest version, EMM2017, includes data from The European Space Agency's Swarm satellite mission.[72]\n\n\nBiomagnetism[edit]\n\nMain article: Magnetoreception\n\nAnimals including birds and turtles can detect the Earth's magnetic field, and use the field to navigate during migration.[73] Some researchers have found that cows and wild deer tend to align their bodies north-south while relaxing, but not when the animals are under high-voltage power lines, suggesting that magnetism is responsible.[74][75] Other researchers reported in 2011 that they could not replicate those findings using different Google Earth images.[76]\n\nResearchers found out that very weak electromagnetic fields disrupt the magnetic compass used by European robins and other songbirds to navigate using the Earth's magnetic field. Neither power lines nor cellphone signals are to blame for the electromagnetic field effect on the birds;[77] instead, the culprits have frequencies between 2 kHz and 5 MHz. These include AM radio signals and ordinary electronic equipment that might be found in businesses or private homes.[78]\n\n\nSee also[edit]\n\n\n\tEarth sciences portal\n\tGeophysics portal\n\tPhysics portal\n\n\n\n\t\t\tBook: Geomagnetism\n\n\n\n\n\tGeomagnetic jerk\n\tGeomagnetic latitude\n\tMagnetotellurics\n\tOperation Argus\n\n\n\n\nReferences[edit]\n\n\n\t^ a b Glatzmaier, Gary A.; Roberts, Paul H. (1995). \"A three-dimensional self-consistent computer simulation of a geomagnetic field reversal\". Nature. 377 (6546): 203–209. Bibcode:1995Natur.377..203G. doi:10.1038/377203a0.\n\n\t^ Glatzmaier, Gary. \"The Geodynamo\". University of California Santa Cruz. Retrieved 20 October 2013.\n\n\n\t^ Finlay, C. C.; Maus, S.; Beggan, C. D.; Bondar, T. N.; Chambodut, A.; Chernova, T. A.; Chulliat, A.; Golovkov, V. P.; Hamilton, B.; Hamoudi, M.; Holme, R.; Hulot, G.; Kuang, W.; Langlais, B.; Lesur, V.; Lowes, F. J.; Lühr, H.; Macmillan, S.; Mandea, M.; McLean, S.; Manoj, C.; Menvielle, M.; Michaelis, I.; Olsen, N.; Rauberg, J.; Rother, M.; Sabaka, T. J.; Tangborn, A.; Tøffner-Clausen, L.; Thébault, E.; Thomson, A. W. P.; Wardinski, I.; Wei, Z.; Zvereva, T. I. (December 2010). \"International Geomagnetic Reference Field: the eleventh generation\". Geophysical Journal International. 183 (3): 1216–1230. Bibcode:2010GeoJI.183.1216F. doi:10.1111/j.1365-246X.2010.04804.x.\n\n\n\t^ Shlermeler, Quirin (3 March 2005). \"Solar wind hammers the ozone layer\". News@nature. doi:10.1038/news050228-12.\n\n\n\t^ \"Solar wind ripping chunks off Mars\". Cosmos Online. 25 November 2008. Archived from the original on 4 March 2016. Retrieved 21 October 2013.\n\n\n\t^ Luhmann, Johnson & Zhang 1992\n\n\t^ Structure of the Earth Archived 2013-03-15 at the Wayback Machine. Scign.jpl.nasa.gov. Retrieved on 2012-01-27.\n\n\t^ a b c d McElhinny, Michael W.; McFadden, Phillip L. (2000). Paleomagnetism: Continents and Oceans. Academic Press. ISBN 978-0-12-483355-5.\n\n\n\t^ Opdyke, Neil D.; Channell, James E. T. (1996). Magnetic Stratigraphy. Academic Press. ISBN 978-0-12-527470-8.\n\n\n\t^ Mussett, Alan E.; Khan, M. Aftab (2000). Looking into the Earth: An introduction to Geological Geophysics. Cambridge University Press. ISBN 978-0-521-78085-8.\n\n\n\t^ Temple, Robert (2006). The Genius of China. Andre Deutsch. ISBN 978-0-671-62028-8.\n\n\n\t^ a b c d e f g h i j Merrill, McElhinny & McFadden 1996, Chapter 2\n\n\t^ a b \"Geomagnetism Frequently Asked Questions\". National Geophysical Data Center. Retrieved 21 October 2013.\n\n\n\t^ Palm, Eric (2011). \"Tesla\". National High Magnetic Field Laboratory. Archived from the original on 21 March 2013. Retrieved 20 October 2013.\n\n\n\t^ a b Chulliat, A.; Macmillan, S.; Alken, P.; Beggan, C.; Nair, M.; Hamilton, B.; Woods, A.; Ridley, V.; Maus, S.; Thomson, A. (2015). The US/UK World Magnetic Model for 2015-2020 (PDF) (Report). National Geophysical Data Center. Retrieved 21 February 2016.\n\n\n\t^ Casselman, Anne (28 February 2008). \"The Earth Has More Than One North Pole\". Scientific American. Retrieved 21 May 2013.\n\n\n\t^ Serway, Raymond A.; Chris Vuille (2006). Essentials of college physics. USA: Cengage Learning. p. 493. ISBN 978-0-495-10619-7.\n\n\n\t^ Emiliani, Cesare (1992). Planet Earth: Cosmology, Geology, and the Evolution of Life and Environment. UK: Cambridge University Press. p. 228. ISBN 978-0-521-40949-0.\n\n\n\t^ Manners, Joy (2000). Static Fields and Potentials. USA: CRC Press. p. 148. ISBN 978-0-7503-0718-5.\n\n\n\t^ Nave, Carl R. (2010). \"Bar Magnet\". Hyperphysics. Dept. of Physics and Astronomy, Georgia State Univ. Retrieved 2011-04-10.\n\n\n\t^ Campbell, Wallace A. (1996). \"\"Magnetic\" pole locations on global charts are incorrect\". Eos, Transactions American Geophysical Union. 77 (36): 345. Bibcode:1996EOSTr..77..345C. doi:10.1029/96EO00237.\n\n\n\t^ \"The Magnetic North Pole\". Woods Hole Oceanographic Institution. Archived from the original on 19 August 2013. Retrieved 21 October 2013.\n\n\n\t^ a b c Phillips, Tony (29 December 2003). \"Earth's Inconstant Magnetic Field\". Science@Nasa. Retrieved 27 December 2009.\n\n\n\t^ a b c d e Merrill 2010, pages 126–141\n\n\t^ a b c Parks, George K. (1991). Physics of space plasmas : an introduction. Redwood City, Calif.: Addison-Wesley. ISBN 978-0201508215.\n\n\n\t^ Darrouzet, Fabien; De Keyser, Johan; Escoubet, C. Philippe (10 September 2013). \"Cluster shows plasmasphere interacting with Van Allen belts\" (Press release). European Space Agency. Retrieved 22 October 2013.\n\n\n\t^ \"Shields Up! A breeze of interstellar helium atoms is blowing through the solar system\". Science@NASA. 27 September 2004. Retrieved 23 October 2013.\n\n\n\t^ Odenwald, Sten (2010). \"The great solar superstorm of 1859\". Technology Through Time. 70. Retrieved 24 October 2013.\n\n\n\t^ \"The K-index\". Space Weather Prediction Center. Archived from the original on 22 October 2013. Retrieved 20 October 2013.\n\n\n\t^ Steigerwald, Bill (16 December 2008). \"Sun Often \"Tears Out A Wall\" In Earth's Solar Storm Shield\". THEMIS: Understanding space weather. NASA. Retrieved 20 August 2011.\n\n\n\t^ Jackson, Andrew; Jonkers, Art R. T.; Walker, Matthew R. (2000). \"Four centuries of Geomagnetic Secular Variation from Historical Records\". Philosophical Transactions of the Royal Society A. 358 (1768): 957–990. Bibcode:2000RSPTA.358..957J. CiteSeerX 10.1.1.560.5046. doi:10.1098/rsta.2000.0569. JSTOR 2666741.\n\n\n\t^ a b \"Secular variation\". Geomagnetism. Canadian Geological Survey. 2011. Retrieved 18 July 2011.\n\n\n\t^ Constable, Catherine (2007). \"Dipole Moment Variation\".  In Gubbins, David; Herrero-Bervera, Emilio (eds.). Encyclopedia of Geomagnetism and Paleomagnetism. Springer-Verlag. pp. 159–161. doi:10.1007/978-1-4020-4423-6_67. ISBN 978-1-4020-3992-8.\n\n\n\t^ Dumberry, Mathieu; Finlay, Christopher C. (2007). \"Eastward and westward drift of the Earth's magnetic field for the last three millennia\" (PDF). Earth and Planetary Science Letters. 254 (1–2): 146–157. Bibcode:2007E&PSL.254..146D. doi:10.1016/j.epsl.2006.11.026. Archived from the original (PDF) on 2013-10-23. Retrieved 2013-10-22.\n\n\n\t^ Tauxe 1998, Chapter 1\n\n\t^ Vacquier, Victor (1972). Geomagnetism in marine geology (2nd ed.). Amsterdam: Elsevier Science. p. 38. ISBN 9780080870427.\n\n\n\t^ Merrill, McElhinny & McFadden 1996, Chapter 5\n\n\t^ \"Ice Age Polarity Reversal Was Global Event: Extremely Brief Reversal of Geomagnetic Field, Climate Variability, and Super Volcano\". ScienceDaily. 16 October 2012. Bibcode:2012E&PSL.351...54N. doi:10.1016/j.epsl.2012.06.050. Retrieved 21 March 2013.\n\n\n\t^ a b Merrill, McElhinny & McFadden 1996, pp. 148–155\n\n\t^ Coe, R. S.; Prévot, M.; Camps, P. (20 April 1995). \"New evidence for extraordinarily rapid change of the geomagnetic field during a reversal\". Nature. 374 (6524): 687–692. Bibcode:1995Natur.374..687C. doi:10.1038/374687a0.\n (also available online at es.ucsc.edu)\n\n\t^ Coe, R. S.; Jarboe, N. A.; Le Goff, M.; Petersen, N. (15 August 2014). \"Demise of the rapid-field-change hypothesis at Steens Mountain: The crucial role of continuous thermal demagnetization\". Earth and Planetary Science Letters. 400: 302–312. Bibcode:2014E&PSL.400..302C. doi:10.1016/j.epsl.2014.05.036.\n\n\n\t^ McElhinney, T. N. W.; Senanayake, W. E. (1980). \"Paleomagnetic Evidence for the Existence of the Geomagnetic Field 3.5 Ga Ago\". Journal of Geophysical Research. 85 (B7): 3523. Bibcode:1980JGR....85.3523M. doi:10.1029/JB085iB07p03523.\n\n\n\t^ Usui, Yoichi; Tarduno, John A.; Watkeys, Michael; Hofmann, Axel; Cottrell, Rory D. (2009). \"Evidence for a 3.45-billion-year-old magnetic remanence: Hints of an ancient geodynamo from conglomerates of South Africa\". Geochemistry Geophysics Geosystems. 10 (9): n/a. Bibcode:2009GGG....1009Z07U. doi:10.1029/2009GC002496.\n\n\n\t^ Tarduno, J. A.; Cottrell, R. D.; Watkeys, M. K.; Hofmann, A.; Doubrovine, P. V.; Mamajek, E. E.; Liu, D.; Sibeck, D. G.; Neukirch, L. P.; Usui, Y. (4 March 2010). \"Geodynamo, Solar Wind, and Magnetopause 3.4 to 3.45 Billion Years Ago\". Science. 327 (5970): 1238–1240. Bibcode:2010Sci...327.1238T. doi:10.1126/science.1183445. PMID 20203044.\n\n\n\t^ Lovett, Richard A. (December 24, 2009). \"North Magnetic Pole Moving Due to Core Flux\".\n\n\n\t^ \"How does the Earth's core generate a magnetic field?\". USGS FAQs. United States Geological Survey. Archived from the original on 18 January 2015. Retrieved 21 October 2013.\n\n\n\t^ a b Weiss, Nigel (2002). \"Dynamos in planets, stars and galaxies\". Astronomy and Geophysics. 43 (3): 3.09–3.15. Bibcode:2002A&G....43c...9W. doi:10.1046/j.1468-4004.2002.43309.x.\n\n\n\t^ Jordan, T. H. (1979). \"Structural Geology of the Earth's Interior\". Proceedings of the National Academy of Sciences. 76 (9): 4192–4200. Bibcode:1979PNAS...76.4192J. doi:10.1073/pnas.76.9.4192. PMC 411539. PMID 16592703.\n\n\n\t^ European Synchrotron Radiation Facility (25 April 2013). \"Earth's Center Is 1,000 Degrees Hotter Than Previously Thought, Synchrotron X-Ray Experiment Shows\". ScienceDaily. Retrieved 21 October 2013.\n\n\n\t^ a b Buffett, B. A. (2000). \"Earth's Core and the Geodynamo\". Science. 288 (5473): 2007–2012. Bibcode:2000Sci...288.2007B. doi:10.1126/science.288.5473.2007. PMID 10856207.\n\n\n\t^ Feynman, Richard P. (2010). The Feynman lectures on physics (New millennium ed.). New York: BasicBooks. pp. 13–3, 15–14, 17–2. ISBN 9780465024940.\n\n\n\t^ a b c d e Merrill, McElhinny & McFadden 1996, Chapter 8\n\n\t^ Merrill, McElhinny & McFadden 1996, Chapter 10\n\n\t^ Merrill, McElhinny & McFadden 1996, Chapter 11\n\n\t^ Buffett, Bruce A. (2010). \"Tidal dissipation and the strength of the Earth's internal magnetic field\". Nature. 468 (7326): 952–954. Bibcode:2010Natur.468..952B. doi:10.1038/nature09643. PMID 21164483. Lay summary – Science 20.\n\n\n\t^ a b Kono, Masaru; Roberts, Paul H. (2002). \"Recent geodynamo simulations and observations of the geomagnetic field\". Reviews of Geophysics. 40 (4): 1–53. Bibcode:2002RvGeo..40.1013K. doi:10.1029/2000RG000102.\n\n\n\t^ Kageyama, Akira; Sato, Tetsuya; the Complexity Simulation Group (1 January 1995). \"Computer simulation of a magnetohydrodynamic dynamo. II\". Physics of Plasmas. 2 (5): 1421–1431. Bibcode:1995PhPl....2.1421K. doi:10.1063/1.871485.\n\n\n\t^ Glatzmaier, Gary A.; Roberts, Paul H. (1995). \"A three-dimensional convective dynamo solution with rotating and finitely conducting inner core and mantle\". Physics of the Earth and Planetary Interiors. 91 (1–3): 63–75. Bibcode:1995PEPI...91...63G. doi:10.1016/0031-9201(95)03049-3.\n\n\n\t^ Stepišnik, Janez (2006). \"Spectroscopy: NMR down to Earth\". Nature. 439 (7078): 799–801. Bibcode:2006Natur.439..799S. doi:10.1038/439799a. PMID 16482144.\n\n\n\t^ Gauss, C.F (1832). \"The Intensity of the Earth's Magnetic Force Reduced to Absolute Measurement\" (PDF). Retrieved 2009-10-21.\n\n\n\t^ Courtillot, Vincent; Le Mouel, Jean Louis (1988). \"Time Variations of the Earth's Magnetic Field: From Daily to Secular\". Annual Review of Earth and Planetary Sciences. 1988 (16): 435. Bibcode:1988AREPS..16..389C. doi:10.1146/annurev.ea.16.050188.002133.\n\n\n\t^ Hulot, G.; Eymin, C.; Langlais, B.; Mandea, M.; Olsen, N. (April 2002). \"Small-scale structure of the geodynamo inferred from Oersted and Magsat satellite data\". Nature. 416 (6881): 620–623. Bibcode:2002Natur.416..620H. doi:10.1038/416620a. PMID 11948347.\n\n\n\t^ Frey, Herbert. \"Satellite Magnetic Models\". Comprehensive Modeling of the Geomagnetic Field. NASA. Retrieved 13 October 2011.\n\n\n\t^ William F. Hanna (1987). Geologic Applications of Modern Aeromagnetic Surveys (PDF). USGS. p. 66. Retrieved 3 May 2017.\n\n\n\t^ G. D. Nicholls (1965). \"Basalts from the Deep Ocean Floor\" (PDF). Mineralogical Magazine. 34 (268): 373–388. Bibcode:1965MinM...34..373N. doi:10.1180/minmag.1965.034.268.32. Retrieved 3 May 2017.\n\n\n\t^ a b Jacqueline W. Kious; Robert I. Tilling (1996). This Dynamic Earth: The Story of Plate Tectonics. USGS. p. 17. ISBN 978-0160482205. Retrieved 3 May 2017.\n\n\n\t^ Campbell 2003, p. 1.\n\n\t^ Finlay, C. C.; Maus, S.; Beggan, C. D.; Hamoudi, M.; Lowes, F. J.; Olsen, N.; Thébault, E. (2010). \"Evaluation of candidate geomagnetic field models for IGRF-11\" (PDF). Earth, Planets and Space. 62 (10): 787–804. Bibcode:2010EP&S...62..787F. doi:10.5047/eps.2010.11.005.\n\n\n\t^ \"The International Geomagnetic Reference Field: A \"Health\" Warning\". National Geophysical Data Center. January 2010. Retrieved 13 October 2011.\n\n\n\t^ \"The World Magnetic Model\". National Geophysical Data Center. Retrieved 14 October 2011.\n\n\n\t^ Herbert, Frey. \"Comprehensive Modeling of the Geomagnetic Field\". NASA. Archived from the original on 2011-10-20.\n\n\n\t^ \"The Enhanced Magnetic Model\". United States National Centers for Environmental Information. Retrieved 29 June 2018.\n\n\n\t^ Deutschlander, M.; Phillips, J.; Borland, S. (1999). \"The case for light-dependent magnetic orientation in animals\". Journal of Experimental Biology. 202 (8): 891–908. PMID 10085262.\n\n\n\t^ Burda, H.; Begall, S.; Cerveny, J.; Neef, J.; Nemec, P. (2009). \"Extremely low-frequency electromagnetic fields disrupt magnetic alignment of ruminants\". Proceedings of the National Academy of Sciences. 106 (14): 5708–13. Bibcode:2009PNAS..106.5708B. doi:10.1073/pnas.0811194106. PMC 2667019. PMID 19299504.\n\n\n\t^ \"Biology: Electric cows\". Nature. 458 (7237): 389. 2009. Bibcode:2009Natur.458Q.389.. doi:10.1038/458389a.\n\n\n\t^ Hert, J; Jelinek, L; Pekarek, L; Pavlicek, A (2011). \"No alignment of cattle along geomagnetic field lines found\". Journal of Comparative Physiology. 197 (6): 677–682. arXiv:1101.5263. doi:10.1007/s00359-011-0628-7. PMID 21318402.\n [1]\n\n\t^ Engels, Svenja; Schneider, Nils-Lasse; Lefeldt, Nele; Hein, Christine Maira; Zapka, Manuela; Michalik, Andreas; Elbers, Dana; Kittel, Achim; Hore, P. J. (2014-05-15). \"Anthropogenic electromagnetic noise disrupts magnetic compass orientation in a migratory bird\". Nature. 509 (7500): 353–356. Bibcode:2014Natur.509..353E. doi:10.1038/nature13290. ISSN 0028-0836. PMID 24805233.\n\n\n\t^ Hsu, Jeremy (9 May 2014). \"Electromagnetic Interference Disrupts Bird Navigation, Hints at Quantum Action\". IEEE Spectrum. Retrieved 31 May 2015.\n\n\n\n\n\nFurther reading[edit]\n\n\n\tCampbell, Wallace H. (2003). Introduction to geomagnetic fields (2nd ed.). New York: Cambridge University Press. ISBN 978-0-521-52953-2.\n\n\tComins, Neil F. (2008). Discovering the Essential Universe (Fourth ed.). W. H. Freeman. ISBN 978-1-4292-1797-2.\n\n\tGramling, Carolyn (1 February 2019). \"Earth's core may have hardened just in time to save its magnetic field\". Science News. Retrieved 3 February 2019.\n\n\tHerndon, J. M. (1996-01-23). \"Substructure of the inner core of the Earth\". PNAS. 93 (2): 646–648. Bibcode:1996PNAS...93..646H. doi:10.1073/pnas.93.2.646. PMC 40105. PMID 11607625.\n\n\tHollenbach, D. F.; Herndon, J. M. (2001-09-25). \"Deep-Earth reactor: Nuclear fission, helium, and the geomagnetic field\". PNAS. 98 (20): 11085–90. Bibcode:2001PNAS...9811085H. doi:10.1073/pnas.201393998. PMC 58687. PMID 11562483.\n\n\tLove, Jeffrey J. (2008). \"Magnetic monitoring of Earth and space\" (PDF). Physics Today. 61 (2): 31–37. Bibcode:2008PhT....61b..31H. doi:10.1063/1.2883907.\n\n\tLuhmann, J. G.; Johnson, R. E.; Zhang, M. H. G. (1992). \"Evolutionary impact of sputtering of the Martian atmosphere by O+ pickup ions\". Geophysical Research Letters. 19 (21): 2151–2154. Bibcode:1992GeoRL..19.2151L. doi:10.1029/92GL02485.\n\n\tMerrill, Ronald T. (2010). Our Magnetic Earth: The Science of Geomagnetism. University of Chicago Press. ISBN 978-0-226-52050-6.\n\n\tMerrill, Ronald T.; McElhinny, Michael W.; McFadden, Phillip L. (1996). The magnetic field of the earth: paleomagnetism, the core, and the deep mantle. Academic Press. ISBN 978-0-12-491246-5.\n\n\t\"Temperature of the Earth's core\". NEWTON Ask a Scientist. 1999.\n\n\tTauxe, Lisa (1998). Paleomagnetic Principles and Practice. Kluwer. ISBN 978-0-7923-5258-7.\n\n\tTowle, J. N. (1984). \"The Anomalous Geomagnetic Variation Field and Geoelectric Structure Associated with the Mesa Butte Fault System, Arizona\". Geological Society of America Bulletin. 9 (2): 221–225. Bibcode:1984GSAB...95..221T. doi:10.1130/0016-7606(1984)95<221:TAGVFA>2.0.CO;2.\n\n\tWait, James R. (1954). \"On the relation between telluric currents and the earth's magnetic field\". Geophysics. 19 (2): 281–289. Bibcode:1954Geop...19..281W. doi:10.1190/1.1437994.\n\n\tWalt, Martin (1994). Introduction to Geomagnetically Trapped Radiation. Cambridge University Press. ISBN 978-0-521-61611-9.\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Geomagnetism.\n\n\n\tGeomagnetism & Paleomagnetism background material. American Geophysical Union Geomagnetism and Paleomagnetism Section.\n\tNational Geomagnetism Program. United States Geological Survey, March 8, 2011.\n\tBGS Geomagnetism. Information on monitoring and modeling the geomagnetic field. British Geological Survey, August 2005.\n\tWilliam J. Broad, Will Compasses Point South?. The New York Times, July 13, 2004.\n\tJohn Roach, Why Does Earth's Magnetic Field Flip?. National Geographic, September 27, 2004.\n\tMagnetic Storm. PBS NOVA, 2003. (ed. about pole reversals)\n\tWhen North Goes South. Projects in Scientific Computing, 1996.\n\tThe Great Magnet, the Earth, History of the discovery of Earth's magnetic field by David P. Stern.\n\tExploration of the Earth's Magnetosphere, Educational web site by David P. Stern and Mauricio Peredo\n\tDr. Dan Lathrop: The study of the Earth's magnetic field. Interview with Dr. Dan Lathrop, Geophysicist at the University of Maryland, about his experiments with the Earth's core and magnetic field. July 3, 2008\n\tInternational Geomagnetic Reference Field 2011\n\tGlobal evolution/anomaly of the Earth's magnetic field Sweeps are in 10 degree steps at 10 years intervals. Based on data from: The Institute of Geophysics, ETH Zurich\n\tPatterns in Earth's magnetic field that evolve on the order of 1,000 years. July 19, 2017\n\n\n\t\tv\n\tt\n\te\n\n\nAtmospheric electricity\n\n\tGeneral\t\n\tGeophysics\n\tAtmospheric sciences\n\tAtmospheric physics\n\tAtmospheric dynamics\n\tAtmospheric dynamo\n\tAtmospheric chemistry\n\tEarth's magnetic field\n\n\n\n\n\tElectromagnetism\t\n\tELF/VLF emissions\t\n\tRadio atmospherics\n\tWhistlers\n\tChorus\n\tHiss\n\n\n\n\n\tOptical emissions\t\n\tUpper-atmospheric lightning\n\tSprites\n\tSt. Elmo's fire\n\tBall lightning\n\n\n\n\n\n\n\n\tSources\t\n\tSolar radiation\n\tLightning\n\tEquatorial electrojet\n\n\n\n\n\tApplications\t\n\tElectrodynamic tethers\n\tMagnetotellurics\n\n\n\n\n\tPeople\t\n\tGeorg Wilhelm Richmann\n\tEgon Schweidler\n\tNikola Tesla\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nGeology\n\n\tOverviews\t\n\tOutline of geology\n\tIndex of geology articles\n\n\n\n\t\n\n\n\tHistory of geology\t\n\tAbsolute dating\n\tGeological history of Earth\n\tTimeline of geology\n\n\n\n\n\tСomposition and structure\t\n\tGeochemistry\n\tCrystallography\n\tMineralogy\n\tPetrography\n\tPetrology\n\tSedimentology\n\tIgneous petrology\n\n\n\n\n\tHistorical geology\t\n\tClimatic geomorphology\n\tDenudation chronology\n\tStratigraphy\n\tPaleontology\n\tPaleoclimatology\n\tPaleogeography\n\n\n\n\n\tMotion\t\n\tClimatic geomorphology\n\tStructural geology\n\tGeodynamics\n\tPlate tectonics\n\tGeomorphology\n\tVolcanology\n\n\n\n\n\tWater\t\n\tGlaciology\n\tHydrogeology\n\tMarine geology\n\n\n\n\n\tGeophysics\t\n\tGeodesy\n\tGeomagnetism\n\tGeophysical survey\n\tSeismology\n\tTectonophysics\n\n\n\n\n\tApplications\t\n\tEconomic geology\n\tEngineering geology\n\tEnvironmental geology\n\tPlanetary geology\n\tBiogeology\n\tGeomicrobiology\n\tGeologic modelling \n\tForensic Geology\n\tForensic geophysics\n\n\n\n\n\tOccupations\t\n\tGeodesist\n\tGeologist\n\tPetroleum geologist\n\tGeophysicist\n\tHydrologist\n\tPaleontologist\n\tSeismologist\n\tVolcanologist\n\n\n\n\n\t\n\t Geology\n\t Earth sciences\n\t Geology\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nGeophysics\n\n\tOverview\t\n\tOutline\n\tGeophysicists\n\n\n\n\n\tSubfields\t\n\tGeodesy\n\tGeodynamics\n\tGeophysical survey\n\tGeomagnetism\n\tGeophysical fluid dynamics\n\tMathematical geophysics\n\tMineral physics\n\tNear-surface geophysics\n\tPaleomagnetism\n\tSeismology\n\tTectonophysics\n\n\n\n\n\tPhysical \nphenomena\t\n\tChandler wobble\n\tCoriolis effect\n\tEarth's magnetic field\n\tGeodynamo\n\tGeothermal gradient\n\tGravity of Earth\n\tMantle convection\n\tPrecession of the equinoxes\n\tSeismic wave\n\tTides\n\n\n\n\n\t\n\t Category\n\t Portal\n\t Commons\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nMagnetospherics\n\n\tSubmagnetosphere\t\n\tAtmospheric circulation\n\tAurora\n\tEarth's magnetic field\n\tGeosphere\n\tJet stream\n\tPolar wind\n\n\n\n\n\tEarth's magnetosphere\t\n\tBirkeland current\n\tBow shock\n\tIonosphere\n\tMagnetopause\n\tMagnetosheath\n\tMagnetosphere\n\tMagnetosphere chronology\n\tMagnetosphere particle motion\n\tPlasmasphere\n\tRing current\n\tVan Allen radiation belt\n\n\n\n\n\tSolar wind\t\n\tCoronal cloud\n\tCoronal mass ejection\n\tSolar flare\n\tGeomagnetic storm\n\tHeliosphere\n\tInterplanetary magnetic field\n\tHeliospheric current sheet\n\tHeliopause\n\tSolar particle event\n\tSpace climate\n\tSpace weather\n\n\n\n\n\tSatellites\t\n\tFull list\n\tArase (2016)\n\tCluster II\n\tDouble Star\n\tGeotail\n\tIMAGE\n\tMMS (2015)\n\tPolar\n\tTHEMIS\n\tVan Allen Probes\n\tWind\n\n\n\n\n\tResearch projects\t\n\tHAARP\n\tSHARE\n\tUnwin Radar\n\n\n\tSuperDARN\n\n\n\n\n\tOther magnetospheres\t\n\tHermian\n\tLunar\n\tJovian\n\tGanymedian\n\tSaturnian\n\tUranian\n\tNeptunian\n\n\n\n\n\tRelated topics\t\n\tFlux tube\n\tGas torus\n\tLunar swirls\n\tPlanetary rings\n\tJupiter\n\tSaturn\n\tUranus\n\tNeptune\n\n\n\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4015173-6\n\tLCCN: sh85079763\n\tNDL: 00573127\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Earth%27s_magnetic_field&oldid=919093165\"\n\n\t\t\n\t\tCategories: \tGeomagnetism\n\tGeophysics\n\tMagnetospheres\n\n\nHidden categories: \tWebarchive template wayback links\n\tArticles with short description\n\tGood articles\n\tArticles containing potentially dated statements from 2018\n\tAll articles containing potentially dated statements\n\tCommons category link is locally defined\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tবাংলা\n\tБеларуская\n\tБългарски\n\tBosanski\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tDiné bizaad\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\tGĩkũyũ\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tქართული\n\tLatviešu\n\tLëtzebuergesch\n\tMagyar\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tଓଡ଼ିଆ\n\tਪੰਜਾਬੀ\n\tPolski\n\tPortuguês\n\tРусский\n\tScots\n\tShqip\n\tSimple English\n\tSlovenčina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 October 2019, at 20:08 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "10", "dc:title": "Earth's magnetic field - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Geodynamo_Between_Reversals.gif", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-geomagnetic_field", "title": "Earth's magnetic field - Wikipedia"}}