{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGeosynchronous orbit - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tGeosynchronous orbit\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tOrbit keeping the satellite at a fixed longitude above the equator\n\n  \nAnimation showing geosynchronous satellite orbiting the Earth.\n\n\n\nA geosynchronous orbit (sometimes abbreviated GSO) is an orbit around Earth of a satellite with an orbital period that matches Earth's rotation on its axis, which takes one sidereal day (about 23 hours, 56 minutes, and 4 seconds).[1] The synchronization of rotation and orbital period means that, for an observer on Earth's surface, an object in geosynchronous orbit returns to exactly the same position in the sky after a period of one sidereal day. Over the course of a day, the object's position in the sky may remain still or trace out a path, typically in a figure-8 form,[citation needed] whose precise characteristics depend on the orbit's inclination and eccentricity. Satellites are typically launched in an eastward direction. A circular geosynchronous orbit is 35,786 km (22,236 mi) above Earth's surface. Those closer to Earth orbit faster than Earth rotates, so from Earth, they appear to move eastward while those that orbit beyond geosynchronous distances appear to move westward. \n\nA special case of geosynchronous orbit is the geostationary orbit, which is a circular geosynchronous orbit in Earth's equatorial plane (that is, directly above the Equator). A satellite in a geostationary orbit appears stationary, always at the same point in the sky, to observers on the surface. Popularly or loosely, the term geosynchronous may be used to mean geostationary.[2] Specifically, geosynchronous Earth orbit (GEO) may be a synonym for geosynchronous equatorial orbit,[3] or geostationary Earth orbit.[4] Communications satellites are often given geostationary or close to geostationary orbits so that the satellite antennas that communicate with them do not have to move, but can be pointed permanently at the fixed location in the sky where the satellite appears.\n\nA semi-synchronous orbit has an orbital period of half a sidereal day (i.e., 11 hours and 58 minutes). Relative to Earth's surface, it has twice this period and hence appears to go around Earth once every day. Examples include the Molniya orbit and the orbits of the satellites in the Global Positioning System.\n\n\nContents\n\n\n\t1 Orbital characteristics\n\t2 Geostationary orbit\n\t3 Other geosynchronous orbits\n\t4 Other synchronous orbits\n\t5 History\n\t6 See also\n\t7 References\n\t8 External links\n\n\n\n\n\nOrbital characteristics[edit]\n\nCircular Earth geosynchronous orbits have a radius of 42,164 km (26,199 mi). All Earth geosynchronous orbits, whether circular or elliptical, have the same semi-major axis.[5] In fact, orbits with the same period always share the same semi-major axis:\n\n\n\t\n  \n    \n      \n        a\n        =\n        \n          \n            \n              \n                \n                  (\n                  \n                    \n                      P\n                      \n                        2\n                        π\n                      \n                    \n                  \n                  )\n                \n                \n                  2\n                \n              \n              μ\n            \n            \n              3\n            \n          \n        \n      \n    \n    {\\displaystyle a={\\sqrt[{3}]{\\left({\\frac {P}{2\\pi }}\\right)^{2}\\mu }}}\n  \n\n\n\nwhere a is the semi-major axis, P is the orbital period, and μ is the geocentric gravitational constant, equal to 398,600.4418 km3/s2.\n\nIn the special case of a geostationary orbit, the ground track of a satellite is a single point on the equator. In the general case of a geosynchronous orbit with a non-zero inclination or eccentricity, the ground track is a more or less distorted figure-eight, returning to the same places once per sidereal day.\n\n\nGeostationary orbit[edit]\n\nMain article: Geostationary orbit\n\n  \nA geostationary satellite above a marked spot on the Equator. An observer on the marked spot sees the satellite remain directly overhead, unlike other celestial objects, which sweep across the sky.\n\n\n\nA geostationary equatorial orbit (GEO) is a circular geosynchronous orbit in the plane of the Earth's equator with a radius of approximately 42,164 km (26,199 mi) (measured from the center of the Earth). A satellite in such an orbit is at an altitude of approximately 35,786 km (22,236 mi) above mean sea level. It maintains the same position relative to the Earth's surface. If one could see a satellite in geostationary orbit, it would appear to hover at the same point in the sky, i.e., not exhibit diurnal motion, while the Sun, Moon, and stars would traverse the skies behind it. The theoretical basis for this novel phenomenon of the sky goes back to Newton's theory of motion and gravity. In that theory, the existence of a geostationary satellite is made possible because the Earth rotates (with respect to an inertial frame in which Newton's laws of motion and gravity hold). However, as a practical device, the geostationary satellite owes much for its realisation to Arthur C. Clarke who proposed it during the 20th century and in whose honour the orbit is called the Clarke orbit. Such orbits are useful for telecommunications satellites.\n\nA perfectly stable geostationary orbit is an ideal that can only be approximated. In practice the satellite drifts out of this orbit because of perturbations such as the solar wind, radiation pressure, variations in the Earth's gravitational field, and the gravitational effect of the Moon and Sun, and thrusters are used to maintain the orbit in a process known as station-keeping.\n\n\nOther geosynchronous orbits[edit]\n\nElliptical geosynchronous orbits are used in communications satellites to keep the satellite in view of its assigned ground stations and receivers. A satellite in an elliptical geosynchronous orbit appears to oscillate in the sky from the viewpoint of a ground station, tracing an analemma in the sky. Satellites in highly elliptical orbits must be tracked by steerable ground stations.\n\nThe Infrared Space Observatory was in a highly elliptical geosynchronous orbit with an orbital height of apogee 70,600 km and perigee 1,000 km.  It was controlled by two ground stations.\n\nNAVIC is a regional — i.e. non-global — Indian navigation system currently operating with 7 satellites, of which 3 are in geostationary orbit and 4 in geosynchronous orbit.\n\nThe Quasi-Zenith Satellite System (QZSS) is a three-satellite regional time transfer system and enhancement for GPS, covering Japan at high elevation from a Tundra orbit.\n\nAn active geosynchronous orbit is a hypothetical orbit that could be maintained if forces other than gravity were also used, such as a solar sail. Such a statite could be geosynchronous in an orbit different (higher, lower, more or less elliptical, or some other path) from the conic section orbit dictated by the laws of gravity.\n\nA further form of geosynchronous orbit is proposed for the theoretical space elevator, in which one end of the structure is tethered to the ground, maintaining a shorter orbital period than by gravity alone if under tension.\n\nOther related orbit types are:\n\n\n\tSupersynchronous orbit: a disposal / storage orbit above GSO/GEO.  Satellites drift in a westerly direction.\n\tSubsynchronous orbit: a drift orbit close to but below GSO/GEO.  Used for satellites undergoing station changes in an eastern direction.\n\tGraveyard orbit: a supersynchronous orbit where spacecraft are intentionally placed at the ends of their operational lives.\n\n\nOther synchronous orbits[edit]\n\nMain article: Synchronous orbit\n\n  \nSyncom 2\n\n\n\nSynchronous orbits can only exist for bodies that have a fixed surface (e.g. moons, rocky planets).  Without such a surface (e.g. gas giants, black holes) there is no fixed point an orbit can be said to synchronise with.  No synchronous orbit exists if the body rotates so slowly that the orbit would be outside its Hill sphere, or so quickly that it would be inside the body.  Large bodies held together by gravity cannot rotate that quickly, since they would fly apart, so the last condition only applies to small bodies held together by other forces, e.g. smaller asteroids.  Most inner moons of planets have synchronous rotation, so their synchronous orbits are, in practice, limited to their leading and trailing (L4 and L5) Lagrange points, as well as the L1 and L2 Lagrange points, assuming they do not fall within the body of the moon. Objects with chaotic rotations, such as exhibited by Hyperion, are also problematic, as their synchronous orbits change unpredictably.\n\n\nHistory[edit]\n\n  \nAuthor Arthur C. Clarke\n\n\n\nAuthor Arthur C. Clarke is credited with proposing the notion of using a geostationary orbit for communications satellites.[6] The orbit is also known as the Clarke Orbit.  Together, the collection of artificial satellites in these orbits is known as the Clarke Belt.\n\nThe first communications satellite placed in a geosynchronous orbit was Syncom 2, launched in 1963. However, it was in an inclined orbit, still requiring the use of moving antennas.  The first communications satellite placed in a geostationary orbit was Syncom 3.  Geostationary orbits have been in common use ever since, in particular for satellite television.\n\nGeostationary satellites also carry international telephone traffic but they are being replaced by fiber optic cables in heavily populated areas and along the coasts of less developed regions, because of the greater bandwidth available and lower latency, due to the inherent disconcerting delay in communicating via a satellite in such a high orbit. It takes electromagnetic waves about a quarter of a second to travel from one end to the other end of the link. Thus, two parties talking via satellite are subject to about a half second delay in a round-trip message/response sequence.\n\nAlthough many populated land locations on the planet now have terrestrial communications facilities (microwave, fiber-optic), even undersea, with more than sufficient capacity,  telephone and Internet access is still available only via satellite in many places in Africa, Latin America, and Asia, as well as isolated locations that have no terrestrial facilities, such as Canada's Arctic islands, Antarctica, the far reaches of Alaska and Greenland, and ships at sea.\n\n\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\tGeostationary orbit\n\tGeosynchronous satellite\n\tGraveyard orbit\n\tHigh Earth orbit\n\tList of orbits\n\tList of satellites in geosynchronous orbit\n\tLow Earth orbit\n\tMedium Earth orbit\n\tMolniya orbit\n\n\nReferences[edit]\n\n\n\t^ V. Chobotov, ed. (1996). Orbital Mechanics (2nd ed.). AIAA Education Series. p. 304.\n\n\t^ Brown, C. D. (1998). Spacecraft Mission Design (2nd ed.). AIAA Education Series. p. 81.\n\n\n\t^ \"Ariane 5 User's Manual Issue 5 Revision 1\" (PDF). Ariane Space. July 2011. Archived from the original (PDF) on 4 October 2013. Retrieved 28 July 2013.\n\n\n\t^ \n\"What is orbit?\". NASA. October 25, 2001. Retrieved 2013-03-10. Satellites that seem to be attached to some location on Earth are in Geosynchronous Earth Orbit (GEO)...Satellites headed for GEO first go to an elliptical orbit with an apogee about 23,000 miles. Firing the rocket engines at apogee then makes the orbit round. Geosynchronous orbits are also called geostationary.\n\n\n\t^ \nVallado, David A. (2007). Fundamentals of Astrodynamics and Applications. Hawthorne, CA: Microcosm Press. p. 31.\n\n\n\t^ A. C. Clarke, \"Extra-Terrestrial Relays\", Wireless World, Vol. 51, No. 10, pp. 305–308, 1945\n\n\n\n\n\nExternal links[edit]\n\n\tSatellites currently in Geosynchronous Orbit, list updated daily\n\tScience@NASA – Geosynchronous Orbit\n\tNASA – Planetary Orbits\n\tScience Presse data on Geosynchronous Orbits (including historical data and launch statistics)\n\tORBITAL MECHANICS (Rocket and Space Technology)\n\tfils.html[permanent dead link]\n\tNASA Astronomy Picture of the Day: Time lapse of Geostationary Satellites Beyond the Alps (11 April 2012)\n\n\n\t\tv\n\tt\n\te\n\n\nGravitational orbits\n\n\tTypes\t\n\tGeneral\t\n\tBox\n\tCapture\n\tCircular\n\tElliptical / Highly elliptical\n\tEscape\n\tHorseshoe\n\tHyperbolic trajectory\n\tInclined / Non-inclined\n\tLagrangian point\n\tOsculating\n\tParabolic trajectory\n\tParking\n\tSynchronous\n\tsemi\n\tsub\n\n\n\tTransfer orbit\n\n\n\n\n\tGeocentric\t\n\tGeosynchronous\n\tGeostationary\n\tGeostationary transfer\n\n\n\tGraveyard\n\tHigh Earth\n\tLow Earth\n\tMedium Earth\n\tMolniya\n\tNear-equatorial\n\tOrbit of the Moon\n\tPolar\n\tSun-synchronous\n\tTundra\n\n\n\n\n\tAbout other points\t\n\tMars\n\tAreosynchronous\n\tAreostationary\n\n\n\tLagrange points\n\tHalo\n\tLissajous\n\n\n\tLunar\n\tSun\n\tHeliocentric\n\tEarth's orbit\n\n\n\tHeliosynchronous\n\n\n\n\n\n\n\n\n\n\tParameters\t\n\t\tShape\n\tSize\n\n\n\t\n\te  Eccentricity\n\ta  Semi-major axis\n\tb  Semi-minor axis\n\tQ, q  Apsides\n\n\n\n\n\tOrientation\t\n\ti  Inclination\n\tΩ  Longitude of the ascending node\n\tω  Argument of periapsis\n\tϖ  Longitude of the periapsis\n\n\n\n\n\tPosition\t\n\tM  Mean anomaly\n\tν, θ, f  True anomaly\n\tE  Eccentric anomaly\n\tL  Mean longitude\n\tl  True longitude\n\n\n\n\n\tVariation\t\n\tT  Orbital period\n\tn  Mean motion\n\tv  Orbital speed\n\tt0  Epoch\n\n\n\n\n\n\n\n\tManeuvers\t\n\tBi-elliptic transfer\n\tCollision avoidance (spacecraft)\n\tDelta-v\n\tDelta-v budget\n\tGravity assist\n\tGravity turn\n\tHohmann transfer\n\tInclination change\n\tLow energy transfer\n\tOberth effect\n\tPhasing\n\tRocket equation\n\tRendezvous\n\tTransposition, docking, and extraction\n\n\n\n\n\tOrbital mechanics\t\n\tCelestial coordinate system\n\tCharacteristic energy\n\tEscape velocity\n\tEphemeris\n\tEquatorial coordinate system\n\tGround track\n\tHill sphere\n\tInterplanetary Transport Network\n\tKepler's laws of planetary motion\n\tLagrangian point\n\tn-body problem\n\tOrbit equation\n\tOrbital state vectors\n\tPerturbation\n\tRetrograde motion\n\tSpecific orbital energy\n\tSpecific relative angular momentum\n\tTwo-line elements\n\n\n\n\n\t\n\tList of orbits\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpaceflight\n\n\tGeneral\t\n\tAstrodynamics\n\tHistory\n\tTimeline\n\tSpace Race\n\tAsian Space Race\n\tRecords\n\tAccidents and incidents\n\n\n\tSpace policy\n\tAustralia\n\tChina\n\tEuropean Union\n\tIndia\n\tJapan\n\tRussia\n\tSoviet Union\n\tUnited States\n\n\n\tSpace law\n\tOuter Space Treaty\n\tRescue Agreement\n\tSpace Liability Convention\n\tRegistration Convention\n\tMoon Treaty\n\n\n\tPrivate spaceflight\n\n\n\n\t\n\n\tApplications\t\n\tAstronomy\n\tEarth observation\n\tArchaeology\n\tImagery and mapping\n\tReconnaissance\n\tWeather and environment monitoring\n\n\n\tSatellite communications\n\tInternet\n\tRadio\n\tTelephone\n\tTelevision\n\n\n\tSatellite navigation\n\tCommercial use of space\n\tSpace launch market competition\n\tMilitarisation of space\n\tSpace architecture\n\tSpace exploration\n\tSpace research\n\tSpace technology\n\tSpace weather\n\n\n\n\n\tHuman spaceflight\t\n\tGeneral\t\n\tAstronaut\n\tcommercial\n\n\n\tLife support system\n\tAnimals in space\n\tBioastronautics\n\tSpace suit\n\n\n\tExtravehicular activity\n\tWeightlessness\n\tSpace toilet\n\tSpace tourism\n\tSpace colonization\n\n\n\n\n\tPrograms\t\n\tVostok\n\tMercury\n\tVoskhod\n\tGemini\n\tSoyuz\n\tApollo\n\tSkylab\n\tApollo–Soyuz\n\n\n\tSpace Shuttle\n\tMir\n\tShuttle–Mir\n\n\n\tInternational Space Station\n\tShenzhou\n\tTiangong\n\n\n\n\n\tHealth issues\t\n\tEffect of spaceflight on the human body\n\tSpace adaptation syndrome\n\n\n\tHealth threat from cosmic rays\n\tSpace psychology\n\tPsychological and sociological effects\n\n\n\tSpace and survival\n\tSpace medicine\n\tSpace nursing\n\n\n\n\n\n\n\n\tSpacecraft\t\n\tLaunch vehicle\n\tRocket\n\tSpaceplane\n\tRobotic spacecraft\n\tSatellite\n\tSpace probe\n\tLander\n\tRover\n\tSelf-replicating spacecraft\n\tSpace telescope\n\n\n\tSpacecraft propulsion\n\tRocket engine\n\tElectric propulsion\n\tSolar sail\n\tGravity assist\n\n\n\n\n\n\n\tDestinations\t\n\tSub-orbital\n\tOrbital\n\tGeocentric\n\tGeosynchronous\n\n\n\tInterplanetary\n\tInterstellar\n\tIntergalactic\n\n\n\n\n\tSpace launch\t\n\tDirect ascent\n\tEscape velocity\n\tExpendable and reusable launch systems\n\tLaunch pad\n\tNon-rocket spacelaunch\n\tSpaceport\n\n\n\n\n\tGround segment\t\n\tFlight controller\n\tGround station\n\tPass\n\tMission control center\n\n\n\n\n\tSpace agencies\t\n\t CoNAE\n\t ASA\n\t AEB\n\t CSA\n\t CNSA\n\t ESA\n\t CNES\n\t DLR\n\t ISRO\n\t LAPAN\n\t ISA\n\t ISA\n\t ASI\n\t AEM\n\t JAXA\n\t NADA\n\t KARI\n\t SUPARCO\n\t Roscosmos\n\t SNSA\n\t SSAU\n\t UKSA\n\t NASA\n\n\n\n\n\t\n\t  Category\n\t  Portal\n\t  WikiProject\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Geosynchronous_orbit&oldid=916671306\"\n\n\t\t\n\t\tCategories: \tArtificial satellites in geosynchronous orbit\n\tEarth orbits\n\tSatellite broadcasting\n\n\nHidden categories: \tArticles with short description\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from April 2019\n\tAll articles with dead external links\n\tArticles with dead external links from November 2017\n\tArticles with permanently dead external links\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tБългарски\n\tBrezhoneg\n\tCatalà\n\tČeština\n\tDeutsch\n\tΕλληνικά\n\tEspañol\n\tفارسی\n\tFrançais\n\tGaeilge\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tҚазақша\n\tLëtzebuergesch\n\tLietuvių\n\tMagyar\n\tBahasa Melayu\n\t日本語\n\tNorsk\n\tPolski\n\tPortuguês\n\tРусский\n\tSimple English\n\tСрпски / srpski\n\tSunda\n\tதமிழ்\n\tతెలుగు\n\tไทย\n\tTürkçe\n\tУкраїнська\n\t吴语\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 20 September 2019, at 01:38 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Geosynchronous orbit - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Geosynchronous_orbit.gif", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-geosynchronous_orbit", "title": "Geosynchronous orbit - Wikipedia"}}