{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGravity assist - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tGravity assist\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Gravitational slingshot)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tFor powered flybys, see Oberth effect.\n\n\nAnimation of Voyager 1's trajectory from 5 September 1977 to 30 December 1981 \n   Voyager 1 ·   Earth ·   Jupiter ·   Saturn ·   Sun\n\n\n\nAnimation of Voyager 2's trajectory from 20 August 1977 to 30 December 2000 \n   Voyager 2 ·   Earth ·   Jupiter ·   Saturn ·   Uranus ·   Neptune ·   Sun\n\n\n\n\n\n\tPart of a series on\n\tAstrodynamics\n\t\n\t\nOrbital mechanics\n\n\t\nOrbital parameters\n\n\tApsis\n\tArgument of periapsis\n\tAzimuth\n\tEccentricity\n\tInclination\n\tMean anomaly\n\tOrbital nodes\n\tSemi-major axis\n\tTrue anomaly\n\n\n\n\n\t\nTypes of two-body orbits, by \neccentricity\n\n\tCircular orbit\n\tElliptic orbit\n\n\nTransfer orbit \t(Hohmann transfer orbit\n\tBi-elliptic transfer orbit)\n\n\n\n\n\tParabolic orbit\n\tHyperbolic orbit\n\tRadial orbit\n\tDecaying orbit\n\n\n\n\n\t\nEquations\n\n\tDynamical friction\n\tEscape velocity\n\tKepler's equation\n\tKepler's laws of planetary motion\n\tOrbital period\n\tOrbital velocity\n\tSurface gravity\n\tSpecific orbital energy\n\tVis-viva equation\n\n\n\n\n\t\nCelestial mechanics\n\n\t\nGravitational influences\n\n\tBarycenter\n\tHill sphere\n\tPerturbations\n\tSphere of influence\n\n\n\n\n\t\nN-body orbits\nLagrangian points \t(Halo orbits)\n\n\n\n\n\tLissajous orbits\n\tLyapunov orbits\n\n\n\n\n\t\nEngineering and efficiency\n\n\t\nPreflight engineering\n\n\tMass ratio\n\tPayload fraction\n\tPropellant mass fraction\n\tTsiolkovsky rocket equation\n\n\n\n\n\t\nEfficiency measures\n\n\tGravity assist\n\tOberth effect\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nIn orbital mechanics and aerospace engineering, a gravitational slingshot, gravity assist maneuver, or swing-by is the use of the relative movement (e.g. orbit around the Sun) and gravity of a planet or other astronomical object to alter the path and speed of a spacecraft, typically to save propellant and reduce expense.\n\nGravity assistance can be used to accelerate a spacecraft, that is, to increase or decrease its speed or redirect its path. The \"assist\" is provided by the motion of the gravitating body as it pulls on the spacecraft.[1] The gravity assist maneuver was first used in 1959 when the Soviet probe Luna 3 photographed the far side of Earth's Moon and it was used by interplanetary probes from Mariner 10 onwards, including the two Voyager probes' notable flybys of Jupiter and Saturn.\n\n\nContents\n\n\n\t1 Explanation\n\t2 Historical origins\n\t3 Purpose\n\t4 Limits\n\t5 Tisserand parameter and gravity assists\n\t6 Timeline of notable examples\n\t6.1 Luna 3\n\t6.2 Mariner 10\n\t6.3 Voyager 1\n\t6.4 Galileo\n\t6.5 Ulysses\n\t6.6 MESSENGER\n\t6.7 Cassini\n\t6.8 Rosetta\n\t6.9 Juno\n\t6.10 Parker Solar Probe\n\t6.11 BepiColombo\n\n\n\n\t7 See also\n\t8 References\n\t9 External links\n\n\n\n\n\nExplanation[edit]\n\n  \nExample encounter.[2]\nIn the planet's frame of reference, the space probe leaves with the exact same speed at which it had arrived.  But when observed in the reference frame of the Solar System (fixed to the Sun), the benefit of this maneuver becomes apparent.  Here it can be seen how the probe gains speed by tapping energy from the speed of the planet as it orbits the Sun.  (If the trajectory is designed to pass in front of the planet instead of behind it, the gravity assist can be used as a braking maneuver rather than accelerating.)  Because the mass of the probe is many orders of magnitude smaller than that of the planet, while the result on the probe is quite significant, the deceleration reaction experienced by the planet, according to Newton's third law, is utterly imperceptible.\n\n\n\n  \nPossible outcomes of a gravity assist maneuver depending on the velocity vector and flyby position of the incoming spacecraft\n\n\n\nA gravity assist around a planet changes a spacecraft's velocity (relative to the Sun) by entering and leaving the gravitational sphere of influence of a planet. The spacecraft's speed increases as it approaches the planet and decreases while escaping its gravitational pull (which is approximately the same), but because the planet orbits the Sun the spacecraft is affected by this motion during the maneuver. To increase speed, the spacecraft flies with the movement of the planet, acquiring some of the planet's orbital energy in the process; to decrease speed, the spacecraft flies against the movement of the planet to transfer some of its own orbital energy to the planet - in both types of maneuver the energy transfer compared to the planet's total orbital energy will be negligible. The sum of the kinetic energies of both bodies remains constant (see elastic collision). A slingshot maneuver can therefore be used to change the spaceship's trajectory and speed relative to the Sun.\n\nA close terrestrial analogy is provided by a tennis ball bouncing off the front of a moving train.  Imagine standing on a train platform, and throwing a ball at 30 km/h toward a train approaching at 50 km/h.  The driver of the train sees the ball approaching at 80 km/h and then departing at 80 km/h after the ball bounces elastically off the front of the train.  Because of the train's motion, however, that departure is at 130 km/h relative to the train platform; the ball has added twice the train's velocity to its own.\n\nTranslating this analogy into space: in the planet reference frame, the spaceship has a vertical velocity of v relative to the planet. After the slingshot occurs the spaceship is leaving on a course 90 degrees to that which it arrived on. It will still have a velocity of v, but in the horizontal direction.[2] In the Sun reference frame, the planet has a horizontal velocity of v, and by using the Pythagorean Theorem, the spaceship initially has a total velocity of √2v. After the spaceship leaves the planet, it will have a velocity of v + v = 2v, gaining around 0.6v.[2]\n\nThis oversimplified example is impossible to refine without additional details regarding the orbit, but if the spaceship travels in a path which forms a hyperbola, it can leave the planet in the opposite direction without firing its engine. This example is also one of many trajectories and gains of speed the spaceship can have.\n\nThis explanation might seem to violate the conservation of energy and momentum, apparently adding velocity to the spacecraft out of nothing, but the spacecraft's effects on the planet must also be taken into consideration to provide a complete picture of the mechanics involved.  The linear momentum gained by the spaceship is equal in magnitude to that lost by the planet, so the spacecraft gains velocity and the planet loses velocity. However, the planet's enormous mass compared to the spacecraft makes the resulting change in its speed negligibly small even when strictly compared to the orbital perturbations planets undergo due to interactions with other celestial bodies on astronomically short timescales. For example, one metric ton is a typical mass for an interplanetary space probe whereas Jupiter has a mass of almost 2 x 1024 metric tons. Therefore, a one-ton spacecraft passing Jupiter will theoretically cause the planet to lose approximately 5 x 10−25 km/s of orbital velocity for every km/s of velocity relative to the Sun gained by the spacecraft. For all practical purposes, since the effects on the planet are so slight (because planets are so much more massive than spacecraft) they can be ignored in the calculation.[3]\n\nRealistic portrayals of encounters in space require the consideration of three dimensions.  The same principles apply, only adding the planet's velocity to that of the spacecraft requires vector addition, as shown below.\n\n\n  \nTwo-dimensional schematic of gravitational slingshot. The arrows show the direction in which the spacecraft is traveling before and after the encounter. The length of the arrows shows the spacecraft's speed.\n\n\n\n\nPlay media\n  \nA view from MESSENGER as it uses Earth as a gravitational slingshot to decelerate to allow insertion into an orbit around Mercury.\n\n\n\nDue to the reversibility of orbits, gravitational slingshots can also be used to reduce the speed of a spacecraft. Both Mariner 10 and MESSENGER performed this maneuver to reach Mercury.\n\nIf even more speed is needed than available from gravity assist alone, the most economical way to utilize a rocket burn is to do it near the periapsis (closest approach). A given rocket burn always provides the same change in velocity (Δv), but the change in kinetic energy is proportional to the vehicle's velocity at the time of the burn. So to get the most kinetic energy from the burn, the burn must occur at the vehicle's maximum velocity, at periapsis. Oberth effect describes this technique in more detail.\n\n\nHistorical origins[edit]\n\nIn his paper Тем кто будет читать, чтобы строить (To those who will be reading [this paper] in order to build [an interplanetary rocket]),[4] published in 1938 but dated 1918–1919,[5] Yuri Kondratyuk suggested that a spacecraft traveling between two planets could be accelerated at the beginning and end of its trajectory by using the gravity of the two planets' moons.  In his 1925 paper \"Проблема полета при помощи реактивных аппаратов: межпланетные полеты\" [Problems of flight by jet propulsion:  interplanetary flights],[6] Friedrich Zander and  Guido von Pirquet made a similar argument.\n\nThe gravity assist maneuver was first used in 1959 when the Soviet probe Luna 3 photographed the far side of Earth's Moon.  The maneuver relied on research performed under the direction of Mstislav Keldysh at the Steklov Institute of Mathematics[7] by, amongst others, Vsevolod Alexandrovich Egorov.[8][9]\n\n\nPurpose[edit]\n\n  \nPlot of Voyager 2's heliocentric velocity against its distance from the Sun, illustrating the use of gravity assist to accelerate the spacecraft by Jupiter, Saturn and Uranus. To observe Triton, Voyager 2 passed over Neptune's north pole resulting in an acceleration out of the plane of the ecliptic and reduced velocity away from the Sun.[1]\n\n\n\nA spacecraft traveling from Earth to an inner planet will increase its relative speed because it is falling toward the Sun, and a spacecraft traveling from Earth to an outer planet will decrease its speed because it is leaving the vicinity of the Sun.\n\nAlthough the orbital speed of an inner planet is greater than that of the Earth, a spacecraft traveling to an inner planet, even at the minimum speed needed to reach it, is still accelerated by the Sun's gravity to a speed notably greater than the orbital speed of that destination planet. If the spacecraft's purpose is only to fly by the inner planet, then there is typically no need to slow the spacecraft. However, if the spacecraft is to be inserted into orbit about that inner planet, then there must be some way to slow it down.\n\nSimilarly, while the orbital speed of an outer planet is less than that of the Earth, a spacecraft leaving the Earth at the minimum speed needed to travel to some outer planet is slowed by the Sun's gravity to a speed far less than the orbital speed of that outer planet. Thus, there must be some way to accelerate the spacecraft when it reaches that outer planet if it is to enter orbit about it. However, if the spacecraft is accelerated to more than the minimum required, less total propellant will be needed to enter orbit about the target planet.[clarification needed][dubious  – discuss] In addition, accelerating the spacecraft early in the flight reduces the travel time.\n\nRocket engines can certainly be used to increase and decrease the speed of the spacecraft. However, rocket thrust takes propellant, propellant has mass, and even a small change in velocity (known as Δv, or \"delta-v\", the delta symbol being used to represent a change and \"v\" signifying velocity) translates to a far larger requirement for propellant needed to escape Earth's gravity well. This is because not only must the primary-stage engines lift the extra propellant, they must also lift the extra propellant beyond that which is needed to lift that additional propellant. Thus the liftoff mass requirement increases exponentially with an increase in the required delta-v of the spacecraft.\n\nBecause additional fuel is needed to lift fuel into space, space missions are designed with a tight propellant \"budget\", known as the \"delta-v budget\". The delta-v budget is in effect the total propellant that will be available after leaving the earth, for speeding up, slowing down, stabilization against external buffeting (by particles or other external effects), or direction changes, if it cannot acquire more propellant. The entire mission must be planned within that capability. Therefore, methods of speed and direction change that do not require fuel to be burned are advantageous, because they allow extra maneuvering capability and course enhancement, without spending fuel from the limited amount which has been carried into space. Gravity assist maneuvers can greatly change the speed of a spacecraft without expending propellant, and can save significant amounts of propellant, so they are a very common technique to save fuel.\n\n\nLimits[edit]\n\n  \nThe trajectories that enabled NASA's twin Voyager spacecraft to tour the four giant planets and achieve velocity to escape the Solar System\n\n\n\nThe main practical limit to the use of a gravity assist maneuver is that planets and other large masses are seldom in the right places to enable a voyage to a particular destination. For example, the Voyager missions which started in the late 1970s were made possible by the \"Grand Tour\" alignment of Jupiter, Saturn, Uranus and Neptune. A similar alignment will not occur again until the middle of the 22nd century. That is an extreme case, but even for less ambitious missions there are years when the planets are scattered in unsuitable parts of their orbits.\n\nAnother limitation is the atmosphere, if any, of the available planet. The closer the spacecraft can approach, the faster its periapsis speed as gravity accelerates the spacecraft, allowing for more kinetic energy to be gained from a rocket burn. However, if a spacecraft gets too deep into the atmosphere, the energy lost to drag can exceed that gained from the planet's gravity. On the other hand, the atmosphere can be used to accomplish aerobraking.  There have also been theoretical proposals to use aerodynamic lift as the spacecraft flies through the atmosphere. This maneuver, called an aerogravity assist, could bend the trajectory through a larger angle than gravity alone, and hence increase the gain in energy.\n\nEven in the case of an airless body, there is a limit to how close a spacecraft may approach. The magnitude of the achievable change in velocity depends on the spacecraft's approach velocity and the planet's escape velocity at the point of closest approach (limited by either the surface or the atmosphere.)\n\nInterplanetary slingshots using the Sun itself are not possible because the Sun is at rest relative to the Solar System as a whole. However, thrusting when near the Sun has the same effect as the powered slingshot described as the Oberth effect. This has the potential to magnify a spacecraft's thrusting power enormously, but is limited by the spacecraft's ability to resist the heat.\n\nAn interstellar slingshot using the Sun is conceivable, involving for example an object coming from elsewhere in our galaxy and swinging past the Sun to boost its galactic travel. The energy and angular momentum would then come from the Sun's orbit around the Milky Way.  This concept features prominently in Arthur C. Clarke's 1972 award-winning novel Rendezvous With Rama; his story concerns an interstellar spacecraft that uses the Sun to perform this sort of maneuver, and in the process alarms many nervous humans.\n\nA rotating black hole might provide additional assistance, if its spin axis is aligned the right way. General relativity predicts that a large spinning mass produces frame-dragging—close to the object, space itself is dragged around in the direction of the spin. Any ordinary rotating object produces this effect. Although attempts to measure frame dragging about the Sun have produced no clear evidence, experiments performed by Gravity Probe B have detected frame-dragging effects caused by Earth.[10] General relativity predicts that a spinning black hole is surrounded by a region of space, called the ergosphere, within which standing still (with respect to the black hole's spin) is impossible, because space itself is dragged at the speed of light in the same direction as the black hole's spin. The Penrose process may offer a way to gain energy from the ergosphere, although it would require the spaceship to dump some \"ballast\" into the black hole, and the spaceship would have had to expend energy to carry the \"ballast\" to the black hole.\n\n\nTisserand parameter and gravity assists[edit]\n\nThe use of gravity assists is constrained by a conserved quantity called the Tisserand parameter (or invariant). This is an approximation to the Jacobi constant of the restricted three-body problem. Considering the case a comet orbiting the Sun and the effects a Jupiter encounter would have, Félix Tisserand showed that\n\n\n\t\n  \n    \n      \n        \n          T\n          \n            P\n          \n        \n         \n        =\n        \n          \n            \n              a\n              \n                J\n              \n            \n            a\n          \n        \n        +\n        2\n        ⋅\n        \n          \n            \n              \n                a\n                \n                  a\n                  \n                    J\n                  \n                \n              \n            \n            (\n            1\n            −\n            \n              e\n              \n                2\n              \n            \n            )\n          \n        \n        cos\n        ⁡\n        i\n      \n    \n    {\\displaystyle T_{P}\\ ={\\frac {a_{J}}{a}}+2\\cdot {\\sqrt {{\\frac {a}{a_{J}}}(1-e^{2})}}\\cos i}\n  \n\n\n\nwill remain constant (where \n  \n    \n      \n        a\n        \n        \n      \n    \n    {\\displaystyle a\\,\\!}\n  \n is the comet's semi-major axis, \n  \n    \n      \n        e\n        \n        \n      \n    \n    {\\displaystyle e\\,\\!}\n  \n its eccentricity, \n  \n    \n      \n        i\n        \n        \n      \n    \n    {\\displaystyle i\\,\\!}\n  \n its inclination, and \n  \n    \n      \n        \n          a\n          \n            J\n          \n        \n      \n    \n    {\\displaystyle a_{J}}\n  \n is the semi-major axis of Jupiter).\nThis applies when the comet is sufficiently far from Jupiter to have well-defined orbital elements and to the extent that Jupiter is much less massive than the Sun and on a circular orbit.\n\nThis quantity is conserved for any system of three objects, one of which has negligible mass.and another of which is of intermediate mass and on a circular orbit. Examples are the Sun, Earth and a spacecraft, or Saturn, Titan and the Cassini spacecraft (using the semi-major axis of the perturbing body instead of  \n  \n    \n      \n        \n          a\n          \n            J\n          \n        \n      \n    \n    {\\displaystyle a_{J}}\n  \n). This imposes a constraint on how a gravity assist may be used to alter a spacecraft's orbit.\n\nThe Tisserand parameter will change if the spacecraft makes a propulsive maneuver or a gravity assist of some fourth object, which is one reason that many spacecraft frequently combine Earth and Venus (or Mars) gravity assists or also perform large deep space maneuvers.\n\n\nTimeline of notable examples[edit]\n\nLuna 3[edit]\n\nThe gravity assist maneuver was first used in 1959 when Luna 3 photographed the far side of Earth's Moon.\n\n\nMariner 10[edit]\n\nThe Mariner 10 probe was the first spacecraft to use the gravitational slingshot effect to reach another planet, passing by Venus on 5 February 1974 on its way to becoming the first spacecraft to explore Mercury.\n\n\nVoyager 1[edit]\n\nAs of 21 July 2018[update], Voyager 1 is over 142.75 AU (21.36 billion km) from the Sun,[11] and is in interstellar space.[12] It gained the energy to escape the Sun's gravity completely by performing slingshot maneuvers around Jupiter and Saturn.[13]\n\n\nGalileo[edit]\n\n  \nAnimation of Galileo's trajectory from 19 October 1989 to 30 September 2003 \n   Galileo ·   Jupiter ·   Earth ·    Venus ·   951 Gaspra ·   243 Ida\n\n\n\nThe Galileo spacecraft was launched by NASA in 1989 aboard Space Shuttle Atlantis.  Its original mission was designed to use a direct Hohmann transfer. However, Galileo's intended booster, the cryogenically fueled Centaur booster rocket was prohibited as a Shuttle \"cargo\" for safety considerations following the loss of Space Shuttle Challenger. With its substituted solid rocket upper stage, the IUS, which could not provide as much delta-v, Galileo did not ascend directly to Jupiter, but flew by Venus once and Earth twice in order to reach Jupiter in December 1995.\n\nThe Galileo engineering review speculated (but was never able to prove conclusively) that this longer flight time coupled with the stronger sunlight near Venus caused lubricant in Galileo's main antenna to fail, forcing the use of a much smaller backup antenna with a consequent lowering of data rate from the spacecraft.\n\nIts subsequent tour of the Jovian moons also used numerous slingshot maneuvers with those moons to conserve fuel and maximize the number of encounters.\n\n\nUlysses[edit]\n\n  \nAnimation of Ulysses' trajectory from 6 October 1990 to 29 June 2009 \n   Ulysses ·   Earth ·   Jupiter ·   C/2006 P1 ·   C/1996 B2 ·   C/1999 T1\n\n\n\nIn 1990, NASA launched the ESA spacecraft Ulysses to study the polar regions of the Sun. All the planets orbit approximately in a plane aligned with the equator of the Sun. Thus, to enter an orbit passing over the poles of the Sun, the spacecraft would have to eliminate the 30 km/s speed it inherited from the Earth's orbit around the Sun and gain the speed needed to orbit the Sun in the pole-to-pole plane, tasks that are impossible with current spacecraft propulsion systems alone, making gravity assist maneuvers essential.\n\nAccordingly, Ulysses was first sent toward Jupiter and aimed to arrive at a point in space just ahead and south of the planet. As it passed Jupiter, the probe fell through the planet's gravity field, exchanging momentum with the planet. The gravity assist maneuver bent the probe's trajectory northward relative to the Ecliptic Plane onto an orbit which passes over the poles of the Sun. By using this maneuver, Ulysses needed only enough propellant to send it to a point near Jupiter, which is well within current capability.\n\n\nMESSENGER[edit]\n\n  \nAnimation of MESSENGER's trajectory from 3 August 2004 to 31 March 2011 \n   MESSENGER ·   Earth ·   Mercury ·   Venus\n\n\n\nThe MESSENGER mission (launched in August 2004) made extensive use of gravity assists to slow its speed before orbiting Mercury. The MESSENGER mission included\none flyby of Earth, two flybys of Venus, and three flybys of Mercury before finally arriving at Mercury in March 2011 with a velocity low enough to permit orbit insertion with available fuel. Although the flybys were primarily orbital maneuvers, each provided an opportunity for significant scientific observations.\n\n\nCassini[edit]\n\nThe Cassini–Huygens spacecraft passed by Venus twice, then Earth, and finally Jupiter on the way to Saturn. The 6.7-year transit was slightly longer than the six years needed for a Hohmann transfer, but cut the extra velocity (delta-v) needed to about 2 km/s, so that the large and heavy Cassini probe was able to reach Saturn, which would not have been possible in a direct transfer even with the Titan IV, the largest launch vehicle available at the time. A Hohmann transfer to Saturn would require a total of 15.7 km/s delta-v (disregarding Earth's and Saturn's own gravity wells, and disregarding aerobraking), which is not within the capabilities of current launch vehicles and spacecraft propulsion systems.\n\n\n\n\nCassini interplanetary trajectory\n\n\nAnimation of Cassini's trajectory from 15 October 1997 to 4 May 2008 \n   Cassini–Huygens ·   Jupiter ·   Saturn ·   Earth ·   Venus ·    2685 Masursky\n\n\nCassini's speed relative to the Sun. Gravity assists form peaks to the left, while periodic variations on the right are caused by the spacecraft's orbit around Saturn.\n\n\n\n\n\nAfter entering orbit around Saturn, the Cassini spacecraft used multiple Titan gravity assists to navigate through a complex orbital tour. A typical Titan encounter changed the spacecraft's velocity by 0.75 km/s, and the spacecraft made 127 Titan encounters. These encounters enabled an orbital tour with a wide range of periapsis and apoapsis distances, various alignments of the orbit with respect to the Sun, and orbital inclinations from 0° to 74°.\n\n\nRosetta[edit]\n\n  \nAnimation of Rosetta's trajectory from 2 March 2004 to 9 September 2016 \n   Rosetta ·   67P/C-G ·   Earth ·   Mars ·   21 Lutetia  ·   2867 Šteins\n\n\n\nThe Rosetta probe, launched in March 2004, used four gravity assist maneuvers (including one just 250 km from the surface of Mars) to accelerate throughout the inner Solar System. That enabled it to match the velocity of the 67P/Churyumov–Gerasimenko comet at the rendezvous point in August 2014.\n\n\nJuno[edit]\n\nThe Juno spacecraft was launched on August 5, 2011 (UTC). The trajectory used a gravity assist speed boost from Earth, accomplished by an Earth flyby in October 2013, two years after its launch on August 5, 2011.[14] In that way Juno changed its orbit (and speed) toward its final goal, Jupiter, after only five years.\n\n\n  \nAnimation of Juno's trajectory from August 5, 2011, to July 30, 2021\n  Juno ·   Earth ·   Mars ·   Jupiter\n\n\n\nParker Solar Probe[edit]\n\nNASA's Parker Solar Probe mission, launched in 2018, will use multiple gravity assists at Venus to remove the Earth's angular momentum from the orbit to drop to a distance of 8.5 solar radii (5.9 Gm) from the Sun. Parker Solar Probe's mission will be the closest approach to the Sun by any space mission.\n\n\nBepiColombo[edit]\n\n  \nAnimation of BepiColombo's trajectory from 20 October 2018 to 2 November 2025\n    BepiColombo ·   Earth ·   Venus ·   Mercury ·   Sun\nFor more detailed animation, See this video.\n\n\n\nBepiColombo is a joint mission of the European Space Agency (ESA) and the Japan Aerospace Exploration Agency (JAXA) to the planet Mercury. It was launched in 20 October 2018. It will use the gravity assist technique on Earth once, with Venus twice, and six times with Mercury (planet). BepiColombo is named after Giuseppe (Bepi) Colombo who was a pioneer thinker with this way of maneuvers.\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\t3753 Cruithne, an asteroid which periodically has gravitational slingshot encounters with Earth\n\tDelta-v budget\n\tLow-energy transfer, a type of gravitational assist where a spacecraft is gravitationally snagged into orbit by a celestial body. This method is usually executed in the Earth-Moon system.\n\tDynamical friction\n\tFlyby anomaly, an anomalous delta-v increase during gravity assists\n\tGravitational keyhole\n\tInterplanetary Transport Network\n\tn-body problem\n\tNew Horizons, a gravity-assisted mission (flying past Jupiter) that reached Pluto on 14 July 2015\n\tPioneer 10\n\tPioneer 11, a gravity-assisted mission (flying past Jupiter 1974-12-03) to reach Saturn in 1979\n\tPioneer H, first Out-Of-The-Ecliptic mission (OOE) proposed, for Jupiter and solar (Sun) observations\n\tSTEREO, a gravity-assisted mission which used Earth's Moon to eject two spacecraft from Earth's orbit into heliocentric orbit\n\n\nReferences[edit]\n\n\n\t^ a b \"Section 1: Environment, Chapter 4: Trajectories\". Basics of Space Flight. NASA. Retrieved 21 July 2018.\n\n\t^ a b c \"Gravity assist\". The Planetary Society. Retrieved 1 January 2017.\n\n\n\t^ Johnson, R. C. (January 2003). \"The slingshot effect\" (PDF). Durham University. Cite journal requires |journal= (help)\n\n\n\t^ Kondratyuk's paper is included in the book:  Mel'kumov, T. M., ed., Pionery Raketnoy Tekhniki [Pioneers of Rocketry:  Selected Papers] (Moscow, U.S.S.R.:  Institute for the History of Natural Science and Technology, Academy of Sciences of the USSR, 1964).  An English translation of Kondratyuk's paper was made by NASA.  See:  NASA Technical Translation F-9285, pages 15-56 (1 November 1965).\n\n\t^ In 1938, when Kondratyuk submitted his manuscript \"To whoever will read in order to build\" for publication, he dated the manuscript 1918–1919, although it was apparent that the manuscript had been revised at various times.  See page 49 of NASA Technical Translation F-9285 (1 November 1965).\n\n\t^ Zander's 1925 paper, \"Problems of flight by jet propulsion: interplanetary flights\", was translated by NASA.  See NASA Technical Translation F-147 (1964); specifically, Section 7:  Flight Around a Planet’s Satellite for Accelerating or Decelerating Spaceship, pages 290-292.\n\n\t^ Eneev, T.; Akim, E. \"Mstislav Keldysh. Mechanics of the space flight\" (in Russian). Keldysh Institute of Applied Mathematics.\n\n\n\t^ Egorov, Vsevolod Alexandrovich (September 1957). \"Specific problems of a flight to the moon\". Physics-Uspekhi. 63 (9): 73–117. doi:10.3367/UFNr.0063.195709f.0073.\n\n\n\t^ Rauschenbakh, Boris V.; Ovchinnikov, Michael Yu.; McKenna-Lawlor, Susan M. P. (2003). Essential Spaceflight Dynamics and Magnetospherics. Dordrecht, Netherlands: Kluwer Academic. pp. 146–147. ISBN 0-306-48027-1.\n\n\n\t^ Everitt, C. W. F.;  et al. (June 2011). \"Gravity Probe B: Final Results of a Space Experiment to Test General Relativity\". Physical Review Letters. 106 (22). 221101. arXiv:1105.3456. Bibcode:2011PhRvL.106v1101E. doi:10.1103/PhysRevLett.106.221101. PMID 21702590.\n\n\n\t^ \"Spacecraft escaping the Solar System\". Heavens-Above. 21 July 2018. Retrieved 21 July 2018.\n\n\n\t^ \"Interstellar Voyager\". NASA. Retrieved 26 June 2016.\n\n\n\t^ \"A Gravity Assist Primer\". Basics of Space Flight. NASA. Retrieved 21 July 2018.\n\n\n\t^ \"NASA's Shuttle and Rocket Launch Schedule\". NASA. Retrieved February 17, 2011.\n\n\n\n\n\n\nExternal links[edit]\n\n\t\tLook up gravity assist in Wiktionary, the free dictionary.\n\n\n\tBasics of Space Flight: A Gravity Assist Primer at NASA.gov\n\tSpaceflight and Spacecraft: Gravity Assist, discussion at Phy6.org\n\t\"Gravitational Slingshot\". MathPages.com.\n\n\tDouble-ball drop experiment\n\t\"Gravity-assist 'Slingshot', Background, principle, applications, Part 1 and 2\", on EEWorldoneline.com\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft propulsion\n\n\tChemical\nrockets\t\n\tState\t\n\tLiquid-propellant rocket\n\tSolid-propellant rocket\n\tHybrid-propellant rocket\n\n\n\n\n\tPropellants\t\n\tLiquid propellant\n\tCryogenic\n\tHypergolic\n\n\n\tMonopropellant\n\tBipropellant\n\tStaged combustion cycle\n\tExpander cycle\n\tGas-generator cycle\n\tTap-off cycle\n\tPressure-fed engine\n\tPump-fed engine\n\tElectric-pump-fed engine\n\n\n\tTripropellant\n\n\n\n\n\n\n\n\tElectrical\nthrusters\t\n\tElectrostatic\t\n\tColloid thruster\n\tIon thruster\n\tGridded\n\tHall-effect thruster\n\tField-emission electric propulsion\n\n\n\n\n\n\n\tElectromagnetic\t\n\tPulsed inductive thruster\n\tMagnetoplasmadynamic thruster\n\tElectrodeless plasma thruster\n\n\n\n\n\tElectrothermal\t\n\tPulsed plasma thruster\n\tHelicon double-layer thruster\n\tArcjet rocket\n\tResistojet rocket\n\tVASIMR\n\n\n\n\n\tOther\t\n\tAtmosphere-breathing electric propulsion\n\tHigh Power Electric Propulsion\n\tMagBeam\n\tMass driver\n\n\n\n\n\n\n\n\tNuclear\npropulsion\t\n\tClosed system\t\n\tDirect Fusion Drive\n\tNuclear electric rocket\n\tNuclear thermal rocket\n\tRadioisotope\n\tSalt-water\n\tGas core\n\t\"Lightbulb\"\n\n\n\n\n\n\n\tOpen system\t\n\tNuclear pulse propulsion\n\tAntimatter-catalyzed\n\n\n\tPulsed nuclear thermal rocket‎\n\tFusion rocket\n\tBussard ramjet\n\n\n\tFission-fragment rocket\n\tFission sail\n\n\n\tNuclear photonic rocket\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tBeam-powered propulsion\n\tCold gas thruster\n\tGravity assist\n\tSolar sail\n\tElectric sail\n\tMagnetic sail\n\n\n\tSolar thermal rocket\n\tTethers\n\tSteam thruster\n\n\n\n\n\tSpaceflight portal\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nGravitational orbits\n\n\tTypes\t\n\tGeneral\t\n\tBox\n\tCapture\n\tCircular\n\tElliptical / Highly elliptical\n\tEscape\n\tHorseshoe\n\tHyperbolic trajectory\n\tInclined / Non-inclined\n\tLagrangian point\n\tOsculating\n\tParabolic trajectory\n\tParking\n\tSynchronous\n\tsemi\n\tsub\n\n\n\tTransfer orbit\n\n\n\n\n\tGeocentric\t\n\tGeosynchronous\n\tGeostationary\n\tGeostationary transfer\n\n\n\tGraveyard\n\tHigh Earth\n\tLow Earth\n\tMedium Earth\n\tMolniya\n\tNear-equatorial\n\tOrbit of the Moon\n\tPolar\n\tSun-synchronous\n\tTundra\n\n\n\n\n\tAbout other points\t\n\tMars\n\tAreosynchronous\n\tAreostationary\n\n\n\tLagrange points\n\tHalo\n\tLissajous\n\n\n\tLunar\n\tSun\n\tHeliocentric\n\tEarth's orbit\n\n\n\tHeliosynchronous\n\n\n\n\n\n\n\n\n\n\tParameters\t\n\t\tShape\n\tSize\n\n\n\t\n\te  Eccentricity\n\ta  Semi-major axis\n\tb  Semi-minor axis\n\tQ, q  Apsides\n\n\n\n\n\tOrientation\t\n\ti  Inclination\n\tΩ  Longitude of the ascending node\n\tω  Argument of periapsis\n\tϖ  Longitude of the periapsis\n\n\n\n\n\tPosition\t\n\tM  Mean anomaly\n\tν, θ, f  True anomaly\n\tE  Eccentric anomaly\n\tL  Mean longitude\n\tl  True longitude\n\n\n\n\n\tVariation\t\n\tT  Orbital period\n\tn  Mean motion\n\tv  Orbital speed\n\tt0  Epoch\n\n\n\n\n\n\n\n\tManeuvers\t\n\tBi-elliptic transfer\n\tCollision avoidance (spacecraft)\n\tDelta-v\n\tDelta-v budget\n\tGravity assist\n\tGravity turn\n\tHohmann transfer\n\tInclination change\n\tLow energy transfer\n\tOberth effect\n\tPhasing\n\tRocket equation\n\tRendezvous\n\tTransposition, docking, and extraction\n\n\n\n\n\tOrbital mechanics\t\n\tCelestial coordinate system\n\tCharacteristic energy\n\tEscape velocity\n\tEphemeris\n\tEquatorial coordinate system\n\tGround track\n\tHill sphere\n\tInterplanetary Transport Network\n\tKepler's laws of planetary motion\n\tLagrangian point\n\tn-body problem\n\tOrbit equation\n\tOrbital state vectors\n\tPerturbation\n\tRetrograde motion\n\tSpecific orbital energy\n\tSpecific relative angular momentum\n\tTwo-line elements\n\n\n\n\n\t\n\tList of orbits\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nVoyager program\n\n\tSpacecraft\t\n\tVoyager 1\n\tVoyager 2\n\n\n\n\t\n\n\n\tComponents \nexamples\n\t\n\tMHW-RTG\n\tCosmic Ray Subsystem (CRS)\n\tPlasma Wave Subsystem (PWS)\n\tVoyager Golden Record (Contents)\n\n\n\n\n\tWork\t\n\tPale Blue Dot\n\tFamily Portrait\n\n\n\n\n\tVoyager team\t\n\tStamatios Krimigis\n\tCarolyn Porco\n\tRaymond Heacock\n\tJim Blinn\n\tEdward C. Stone\n\tTimothy Ferris\n\n\n\n\n\tRelated\t\n\tGravity assist\n\tRadioisotope thermoelectric generator\n\tSpecific orbital energy of Voyager 1\n\tTitan IIIE\n\tGrand Tour program\n\tNASA Deep Space Network\n\n\n\n\n\tObservation Targets\t\n\tEnceladus\n\tMasubi (volcano)\n\tExploration of Jupiter\n\tExploration of Saturn\n\tExploration of Uranus\n\tPrometheus (volcano)\n\tExploration of Io\n\tRings of Neptune\n\tDunyazad (crater)\n\tSurt (volcano)\n\tShahrazad (crater)\n\tPele (volcano)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Gravity_assist&oldid=913557438\"\n\n\t\t\n\t\tCategories: \tAstrodynamics\n\tSoviet inventions\n\tOrbital maneuvers\n\tSpacecraft propulsion\n\tEffects of gravitation\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tCS1 Russian-language sources (ru)\n\tWikipedia articles needing clarification from February 2018\n\tAll accuracy disputes\n\tArticles with disputed statements from February 2018\n\tArticles containing potentially dated statements from July 2018\n\tAll articles containing potentially dated statements\n\tPages using multiple image with auto scaled images\n\tArticles containing video clips\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tAsturianu\n\tБеларуская\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEspañol\n\tفارسی\n\tFrançais\n\tFrysk\n\tGaeilge\n\t한국어\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tLatviešu\n\tLëtzebuergesch\n\tMagyar\n\tМакедонски\n\tNederlands\n\t日本語\n\tNorsk\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSimple English\n\tSlovenčina\n\tСрпски / srpski\n\tSuomi\n\tSvenska\n\tТатарча/tatarça\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 September 2019, at 20:24 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "9", "dc:title": "Gravity assist - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Animation_of_Voyager_1_trajectory.gif", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-gravitational_slingshot", "title": "Gravity assist - Wikipedia"}}