{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGridded ion thruster - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tGridded ion thruster\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \n\n\n\n\nThe gridded ion thruster is a common design for ion thrusters, a highly efficient low-thrust spacecraft propulsion running on electrical power. These designs use high-voltage grid electrodes to accelerate ions with electrostatic forces.\n\n\nContents\n\n\n\t1 History\n\t2 Method of operation\n\t3 Performance\n\t4 Variants\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nHistory[edit]\n\nThe ion engine was first demonstrated by German-born NASA  scientist Ernst Stuhlinger,[1] and developed in practical form by Harold R. Kaufman at NASA Lewis (now Glenn) Research Center  from 1957 to the early 1960s. \n\nThe use of ion propulsion systems were first demonstrated in space by the NASA Lewis \"Space Electric Rocket Test\" (SERT) I and II.[2]  These thrusters used mercury as the reaction mass.  The first was SERT-1, launched July 20, 1964, which successfully proved that the technology operated as predicted in space.  The second test, SERT-II, launched on February 3, 1970,[3][4] verified the operation of two mercury ion engines for thousands of running hours.[5]  Despite the demonstration in the 1960s and 70s, though, they were rarely used before the late 1990s.\n\nNASA Glenn continued to develop electrostatic gridded ion thrusters through the 1980s, developing the NASA Solar Technology Application Readiness (NSTAR) engine, that was used successfully on the Deep Space 1 probe, the first mission to fly an interplanetary trajectory using electric propulsion as the primary propulsion.  It is currently flying the Dawn asteroid mission. Hughes Aircraft Company (now L-3 ETI) has developed the XIPS (Xenon Ion Propulsion System) for performing station keeping on its geosynchronous satellites (more than 100 engines flying). NASA is currently working on a 20-50 kW electrostatic ion thruster called HiPEP which will have higher efficiency, specific impulse, and a longer lifetime than NSTAR.  Aerojet has recently completed testing of a prototype NEXT ion thruster.[6]\n\nBeginning in the 1970s, radio-frequency ion thrusters were developed at Giessen University and ArianeGroup. RIT-10 engines are flying on the EURECA and ARTEMIS. Qinetiq (UK) has developed the T5 and T6 engines (Kaufman type), used on the GOCE mission (T5) and the BepiColombo mission (T6). From Japan, the µ10, using microwaves, flew on the Hayabusa mission.\n\n\nMethod of operation[edit]\n\nPropellant atoms are injected into the discharge chamber and are ionized by electron bombardment, forming a plasma. There are several ways of producing the energetic electrons for the discharge: electrons can be emitted from a hollow cathode and accelerated by potential difference with the anode; the electrons can be accelerated by an oscillating electric field induced by an alternating electromagnet, which results in a self-sustaining discharge and omits any cathode (radio frequency ion thruster); and microwave heating. The positively charged ions diffuse towards the chamber's extraction system (2 or 3 multi-aperture grids). After ions enter the plasma sheath at a grid hole, they are accelerated by the potential difference between the first and second grids (called the screen and accelerator grids, respectively). The ions are guided through the extraction holes by the powerful electric field. The final ion energy is determined by the potential of the plasma, which generally is slightly greater than the screen grids' voltage.\n\nThe negative voltage of the accelerator grid prevents electrons of the beam plasma outside the thruster from streaming back to the discharge plasma. This can fail due to insufficient negative potential in the grid, which is a common ending for ion thrusters' operational life. The expelled ions propel the spacecraft in the opposite direction, according to Newton's 3rd law.\nLower-energy electrons are emitted from a separate cathode, called the neutralizer, into the ion beam to ensure that equal amounts of positive and negative charge are ejected. Neutralizing is needed to prevent the spacecraft from gaining a net negative charge, which would attract ions back toward the spacecraft and cancel the thrust.\n\n\nPerformance[edit]\n\nThe ion optics are constantly bombarded by a small amount of secondary ions and erode or wear away, thus reducing engine efficiency and life. Ion engines need to be able to run efficiently and continuously for years. Several techniques were used to reduce erosion; most notable was switching to a different propellant. Mercury or caesium atoms were used as propellants during tests in the 1960s and 1970s, but these propellants adhered to, and eroded the grids.  Xenon atoms, on the other hand, are far less corrosive, and became the propellant of choice for virtually all ion thruster types. NASA has demonstrated continuous operation of NSTAR engines for over 16,000 hours (1.8 years), and tests are still ongoing for double this lifetime. Electrostatic ion thrusters have also achieved a specific impulse of 30–100 kN·s/kg, better than most other ion thruster types. Electrostatic ion thrusters have accelerated ions to speeds reaching 100 km/s.\n\nIn January 2006, the European Space Agency, together with the Australian National University, announced successful testing of an improved electrostatic ion engine, the Dual-Stage 4-Grid (DS4G), that showed exhaust speeds of 210 km/s, reportedly four times higher than previously achieved, allowing for a specific impulse which is four times higher. Conventional electrostatic ion thrusters possess only two grids, one high voltage and one low voltage, which perform both the ion extraction and acceleration functions. However, when the charge differential between these grids reaches around 5 kV, some of the particles extracted from the chamber collide with the low voltage grid, eroding it and compromising the engine's longevity. This limitation is successfully bypassed when two pairs of grids are used. The first pair operates at high voltage, possessing a voltage differential of around 3 kV between them; this grid pair is responsible for extracting the charged propellant particles from the gas chamber. The second pair, operating at low voltage, provides the electrical field that accelerates the particles outwards, creating thrust. Other advantages to the new engine include a more compact design, allowing it to be scaled up to higher thrusts, and a narrower, less divergent exhaust plume of 3 degrees, which is reportedly five times narrower than previously achieved. This reduces the propellant needed to correct the orientation of the spacecraft due to small uncertainties in the thrust vector direction.[7]\n\n\nVariants[edit]\n\nThe largest difference in the many electrostatic ion thrusters is the method of ionizing the propellant atoms - electron bombardment (NSTAR, NEXT, T5, T6), radiofrequency (rf) excitation (RIT 10, RIT 22, µN-RIT), microwave excitation (µ10, µ20). Related to this is the need for a cathode and a required effort for the power supplies. Kaufman type engines require at the least, supplies to the cathode, anode and chamber. The rf and microwave types require an additional rf generator, but no anode or cathode supplies. \n\nIn the extraction grid systems, minor differences occur in the grid geometry and the materials used. This may have implications for the grid system operational lifetime.\n\n\nSee also[edit]\n\n\tList of plasma (physics) articles\n\tElectrically powered spacecraft propulsion\n\tIon thruster\n\tDual-Stage 4-Grid\n\n\nReferences[edit]\n\n\n\t^ Ernst Stuhlinger, Ion Propulsion for Space Flight (McGraw-Hill, New York, 1964).\n\n\t^ J. S. Sovey,  V. K. Rawlin, and M. J. Patterson, \"Ion Propulsion Development Projects in U. S.: Space Electric Rocket Test 1 to Deep Space 1\", Journal of Propulsion and Power, Vol. 17, No. 3, May–June 2001, pp. 517-526.\n\n\t^ NASA Glenn, \"SPACE ELECTRIC ROCKET TEST II (SERT II) (Accessed July 1, 2010)\n\n\t^ SERT Archived 2010-10-25 at the Wayback Machine page at Astronautix (Accessed July 1, 2010)\n\n\t^ Space Electric Rocket Test\n\n\t^ Aerojet Successfully Completes Manufacturing and System Integration Milestones for NASA's NEXT Ion Engine Development Program Archived May 30, 2006, at the Wayback Machine\n\n\t^ ESA Portal - ESA and ANU make space propulsion breakthrough\n\n\n\n\n\nExternal links[edit]\n\n\tAerojet (Redmond, Washington USA) - Gridded Ion Thruster Vendor\n\tNSTAR ion engine\n\tTechnologies to Improve Ion Propulsion System (PDF)\n\tElectric Thruster Systems (PDF)\n\tHiPEP\n\tESA And ANU Make Space Propulsion Breakthrough\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft propulsion\n\n\tChemical\nrockets\t\n\tState\t\n\tLiquid-propellant rocket\n\tSolid-propellant rocket\n\tHybrid-propellant rocket\n\n\n\n\n\tPropellants\t\n\tLiquid propellant\n\tCryogenic\n\tHypergolic\n\n\n\tMonopropellant\n\tBipropellant\n\tStaged combustion cycle\n\tExpander cycle\n\tGas-generator cycle\n\tTap-off cycle\n\tPressure-fed engine\n\tPump-fed engine\n\tElectric-pump-fed engine\n\n\n\tTripropellant\n\n\n\n\n\n\n\n\tElectrical\nthrusters\t\n\tElectrostatic\t\n\tColloid thruster\n\tIon thruster\n\tGridded\n\tHall-effect thruster\n\tField-emission electric propulsion\n\n\n\n\n\n\n\tElectromagnetic\t\n\tPulsed inductive thruster\n\tMagnetoplasmadynamic thruster\n\tElectrodeless plasma thruster\n\n\n\n\n\tElectrothermal\t\n\tPulsed plasma thruster\n\tHelicon double-layer thruster\n\tArcjet rocket\n\tResistojet rocket\n\tVASIMR\n\n\n\n\n\tOther\t\n\tAtmosphere-breathing electric propulsion\n\tHigh Power Electric Propulsion\n\tMagBeam\n\tMass driver\n\n\n\n\n\n\n\n\tNuclear\npropulsion\t\n\tClosed system\t\n\tDirect Fusion Drive\n\tNuclear electric rocket\n\tNuclear thermal rocket\n\tRadioisotope\n\tSalt-water\n\tGas core\n\t\"Lightbulb\"\n\n\n\n\n\n\n\tOpen system\t\n\tNuclear pulse propulsion\n\tAntimatter-catalyzed\n\n\n\tPulsed nuclear thermal rocket‎\n\tFusion rocket\n\tBussard ramjet\n\n\n\tFission-fragment rocket\n\tFission sail\n\n\n\tNuclear photonic rocket\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tBeam-powered propulsion\n\tCold gas thruster\n\tGravity assist\n\tSolar sail\n\tElectric sail\n\tMagnetic sail\n\n\n\tSolar thermal rocket\n\tTethers\n\tSteam thruster\n\n\n\n\n\tSpaceflight portal\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Gridded_ion_thruster&oldid=898127964\"\n\n\t\t\n\t\tCategories: \tElectrostatic motors\n\tPlasma physics\n\tIon engines\n\n\nHidden categories: \tWebarchive template wayback links\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tČeština\n\tDansk\n\tDeutsch\n\tItaliano\n\tPolski\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 21 May 2019, at 15:25 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "8", "dc:title": "Gridded ion thruster - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Electrostatic_ion_thruster-en.svg/1200px-Electrostatic_ion_thruster-en.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-gridded_ion_thruster", "title": "Gridded ion thruster - Wikipedia"}}