{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGround segment - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tGround segment\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tground-based elements of a spacecraft system\n\n  \nA simplified spacecraft system. Dotted orange arrows denote radio links; solid black arrows denote ground network links. (User terminals typically rely on only one of the indicated paths for access to space-segment resources.)\n\n\n\nA ground segment consists of all the ground-based elements of a spacecraft system used by operators and support personnel, as opposed to the space segment and user segment.[1][2]:1 The ground segment enables management of a spacecraft, and distribution of payload data and telemetry among interested parties on the ground. The primary elements of a ground segment are:\n\n\n\tGround (or Earth) stations, which provide radio interfaces with spacecraft[2]:142\n\tMission control (or operations) centers, from which spacecraft are managed[3]:20\n\tGround networks, which connect the other ground elements to one another[2]:142[4]\n\tRemote terminals, used by support personnel[2]:142\n\tSpacecraft integration and test facilities\n\tLaunch facilities[3]:21\n\n\nThese elements are present in nearly all space missions, whether commercial, military, or scientific. They may be located together or separated geographically, and they may be operated by different parties.[5][6]:25 Some elements may support multiple spacecraft simultaneously.\n\n\nContents\n\n\n\t1 Elements\n\t1.1 Ground stations\n\t1.1.1 Transmission and reception\n\t1.1.2 Passes\n\t1.1.3 Tracking and ranging\n\n\n\n\t1.2 Mission control centers\n\t1.2.1 Telemetry processing\n\t1.2.2 Commanding\n\t1.2.3 Analysis and support\n\t1.2.4 Staffing\n\n\n\n\t1.3 Ground networks\n\t1.4 Remote terminals\n\t1.5 Integration and test facilities\n\t1.6 Launch facilities\n\n\n\n\t2 Costs\n\t3 Images\n\t4 See also\n\t5 References\n\n\n\n\n\nElements[edit]\n\nGround stations[edit]\n\nSee also: Ground station\n\n  \nRadio dishes at an Embratel earth station in Tanguá, Brazil\n\n\n\nGround stations provide radio interfaces between the space and ground segments for telemetry, tracking, and command (TT&C), as well as payload data transmission and reception.[6]:4[7][8] Tracking networks, such as NASA's Near Earth Network and Space Network, handle communications with multiple spacecraft through time-sharing.[3]:22\n\nGround station equipment may be monitored and controlled remotely, often via serial and/or IP interfaces. There are typically backup stations from which radio contact can be maintained if there is a problem at the primary ground station which renders it unable to operate, such as a natural disaster. Such contingencies are considered in a Continuity of Operations plan.\n\n\nTransmission and reception[edit]\n\nSignals to be uplinked to a spacecraft must first be extracted from ground network packets, encoded to baseband, and modulated,[9] typically onto an intermediate frequency (IF) carrier, before being up-converted to the assigned radio frequency (RF) band. The RF signal is then amplified to high power and carried via waveguide to an antenna for transmission. In colder climates, electric heaters or hot air blowers may be necessary to prevent ice or snow buildup on the parabolic dish.\n\nReceived (\"downlinked\") signals are passed through a low-noise amplifier (often located in the antenna hub to minimize the distance the signal must travel) before being down-converted to IF; these two functions may be combined in a low-noise block downconverter. The IF signal is then demodulated, and the data stream extracted via bit and frame synchronization and decoding.[9] Data errors, such as those caused by signal degradation, are identified and corrected where possible.[9] The extracted data stream is then packetized or saved to files for transmission on ground networks. Ground stations may temporarily store received telemetry for later playback to control centers, often when ground network bandwidth is not sufficient to allow real-time transmission of all received telemetry.\n\nA single spacecraft may make use of multiple RF bands for different telemetry, command, and payload data streams, depending on bandwidth and other requirements.\n\n\nPasses[edit]\n\nThe timing of passes, when a line of sight exists to the spacecraft, is determined by the location of ground stations, and by the characteristics of the spacecraft orbit or trajectory.[10] The Space Network uses geostationary relay satellites to extend pass opportunities over the horizon.\n\n\nTracking and ranging[edit]\n\nGround stations must track spacecraft in order to point their antennas properly, and must account for Doppler shifting of RF frequencies due to the motion of the spacecraft. Ground stations may also perform automated ranging; ranging tones may be multiplexed with command and telemetry signals. Ground station tracking and ranging data are passed to the control center along with spacecraft telemetry.\n\n\nMission control centers[edit]\n\nSee also: List of mission control centers\n\n  \nControl center at NASA's Jet Propulsion Laboratory\n\n\n\nMission control centers process, analyze, and distribute spacecraft telemetry, and issue commands, data uploads, and software updates to spacecraft. For manned spacecraft, mission control manages voice and video communications with the crew. Control centers may also be responsible for configuration management and data archival. As with ground stations, there are typically backup control facilities available to support continuity of operations.\n\n\nTelemetry processing[edit]\n\nControl centers use telemetry to determine the status of a spacecraft and its systems.[3]:485 Housekeeping, diagnostic, science, and other types of telemetry may be carried on separate virtual channels. Flight control software performs the initial processing of received telemetry, including:\n\n\n\tSeparation and distribution of virtual channels[3]:393\n\tTime-ordering and gap-checking of received frames (gaps may be filled by commanding a re-transmission)\n\tDecommutation of parameter values,[9] and association of these values with parameter names called mnemonics\n\tConversion of raw data to calibrated (engineering) values, and calculation of derived parameters\n\tLimit and constraint checking (which may generate alert notifications)[3]:479\n\n\nA spacecraft database is called on to provide information on telemetry frame formatting, the positions and frequencies of parameters within frames, and their associated mnemonics, calibrations, and soft and hard limits. The contents of this database—especially calibrations and limits—may be updated periodically to maintain consistency with onboard software and operating procedures; these can change during the life of a mission in response to upgrades, hardware degradation in the space environment, and changes to mission parameters.\n\n\nCommanding[edit]\n\nCommands sent to spacecraft are formatted according to the spacecraft database, and are validated against the database before being transmitted via a ground station. Commands may be issued manually in real time, or they may be part of automated or semi-automated procedures. Typically, commands successfully received by the spacecraft are acknowledged in telemetry, and a command counter is maintained on the spacecraft and at the ground to ensure synchronization. In certain cases, closed-loop control may be performed. Commanded activities may pertain directly to mission objectives, or they may be part of housekeeping. Commands (and telemetry) may be encrypted to prevent unauthorized access to the spacecraft or its data.\n\nSpacecraft procedures are often developed and tested against a spacecraft simulator prior to use with the actual spacecraft.\n\n\nAnalysis and support[edit]\n\nMission control centers may rely on \"offline\" (i.e., non-real-time) data processing subsystems to handle analytical tasks[3]:21 such as:\n\n\n\tShort- and long-term trend analysis[3]:21\n\tOrbit determination and maneuver planning[11]\n\tConjunction assessment and collision avoidance planning\n\tMission planning and scheduling\n\tOn-board memory management[12]:247–249\n\tPath planning, in the case of planetary rovers\n\n\nDedicated physical spaces may be provided in the control center for certain mission support roles, such as flight dynamics and network control,[3]:475 or these roles may be handled via remote terminals outside the control center. As on-board computing power and flight software complexity have increased, there is a trend toward performing more automated data processing on board the spacecraft.[13]:2–3\n\n\nStaffing[edit]\n\nControl centers may be continuously or regularly staffed by flight controllers. Staffing is typically greatest during the early phases of a mission,[3]:21 and during critical procedures and periods.[13] Increasingly commonly, control centers for unmanned spacecraft may be set up for \"lights-out\" (or automated) operation, as a means of controlling costs.[13] Flight control software will typically generate notifications of significant events – both planned and unplanned – in the ground or space segment that may require operator intervention.[13]\n\n\nGround networks[edit]\n\nGround networks handle data transfer and voice communication between different elements of the ground segment. These networks often combine LAN and WAN elements, for which different parties may be responsible. Geographically separated elements may be connected via leased lines or virtual private networks. The design of ground networks is driven by requirements on reliability, bandwidth, and security.\n\nReliability is a particularly important consideration for critical systems, with uptime and mean time to recovery being of paramount concern. As with other aspects of the spacecraft system, redundancy of network components is the primary means of achieving the required system reliability.\n\nSecurity considerations are vital to protect space resources and sensitive data. WAN links often incorporate encryption protocols and firewalls to provide information and network security. Antivirus software and intrusion detection systems provide additional security at network endpoints.\n\n\nRemote terminals[edit]\n\nRemote terminals are interfaces on ground networks, separate from the mission control center, which may be accessed by payload controllers, telemetry analysts, instrument and science teams, and support personnel, such as system administrators and software development teams. They may be receive-only, or they may transmit data to the ground network.\n\nTerminals used by service customers, including ISPs and end users, are collectively called the \"user segment\", and are typically distinguished from the ground segment. User terminals including satellite television systems and satellite phones communicate directly with spacecraft, while other types of user terminals rely on the ground segment for data receipt, transmission, and processing. \n\n\nIntegration and test facilities[edit]\n\nSpace vehicles and their interfaces are assembled and tested at integration and test (I&T) facilities. I&T provides an opportunity to fully test communications with, and behavior of, the spacecraft prior to launch.\n\n\nLaunch facilities[edit]\n\nVehicles are delivered to space via launch facilities, which handle the logistics of rocket launches. Launch facilities are typically connected to the ground network to relay telemetry prior to and during launch. The launch vehicle itself is sometimes said to constitute a \"transfer segment\", which may be considered distinct from both the space and ground segments.[3]:21\n\n\nCosts[edit]\n\nCosts associated with the establishment and operation of a ground segment are highly variable,[14] and depend on accounting methods. According to a study by Delft University of Technology,[Note 1] the ground segment contributes approximately 5% to the total cost of a space system.[15] According to a report by the RAND Corporation on NASA small spacecraft missions, operation costs alone contribute 8% to the lifetime cost of a typical mission, with integration and testing making up a further 3.2%, ground facilities 2.6%, and ground systems engineering 1.1%.[16]:10\n\nGround segment cost drivers include requirements placed on facilities, hardware, software, network connectivity, security, and staffing.[17] Ground station costs in particular depend largely on the required transmission power, RF band(s), and the suitability of preexisting facilities.[14]:703 Control centers may be highly automated as a means of controlling staffing costs.[13]\n\n\n\n\t^ Based on a model described in Space Mission Analysis and Design, third edition, by James W. Wertz and Wiley J. Larson\n\n\n\n\n\nImages[edit]\n\n\t\n\t\t\t\n\n\n\t\t\t\nAntenna belonging to the Deep Space Network\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nSpace Telescope Operations Control Center at Goddard Space Flight Center, during servicing of the Hubble Space Telescope\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nIntegration of flight hardware at a JAXA facility in Tsukuba, Japan\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nDecommissioned launch site at the Guiana Space Centre\n\n\n\t\t\t\n\n\t\t\n\n\n\nSee also[edit]\n\n\tConsultative Committee for Space Data Systems (CCSDS), which maintains standards for telemetry and command formatting\n\tRadiocommunication service, as defined by ITU Radio Regulations\n\tOn-board data handling subsystem\n\n\nReferences[edit]\n\n\n\t^ \"Ground Segment\". SKY Perfect JSAT Group International. Retrieved 5 November 2015.\n\n\t^ a b c d Elbert, Bruce (2014). The Satellite Communication Ground Segment and Earth Station Handbook (2nd ed.). Artech House. p. 141. ISBN 978-1-60807-673-4.\n\n\n\t^ a b c d e f g h i j k Ley, Wilfried; Wittmann, Klaus; Hallmann, Willi, eds. (2008). Handbook of Space Technology. Wiley. ISBN 0470742410. Retrieved 30 December 2015.\n\n\n\t^ \"ERS Ground Segment\". European Space Agency. Retrieved 5 November 2015.\n\n\n\t^ \"Ground Segment Overview\". European Space Agency. Retrieved 5 November 2015.\n\n\n\t^ a b Reiniger, Klaus; Diedrich, Erhard; Mikusch, Eberhard (August 2006). \"Aspects of Ground Segment Design for Earth observation missions\" (PDF). Alpbach Summer School.\n\n\n\t^ \"Radio Frequency Components\". SKY Perfect JSAT Group International. Retrieved 5 November 2015.\n\n\n\t^ \"Earth Stations/Teleports - Hub\". SKY Perfect JSAT Group International. Retrieved 5 November 2015.\n\n\n\t^ a b c d \"Chapter 10: Telecommunications\". Basics of Spaceflight. NASA Jet Propulsion Laboratory. Retrieved 28 December 2015.\n\n\n\t^ Wood, Lloyd (July 2006). Introduction to satellite constellations: Orbital types, uses and related facts (PDF). ISU Summer Session. Retrieved 17 November 2015.\n\n\n\t^ \"Chapter 13: Spacecraft Navigation\". Basics of Spaceflight. NASA Jet Propulsion Laboratory. Retrieved 28 December 2015.\n\n\n\t^ Uhlig, Thomas; Sellmaier, Florian; Schmidhuber, Michael, eds. (2014). Spacecraft Operations. Springer-Verlag. ISBN 978-3-7091-1802-3. Retrieved 28 December 2015.\n\n\n\t^ a b c d e \"Operations Staffing\". Satellite Operations Best Practice Documents. Space Operations and Support Technical Committee, American Institute of Aeronautics and Astronautics. Retrieved 28 December 2015.\n\n\n\t^ a b Tirró, Sebastiano, ed. (1993). Satellite Communication Systems Design. Springer Science+Business Media. ISBN 1461530067. Retrieved 8 January 2016.\n\n\n\t^ Zandbergen, B.T.C., \"ROM system cost\", Cost Estimation for Space System Elements, v.1.02 (Excel spreadsheet), retrieved 8 January 2016\n\n\n\t^ de Weck, Olivier; de Neufville, Richard; Chang, Darren; Chaize, Mathieu. \"Technical Success and Economic Failure\". Communications Satellite Constellations (PDF). Massachusetts Institute of Technology.\n\n\n\t^ Matthews, Anthony J. (February 25, 1996). \"A ground cost model (G-COST) for military systems\". AIAA International Communications Satellite Systems Conference. American Institute of Aeronautics and Astronautics: 1416–1421. doi:10.2514/6.1996-1111. Retrieved 8 January 2016.\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpaceflight\n\n\tGeneral\t\n\tAstrodynamics\n\tHistory\n\tTimeline\n\tSpace Race\n\tAsian Space Race\n\tRecords\n\tAccidents and incidents\n\n\n\tSpace policy\n\tAustralia\n\tChina\n\tEuropean Union\n\tIndia\n\tJapan\n\tRussia\n\tSoviet Union\n\tUnited States\n\n\n\tSpace law\n\tOuter Space Treaty\n\tRescue Agreement\n\tSpace Liability Convention\n\tRegistration Convention\n\tMoon Treaty\n\n\n\tPrivate spaceflight\n\n\n\n\t\n\n\tApplications\t\n\tAstronomy\n\tEarth observation\n\tArchaeology\n\tImagery and mapping\n\tReconnaissance\n\tWeather and environment monitoring\n\n\n\tSatellite communications\n\tInternet\n\tRadio\n\tTelephone\n\tTelevision\n\n\n\tSatellite navigation\n\tCommercial use of space\n\tSpace launch market competition\n\tMilitarisation of space\n\tSpace architecture\n\tSpace exploration\n\tSpace research\n\tSpace technology\n\tSpace weather\n\n\n\n\n\tHuman spaceflight\t\n\tGeneral\t\n\tAstronaut\n\tcommercial\n\n\n\tLife support system\n\tAnimals in space\n\tBioastronautics\n\tSpace suit\n\n\n\tExtravehicular activity\n\tWeightlessness\n\tSpace toilet\n\tSpace tourism\n\tSpace colonization\n\n\n\n\n\tPrograms\t\n\tVostok\n\tMercury\n\tVoskhod\n\tGemini\n\tSoyuz\n\tApollo\n\tSkylab\n\tApollo–Soyuz\n\n\n\tSpace Shuttle\n\tMir\n\tShuttle–Mir\n\n\n\tInternational Space Station\n\tShenzhou\n\tTiangong\n\n\n\n\n\tHealth issues\t\n\tEffect of spaceflight on the human body\n\tSpace adaptation syndrome\n\n\n\tHealth threat from cosmic rays\n\tSpace psychology\n\tPsychological and sociological effects\n\n\n\tSpace and survival\n\tSpace medicine\n\tSpace nursing\n\n\n\n\n\n\n\n\tSpacecraft\t\n\tLaunch vehicle\n\tRocket\n\tSpaceplane\n\tRobotic spacecraft\n\tSatellite\n\tSpace probe\n\tLander\n\tRover\n\tSelf-replicating spacecraft\n\tSpace telescope\n\n\n\tSpacecraft propulsion\n\tRocket engine\n\tElectric propulsion\n\tSolar sail\n\tGravity assist\n\n\n\n\n\n\n\tDestinations\t\n\tSub-orbital\n\tOrbital\n\tGeocentric\n\tGeosynchronous\n\n\n\tInterplanetary\n\tInterstellar\n\tIntergalactic\n\n\n\n\n\tSpace launch\t\n\tDirect ascent\n\tEscape velocity\n\tExpendable and reusable launch systems\n\tLaunch pad\n\tNon-rocket spacelaunch\n\tSpaceport\n\n\n\n\n\tGround segment\t\n\tFlight controller\n\tGround station\n\tPass\n\tMission control center\n\n\n\n\n\tSpace agencies\t\n\t CoNAE\n\t ASA\n\t AEB\n\t CSA\n\t CNSA\n\t ESA\n\t CNES\n\t DLR\n\t ISRO\n\t LAPAN\n\t ISA\n\t ISA\n\t ASI\n\t AEM\n\t JAXA\n\t NADA\n\t KARI\n\t SUPARCO\n\t Roscosmos\n\t SNSA\n\t SSAU\n\t UKSA\n\t NASA\n\n\n\n\n\t\n\t  Category\n\t  Portal\n\t  WikiProject\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Ground_segment&oldid=912325701\"\n\n\t\t\n\t\tCategories: \tTelecommunications infrastructure\n\tSpaceflight ground equipment\n\tSpaceflight technologies\n\tSpacecraft communication\n\tSpaceflight concepts\n\n\nHidden categories: \tArticles with short description\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tDeutsch\n\tEspañol\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 24 August 2019, at 19:33 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "120", "dc:title": "Ground segment - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.25", "og:image": "https://upload.wikimedia.org/wikipedia/commons/4/47/Ground_segment.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-ground_segment", "title": "Ground segment - Wikipedia"}}