{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHeat pipe - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tHeat pipe\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nA laptop computer heat pipe system\n\n\n\nA heat pipe is a heat-transfer device that combines the principles of both thermal conductivity and phase transition to effectively transfer heat between two solid interfaces.[citation needed]\n\nAt the hot interface of a heat pipe a liquid in contact with a thermally conductive solid surface turns into a vapor by absorbing heat from that surface. The vapor then travels along the heat pipe to the cold interface and condenses back into a liquid – releasing the latent heat. The liquid then returns to the hot interface through either capillary action, centrifugal force, or gravity, and the cycle repeats. Due to the very high heat transfer coefficients for boiling and condensation, heat pipes are highly effective thermal conductors. The effective thermal conductivity varies with heat pipe length, and can approach 100 kW/(m⋅K) for long heat pipes, in comparison with approximately 0.4 kW/(m⋅K) for copper.[citation needed]\n\n\nContents\n\n\n\t1 Structure, design and construction\n\t1.1 Heat pipe materials and working fluids\n\t1.2 Different types of heat pipes\n\t1.2.1 Vapor chamber or flat heat pipes\n\t1.2.2 Variable conductance heat pipes (VCHPs)\n\t1.2.3 Diode heat pipes\n\t1.2.4 Thermosyphons\n\t1.2.5 Loop heat pipe\n\t1.2.6 Oscillating or pulsating heat pipe\n\n\n\n\n\n\n\t2 Heat transfer\n\t3 Development\n\t3.1 Wider usage\n\n\n\n\t4 Applications\n\t4.1 Spacecraft\n\t4.2 Computer systems\n\t4.3 Solar thermal\n\t4.4 Permafrost cooling\n\t4.5 Cooking\n\t4.6 Ventilation heat recovery\n\t4.7 Nuclear power conversion\n\t4.8 Wankel rotary combustion engines\n\n\n\n\t5 Limitations\n\t6 See also\n\t7 References\n\t8 External links\n\n\n\n\n\nStructure, design and construction[edit]\n\n  \nDiagram showing components and mechanism for a heat pipe containing a wick\n\n\n\n  \nThis 100 mm by 100 mm by 10 mm high thin flat heat pipe (heat spreader) animation was created using high resolution CFD analysis and shows temperature contoured flow trajectories, predicted using a CFD analysis package\n\n\n\n  \nThis 120 mm diameter vapor chamber (heat spreader) heat sink design thermal animation was created using high resolution CFD analysis and shows temperature contoured heat sink surface and fluid flow trajectories predicted using a CFD analysis package\n\n\n\n  \nCross section of a heat pipe for cooling the CPU of a laptop computer.  Ruler scale is in millimeters.\n\n\n\n  \nCut-away view of a 500 µm thick flat heat pipe with a thin planar capillary (aqua colored)\n\n\n\n  \nThin flat heat pipe (heat spreader) with remote heat sink and fan\n\n\n\nA typical heat pipe consists of a sealed pipe or tube made of a material that is compatible with the working fluid such as copper for water heat pipes, or aluminium for ammonia heat pipes.  Typically, a vacuum pump is used to remove the air from the empty heat pipe.  The heat pipe is partially filled with a working fluid and then sealed.  The working fluid mass is chosen so that the heat pipe contains both vapor and liquid over the operating temperature range.[1]\n\nBelow the operating temperature, the liquid is too cold and cannot vaporize into a gas. Above the operating temperature, all the liquid has turned to gas, and the environmental temperature is too high for any of the gas to condense. In other words, whether too high or too low, thermal conduction is still possible through the walls of the heat pipe, but at a greatly reduced rate of thermal transfer.[citation needed]\n\nWorking fluids are chosen according to the temperatures at which the heat pipe must operate, with examples ranging from liquid helium for extremely low temperature applications (2–4 K) to mercury (523–923 K), sodium (873–1473 K) and even indium (2000–3000 K) for extremely high temperatures. The vast majority of heat pipes for room temperature applications use ammonia (213–373 K), alcohol (methanol (283–403 K) or ethanol (273–403 K)) or water (298–573 K) as the working fluid.  Copper/water heat pipes have a copper envelope, use water as the working fluid and typically operate in the temperature range of 20 to 150 °C.[2][3] Water heat pipes are sometimes filled by partially filling with water, heating until the water boils and displaces the air, and then sealed while hot.\n\nFor the heat pipe to transfer heat, it must contain saturated liquid and its vapor (gas phase).  The saturated liquid vaporizes and travels to the condenser, where it is cooled and turned back to a saturated liquid.  In a standard heat pipe, the condensed liquid is returned to the evaporator using a wick structure exerting a capillary action on the liquid phase of the working fluid.  Wick structures used in heat pipes include sintered metal powder, screen, and grooved wicks, which have a series of grooves parallel to the pipe axis.  When the condenser is located above the evaporator in a gravitational field, gravity can return the liquid.  In this case, the heat pipe is a thermosiphon.   Finally, rotating heat pipes use centrifugal forces to return liquid from the condenser to the evaporator.[citation needed]\n\nHeat pipes contain no mechanical moving parts and typically require no maintenance, though non-condensable gases that diffuse through the pipe's walls, resulting from breakdown of the working fluid or as impurities extant in the material, may eventually reduce the pipe's effectiveness at transferring heat.[citation needed]\n\nThe advantage of heat pipes over many other heat-dissipation mechanisms is their great efficiency in transferring heat. A pipe one inch in diameter and two feet long can transfer 3.7 kW (12.500 BTU per hour) at 1,800 °F (980 °C) with only 18 °F (10 °C) drop from end to end.[3]  Some heat pipes have demonstrated a heat flux of more than 23 kW/cm², about four times the heat flux through the surface of the sun.[4]\n\n\nHeat pipe materials and working fluids[edit]\n\nHeat pipes have an envelope, a wick, and a working fluid.  Heat pipes are designed for very long term operation with no maintenance, so the heat pipe wall and wick must be compatible with the working fluid.  Some material/working fluids pairs that appear to be compatible are not.  For example, water in an aluminum envelope will develop large amounts of non-condensable gas over a few hours or days, preventing normal operation of the heat pipe.[citation needed]\n\nSince heat pipes were rediscovered by George Grover in 1963, extensive life tests have been conducted to determine compatible envelope/fluid pairs, some going on for decades.  In a heat pipe life test, heat pipes are operated for long periods of time, and monitored for problems such as non-condensable gas generation, material transport, and corrosion.[5][6]\n\nThe most commonly used envelope (and wick)/fluid pairs include:[7]\n\n\n\tCopper envelope with water working fluid for electronics cooling. This is by far the most common type of heat pipe.\n\tCopper or steel envelope with refrigerant R134a working fluid for energy recovery in HVAC systems.\n\tAluminum envelope with ammonia working fluid for spacecraft thermal control.\n\tSuperalloy envelope with alkali metal (cesium, potassium, sodium) working fluid for high temperature heat pipes, most commonly used for calibrating primary temperature measurement devices.\n\n\nOther pairs include stainless steel envelopes with nitrogen, oxygen, neon, hydrogen, or helium working fluids at temperatures below 100 K, copper/methanol heat pipes for electronics cooling when the heat pipe must operate below the water range, aluminum/ethane heat pipes for spacecraft thermal control in environments when ammonia can freeze, and refractory metal envelope/lithium working fluid for high temperature (above 1,050 °C (1,920 °F)) applications.[8]\n\n\nDifferent types of heat pipes[edit]\n\nIn addition to standard, Constant Conductance Heat Pipes (CCHPs), there are a number of other types of heat pipes,[9] including:\n\n\n\tVapor Chambers (planar heat pipes), which are used for heat flux transformation, and isothermalization of surfaces\n\tVariable Conductance Heat Pipes (VCHPs), which use a Non-Condensable Gas (NCG) to change the heat pipe effective thermal conductivity as power or the heat sink conditions change\n\tPressure Controlled Heat Pipes (PCHPs), which are a VCHP where the volume of the reservoir, or the NCG mass can be changed, to give more precise temperature control\n\tDiode Heat Pipes, which have a high thermal conductivity in the forward direction, and a low thermal conductivity in the reverse direction\n\tThermosyphons, which are heat pipes where the liquid is returned to the evaporator by gravitational/accelerational forces,\n\tRotating heat pipes, where the liquid is returned to the evaporator by centrifugal forces\n\n\nVapor chamber or flat heat pipes[edit]\n\nThin planar heat pipes (heat spreaders) have the same primary components as tubular heat pipes: a hermetically sealed hollow vessel, a working fluid, and a closed-loop capillary recirculation system.[10]   In addition, an internal support structure or a  series of posts are generally used in a vapor chamber to accommodate clamping pressures sometimes up to 90 PSI. This helps prevent collapse of the flat top and bottom when the pressure is applied.\n\nThere are two main applications for vapor chambers. First, they are used when high powers and heat fluxes are applied to a relatively small evaporator.[11]  Heat input to the evaporator vaporizes liquid, which flows in two dimensions to the condenser surfaces.  After the vapor condenses on the condenser surfaces, capillary forces in the wick return the condensate to the evaporator.  Note that most vapor chambers are insensitive to gravity, and will still operate when inverted, with the evaporator above the condenser.  In this application, the vapor chamber acts as a heat flux transformer, cooling a high heat flux from an electronic chip or laser diode, and transforming it to a lower heat flux that can be removed by natural or forced convection.  With special evaporator wicks, vapor chambers can remove 2000 W over 4 cm2, or 700 W over 1 cm2.[12]\n\nSecond, compared to a one-dimensional tubular heat pipe, the width of a two-dimensional heat pipe allows an adequate cross section for heat flow even with a very thin device. These thin planar heat pipes are finding their way into “height sensitive” applications, such as notebook computers and surface mount circuit board cores. It is possible to produce flat heat pipes as thin as 1.0 mm (slightly thicker than a 0.76 mm credit card).[13]\n\n\nVariable conductance heat pipes (VCHPs)[edit]\n\nStandard heat pipes are constant conductance devices, where the heat pipe operating temperature is set by the source and sink temperatures, the thermal resistances from the source to the heat pipe, and the thermal resistances from the heat pipe to the sink.  In these heat pipes, the temperature drops linearly as the power or condenser temperature is reduced.  For some applications, such as satellite or research balloon thermal control, the electronics will be overcooled at low powers, or at the low sink temperatures.  Variable Conductance Heat Pipes (VCHPs) are used to passively maintain the temperature of the electronics being cooled as power and sink conditions change.[14]\n\nVariable conductance heat pipes have two additions compared to a standard heat pipe: 1. a reservoir, and 2. a non-condensable gas (NCG) added to the heat pipe, in addition to the working fluid; see the picture in the spacecraft section below.  This non-condensable gas is typically argon for standard Variable conductance heat pipes, and helium for thermosyphons.  When the heat pipe is not operating, the non-condensable gas and working fluid vapor are mixed throughout the heat pipe vapor space.  When the variable conductance heat pipe is operating, the non-condensable gas is swept toward the condenser end of the heat pipe by the flow of the working fluid vapor.  Most of the non-condensable gas is located in the reservoir, while the remainder blocks a portion of the heat pipe condenser.  The variable conductance heat pipe works by varying the active length of the condenser.  When the power or heat sink temperature is increased, the heat pipe vapor temperature and pressure increase.  The increased vapor pressure forces more of the non-condensable gas into the reservoir, increasing the active condenser length and the heat pipe conductance.  Conversely, when the power or heat sink temperature is decreased, the heat pipe vapor temperature and pressure decrease, and the non-condensable gas expands, reducing the active condenser length and heat pipe conductance.  The addition of a small heater on the reservoir, with the power controlled by the evaporator temperature, will allow thermal control of roughly ±1-2 °C.  In one example, the evaporator temperature was maintained in a ±1.65 °C control band, as power was varied from 72 to 150 W, and heat sink temperature varied from +15 °C to -65 °C.\n\nPressure controlled heat pipes (PCHPs) can be used when tighter temperature control is required.[15]  In a pressure controlled heat pipe, the evaporator temperature is used to either vary the reservoir volume, or the amount of non-condensable gas in the heat pipe.  Pressure controlled heat pipes have shown milli-Kelvin temperature control.[16]\n\n\nDiode heat pipes[edit]\n\nConventional heat pipes transfer heat in either direction, from the hotter to the colder end of the heat pipe.  Several different heat pipes act as a thermal diode, transferring heat in one direction, while acting as an insulator in the other:[17]\n\n\n\tThermosyphons, which only transfer heat from the bottom to the top of the thermosyphon, where the condensate returns by gravity.  When the thermosyphon is heated at the top, there is no liquid available to evaporate.\n\tRotating heat pipes, where the heat pipe is shaped so that liquid can only travel by centrifugal forces from the nominal evaporator to the nominal condenser.  Again, no liquid is available when the nominal condenser is heated.\n\tVapor trap diode heat pipes.\n\tLiquid trap diode heat pipes.\n\n\n \nA vapor trap diode is fabricated in a similar fashion to a variable conductance heat pipe, with a gas reservoir at the end of the condenser. During fabrication, the heat pipe is charged with the working fluid and a controlled amount of a non-condensable gas (NCG).  During normal operation, the flow of the working fluid vapor from the evaporator to the condenser sweeps the non-condensable gas into the reservoir, where it doesn’t interfere with the normal heat pipe operation.  When the nominal condenser is heated, the vapor flow is from the nominal condenser to the nominal evaporator. The non-condensable gas is dragged along with the flowing vapor, completely blocking the nominal evaporator, and greatly increasing the thermal resistivity of the heat pipe.  In general, there is some heat transfer to the nominal adiabatic section.  Heat is then conducted through the heat pipe walls to the evaporator.  In one example, a vapor trap diode carried 95 W in the forward direction, and only 4.3 W in the reverse direction.[18]\n\n\nA liquid trap diode has a wicked reservoir at the evaporator end of the heat pipe, with a separate wick that is not in communication with the wick in the remainder of the heat pipe.[19]  During normal operation, the evaporator and reservoir are heated.  The vapor flows to the condenser, and liquid returns to the evaporator by capillary forces in the wick.  The reservoir eventually dries out, since there is no method for returning liquid.  When the nominal condenser is heated, liquid condenses in the evaporator and the reservoir.  While the liquid can return to the nominal condenser from the nominal evaporator, the liquid in the reservoir is trapped, since the reservoir wick is not connected.  Eventually, all of the liquid is trapped in the reservoir, and the heat pipe ceases operation.\n\n\nThermosyphons[edit]\n\nMost heat pipes use a wick to return the liquid from the condenser to the evaporator, allowing the heat pipe to operate in any orientation. The liquid is sucked up back to the evaporator by capillary action, similar to the way that a sponge sucks up water when an edge is placed in contact with a pool of water. However the maximum adverse elevation (evaporator over condenser) is relatively small, on the order of 25 cm long for a typical water heat pipe.\n\nIf however, the evaporator is located below the condenser, the liquid can drain back by gravity instead of requiring a wick, and the distance between the two can be much longer. Such a gravity aided heat pipe is known as a thermosyphon.[20]\n\nIn a thermosyphon, liquid working fluid is vaporized by a heat supplied to the evaporator at the bottom of the heat pipe.  The vapor travels to the condenser at the top of the heat pipe, where it condenses.  The liquid then drains back to the bottom of the heat pipe by gravity, and the cycle repeats.  Thermosyphons are diode heat pipes; when heat is applied to the condenser end, there is no condensate available, and hence no way to form vapor and transfer heat to the evaporator.\n\nWhile a typical terrestrial water heat pipe is less than 30 cm long, thermosyphons are often several meters long.  As discussed below, the thermosyphons used to cool the Alaska pipe line were roughly 11 to 12 m long.  Even longer thermosyphons have been proposed for the extraction of geothermal energy.  For example, Storch et al. fabricated a 53 mm I.D., 92 m long propane thermosyphon that carried roughly 6 kW of heat.[21]\n\n\nLoop heat pipe[edit]\n\nA loop heat pipe (LHP) is a passive two-phase transfer device related to the heat pipe.  It can carry higher power over longer distances by having co-current liquid and vapor flow, in contrast to the counter-current flow in a heat pipe.[22][23] This allows the wick in a loop heat pipe to be required only in the evaporator and compensation chamber.  Micro loop heat pipes have been developed and successfully employed in a wide sphere of applications both on the ground and in space.\n\n\nOscillating or pulsating heat pipe[edit]\n\nAn oscillating heat pipe, also known as a pulsating heat pipe, is only partially filled with liquid working fluid. The pipe is arranged in a serpentine pattern in which freely moving liquid and vapor segments alternate.[24] Oscillation takes place in the working fluid; the pipe remains motionless.\n\n\nHeat transfer[edit]\n\n  \nA heat sink (aluminium) with heat pipes (copper)\n\n\n\nHeat pipes employ evaporative cooling to transfer thermal energy from one point to another by the evaporation and condensation of a working fluid or coolant. Heat pipes rely on a temperature difference between the ends of the pipe, and cannot lower temperatures at either end below the ambient temperature (hence they tend to equalize the temperature within the pipe).\n\nWhen one end of the heat pipe is heated, the working fluid inside the pipe at that end evaporates and increases the vapor pressure inside the cavity of the heat pipe. The latent heat of evaporation absorbed by the vaporisation of the working fluid reduces the temperature at the hot end of the pipe.\n\nThe vapor pressure over the hot liquid working fluid at the hot end of the pipe is higher than the equilibrium vapor pressure over the condensing working fluid at the cooler end of the pipe, and this pressure difference drives a rapid mass transfer to the condensing end where the excess vapor condenses, releases its latent heat, and warms the cool end of the pipe. Non-condensing gases (caused by contamination for instance) in the vapor impede the gas flow and reduce the effectiveness of the heat pipe, particularly at low temperatures, where vapor pressures are low. The speed of molecules in a gas is approximately the speed of sound, and in the absence of noncondensing gases (i.e., if there is only a gas phase present) this is the upper limit to the velocity with which they could travel in the heat pipe. In practice, the speed of the vapor through the heat pipe is limited by the rate of condensation at the cold end and far lower than the molecular speed.[citation needed] Note/explanation: The condensation rate is very close to the sticking coefficient times the molecular speed times the gas density, if the condensing surface is very cold. However, if the surface is close to the temperature of the gas, the evaporation caused by the finite temperature of the surface largely cancels this heat flux. If the temperature difference is more than some tens of degrees, the evaporation from the surface is typically negligible, as can be assessed from the vapor pressure curves. In most cases, with very efficient heat transport through the gas, it is very challenging to maintain such significant temperature differences between the gas and the condensing surface. Moreover, this temperature differences of course corresponds to a large effective thermal resistance by itself. The bottleneck is often less severe at the heat source, as the gas densities are higher there, corresponding to higher maximum heat fluxes.\n\nThe condensed working fluid then flows back to the hot end of the pipe. In the case of vertically oriented heat pipes the fluid may be moved by the force of gravity. In the case of heat pipes containing wicks, the fluid is returned by capillary action.\n\nWhen making heat pipes, there is no need to create a vacuum in the pipe. One simply boils the working fluid in the heat pipe until the resulting vapor has purged the non-condensing gases from the pipe, and then seals the end.\n\nAn interesting property of heat pipes is the temperature range over which they are effective.  Initially, it might be suspected that a water-charged heat pipe only works when the hot end reaches the boiling point (100 °C, 212 °F, at  normal atmospheric pressure) and steam is transferred to the cold end.  However, the boiling point of water depends on the absolute pressure inside the pipe.  In an evacuated pipe, water vaporizes from its triple point (0.01 °C, 32 °F) to its critical point (374 °C; 705 °F), as long as the heat pipe contains both liquid and vapor.  Thus a heat pipe can operate at hot-end temperatures as low as just slightly warmer than the melting point of the working fluid, although the maximum rate of heat transfer is low at temperatures below 25 °C (77 °F). Similarly, a heat pipe with water as a working fluid can work well above the atmospheric boiling point (100 °C, 212 °F).  The maximum temperature for long term water heat pipes is 270 °C (518 °F), with heat pipes operating up to 300 °C (572 °F) for short term tests.[25]\n\nThe main reason for the effectiveness of heat pipes is the evaporation and condensation of the working fluid.  The heat of vaporization greatly exceeds the specific heat capacity.  Using water as an example, the energy needed to evaporate one gram of water is 540 times the amount of energy needed to raise the temperature of that same one gram of water by 1 °C.  Almost all of that energy is rapidly transferred to the \"cold\" end when the fluid condenses there, making a very effective heat transfer system with no moving parts.[citation needed]\n\n\nDevelopment[edit]\n\nThe general principle of heat pipes using gravity, commonly classified as two phase thermosiphons, dates back to the steam age and Angier March Perkins and his son Loftus Perkins and the \"Perkins Tube\", which saw widespread use in locomotive boilers and working ovens.[26] Capillary-based heat pipes were first suggested by R. S. Gaugler of General Motors in 1942, who patented the idea,[27][28] but did not develop it further.\n\nGeorge Grover independently developed capillary-based heat pipes at Los Alamos National Laboratory in 1963, with his patent of that year[29] being the first to use the term \"heat pipe\", and he is often referred to as \"the inventor of the heat pipe\".[30] He noted in his notebook:[31]\n\n\n\nSuch a closed system, requiring no external pumps, may be of particular interest in space reactors in moving heat from the reactor core to a radiating system. In the absence of gravity, the forces must only be such as to overcome the capillary and the drag of the returning vapor through its channels.\n\n\n\n\nGrover's suggestion was taken up by NASA, which played a large role in heat pipe development in the 1960s, particularly regarding applications and reliability in space flight. This was understandable given the low weight, high heat flux, and zero power draw of heat pipes – and that they would not be adversely affected by operating in a zero gravity environment.\n\nThe first application of heat pipes in the space program was the thermal equilibration of satellite transponders.[citation needed] As satellites orbit, one side is exposed to the direct radiation of the sun while the opposite side is completely dark and exposed to the deep cold of outer space. This causes severe discrepancies in the temperature (and thus reliability and accuracy) of the transponders. The heat pipe cooling system designed for this purpose managed the high heat fluxes and demonstrated flawless operation with and without the influence of gravity. The cooling system developed was the first use of variable conductance heat pipes to actively regulate heat flow or evaporator temperature. \n\n\nWider usage[edit]\n\nNASA has tested heat pipes designed for extreme conditions, with some using liquid sodium metal as the working fluid. Other forms of heat pipes are currently used to cool communication satellites.[32] Publications in 1967 and 1968 by Feldman, Eastman,[33] and Katzoff first discussed applications of heat pipes for wider uses such as in air conditioning, engine cooling, and electronics cooling. These papers were also the first to mention flexible, arterial, and flat plate heat pipes. Publications in 1969 introduced the concept of the rotational heat pipe with its applications to turbine blade cooling and contained the first discussions of heat pipe applications to cryogenic processes.\n\nStarting in the 1980s Sony began incorporating heat pipes into the cooling schemes for some of its commercial electronic products in place of both forced convection and passive finned heat sinks. Initially they were used in receivers and amplifiers, soon spreading to other high heat flux electronics applications.\n\nDuring the late 1990s increasingly high heat flux microcomputer CPUs spurred a threefold increase in the number of U.S. heat pipe patent applications. As heat pipes evolved from a specialized industrial heat transfer component to a consumer commodity most development and production moved from the U.S. to Asia.\n\nModern CPU heat pipes are typically made of copper and use water as the working fluid.[34]\n\n\nApplications[edit]\n\nSpacecraft[edit]\n\n  \nHeat pipes on spacecraft typically use a grooved aluminium extrusion as the envelope\n\n\n\n  \nTypical grooved aluminium-ammonia VCHP for spacecraft thermal control, with the evaporator section on the bottom, and the Non-Condensable Gas reservoir just below the valve[35]\n\n\n\nThe spacecraft thermal control system has the function to keep all components on the spacecraft within their acceptable temperature range.  This is complicated by the following:\n\n\n\tWidely varying external conditions, such as eclipses\n\tMicro-g environment\n\tHeat removal from the spacecraft by thermal radiation only\n\tLimited electrical power available, favoring passive solutions\n\tLong lifetimes, with no possibility of maintenance\n\n\nSome spacecraft are designed to last for 20 years, so heat transport without electrical power or moving parts is desirable.  Rejecting the heat by thermal radiation means that large radiator panes (multiple square meters) are required.  Heat pipes and loop heat pipes are used extensively in spacecraft, since they don’t require any power to operate, operate nearly isothermally, and can transport heat over long distances.\n\nGrooved wicks are used in spacecraft heat pipes, as shown in the first photograph in this section. The heat pipes are formed by extruding aluminum, and typically have an integral flange to increase the heat transfer area, which lowers the temperature drop. Grooved wicks are used in spacecraft, instead of the screen or sintered wicks used for terrestrial heat pipes, since the heat pipes don’t have to operate against gravity in space.  This allows spacecraft heat pipes to be several meters long, in contrast to the roughly 25 cm maximum length for a water heat pipe operating on Earth. Ammonia is the most common working fluid for spacecraft heat pipes. Ethane is used when the heat pipe must operate at temperatures below the ammonia freezing temperature.\n\nThe second figure shows a typical grooved aluminium/ammonia variable conductance heat pipe (VCHP) for spacecraft thermal control.  The heat pipe is an aluminium extrusion, similar to that shown in the first figure.  The bottom flanged area is the evaporator. Above the evaporator, the flange is machined off to allow the adiabatic section to be bent.  The condenser is shown above the adiabatic section. The non-condensable gas (NCG) reservoir is located above the main heat pipe. The valve is removed after filling and sealing the heat pipe. When electric heaters are used on the reservoir, the evaporator temperature can be controlled within ±2 K of the setpoint.\n\n\nComputer systems[edit]\n\nHeat pipes began to be used in computer systems in the late 1990s,[36] when increased power requirements and subsequent increases in heat emission resulted in greater demands on cooling systems. They are now extensively used in many modern computer systems, typically to move heat away from components such as CPUs and GPUs to heat sinks where thermal energy may be dissipated into the environment.\n\n\nSolar thermal[edit]\n\nHeat pipes are also widely used in solar thermal water heating applications in combination with evacuated tube solar collector arrays. In these applications, distilled water is commonly used as the heat transfer fluid inside a sealed length of copper tubing that is located within an evacuated glass tube and oriented towards the sun. In connecting pipes, the heat transport occurs in the liquid steam phase because the thermal transfer medium is converted into steam in a large section of the collecting pipeline.[37]\n\nIn solar thermal water heating applications, an individual absorber tube of an evacuated tube collector is up to 40% more efficient compared to more traditional \"flat plate\" solar water collectors. This is largely due to the vacuum that exists within the tube, which slows down convective and conductive heat loss. Relative efficiencies of the evacuated tube system are reduced however, when compared to flat plate collectors because the latter have a larger aperture size and can absorb more solar energy per unit area. This means that while an individual evacuated tube has better insulation (lower conductive and convective losses) due to the vacuum created inside the tube, an array of tubes found in a completed solar assembly absorbs less energy per unit area due to there being less absorber surface area pointed toward the sun because of the rounded design of an evacuated tube collector. Therefore, real world efficiencies of both designs are about the same.\n\nEvacuated tube collectors reduce the need for anti-freeze additives since the vacuum helps slow heat loss. However, under prolonged exposure to freezing temperatures the heat transfer fluid can still freeze and precautions must be taken to ensure that the freezing liquid does not damage the evacuated tube when designing systems for such environments. Properly designed solar thermal water heaters can be frost protected down to more than -3 °C with special additives and are being used in Antarctica to heat water.[citation needed]\n\n\nPermafrost cooling[edit]\n\n  \nAlaska pipeline support legs cooled by heat pipe thermosyphons to keep permafrost frozen\n\n\n\nBuilding on permafrost is difficult because heat from the structure can thaw the permafrost. Heat pipes are used in some cases to avoid the risk of destabilization. For example, in the Trans-Alaska Pipeline System residual ground heat remaining in the oil as well as heat produced by friction and turbulence in the moving oil could conduct down the pipe's support legs and melt the permafrost on which the supports are anchored. This would cause the pipeline to sink and possibly be damaged. To prevent this, each vertical support member has been mounted with four vertical heat pipe thermosyphons.[38]\n\nThe significant feature of a thermosyphon is that it is passive and does not require any external power to operate. During the winter, the air is colder than the ground around the supports. The liquid ammonia at the bottom of the thermosyphon is vaporized by heat absorbed from the ground, cooling the surrounding permafrost and lowering its temperature.  During the summer, the thermosyphons stop operating, since there is no liquid ammonia available at the top of the heat pipe, but the extreme cooling during the winter allows the ground to remain frozen.\n\nHeat pipes are also used to keep the permafrost frozen alongside parts of the Qinghai–Tibet Railway where the embankment and track absorb the sun's heat. Vertical heat pipes on either side of relevant formations prevent that heat from spreading any further into the surrounding permafrost.\n\nDepending on application there are several thermosyphon designs:[39] thermoprobe, thermopile, depth thermosyphon, sloped-thermosyphon foundation, flat loop thermosyphon foundation, and hybrid flat loop thermosyphon foundation.\n\n\nCooking[edit]\n\nThe first commercial heat pipe product was the \"Thermal Magic Cooking Pin\" developed by Energy Conversion Systems, Inc. and first sold in 1966.[40]  The cooking pins used water as the working fluid.  The envelope was stainless steel, with an inner copper layer for compatibility.  During operation, one end of the heat pipe is poked through the roast.  The other end extends into the oven where it draws heat to the middle of the roast.  The high effective conductivity of the heat pipe reduces the cooking time for large pieces of meat by one-half.[41]\n\nThe principle has also been applied to camping stoves. The heat pipe transfers a large volume of heat at low temperature to allow goods to be baked and other dishes to be cooked in camping-type situations.\n\n\nVentilation heat recovery[edit]\n\nIn heating, ventilation and air-conditioning systems (HVAC) heat pipes are positioned within the supply and exhaust air streams of an air handling system or in the exhaust gases of an industrial process, in order to recover the heat energy.\n\nThe device consists of a battery of multi-row finned heat pipe tubes located within both the supply and exhaust air streams. Within the exhaust air side of the heat pipe, the refrigerant evaporates, extracting heat from the exhaust air. The refrigerant vapor moves towards the cooler end of the tube, within the supply air side of the device, where it condenses and releases heat. The condensed refrigerant returns by a combination of gravity and capillary action in the wick. Thus heat is transferred from the exhaust air stream through the tube wall to the refrigerant, and then from the refrigerant through the tube wall to the supply air stream.\n\nBecause of the characteristics of the device, better efficiencies are obtained when the unit is positioned upright with the supply air side mounted over the exhaust air side, which allows the liquid refrigerant to flow quickly back to the evaporator aided by the force of gravity. Generally, gross heat transfer efficiencies of up to 75% are claimed by manufacturers.[citation needed]\n\n\nNuclear power conversion[edit]\n\nGrover and his colleagues were working on cooling systems for nuclear power cells for space craft, where extreme thermal conditions are encountered. These alkali metal heat pipes transferred heat from the heat source to a thermionic or thermoelectric converter to generate electricity.\n\nSince the early 1990s, numerous nuclear reactor power systems have been proposed using heat pipes for transporting heat between the reactor core and the power conversion system.[42]  The first nuclear reactor to produce electricity using heat pipes  was first operated on September 13, 2012 in a demonstration using flattop fission.[43]\n\n\nWankel rotary combustion engines[edit]\n\nIgnition of the fuel mixture always takes place in the same part of Wankel engines, inducing thermal dilatation disparities that reduce power output, impair fuel economy, and accelerate wear. SAE paper 2014-01-2160, by Wei Wu et al., describes: 'A Heat Pipe Assisted Air-Cooled Rotary Wankel Engine for Improved Durability, Power and Efficiency',[citation needed] they obtained a reduction in top engine temperature from 231 °C to 129 °C, and the temperature difference reduced from 159 °C to 18 °C for a typical small-chamber-displacement air-cooled unmanned aerial vehicle engine.\n\n\nLimitations[edit]\n\nHeat pipes must be tuned to particular cooling conditions. The choice of pipe material, size, and coolant all have an effect on the optimal temperatures at which heat pipes work.\n\nWhen used outside of its design heat range, the heat pipe's thermal conductivity is effectively reduced to the heat conduction properties of its solid metal casing alone. In the case of a copper casing, that is around 1/80 of the original flux. This is because below the intended temperature range the working fluid will not undergo phase change, while above it, all of the working fluid in the heat pipe vaporizes and the condensation process ceases.\n\nMost manufacturers cannot make a traditional heat pipe smaller than 3 mm in diameter due to material limitations.[44]\n\n\nSee also[edit]\n\n\n\tAir cooling\n\tCPU cooling\n\tEvaporative cooling\n\tHeat sink\n\tLoop heat pipe\n\tPeltier-Seebeck effect\n\tPhase-change material\n\tThermoelectric cooling\n\tThermosiphon\n\tVapor-compression refrigeration\n\tWater cooling\n\n\n\n\nReferences[edit]\n\n\n\t^ Faghri, A, 2016, Heat Pipe Science and Technology, Second edition, Global Digital Press.\n\n\t^ \"Improving materials that convert heat to electricity and vice-versa\". Ecnmag.com. May 6, 2013. Retrieved 2013-05-07.\n\n\t^ a b Popular Science – Google Books. June 1974. Retrieved 2013-05-07.\n\n\n\t^ Jim Danneskiold, Los Alamos-developed heat pipes ease space flight. Los Alamos News Release, April 26, 2000.\n\n\t^ Life Tests Archived 2014-11-03 at the Wayback Machine\n\n\t^ \"Incompatible Heat Pipe Fluid/Envelope Pairs\". www.1-act.com.\n\n\n\t^ \"Heat Pipe Materials, Working Fluids, and Compatibility\". www.1-act.com.\n\n\n\t^ \"Compatible Heat Pipe Fluids and Materials - Heat Pipe Technology\". www.1-act.com.\n\n\n\t^ \"Heat Pipes - Different Kinds of Heat Pipes\". www.1-act.com.\n\n\n\t^ Advanced Cooling Technologies Inc. (29 November 2013). \"Vapor Chamber Animation\" – via YouTube.\n\n\n\t^ \"Vapor Chambers\". www.1-act.com.\n\n\n\t^ \"High Heat Flux, High Power, Low Resistance, Low CTE Two-Phase Thermal Ground Planes for Direct Die Attach Applications\". www.1-act.com.\n\n\n\t^ \"Modeling and Design Optimization of Ultra-Thin Vapor Chambers for High Heat Flux Applications, R. Ranjan et al., Purdue University Cooling Technologies Research Center Publications, Paper 186, 2012\". purdue.edu.\n\n\n\t^ \"VCHPs for Passively Controlling Temperature\". www.1-act.com.\n\n\n\t^ \"PCHPs for Precise Temperature Control\". www.1-act.com.\n\n\n\t^ \"Pressure Controlled Heat Pipe Applications\". www.1-act.com.\n\n\n\t^ \"Diode Heat Pipes\". www.1-act.com.\n\n\n\t^ \"Variable Conductance Heat Pipes for Variable Thermal Links\". www.1-act.com.\n\n\n\t^ Advanced Cooling Technologies Inc. (7 November 2013). \"Liquid Trap Diode Heat Pipes Animation\" – via YouTube.\n\n\n\t^ \"Thermosyphon Heat Exchanger, Cooling Systems & Reboilers by ACT\". www.1-act.com.\n\n\n\t^ T. Storch et al., “Wetting and Film Behavior Of Propane Inside Geothermal Heat Pipes”, 16th International Heat Pipe Conference, Lyon, France, May 20–24, 2012.\n\n\t^ Ku, Jentung; Ottenstein, Laura; Douglas, Donya; Hoang, Triem. \"Multi-Evaporator Miniature Loop Heat Pipe for Small Spacecraft Thermal Control\". American Institute of Aeronautics and Astronomics. Goddard Space Flight Center. hdl:2060/20110015223.\n\n\n\t^ Ku, Jentung; Paiva, Kleber; Mantelli, Marcia. \"Loop Heat Pipe Transient Behavior Using Heat Source Temperature for Set Point Control with Thermoelectric Converter on Reservoir\". NASA. Goddard Space Flight Center. hdl:2060/20110015224.\n\n\n\t^ https://www.electronics-cooling.com/2003/05/an-introduction-to-pulsating-heat-pipes/\n\n\t^ \"Intermediate Temperature Heat Pipe Life Tests and Analyses\". www.1-act.com.\n\n\n\t^ \"Heat Pipes\", Fifth Edition, D. A. Reay, P.A. Kew, p. 10.\n\n\t^ Gaugler, Richard (1944). \"Heat Transfer Devices\". Dayton, Ohio: U.S. Patent Office: 4. 2350348. Cite journal requires |journal= (help)\n\n\n\t^ \"Heat transfer device\". google.com.\n\n\n\t^ \"Evaporation-condensation heat transfer device\". google.com.\n\n\n\t^ \"George M. Grover, 81, Inventor Of Popular Heat Transfer Device\", November 3, 1996, New York Times\n\n\t^ Energy, Tom Harper, Chief Information Officer, Los Alamos National Laboratory, Operated by Los Alamos National Security, LLC, for theU.S. Department of. \"Service Unavailable\". www.lanl.gov.\n\n\n\t^ \"Inspired Heat-Pipe Technology\", lanl.gov\n\n\t^ G. Y. Eastman, “The Heat Pipe” Scientific American, Vol. 218, No. 5, pp. 38-46, May 1968.\n\n\t^ \nJansson, Dick (2010). \"Heat Pipes\" (PDF). QEX. ARRL (Jul–Aug2010): 3–9. Retrieved November 14, 2011.\n\n\n\t^ \"Variable Conductance Heat Pipes for Variable Thermal Links\". www.1-act.com.\n\n\n\t^ [1], 1998, Hong Xie, Intel Corp, IEEE\n\n\t^ Planning and Installing Solar Thermal Systems: A Guide for Installers ... – Google Books. 2005. ISBN 9781844071258. Retrieved 2013-05-07.\n\n\n\t^ C. E Heuer, “The Application of Heat Pipes on the Trans-Alaska Pipeline” Special Report 79-26, United States Army Corps of Engineers, Sept. 1979.\n\n\t^ \"Thermosyphon technology for Artificial Ground Freezing (AGF)\". simmakers.com.\n\n\n\t^ Midwest Research Institute,  Heat Pipes, NASA Report NASA CR-2508, pg. 19, Jan 1, 1975.\n\n\t^ Kew, David Anthony Reay ; Peter. A. (2006). Heat pipes (5th ed.). Oxford: Butterworth-Heinemann. p. 309. ISBN 978-0-7506-6754-8.\n\n\n\t^ \"Nuclear Reactors for Space\". World Nuclear Association. Retrieved 21 September 2012.\n\n\n\t^ \"Researchers test novel power system for space travel\".\n\n\n\t^ \"Things to Consider When Bending or Flattening A Heat Pipe | Enertron\". Retrieved 2019-04-22.\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to heatpipes.\n\n\n\tFrontiers in Heat Pipes (FHP) – An International Journal\n\tHouse_N Research (mit.edu)\n\tHeat pipe selection guide (pdf)\n\tHeat Pipe Basics and Demonstration\n\n\n\t\tv\n\tt\n\te\n\n\nHeating, ventilation, and air conditioning\n\n\tFundamental concepts\t\n\tAir changes per hour\n\tBake-out\n\tBuilding envelope\n\tConvection\n\tDilution\n\tDomestic energy consumption\n\tEnthalpy\n\tFluid dynamics\n\tGas compressor\n\tHeat pump and refrigeration cycle\n\tHeat transfer\n\tHumidity\n\tInfiltration\n\tLatent heat\n\tNoise control\n\tOutgassing\n\tParticulates\n\tPsychrometrics\n\tSensible heat\n\tStack effect\n\tThermal comfort\n\tThermal destratification\n\tThermal mass\n\tThermodynamics\n\tVapour pressure of water\n\n\n\n\n\tTechnology\t\n\tAbsorption refrigerator\n\tAir barrier\n\tAir conditioning\n\tAntifreeze\n\tAutomobile air conditioning\n\tAutonomous building\n\tBuilding insulation materials\n\tCentral heating\n\tCentral solar heating\n\tChilled beam\n\tChilled water\n\tConstant air volume (CAV)\n\tCoolant\n\tDedicated outdoor air system (DOAS)\n\tDeep water source cooling\n\tDemand-controlled ventilation (DCV)\n\tDisplacement ventilation\n\tDistrict cooling\n\tDistrict heating\n\tElectric heating\n\tEnergy recovery ventilation (ERV)\n\tFirestop\n\tForced-air\n\tForced-air gas\n\tFree cooling\n\tHeat recovery ventilation (HRV)\n\tHybrid heat\n\tHydronics\n\tHVAC\n\tIce storage air conditioning\n\tKitchen ventilation\n\tMixed-mode ventilation\n\tMicrogeneration\n\tNatural ventilation\n\tPassive cooling\n\tPassive house\n\tRadiant heating and cooling system\n\tRadiant cooling\n\tRadiant heating\n\tRadon mitigation\n\tRefrigeration\n\tRenewable heat\n\tRoom air distribution\n\tSolar air heat\n\tSolar combisystem\n\tSolar cooling\n\tSolar heating\n\tThermal insulation\n\tUnderfloor air distribution\n\tUnderfloor heating\n\tVapor barrier\n\tVapor-compression refrigeration (VCRS)\n\tVariable air volume (VAV)\n\tVariable refrigerant flow (VRF)\n\tVentilation\n\n\n\n\n\tComponents\t\n\tAir conditioner inverter\n\tAir door\n\tAir filter\n\tAir handler\n\tAir ionizer\n\tAir-mixing plenum\n\tAir purifier\n\tAir source heat pumps\n\tAutomatic balancing valve\n\tBack boiler\n\tBarrier pipe\n\tBlast damper\n\tBoiler\n\tCentrifugal fan\n\tCeramic heater\n\tChiller\n\tCondensate pump\n\tCondenser\n\tCondensing boiler\n\tConvection heater\n\tCompressor\n\tCooling tower\n\tDamper\n\tDehumidifier\n\tDuct\n\tEconomizer\n\tElectrostatic precipitator\n\tEvaporative cooler\n\tEvaporator\n\tExhaust hood\n\tExpansion tank\n\tFan coil unit\n\tFan filter unit\n\tFan heater\n\tFire damper\n\tFireplace\n\tFireplace insert\n\tFreeze stat\n\tFlue\n\tFreon\n\tFume hood\n\tFurnace\n\tFurnace room\n\tGas compressor\n\tGas heater\n\tGasoline heater\n\tGeothermal heat pump\n\tGrease duct\n\tGrille\n\tGround-coupled heat exchanger\n\tHeat exchanger\n\tHeat pipe\n\tHeat pump\n\tHeating film\n\tHeating system\n\tHigh efficiency glandless circulating pump\n\tHigh-efficiency particulate air (HEPA)\n\tHigh pressure cut off switch\n\tHumidifier\n\tInfrared heater\n\tInverter compressor\n\tKerosene heater\n\tLouver\n\tMechanical fan\n\tMechanical room\n\tOil heater\n\tPackaged terminal air conditioner\n\tPlenum space\n\tPressurisation ductwork\n\tProcess duct work\n\tRadiator\n\tRadiator reflector\n\tRecuperator\n\tRefrigerant\n\tRegister\n\tReversing valve\n\tRun-around coil\n\tScroll compressor\n\tSolar chimney\n\tSolar-assisted heat pump\n\tSpace heater\n\tSmoke exhaust ductwork\n\tThermal expansion valve\n\tThermal wheel\n\tThermosiphon\n\tThermostatic radiator valve\n\tTrickle vent\n\tTrombe wall\n\tTurning vanes\n\tUltra-low particulate air (ULPA)\n\tWhole-house fan\n\tWindcatcher\n\tWood-burning stove\n\n\n\n\n\tMeasurement\nand control\t\n\tAir flow meter\n\tAquastat\n\tBACnet\n\tBlower door\n\tBuilding automation\n\tCarbon dioxide sensor\n\tClean Air Delivery Rate (CADR)\n\tGas sensor\n\tHome energy monitor\n\tHumidistat\n\tHVAC control system\n\tIntelligent buildings\n\tLonWorks\n\tMinimum efficiency reporting value (MERV)\n\tOpenTherm\n\tProgrammable communicating thermostat\n\tProgrammable thermostat\n\tPsychrometrics\n\tRoom temperature\n\tSmart thermostat\n\tThermostat\n\tThermostatic radiator valve\n\n\n\n\n\tProfessions, trades,\nand services\t\n\tArchitectural acoustics\n\tArchitectural engineering\n\tArchitectural technologist\n\tBuilding services engineering\n\tBuilding information modeling (BIM)\n\tDeep energy retrofit\n\tDuct leakage testing\n\tEnvironmental engineering\n\tHydronic balancing\n\tKitchen exhaust cleaning\n\tMechanical engineering\n\tMechanical, electrical, and plumbing\n\tMold growth, assessment, and remediation\n\tRefrigerant reclamation\n\tTesting, adjusting, balancing\n\n\n\n\n\tIndustry organizations\t\n\tACCA\n\tAMCA\n\tASHRAE\n\tASTM International\n\tBRE\n\tBSRIA\n\tCIBSE\n\tLEED\n\tSMACNA\n\n\n\n\n\tHealth and safety\t\n\tIndoor air quality (IAQ)\n\tPassive smoking\n\tSick building syndrome (SBS)\n\tVolatile organic compound (VOC)\n\n\n\n\n\tSee also\t\n\tASHRAE Handbook\n\tBuilding science\n\tFireproofing\n\tGlossary of HVAC terms\n\tTemplate:Home automation\n\tTemplate:Solar energy\n\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4132614-3\n\tNDL: 00576130\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Heat_pipe&oldid=918671202\"\n\n\t\t\n\t\tCategories: \tHeating, ventilating, and air conditioning\n\tComputer hardware cooling\n\tHeat conduction\n\tSpacecraft components\n\tHeat transfer\n\n\nHidden categories: \tWebarchive template wayback links\n\tCS1 errors: missing periodical\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from July 2019\n\tArticles with unsourced statements from March 2011\n\tArticles with unsourced statements from July 2013\n\tArticles with unsourced statements from August 2019\n\tCommons category link is locally defined\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tБългарски\n\tČeština\n\tDansk\n\tDeutsch\n\tEspañol\n\tفارسی\n\tFrançais\n\t한국어\n\tItaliano\n\tҚазақша\n\tNederlands\n\t日本語\n\tPolski\n\tPortuguês\n\tРусский\n\tSlovenčina\n\tSuomi\n\tSvenska\n\tไทย\n\tУкраїнська\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 29 September 2019, at 20:16 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "6", "dc:title": "Heat pipe - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Laptop_Heat_Pipe.JPG/1200px-Laptop_Heat_Pipe.JPG", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-heat_pipe", "title": "Heat pipe - Wikipedia"}}