{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJames Webb Space Telescope - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tJames Webb Space Telescope\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\"Next generation space telescope\" redirects here. For future generations of space telescopes, see List of space telescopes and List of proposed space observatories.\n\nSpace observatory\n\n\n\n\n\nJames Webb Space Telescope\tA rendering of the James Webb Space Telescope with its components fully deployed\n\n\t\n\tMission type\tAstronomy\n\tOperator\tNASA / ESA / CSA / STScI[1]\n\tWebsite\tjwst.nasa.gov\nsci.esa.int/jwst\nasc-csa.gc.ca\njwst.stsci.edu\n\tMission duration\t5 years (design)\n10 years (goal)\n\t\n\n\t\n\tSpacecraft properties\n\tManufacturer\tNorthrop Grumman\nBall Aerospace\n\tLaunch mass\t6,500 kg (14,300 lb)[2]\n\tDimensions\t20.197 m × 14.162 m (66.26 ft × 46.46 ft) (sunshield)\n\tPower\t2,000 watts\n\t\n\n\t\n\tStart of mission\n\tLaunch date\t30 March 2021 (planned)[3]\n\tRocket\tAriane 5 ECA\n\tLaunch site\tKourou ELA-3\n\tContractor\tArianespace\n\t\n\n\t\n\tOrbital parameters\n\tReference system\tSun–Earth L2\n\tRegime\tHalo orbit\n\tPeriapsis altitude\t374,000 km (232,000 mi)[4]\n\tApoapsis altitude\t1,500,000 km (930,000 mi)[4]\n\tPeriod\t6 months\n\tEpoch\tplan\n\t\n\n\t\n\tMain\n\tType\tKorsch telescope\n\tDiameter\t6.5 m (21 ft)\n\tFocal length\t131.4 m (431 ft)\n\tCollecting area\t25.4 m2 (273 sq ft)[5]\n\tWavelengths\tfrom 0.6 µm (orange)\nto 28.5 µm (mid-infrared)\n\t\n\n\t\n\tTransponders\n\tBand\tS-band (TT&C support)\nKa band (data acquisition)\n\tBandwidth\tS-band up: 16 kbit/s\nS-band down: 40 kbit/s\nKa band down: up to 28 Mbit/s\n\t\n\n\t\tInstruments\n\tNIRCam\tNear IR Camera\n\tNIRSpec\tNear-Infrared Spectrograph\n\tMIRI\tMid IR Instrument\n\tNIRISS\tNear Infrared Imager and Slitless Spectrograph\n\tFGS\tFine Guidance Sensor\n\n\nElements:\n\n\n\tIntegrated Science Instrument Module\n\tOptical Telescope Element\n\tSpacecraft Element (Spacecraft Bus+Sunshield)\n\n\n\n\n\n\t\nJames Webb Space Telescope insignia\n \n\n\nThe James Webb Space Telescope (JWST or \"Webb\") is a space telescope that is planned to be the successor to the Hubble Space Telescope.[6][7] The JWST will provide greatly improved resolution and sensitivity over the Hubble, and will enable a broad range of investigations across the fields of astronomy and cosmology, including observing some of the most distant events and objects in the universe, such as the formation of the first galaxies. Other goals include understanding the formation of stars and planets, and direct imaging of exoplanets and novas.[8]\n\nThe primary mirror of the JWST, the Optical Telescope Element, is composed of 18 hexagonal mirror segments which combine to create a 6.5-meter (21 ft; 260 in) diameter mirror that is much larger than the Hubble's 2.4-meter (7.9 ft; 94 in) mirror.  Unlike the Hubble, which observes in the near ultraviolet, visible, and near infrared (0.1 to 1 μm) spectra, the JWST will observe in a lower frequency range, from long-wavelength visible light through mid-infrared (0.6 to 27 μm), which will allow it to observe high redshift objects that are too old and too distant for the Hubble to observe.[9] The telescope must be kept very cold in order to observe in the infrared without interference, so it will be deployed in space near the Earth–Sun L2 Lagrangian point, and a large sunshield will keep its mirror and instruments below 50 K (−220 °C; −370 °F).[10]\n\nThe JWST is being developed by NASA—with significant contributions from the European Space Agency and the Canadian Space Agency[1]—and is named for James E. Webb, who was the administrator of NASA from 1961 to 1968 and played an integral role in the Apollo program.[11][12] Development began in 1996 for a launch that was initially planned for 2007, but the project has had numerous delays and cost overruns, and underwent a major redesign in 2005. The JWST's construction was completed in late 2016, after which its extensive testing phase began.[13][14] In March 2018, NASA delayed the launch after the telescope's sunshield ripped during a practice deployment.[15] Launch was delayed again in June 2018 following recommendations from an independent review board, and is currently scheduled for March 2021.[3][16][17] On 28 August 2019, it was confirmed by NASA that construction was completely finished.[18]\n\n\nContents\n\n\n\t1 Features\n\t1.1 Sunshield protection\n\t1.2 Optics\n\t1.3 Scientific instruments\n\t1.4 Spacecraft Bus\n\n\n\n\t2 Comparison with other telescopes\n\t3 History\n\t3.1 Development and construction\n\t3.2 Cost and schedule issues\n\t3.3 Partnership\n\t3.4 Public displays and outreach\n\n\n\n\t4 Mission\n\t4.1 Launch and mission length\n\t4.2 Orbit\n\t4.3 Infrared astronomy\n\t4.4 Ground support and operations\n\n\n\n\t5 After-launch deployment\n\t6 Allocation of observation times\n\t6.1 Early Release Science Program\n\n\n\n\t7 See also\n\t8 Notes\n\t9 References\n\t10 Further reading\n\t11 External links\n\n\n\n\n\nFeatures[edit]\n\n  \nLaunch configuration of the JWST in an Ariane 5.\n\n\n\n\n\nThe JWST has an expected mass about half of Hubble Space Telescope's, but its primary mirror (a 6.5 meter diameter gold-coated beryllium reflector) will have a collecting area about five times as large (25 m2 or 270 sq ft vs. 4.5 m2 or 48 sq ft). The JWST is oriented toward near-infrared astronomy, but can also see orange and red visible light, as well as the mid-infrared region, depending on the instrument. The design emphasizes the near to mid-infrared for three main reasons: High-redshift objects have their visible emissions shifted into the infrared, cold objects such as debris disks and planets emit most strongly in the infrared, and this band is difficult to study from the ground or by existing space telescopes such as Hubble.  Ground-based telescopes must look through the atmosphere, which is opaque in many infrared bands (see figure of atmospheric transmission).  Even where the atmosphere is transparent, many of the target chemical compounds, such as water, carbon dioxide, and methane, also exist in the Earth's atmosphere, vastly complicating analysis. Existing space telescopes such as Hubble cannot study these bands since their mirrors are not cool enough (the Hubble mirror is maintained at about 15 °C (288 K)) and hence the telescope itself radiates strongly in the infrared bands.[citation needed]\n\nThe JWST will operate near the Earth–Sun L2 (Lagrange) point, approximately 1,500,000 km (930,000 mi) beyond Earth's orbit. By way of comparison, Hubble orbits 550 kilometres (340 mi) above Earth's surface, and the Moon is roughly 400,000 kilometres (250,000 mi) from Earth. This distance makes post-launch repair or upgrade of the JWST hardware virtually impossible. Objects near this point can orbit the Sun in synchrony with the Earth, allowing the telescope to remain at a roughly constant distance[19] and use a single sunshield to block heat and light from the Sun and Earth. This will keep the temperature of the spacecraft below 50 K (−220 °C; −370 °F), necessary for infrared observations.[10][20] The prime contractor is Northrop Grumman.[21]\n\n\n\t\n\t\t\t\n\n\n\t\t\t\nThree-quarter view of the top\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nBottom (sun-facing side)\n\n\n\t\t\t\n\n\t\t\n\n\n\n\n\nSunshield protection[edit]\n\n  \nTest unit of the sunshield stacked and expanded at the Northrop Grumman facility in California, 2014.\n\n\n\nMain article: Sunshield (JWST)\n\nTo make observations in the infrared spectrum, the JWST must be kept very cold (under 50 K (−220 °C; −370 °F)), otherwise infrared radiation from the telescope itself would overwhelm its instruments. Therefore, it uses a large sunshield to block light and heat from the Sun, Earth, and Moon, and its position near the Earth–Sun L2 point keeps all three bodies on the same side of the spacecraft at all times.[22] Its halo orbit around L2 avoids the shadow of the Earth and Moon, maintaining a constant environment for the sunshield and solar arrays.[19] The shielding maintains a stable temperature throughout the structures on the dark side, which is critical to maintaining precise alignment of the primary mirror segments.[citation needed]\n\nThe five-layer sunshield is constructed from polyimide film, with membranes coated with aluminum on one side and silicon on the other.[23]  Accidental tears of the delicate film structure during testing are one factor delaying the project.[24]\n\nThe sunshield is designed to be folded twelve times so it will fit within the Ariane 5 rocket's 4.57 m (5 yards) × 16.19 m (17.7 yards) payload fairing. Once deployed at the L2 point, it will unfold to 21.197 m (23.18 yards) × 14.162 m (15.55 yards). The sunshield was hand-assembled at ManTech (NeXolve) in Huntsville, Alabama, before it was delivered to Northrop Grumman in Redondo Beach, California, USA for testing.[25]\n\n\nOptics[edit]\n\n  \nMain mirror assembled at Goddard Space Flight Center, May 2016.\n\n\n\nMain article: Optical Telescope Element\n\nJWST's primary mirror is a 6.5-meter-diameter gold-coated beryllium reflector with a collecting area of 25 m2.  This is too large for existing launch vehicles, so the mirror is composed of 18 hexagonal segments, which will unfold after the telescope is launched. Image plane wavefront sensing through phase retrieval will be used to position the mirror segments in the correct location using very precise micro-motors.  Subsequent to this initial configuration they will only need occasional updates every few days to retain optimal focus.[26] This is unlike terrestrial telescopes like the Keck which continually adjust their mirror segments using active optics to overcome the effects of gravitational and wind loading, and is made possible because of the lack of environmental disturbances of a telescope in space.[citation needed]\n\nJWST's optical design is a three-mirror anastigmat,[27] which makes use of curved secondary and tertiary mirrors to deliver images that are free of optical aberrations over a wide field. In addition, there is a fast steering mirror, which can adjust its position many times per second to provide image stabilization.\n\nBall Aerospace & Technologies Corp. is the principal optical subcontractor for the JWST project, led by prime contractor Northrop Grumman Aerospace Systems, under a contract from the NASA Goddard Space Flight Center, in Greenbelt, Maryland.[2][28]  Eighteen primary mirror segments, secondary, tertiary and fine steering mirrors, plus flight spares have been fabricated and polished by Ball Aerospace based on beryllium segment blanks manufactured by several companies including Axsys, Brush Wellman, and Tinsley Laboratories.[citation needed]\n\nThe final segment of the primary mirror was installed on 3 February 2016,[29] and the secondary mirror was installed on 3 March 2016.[30]\n\n\nScientific instruments[edit]\n\nThe Integrated Science Instrument Module (ISIM) is a framework that provides electrical power, computing resources, cooling capability as well as structural stability to the Webb telescope. It is made with bonded graphite-epoxy composite attached to the underside of Webb's telescope structure. The ISIM holds the four science instruments and a guide camera.[31]\n\n\n  \nNIRCam model\n\n\n\n  \nNIRSpec model\n\n\n\n  \nMIRI 1:3 scale model\n\n\n\n\tNear InfraRed Camera (NIRCam) is an infrared imager which will have a spectral coverage ranging from the edge of the visible (0.6 micrometers) through the near infrared (5 micrometers).[32][33] NIRCam will also serve as the observatory's wavefront sensor, which is required for wavefront sensing and control activities. NIRCam was built by a team led by the University of Arizona, with Principal Investigator Marcia J. Rieke. The industrial partner is Lockheed-Martin's Advanced Technology Center located in Palo Alto, California.[34]\n\tNear InfraRed Spectrograph (NIRSpec) will also perform spectroscopy over the same wavelength range. It was built by the European Space Agency at ESTEC in Noordwijk, Netherlands. The leading development team is composed of people from Airbus Defence and Space, Ottobrunn and Friedrichshafen, Germany, and the Goddard Space Flight Center; with Pierre Ferruit (École normale supérieure de Lyon) as NIRSpec project scientist. The NIRSpec design provides three observing modes: a low-resolution mode using a prism, an R~1000 multi-object mode and an R~2700 integral field unit or long-slit spectroscopy mode.[35] Switching of the modes is done by operating a wavelength preselection mechanism called the Filter Wheel Assembly, and selecting a corresponding dispersive element (prism or grating) using the Grating Wheel Assembly mechanism.[35] Both mechanisms are based on the successful ISOPHOT wheel mechanisms of the Infrared Space Observatory. The multi-object mode relies on a complex micro-shutter mechanism to allow for simultaneous observations of hundreds of individual objects anywhere in NIRSpec's field of view. The mechanisms and their optical elements were designed, integrated and tested by Carl Zeiss Optronics GmbH of Oberkochen, Germany, under contract from Astrium.[35]\n\tMid-InfraRed Instrument (MIRI) will measure the mid-to-long-infrared wavelength range from 5 to 27 micrometers.[36][37] It contains both a mid-infrared camera and an imaging spectrometer.[2] MIRI was developed as a collaboration between NASA and a consortium of European countries, and is led by George Rieke (University of Arizona) and Gillian Wright (UK Astronomy Technology Centre, Edinburgh, part of the Science and Technology Facilities Council (STFC)).[34] MIRI features similar wheel mechanisms as NIRSpec which are also developed and built by Carl Zeiss Optronics GmbH under contract from the Max Planck Institute for Astronomy, Heidelberg. The completed Optical Bench Assembly of MIRI was delivered to Goddard in mid-2012 for eventual integration into the ISIM. The temperature of the MIRI must not exceed 6 Kelvin (K): a helium gas mechanical cooler sited on the warm side of the environmental shield provides this cooling.[38]\n\tFine Guidance Sensor and Near InfraRed Imager and Slitless Spectrograph (FGS/NIRISS), led by the Canadian Space Agency under project scientist John Hutchings (Herzberg Institute of Astrophysics, National Research Council of Canada), is used to stabilize the line-of-sight of the observatory during science observations. Measurements by the FGS are used both to control the overall orientation of the spacecraft and to drive the fine steering mirror for image stabilization. The Canadian Space Agency is also providing a Near Infrared Imager and Slitless Spectrograph (NIRISS) module for astronomical imaging and spectroscopy in the 0.8 to 5 micrometer wavelength range, led by principal investigator René Doyon at the University of Montreal.[34] Because the NIRISS is physically mounted together with the FGS, they are often referred to as a single unit, but they serve entirely different purposes, with one being a scientific instrument and the other being a part of the observatory's support infrastructure.\n\n\nNIRCam and MIRI feature starlight-blocking coronagraphs for observation of faint targets such as extrasolar planets and circumstellar disks very close to bright stars.[37]\n\nThe infrared detectors for the NIRCam, NIRSpec, FGS, and NIRISS modules are being provided by Teledyne Imaging Sensors (formerly Rockwell Scientific Company). The James Webb Space Telescope (JWST) Integrated Science Instrument Module (ISIM) and Command and Data Handling (ICDH) engineering team uses SpaceWire to send data between the science instruments and the data-handling equipment.[39]\n\n\nSpacecraft Bus[edit]\n\nMain article: Spacecraft Bus (JWST)\n\n  \nDiagram of the Spacecraft Bus. The solar panel is in green and the light purple flats are radiators shades.\n\n\n\nThe Spacecraft Bus is the primary support component of the James Webb Space Telescope, that hosts a multitude of computing, communication, propulsion, and structural parts, bringing the different parts of the telescope together.[40] Along with the Sunshield, it forms the Spacecraft Element of the space telescope.[41] The other two major elements of the JWST are the Integrated Science Instrument Module (ISIM) and the Optical Telescope Element (OTE).[42] Region 3 of ISIM is also inside the Spacecraft Bus; region 3 includes ISIM Command and Data Handling subsystem and the MIRI cryocooler.[42]\n\nThe Spacecraft Bus is connected to Optical Telescope Element via the Deployable Tower Assembly, which also connects to the sunshield.[40]\n\nThe structure of the Spacecraft Bus must support the 6.5-ton space telescope, while it itself weighs 350 kg (about 770 lb).[8] It is made primarily of graphite composite material.[8] It was assembled in California by 2015, and after that it had to be integrated with the rest of the space telescope leading up to its planned 2021 launch. The bus can provide pointing of one-arcsecond and isolates vibration down to two milliarcseconds.[43]\n\nThe Spacecraft Bus is on the Sun-facing \"warm\" side and operates at a temperature of about 300 K.[41] Everything on the Sun facing side must be able to handle the thermal conditions of JWST's halo orbit, which has one side in continuous sunlight and the other in the shade of the spacecraft sunshield.[41]\n\nAnother important aspect of the Spacecraft Bus is the central computing, memory storage, and communications equipment.[40] The processor and software direct data to and from the instruments, to the solid-state memory core, and to the radio system which can send data back to Earth and receive commands.[40] The computer also controls the pointing and moment of the spacecraft, taking in sensor data from the gyroscopes and star tracker, and sending the necessary commands to the reaction wheels or thrusters depending.[40]\n\n\nComparison with other telescopes[edit]\n\n  \nComparison with Hubble primary mirror\n\n\n\n  \nCalisto architecture for SAFIR would be a successor to Spitzer, requiring even cooler passive cooling than JWST (5 Kelvin).[44]\n\n\n\n  \nAtmospheric windows in the infrared: much of this type of light is blocked when viewed from the Earth's surface. It would be like looking at a rainbow but only seeing one color.\n\n\n\nThe desire for a large infrared space telescope traces back decades; in the United States the Shuttle Infrared Telescope Facility was planned while the Space Shuttle was in development and the potential for infrared astronomy was acknowledged at that time.[45] Compared to ground telescopes, space observatories were free from atmospheric absorption of infrared light; this would be a whole \"new sky\" for astronomers.[45]\n\n\nThe tenuous atmosphere above the 400 km nominal flight altitude has no measurable absorption so that detectors operating at all wavelengths from 5 µm to 1000 µm can achieve high radiometric sensitivity.\n— S. G. McCarthy & G. W. Autio, 1978[45]\n\n\n\nHowever, infrared telescopes have a disadvantage—they need to stay extremely cold and the longer the wavelength of infrared, the colder they need to be.[46] If not, the background heat of the device itself overwhelms the detectors, making it effectively blind.[46] This can be overcome by careful spacecraft design, in particular by placing the telescope in a dewar with an extremely cold substance, such as liquid helium.[46] This has meant most infrared telescopes have a lifespan limited by their coolant, as short as a few months, maybe a few years at most.[46] It has been possible to maintain a temperature low enough through the design of the spacecraft to enable near-infrared observations without a supply of coolant, such as the extended missions of Spitzer and NEOWISE. Another example is Hubble's NICMOS instrument, which started out using a block of nitrogen ice that depleted after a couple of years, but was then converted to a cryocooler that worked continuously. The James Webb Space Telescope is designed to cool itself without a dewar, using a combination of sunshield and radiators with the mid-infrared instrument using an additional cryocooler.[47]\n\nThe telescope's delays and cost increases can be compared to the Hubble Space Telescope.[48] When Hubble formally started in 1972, it had an estimated development cost of $300 million (or about $1 billion in 2006 constant dollars),[48] but by the time it was sent into orbit in 1990, the cost was about four times that.[48] In addition new instruments and servicing missions increased the cost to at least $9 billion by 2006.[48]\n\nIn contrast to other proposed observatories, most of which have already been canceled or put on hold, including Terrestrial Planet Finder (2011), Space Interferometry Mission (2010), International X-ray Observatory (2011), MAXIM (Microarcsecond X-ray Imaging Mission), SAFIR (Single Aperture Far-Infrared Observatory), SUVO (Space Ultraviolet-Visible Observatory), and the SPECS (Submillimeter Probe of the Evolution of Cosmic Structure), the JWST is the last big NASA astrophysics mission of its generation to be built.[citation needed]\n\n\n\tSelected space telescopes and instruments[49]\n\n\tName\tYear\tWavelength\tAperture\tCooling\n\n\tHuman eye\t~600 million years ago[50]\t0.39–0.75 μm\t0.007 m\tPassive\n\n\tIRT\t1985\t1.7–118 μm\t0.15 m\tHelium\n\n\tISO[51]\t1995\t2.5–240 μm\t0.60 m\tHelium\n\n\tHubble STIS\t1997\t0.115–1.03 μm\t2.4 m\tPassive\n\n\tHubble NICMOS\t1997\t0.8–2.4 μm\t2.4 m\tNitrogen, later cryocooler\n\n\tSpitzer\t2003\t3–180 μm\t0.85 m\tHelium\n\n\tHubble WFC3\t2009\t0.2–1.7 μm\t2.4 m\tPassive +  Thermo-electric [52]\n\n\tHerschel\t2009\t55–672 μm\t3.5 m\tHelium\n\n\tJWST\tPlanned\t0.6–28.5 μm\t6.5 m\tPassive + cryocooler (MIRI)\n\n\n\n\n\nHistory[edit]\n\nDevelopment and construction[edit]\n\nSelected Events\n\tYear\tEvents\n\n\t1996\tNGST started.\n\n\t2002\tnamed JWST, 8 to 6 m\n\n\t2004\tNEXUS cancelled[53]\n\n\t2007\tESA/NASA MOU\n\n\t2010\tMCDR passed\n\n\t2011\tProposed cancel\n\n\t2021\tPlanned launch\n\n\n\nEarly development work for a Hubble successor between 1989 and 1994 led to the Hi-Z[54] telescope concept, a fully baffled[Note 1] 4-meter aperture infrared telescope that would recede to an orbit at 3 AU.[55] This distant orbit would have benefited from reduced light noise from zodiacal dust.[55] Other early plans called for a NEXUS precursor telescope mission.[56][57]\n\nThe JWST originated in 1996 as the Next Generation Space Telescope (NGST). In 2002 it was renamed after NASA's second administrator (1961–1968) James E. Webb (1906–1992), noted for playing a key role in the Apollo program and establishing scientific research as a core NASA activity.[58] The JWST is a project of the National Aeronautics and Space Administration, the United States space agency, with international collaboration from the European Space Agency and the Canadian Space Agency.\n\nIn the \"faster, better, cheaper\" era in the mid-1990s, NASA leaders pushed for a low-cost space telescope.[59] The result was the NGST concept, with an 8-meter aperture and located at L2, roughly estimated to cost $500 million.[59] In 1997, NASA worked with the Goddard Space Flight Center,[60] Ball Aerospace,[61] and TRW[62] to conduct technical requirement and cost studies, and in 1999 selected Lockheed Martin[63] and TRW for preliminary concept studies.[64] Launch was at that time planned for 2007, but the launch date has subsequently been pushed back many times (see table further down).\n\n\n  \nA JWST mirror segment, 2010.\n\n\n\nIn 2002, NASA awarded the $824.8 million prime contract for the NGST, now renamed the James Webb Space Telescope, to TRW. The design called for a descoped 6.1-meter (20 ft) primary mirror and a launch date of 2010.[65] Later that year, TRW was acquired by Northrop Grumman in a hostile bid and became Northrop Grumman Space Technology.[64]\n\nNASA's Goddard Space Flight Center in Greenbelt, Maryland, is leading the management of the observatory project. The project scientist for the James Webb Space Telescope is John C. Mather. Northrop Grumman Aerospace Systems serves as the primary contractor for the development and integration of the observatory. They are responsible for developing and building the spacecraft element, which includes both the spacecraft bus and sunshield. Ball Aerospace has been subcontracted to develop and build the Optical Telescope Element (OTE). Northrop Grumman's Astro Aerospace business unit has been contracted to build the Deployable Tower Assembly (DTA) which connects the OTE to the spacecraft bus and the Mid Boom Assembly (MBA) which helps to deploy the large sunshields on orbit.[66] Goddard Space Flight Center is also responsible for providing the Integrated Science Instrument Module (ISIM).[31]\n\nCost growth revealed in spring 2005 led to an August 2005 re-planning.[67]  The primary technical outcomes of the re-planning were significant changes in the integration and test plans, a 22-month launch delay (from 2011 to 2013), and elimination of system-level testing for observatory modes at wavelength shorter than 1.7 micrometers. Other major features of the observatory were unchanged.  Following the re-planning, the project was independently reviewed in April 2006. The review concluded the project was technically sound, but that funding phasing at NASA needed to be changed. NASA re-phased its JWST budgets accordingly.[citation needed]\n\nIn the 2005 re-plan, the life-cycle cost of the project was estimated at about US$4.5 billion. This comprised approximately US$3.5 billion for design, development, launch and commissioning, and approximately US$1.0 billion for ten years of operations.[67] ESA is contributing about €300 million, including the launch,[68] and the Canadian Space Agency about $39M Canadian.[69]\n\nIn January 2007, nine of the ten technology development items in the project successfully passed a non-advocate review.[70] These technologies were deemed sufficiently mature to retire significant risks in the project. The remaining technology development item (the MIRI cryocooler) completed its technology maturation milestone in April 2007. This technology review represented the beginning step in the process that ultimately moved the project into its detailed design phase (Phase C). By May 2007, costs were still on target.[71] In March 2008, the project successfully completed its Preliminary Design Review (PDR). In April 2008, the project passed the Non-Advocate Review. Other passed reviews include the Integrated Science Instrument Module review in March 2009, the Optical Telescope Element review completed in October 2009, and the Sunshield review completed in January 2010.[citation needed]\n\nIn April 2010, the telescope passed the technical portion of its Mission Critical Design Review (MCDR). Passing the MCDR signified the integrated observatory can meet all science and engineering requirements for its mission.[72] The MCDR encompassed all previous design reviews. The project schedule underwent review during the months following the MCDR, in a process called the Independent Comprehensive Review Panel, which led to a re-plan of the mission aiming for a 2015 launch, but as late as 2018. By 2010, cost over-runs were impacting other projects, though JWST itself remained on schedule.[73]\n\nBy 2011, the JWST project was in the final design and fabrication phase (Phase C). As is typical for a complex design that cannot be changed once launched, there are detailed reviews of every portion of design, construction, and proposed operation. New technological frontiers have been pioneered by the project, and it has passed its design reviews. In the 1990s it was unknown if a telescope so large and low mass was possible.[74]\n\nAssembly of the hexagonal segments of the primary mirror, which was done via robotic arm, began in November 2015 and was completed in February 2016.[75]  Final construction of the Webb telescope was completed in November 2016, after which extensive testing procedures began.[76]  In March 2018, NASA delayed the JWST's launch an additional year to May 2020 after the telescope's sunshield ripped during a practice deployment and the sunshield's cables did not sufficiently tighten.[15] In June 2018, NASA delayed the JWST's launch an additional 10 months to March 2021, based on the assessment of the independent review board convened after the failed March 2018 test deployment.[16] In August 2019, the mechanical integration of the telescope was completed, something that was scheduled to be done 12 years ago in 2007. Following this engineers now are working to add a five layer sunshield in place to prevent damage to telescope parts from infra red rays of the sun[77]. \n\n\n\nPrimary mirror segments made of beryllium\n\n\nMirror segments undergoing cryogenic tests at the X-ray & Cryogenic Facility at Marshall Space Flight Center\n\n\nMirror segment after being coated with gold\n\n\n\n\n\n\n\nCost and schedule issues[edit]\n\nThen-planned launch and costs\n\tYear\tPlanned\nlaunch\tBudget Plan\n(Billion USD)\n\n\t1997\t2007[74]\t0.5[74]\n\n\t1998\t2007[78]\t1[48]\n\n\t1999\t2007 to 2008[79]\t1[48]\n\n\t2000\t2009[36]\t1.8[48]\n\n\t2002\t2010[80]\t2.5[48]\n\n\t2003\t2011[81]\t2.5[48]\n\n\t2005\t2013\t3[82]\n\n\t2006\t2014\t4.5[83]\n\n\t2008, Preliminary Design Review\n\n\t2008\t2014\t5.1[84]\n\n\t2010, Critical Design Review\n\n\t2010\t2015 to 2016\t6.5[citation needed]\n\n\t2011\t2018\t8.7[85]\n\n\t2013\t2018\t8.8[86]\n\n\t2017\t2019[87]\t8.8\n\n\t2018\t2020[88]\t≥8.8\n\n\t2018\t2021[89]\t9.66\n\n\n\nThe JWST has a history of major cost overruns and delays which have resulted in part from outside factors such as delays in deciding on a launch vehicle and adding extra funding for contingencies. By 2006, $1 billion had been spent on developing JWST, with the budget at about $4.5 billion at that time. A 2006 article in the journal Nature noted a study in 1984 by the Space Science Board, which estimated that a next generation infrared observatory would cost $4 billion (about $7 billion in 2006 dollars).[48]\n\nThe telescope was originally estimated to cost $1.6 billion,[90] but the cost estimate grew throughout the early development and had reached about $5 billion by the time the mission was formally confirmed for construction start in 2008. In summer 2010, the mission passed its Critical Design Review with excellent grades on all technical matters, but schedule and cost slips at that time prompted Maryland US Senator Barbara Mikulski to call for an independent review of the project. The Independent Comprehensive Review Panel (ICRP) chaired by J. Casani (JPL) found that the earliest possible launch date was in late 2015 at an extra cost of $1.5bn (for a total of $6.5bn). They also pointed out that this would have required extra funding in FY2011 and FY2012 and that any later launch date would lead to a higher total cost.[91]\n\nOn 6 July 2011, the United States House of Representatives' appropriations committee on Commerce, Justice, and Science moved to cancel the James Webb project by proposing an FY2012 budget that removed $1.9bn from NASA's overall budget, of which roughly one quarter was for JWST.[92][93][94][95] $3 billion had been spent and 75% of its hardware was in production.[96] This budget proposal was approved by subcommittee vote the following day. The committee charged that the project was \"billions of dollars over budget and plagued by poor management\".[92] In response, the American Astronomical Society issued a statement in support of JWST,[97] as did Maryland US Senator Barbara Mikulski.[98] A number of editorials supporting JWST appeared in the international press during 2011 as well.[92][99][100] In November 2011, Congress reversed plans to cancel the JWST and instead capped additional funding to complete the project at $8 billion.[101]\n\nSome scientists have expressed concerns about growing costs and schedule delays for the Webb telescope, which competes for scant astronomy budgets and thus threatens funding for other space science programs.[102][86] Because the runaway budget diverted funding from other research, a 2010 Nature article described the JWST as \"the telescope that ate astronomy\".[103]\n\nA review of NASA budget records and status reports noted that the JWST is plagued by many of the same problems that have affected other major NASA projects. Repairs and additional testing included underestimates of the telescope's cost that failed to budget for expected technical glitches, missed budget projections, and evaluation of components to estimate extreme launch conditions, thus extending the schedule and increasing costs further.[86][90][104]\n\nOne reason for the early cost growth is that it is difficult to forecast the cost of development, and in general budget predictability improved when initial development milestones were achieved.[86] By the mid-2010s, the U.S. contribution was still expected to cost $8.8 billion.[86] In 2007, the expected ESA contribution was about €350 million.[105]  With the U.S. and international funding combined, the overall cost not including extended operations is projected to be over $10 billion when completed.[106]  On 27 March 2018, NASA officials announced that JWST's launch would be pushed back to May 2020 or later, and admitted that the project's costs might exceed the $8.8 billion price tag.[88] In the 27 March press release announcing the latest delay, NASA said that it will release a revised cost estimate after a new launch window is determined in cooperation with the ESA.[107] If this cost estimate exceeds the $8 billion cap Congress put in place in 2011, as is considered unavoidable, NASA will have to have the mission re-authorized by the legislature.[108][109]\nIn February 2019, despite expressing criticism over cost growth, Congress increased the mission's cost cap by $800 million.[110]\n\n\nPartnership[edit]\n\nNASA, ESA and CSA have collaborated on the telescope since 1996. ESA's participation in construction and launch was approved by its members in 2003 and an agreement was signed between ESA and NASA in 2007. In exchange for full partnership, representation and access to the observatory for its astronomers, ESA is providing the NIRSpec instrument, the Optical Bench Assembly of the MIRI instrument, an Ariane 5 ECA launcher, and manpower to support operations.[68][111] The CSA will provide the Fine Guidance Sensor and the Near-Infrared Imager Slitless Spectrograph plus manpower to support operations.[112]\n\n\n\tParticipating countries\n\n\n\n\t Austria\n\t Belgium\n\t Canada\n\t Czech Republic\n\t Denmark\n\t Finland\n\t France\n\t Germany\n\t Greece\n\t Ireland\n\t Italy\n\t Luxembourg\n\t Netherlands\n\t Norway\n\t Portugal\n\t Spain\n\t Sweden\n\t  Switzerland\n\t United Kingdom\n\t United States\n\n\n\n\nPublic displays and outreach[edit]\n\n  \nEarly full-scale model on display at NASA Goddard (2005).\n\n\n\nA large telescope model has been on display at various places since 2005: in the United States at Seattle, Washington; Colorado Springs, Colorado; Greenbelt, Maryland; Rochester, New York; Manhattan, New York; and Orlando, Florida; and elsewhere at Paris, France; Dublin, Ireland; Montreal, Canada; Hatfield, United Kingdom; and Munich, Germany.  The model was built by the main contractor, Northrop Grumman Aerospace Systems.[113]\n\nIn May 2007, a full-scale model of the telescope was assembled for display at the Smithsonian Institution's National Air and Space Museum on the National Mall, Washington D.C.  The model was intended to give the viewing public a better understanding of the size, scale and complexity of the satellite, as well as pique the interest of viewers in science and astronomy in general. The model is significantly different from the telescope, as the model must withstand gravity and weather, so is constructed mainly of aluminum and steel measuring approximately 24×12×12 m (79×39×39 ft) and weighs 5.5 tonnes (12,000 lb; 6.1 short tons).[citation needed]\n\nThe model was on display in New York City's Battery Park during the 2010 World Science Festival, where it served as the backdrop for a panel discussion featuring Nobel Prize laureate John C. Mather, astronaut John M. Grunsfeld and astronomer Heidi Hammel.  In March 2013, the model was on display in Austin, Texas for SXSW 2013.[114][115]\n\n\n\n\nMission[edit]\n\nThe JWST's primary scientific mission has four key goals: to search for light from the first stars and galaxies that formed in the Universe after the Big Bang, to study the formation and evolution of galaxies, to understand the formation of stars and planetary systems, and to study planetary systems and the origins of life.[116] These goals can be accomplished more effectively by observation in near-infrared light rather than light in the visible part of the spectrum. For this reason the JWST's instruments will not measure visible or ultraviolet light like the Hubble Telescope, but will have a much greater capacity to perform infrared astronomy. The JWST will be sensitive to a range of wavelengths from 0.6 (orange light) to 28 micrometers (deep infrared radiation at about 100 K (−170 °C; −280 °F)).\n\nJWST may be used to gather information on the dimming light of star KIC 8462852, which was discovered in 2015, and has some abnormal light-curve properties.[117]\n\n\nLaunch and mission length[edit]\n\nAs of July 2019, launch is planned 30 March 2021,[3] on an Ariane 5 rocket. The observatory attaches to the Ariane 5 rocket via a launch vehicle adapter ring which could be used by a future spacecraft to grapple the observatory to attempt to fix gross deployment problems. However, the telescope itself is not serviceable, and astronauts would not be able to perform tasks such as swapping instruments, as with the Hubble Telescope.[2] Its nominal mission time is five years, with a goal of ten years.[118] JWST needs to use propellant to maintain its halo orbit around L2, which provides an upper limit to its designed lifetime, and it is being designed to carry enough for ten years.[119] The planned five year science mission begins after a 6-month commissioning phase.[119] An L2 orbit is only meta-stable so it requires orbital station-keeping or an object will drift away from this orbital configuration.[120]\n\n\nOrbit[edit]\n\n  \nJWST will not be exactly at the L2 point, but circle around it in a halo orbit.\n\n\n\n  \nTwo alternate Hubble Space Telescope views of the Carina Nebula, comparing ultraviolet and visible (top) and infrared (bottom) astronomy. Far more stars are visible in the latter.\n\n\n\nThe JWST will be located near the second Lagrange point (L2) of the Earth-Sun system, which is 1,500,000 kilometers (930,000 mi) from Earth, directly opposite to the Sun. Normally an object circling the Sun farther out than Earth would take longer than one year to complete its orbit, but near the L2 point the combined gravitational pull of the Earth and the Sun allow a spacecraft to orbit the Sun in the same time it takes the Earth. The telescope will circle about the L2 point in a halo orbit, which will be inclined with respect to the ecliptic, have a radius of approximately 800,000 kilometers (500,000 mi), and take about half a year to complete.[19] Since L2 is just an equilibrium point with no gravitational pull, a halo orbit is not an orbit in the usual sense: the spacecraft is actually in orbit around the Sun, and the halo orbit can be thought of as controlled drifting to remain in the vicinity of the L2 point.[121] This requires some station-keeping: around 2–4 m/s per year[122] from the total budget of 150 m/s.[123] Two sets of thrusters constitute the observatory's propulsion system.[124]\n\n\nInfrared astronomy[edit]\n\n  \nInfrared observations can see objects hidden in visible light, such as HUDF-JD2 shown.\n\n\n\nJWST is the formal successor to the Hubble Space Telescope (HST), and since its primary emphasis is on infrared observation, it is also a successor to the Spitzer Space Telescope. JWST will far surpass both those telescopes, being able to see many more and much older stars and galaxies.[125] Observing in the infrared is a key technique for achieving this because of cosmological redshift and because it better penetrates obscuring dust and gas. This allows observation of dimmer, cooler objects. Since water vapor and carbon dioxide in the Earth's atmosphere strongly absorbs most infrared, ground-based infrared astronomy is limited to narrow wavelength ranges where the atmosphere absorbs less strongly. Additionally, the atmosphere itself radiates in the infrared, often overwhelming light from the object being observed. This makes a space telescope preferable for infrared observation.[126]\n\nThe more distant an object is, the younger it appears: its light has taken longer to reach human observers. Because the universe is expanding, as the light travels it becomes red-shifted, and objects at extreme distances are therefore easier to see if viewed in the infrared.[127] JWST's infrared capabilities are expected to let it see back in time to the first galaxies forming just a few hundred million years after the Big Bang.[128]\n\nInfrared radiation can pass more freely through regions of cosmic dust that scatter visible light. Observations in infrared allow the study of objects and regions of space which would be obscured by gas and dust in the visible spectrum,[127] such as the molecular clouds where stars are born, the circumstellar disks that give rise to planets, and the cores of active galaxies.[127]\n\nRelatively cool objects (temperatures less than several thousand degrees) emit their radiation primarily in the infrared, as described by Planck's law. As a result, most objects that are cooler than stars are better studied in the infrared.[127] This includes the clouds of the interstellar medium, brown dwarfs, planets both in our own and other solar systems, comets and Kuiper belt objects that will be observed with the Mid-Infrared Instrument (MIRI) requiring an additional cryocooler.[36][128]\n\nSome of the missions in infrared astronomy that impacted JWST development were Spitzer and also the WMAP probe.[129] Spitzer showed the importance of mid-infrared, such as in its observing dust disks around stars.[129] Also, the WMAP probe showed the universe was \"lit up\" at redshift 17, further underscoring the importance of the mid-infrared.[129] Both these missions launched in the early 2000s, in time to influence JWST development.[129]\n\n\nGround support and operations[edit]\n\nThe Space Telescope Science Institute (STScI), located in Baltimore, Maryland on the Homewood campus of Johns Hopkins University, was selected as the Science and Operations Center (S&OC) for JWST with an initial budget of $162.2 million intended to support operations through the first year after launch.[130] In this capacity, STScI will be responsible for the scientific operation of the telescope and delivery of data products to the astronomical community. Data will be transmitted from JWST to the ground via NASA's Deep Space Network, processed and calibrated at STScI, and then distributed online to astronomers worldwide.  Similar to how Hubble is operated, anyone, anywhere in the world, will be allowed to submit proposals for observations. Each year several committees of astronomers will peer review the submitted proposals to select the projects to observe in the coming year. The authors of the chosen proposals will typically have one year of private access to the new observations, after which the data will become publicly available for download by anyone from the online archive at STScI.\n\nMost of the data processing on the telescope is done by conventional single-board computers.[131] The conversion of the analog science data to digital form is performed by the custom-built SIDECAR ASIC (System for Image Digitization, Enhancement, Control And Retrieval Application Specific Integrated Circuit). NASA stated that the SIDECAR ASIC will include all the functions of a 9 kg (20 lb) instrument box in a 3 cm package and consume only 11 milliwatts of power.[132] Since this conversion must be done close to the detectors, on the cool side of the telescope, the low power use of this IC will be crucial for maintaining the low temperature required for optimal operation of the JWST.[132]\n\n\nAfter-launch deployment[edit]\n\nNearly a month after launch, a trajectory correction will be initiated to place the JWST into a halo orbit at the L2 lagrangian point.[133]\n\n\n\t\n\t\t\t\n\n\n\t\t\t\nJWST after-launch deployment planned timeline[2]\n\n\n\t\t\t\n\n\t\t\n\n\n\n\n\n\nAnimation of James Webb Space Telescope trajectory\n\n\nPolar view\n\n\n\nEquatorial view\n\n\n\n\n\nAllocation of observation times[edit]\n\nJWST observing time will be allocated through a Director's Discretionary Early Release Science (DD-ERS) Program, a Guaranteed Time Observations (GTO) Program, and a General Observers (GO) Program.[134] The GTO Program provides guaranteed observing time for scientists who developed hardware and software components for the observatory. The GO Program provides all astronomers the opportunity to apply for observing time. GO programs will be selected through peer review by a Time Allocation Committee (TAC), similar to the proposal review process used for the Hubble Space Telescope. JWST observing time is expected to be highly oversubscribed.\n\n\nEarly Release Science Program[edit]\n\nIn November 2017, the Space Telescope Science Institute announced the selection of 13 Director's Discretionary Early Release Science (DD-ERS) Programs, chosen through a competitive proposal process.[135] The observations for these programs will be obtained during the first five months of JWST science operations after the end of the commissioning period. A total of 460 hours of observing time was awarded to these 13 programs, which span science topics including the Solar System, exoplanets, stars and star formation, nearby and distant galaxies, gravitational lenses, and quasars.\n\n\nSee also[edit]\n\n\n\tHigh-Definition Space Telescope, 12 m proposal for 2030s launch\n\tWide Field Infrared Survey Telescope, may launch in 2020s\n\tList of largest infrared telescopes\n\tList of largest optical reflecting telescopes\n\tList of space telescopes\n\tNew Worlds Mission (proposed occulter for the JWST)\n\tPhysical cosmology\n\tJames Webb Space Telescope timeline\n\tSpacecraft design\n\tSpacecraft thermal control\n\tSolar panels on spacecraft\n\tSatellite bus\n\tAttitude control\n\n\n\n\tAstronomy portal\n\n\n\n\n\nNotes[edit]\n\n\n\t^ \"Baffled\", in this context, means enclosed in a tube in a similar manner to a conventional optical telescope, which helps to stop stray light entering the telescope from the side. For an actual example, see the following link: Freniere, E.R. (1981). \"First-order design of optical baffles\". Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series, First-order design of optical baffles. Radiation Scattering in Optical Systems. 257. pp. 19–28. Bibcode:1981SPIE..257...19F. doi:10.1117/12.959598.\n\n\n\n\n\nReferences[edit]\n\n\n\t^ a b \"NASA JWST FAQ \"Who are the partners in the Webb project?\"\". NASA. Retrieved 18 November 2011.\n\n\n\t^ a b c d e \"JWST - Frequently Asked Questions\". NASA. Retrieved 29 June 2015.\n\n\n\t^ a b c Jim Bridenstine [@JimBridenstine] (27 June 2018). \"The James Webb Space Telescope will produce first of its kind, world-class science. Based on recommendations by an Independent Review Board, the new launch date for @NASAWebb is March 30, 2021. I'm looking forward to the launch of this historic mission\" (Tweet). Retrieved 27 June 2018 – via Twitter.\n    \n\n\t^ a b \"JWST (James Webb Space Telescope)\". ESA eoPortal. Retrieved 29 June 2015.\n\n\n\t^ https://jwst-docs.stsci.edu/display/JTI/JWST+Telescope\n\n\t^ \"About the James Webb Space Telescope\". Retrieved 13 January 2012.\n\n\n\t^ \"How does the Webb Contrast with Hubble?\". JWST Home – NASA. 2016. Archived from the original on 3 December 2016. Retrieved 4 December 2016.\n\n\n\t^ a b c \"JWST vital facts: mission goals\". NASA James Webb Space Telescope. 2017. Retrieved 29 January 2017.\n\n\n\t^ \"James Webb Space Telescope. JWST History: 1989-1994\". Space Telescope Science Institute, Baltimore, MD. 2017. Archived from the original on 3 February 2014. Retrieved 29 December 2018.\n\n\n\t^ a b \"The Sunshield\". nasa.gov. NASA. Retrieved 28 August 2016.\n\n\n\t^ \"ESA JWST Timeline\". Archived from the original on 21 August 2003. Retrieved 13 January 2012.\n\n\n\t^ During, John. \"The James Webb Space Telescope\". National Aeronautics and Space Administration. Retrieved 31 December 2011.\n\n\n\t^ \"James Webb Space Telescope observatory is assembled\". Space Daily. 29 December 2016. Retrieved 3 February 2017.\n\n\n\t^ Foust, Jeff (23 December 2016). \"No damage to JWST after vibration test anomaly\". Space News. Retrieved 3 February 2017.\n\n\n\t^ a b Overbye, Dennis (27 March 2018). \"NASA's Webb Telescope Faces More Setbacks\". The New York Times. Retrieved 5 April 2018.\n\n\n\t^ a b \"NASA Completes Webb Telescope Review, Commits to Launch in Early 2021\". NASA. 27 June 2018. Retrieved 27 June 2018.\n\n\n\t^ Kaplan, Sarah; Achenbach, Joel (24 July 2018). \"NASA's next great space telescope is stuck on Earth after screwy errors\". The Washington Post. Retrieved 25 July 2018.\n\n\n\t^ Amos, Jonathan (28 August 2019). \"'Next-generation Hubble' takes shape\". Retrieved 10 September 2019.\n\n\n\t^ a b c \"L2 Orbit\". Space Telescope Science Institute. Archived from the original on 3 February 2014. Retrieved 28 August 2016.\n\n\n\t^ Drake, Nadia (24 April 2015). \"Hubble Still Wows At 25, But Wait Till You See What's Next\". National Geographic.\n\n\n\t^ \"James Webb Space Telescope\". Northrop Grumman Corporation, Redondo Beach, CA. 2017. Retrieved 31 January 2017.\n\n\n\t^ \"The James Webb Space Telescope\". nasa.gov. Retrieved 28 August 2016.\n\n\n\t^ \"The Sunshield\". NASA Goddard Space Flight Center. Retrieved 5 June 2018.\n\n\n\t^ \"NASA announces more delays for giant space telescope\". Science. 27 March 2018. Retrieved 5 June 2018.\n\n\n\t^ Morring, Jr., Frank, Sunshield, Aviation Week and Space Technology, 16 December 2013, pp. 48-49\n\n\t^ \"JWST Wavefront Sensing and Control\". Space Telescope Science Institute. Archived from the original on 5 August 2012. Retrieved 9 June 2011.\n\n\n\t^ \"JWST Mirrors\". Space Telescope Science Institute. Archived from the original on 5 August 2012. Retrieved 9 June 2011.\n\n\n\t^ \"Science Instruments of NASA's James Webb Space Telescope Successfully Installed\". NASA. 24 May 2016. Retrieved 2 February 2017.\n\n\n\t^ \"NASA's James Webb Space Telescope Primary Mirror Fully Assembled\". NASA. 4 February 2016. Retrieved 23 March 2016.\n\n\n\t^ \"NASA's James Webb Space Telescope Secondary Mirror Installed\". NASA. 7 March 2016. Retrieved 23 March 2016.\n\n\n\t^ a b \"JWST: Integrated Science Instrument Module (ISIM)\". NASA. 2017. Retrieved 2 February 2017.\n\n\n\t^ \"James Webb Space Telescope Near Infrared Camera\". STScI. Retrieved 24 October 2013.\n\n\n\t^ \"NIRCam for the James Webb Space Telescope\". University of Arizona. Retrieved 24 October 2013.\n\n\n\t^ a b c \"JWST Current Status\". STScI. Archived from the original on 15 July 2009. Retrieved 5 July 2008.\n\n\n\t^ a b c \"NIRSpec - the near-infrared spectrograph on JWST\". European Space Agency. 22 February 2015. Retrieved 2 February 2017.\n\n\n\t^ a b c \"MIRI spectrometer for NGST\". Archived from the original on 27 September 2011.\n\n\n\t^ a b \"JWST: Mid-Infrared Instrument (MIRI)\". NASA. 2017. Retrieved 3 February 2017.\n\n\n\t^ Banks, Kimberly; Larson, Melora; Aymergen, Cagatay; Zhang, Burt (2008). \"James Webb Space Telescope Mid-Infrared Instrument Cooler systems engineering\" (PDF). Proceedings of SPIE. Modeling, Systems Engineering, and Project Management for Astronomy III. 7017: 5. Bibcode:2008SPIE.7017E..0AB. doi:10.1117/12.791925. Retrieved 6 February 2016. Fig. 1. Cooler Architecture Overview\n\n\n\t^ \n\"NASA's James Webb Space Telescope Gets 'Spacewired'\". 2007.\n\n\t^ a b c d e \"The Spacecraft Bus\". NASA James Webb Space Telescope. 2017.\n\n\n\t^ a b c \"The JWST Observatory\". NASA. 2017. The Observatory is the space-based portion of the James Webb Space Telescope system and is comprised of three elements, the Integrated Science Instrument Module (ISIM), the Optical Telescope Element (OTE), which includes the mirrors and backplane, and the Spacecraft Element, which includes the spacecraft bus and the sunshield\n\n\n\t^ a b \"Integrated Science Instrument Module (ISIM)\". NASA James Webb Space Telescope. 2017.\n\n\n\t^ Sloan, Jeff (12 October 2015). \"James Webb Space Telescope spacecraft inches towards full assembly\". Composites World.\n\n\n\t^ \"What is SAFIR?\". NASA, Jet Propulsion Laboratory, Goddard Flight Center, California Institute of Technology, Pasadena, CA. Archived from the original on 16 February 2013. Retrieved 14 July 2013.\n\n\n\t^ a b c McCarthy SG, Autio GW (1978). \"Infrared Detector Performance In The Shuttle Infrared Telescope Facility (SIRTF)\". Utilization of Infrared Detectors. 81 (6 June). Society of Photographic Instrumentation Engineers: 81–88. Bibcode:1978SPIE..132...81M. doi:10.1117/12.956060. Cite journal requires |journal= (help)\n\n\n\t^ a b c d \"Infrared astronomy from earth orbit\". Infrared Processing and Analysis Center, NASA Spitzer Science Center, California Institute of Technology, Pasadena, CA. 2017. Archived from the original on 21 December 2016.\n\n\n\t^ \"How cold can you go? Cooler tested for NASA telescope\". Phys.org. 14 June 2016. Retrieved 31 January 2017.\n\n\n\t^ a b c d e f g h i j Reichhardt, Tony (March 2006). \"US astronomy: Is the next big thing too big?\". Nature. 440 (7081): 140–143. Bibcode:2006Natur.440..140R. doi:10.1038/440140a. PMID 16525437.\n\n\n\t^ \"JPL: Herschel Space Observatory: Related Missions\". NASA, Jet Propulsion Laboratory, Goddard Flight Center, California Institute of Technology, Pasadena, CA. Retrieved 4 June 2012.\n\n\n\t^ \"Darwin's Greatest Challenge Tackled: The Mystery Of Eye Evolution\". ScienceDaily. Retrieved 11 May 2019.\n\n\n\t^ \"What is ISO?\". European Space Agency. 2017.\n\n\n\t^ \"Hubble Space Telescope – Wide Field Camera 3\". NASA. 22 August 2016.\n\n\n\t^ \"Nexus Space Telescope\". MIT.\n\n\n\t^ \"Advanced Concepts Studies – The 4 m Aperture \"Hi Z\" Telescope\". NASA Space Optics Manufacturing Technology Center. Archived from the original on 15 October 2011.\n\n\n\t^ a b \"STSCI JWST History 1994\". Archived from the original on 3 February 2014. Retrieved 29 December 2018.\n\n\n\t^ \"Astrononmy and Astrophysics in the New Millennium\". NASA.\n\n\n\t^ de Weck, Olivier L.; Miller, David W.; Mosier, Gary E. (2002). \"Multidisciplinary analysis of the NEXUS precursor space telescope\" (PDF). Highly Innovative Space Telescope Concepts. Highly Innovative Space Telescope Concepts. 4849. p. 294. Bibcode:2002SPIE.4849..294D. CiteSeerX 10.1.1.664.8727. doi:10.1117/12.460079.\n\n\n\t^ \"About James Webb\". NASA. Retrieved 15 March 2013.\n\n\n\t^ a b \"STSCI JWST History 1996\". Stsci.edu. Archived from the original on 3 February 2014. Retrieved 16 January 2012.\n\n\n\t^ Goddard Space Flight Center design. spacetelescope.org. Retrieved on 13 January 2014.\n\n\t^ ESA Science & Technology: Ball Aerospace design for JWST Archived 12 December 2012 at Archive.today. Sci.esa.int. Retrieved on 21 August 2013.\n\n\t^ ESA Science & Technology: TRW design for JWST Archived 12 December 2012 at Archive.today. Sci.esa.int. Retrieved on 21 August 2013.\n\n\t^ ESA Science & Technology: Lockheed-Martin design for JWST Archived 13 December 2012 at Archive.today. Sci.esa.int. Retrieved on 21 August 2013.\n\n\t^ a b \"HubbleSite – Webb: Past and Future\". Archived from the original on 10 December 2012. Retrieved 13 January 2012.\n\n\n\t^ \"TRW Selected as JWST Prime Contractor\". STCI. 11 September 2003. Archived from the original on 5 August 2012. Retrieved 13 January 2012.\n\n\n\t^ Writer, Staff (13 December 2011). \"Northrop Grumman Completes Fabrication Of Sunshield Deployment Flight Structure For JWST\". Space. Retrieved 10 December 2014.\n\n\n\t^ a b John Mather. \"James Webb Space Telescope (JWST)\" (PDF). National Academy of Science. Archived from the original (PDF) on 10 November 2008. Retrieved 5 July 2008.\n\n\n\t^ a b \"European agreement on James Webb Space Telescope's Mid-Infrared Instrument (MIRI) signed\" (Press release). ESA Media Relations Service. 9 June 2004. Retrieved 6 May 2009.\n\n\n\t^ \"Canadian Space Agency: Canada's Contribution to NASA's James Webb Space Telescope\". Canadian Corporate News. Retrieved 6 September 2008.\n[dead link]\n\n\t^ \"JWST Passes NTAR\". STScI. Archived from the original on 5 August 2012. Retrieved 5 July 2008.\n\n\n\t^ Brian Berger. \"NASA Adds Docking Capability For Next Space Observatory\". Space News. Retrieved 5 July 2008.\n\n\n\t^ \"NASA's Webb Telescope Passes Key Mission Design Review Milestone\". NASA. Retrieved 2 May 2010.\n\n\n\t^ Stephen Clark. \"NASA says JWST cost crunch impeding new missions\". Spaceflight Now.\n\n\n\t^ a b c Berardelli, Phil (27 October 1997). \"Next Generation Space Telescope will peer back to the beginning of time and space\". CBS.\n\n\n\t^ \"NASA's James Webb Space Telescope Primary Mirror Fully Assembled\". NASA.gov. 3 February 2016. Retrieved 4 February 2016.\n\n\n\t^ Alan Yuhas (4 November 2016). \"Nasa begins testing enormous space telescope made of gold mirrors\". The Guardian.\n\n\n\t^ \"The two halves of Hubble's $10 billion successor have finally come together after 12 years of waiting\". Business Insider. Retrieved 29 August 2019.\n\n\n\t^ Lilly, Simon (27 November 1998). \"The Next Generation Space Telescope (NGST)\". University of Toronto.\n\n\n\t^ Offenberg, Joel D; Sengupta, Ratnabali; Fixsen, Dale J; Stockman, Peter; Nieto-Santisteban, Maria; Stallcup, Scott; Hanisch, Robert; Mather, John C (1999). \"Cosmic Ray Rejection with NGST\". Astronomical Data Analysis Software and Systems Viii. 172: 141. Bibcode:1999ASPC..172..141O.\n\n\n\t^ \"NGST Weekly Missive\". 25 April 2002.\n\n\n\t^ \"NASA Modifies James Webb Space Telescope Contract\". 12 November 2003.\n\n\n\t^ \"Problems for JWST\". 21 May 2005.\n\n\n\t^ \"Refocusing NASA's vision\". Nature. 440 (7081): 127. 9 March 2006. Bibcode:2006Natur.440..127.. doi:10.1038/440127a. PMID 16525425.\n\n\n\t^ Cowen, Ron (25 August 2011). \"Webb Telescope Delayed, Costs Rise to $8 Billion\". ScienceInsider. Archived from the original on 14 January 2012.\n\n\n\t^ Amos, Jonathan (22 August 2011). \"JWST price tag now put at over $8bn\". BBC.\n\n\n\t^ a b c d e Moskowitz, Clara (30 March 2015). \"NASA Assures Skeptical Congress That the James Webb Telescope Is on Track\". Scientific American. Retrieved 29 January 2017.\n\n\n\t^ \"NASA's James Webb Space Telescope to be Launched Spring 2019\". NASA. 28 September 2017.\n\n\n\t^ a b \"NASA Delays Launch of James Webb Space Telescope to 2020\". Space.com. Retrieved 27 March 2018.\n\n\n\t^ \"NASA Completes Webb Telescope Review, Commits to Launch in Early 2021\". Felicia Chou / Natasha Pinol. NASA. 27 June 2018. Retrieved 28 June 2018.\n\n\n\t^ a b Kelly, John (5 June 2011). \"Telescope debacle devours NASA funds. Hubble's successor is billions of dollars over budget, 7 years late\". Florida Today. Archived from the original on 3 April 2014.\n\n\n\t^ \"Independent Comprehensive Review Panel, Final Report\" (PDF). 29 October 2010.\n\n\n\t^ a b c McKie, Robin (9 July 2011). \"Nasa fights to save the James Webb space telescope from the axe\". London: The Guardian.\n\n\n\t^ \"Appropriations Committee Releases the Fiscal Year 2012 Commerce, Justice, Science Appropriations\". US House of representatives Committee on Appropriations. 6 July 2011.\n\n\n\t^ \"US lawmakers vote to kill Hubble successor\". SpaceDaily. 7 July 2011.\n\n\n\t^ \"Proposed NASA Budget Bill Would Cancel Major Space Telescope\". Space.com. 6 July 2011.\n\n\n\t^ Bergin, Chris. \"James Webb Space Telescope hardware entering key test phase\". NASASpaceflight.com. Retrieved 28 August 2016.\n\n\n\t^ Hand E (7 July 2011). \"AAS Issues Statement on Proposed Cancellation of James Webb Space Telescope\". American Astronomical Society.\n\n\n\t^ \"Mikulski Statement On House Appropriations Subcommittee Termination of James Webb Telescope\". SpaceRef Interactive Inc. 11 July 2011.\n\n\n\t^ \"Way Above the Shuttle Flight\". The New York Times. 9 July 2011.\n\n\n\t^ Harrold, Max (7 July 2011). \"Bad news for Canada: U.S. could scrap new space telescope\". The Vancouver Sun.\n\n\n\t^ \"NASA budget plan saves telescope, cuts space taxis\". Reuters. 16 November 2011.\n\n\n\t^ Leone, Dan (7 November 2012). \"NASA Acknowledges James Webb Telescope Costs Will Delay Other Science Missions\". Space News.\n\n\n\t^ Billings, Lee (27 October 2010). \"The telescope that ate astronomy\". Nature. 467 (7319): 1028–1030. doi:10.1038/4671028a. PMID 20981068.\n\n\n\t^ Koren, Marina (7 December 2016). \"The Extreme Hazing of the Most Expensive Telescope Ever Built\". The Atlantic. Retrieved 29 January 2017.\n\n\n\t^ Choi, Choi (5 March 2007). \"ESA to Solicit Bids for Two New Science Missions\". Space.com. Retrieved 4 June 2018.\n\n\n\t^ Clark, Stephen (20 December 2016). \"Engineers examine unexpected readings from JWST shake test\". Retrieved 29 January 2017.\n\n\n\t^ Wang, Jen Rae; Cole, Steve; Northon, Karen (27 March 2018). \"NASA's Webb Observatory Requires More Time for Testing and Evaluation\". NASA. Retrieved 27 March 2018.\n\n\n\t^ Amos, Jonathan (27 March 2018). \"Hubble 'successor' faces new delay\". BBC News. Retrieved 27 March 2018.\n\n\n\t^ Witze, Alexandra (27 March 2018). \"NASA reveals major delay for $8-billion Hubble successor\". Bibcode:2018Natur.556...11W. doi:10.1038/d41586-018-03863-5. Retrieved 27 March 2018.\n\n\n\t^ Dreier, Casey (15 February 2019). \"NASA just got its best budget in a decade\".\n\n\n\t^ ESA Science & Technology: Europe's Contributions to the JWST Mission\n\n\t^ Canadian Space Agency \"Eyes\" Hubble's Successor: Canada Delivers its Contribution to the World's Most Powerful Space Telescope – Canadian Space Agency\n\n\t^ \"Webb Slinger Heads To Washington\". Space Daily. 8 May 2007.\n\n\n\t^ \"NASA's Webb Space Telescope Has Landed in Austin!\". NASA. March 2013. Archived from the original on 10 March 2013.\n\n\n\t^ Khan, Amina (8 March 2013). \"NASA James Webb Space Telescope model lands at South by Southwest\". Los Angeles Times.\n\n\n\t^ Maggie Masetti; Anita Krishnamurthi (2009). \"JWST Science\". NASA. Retrieved 14 April 2013.\n\n\n\t^ \"NASA's Next Telescope Could ID Alien Megastructures\". 9 February 2016. Retrieved 1 September 2016.\n\n\n\t^ \"About the Webb\". NASA James Webb Space Telescope. 2017.\n\n\n\t^ a b \"Frequently asked questions: How long will the Webb mission last?\". NASA James Webb Space Telescope. 2017.\n\n\n\t^ \"JWST orbit\". NASA James Webb Space Telescope. 2017.\n\n\n\t^ \"Basics of Space Flight\". Jet Propulsion Laboratory. Retrieved 28 August 2016.\n\n\n\t^ Michael Mesarch (31 March 1999). \"STScI NGST Libration Point Introduction\" (PDF). NASA/GSFC Guidance Navigation and Control Center. Archived from the original (PDF) on 19 October 2015. Retrieved 17 January 2011.\n\n\n\t^ E.Canalias, G.Gomez, M.Marcote, J.J.Masdemont. \"Assessment of Mission Design Including Utilization of Libration Points and Weak Stability Boundaries\" (PDF). Department de Matematica Aplicada, Universitat Politecnica de Catalunya and Department de Matematica Aplicada, Universitat de Barcellona.CS1 maint: multiple names: authors list (link)\n\n\n\t^ \"James Webb Space Telescope Initial Mid-Course Correction Monte Carlo Implementation using Task Parallelism.\" 3.1 Propulsion System Overview. J. Petersen et al. (PDF)\n\n\t^ Howard, Rick, \"James Webb Space Telescope (JWST)\", nasa.gov, 6 March 2012.\n\n\t^ \"Infrared Atmospheric Windows\". Cool Cosmos. Retrieved 28 August 2016.\n\n\n\t^ a b c d \"Infrared Astronomy: Overview\". NASA Infrared Astronomy and Processing Center. Archived from the original on 8 December 2006. Retrieved 30 October 2006.\n\n\n\t^ a b \"Webb Science: The End of the Dark Ages: First Light and Reionization\". NASA. Retrieved 9 June 2011.\n\n\n\t^ a b c d [1]\n\n\t^ Savage, Donald and Neal, Nancy (6 June 2003). \"Webb Spacecraft Science & Operations Center Contract Awarded\". NASA. Retrieved 1 February 2017.CS1 maint: uses authors parameter (link)\n\n\n\t^ \"Single Board Computer\". FBO Daily Issue, FBO #0332. 30 October 2002.\n\n\n\t^ a b \"Amazing Miniaturized 'SIDECAR' Drives Webb Telescope's Signal\". NASA. 20 February 2008. Retrieved 22 February 2008.\n\n\n\t^ \"James Webb Space Telescope – The First 30 Days After Launch\". News Ledge. 3 March 2017.\n\n\n\t^ \"Calls for Proposals & Policy\". Space Telescope Science Institute. Retrieved 13 November 2017.\n\n\n\t^ \"Selections Made for the JWST Director's Discretionary Early Release Science Program\". Space Telescope Science Institute. Retrieved 13 November 2017.\n\n\n\n\n\nFurther reading[edit]\n\n\tJonathan P. Gardner;  et al. (November 2006). \"The James Webb Space Telescope\". Space Science Reviews. 123 (4): 484–606. arXiv:astro-ph/0606175. Bibcode:2006SSRv..123..485G. doi:10.1007/s11214-006-8315-7.\n The formal case for JWST science presented in 2006.\n\tJason Kalirai (April 2018). \"Scientific discovery with the James Webb Space Telescope\". Contemporary Physics. 59 (3): 259–290. arXiv:1805.06941. doi:10.1080/00107514.2018.1467648.\n A review of JWST capabilities and scientific opportunities.\n\n\nExternal links[edit]\n\nJames Webb Space Telescopeat Wikipedia's sister projects\n\tMedia from Wikimedia Commons\n            \n\tNews from Wikinews\n            \n\tTextbooks from Wikibooks\n            \n\n\n\n\n\tJWST Glossary\n\tJWST Timeline of Accomplishments\n\tJWST Progress Report, 2017\n\n\n\t\tv\n\tt\n\te\n\n\nJames Webb Space Telescope\n\n\t\n\tJames Webb Space Telescope timeline\n\n\n\n\n\tInstruments/sensors\t\n\tFGS/NIRISS (Fine Guidance Sensor and Near Infrared Imager and Slitless Spectrograph)\n\tMIRI (Mid-Infrared Instrument)\n\tNIRCam (Near-Infrared Camera)\n\tNIRSpec (Near-Infrared Spectrograph)\n\n\n\n\t\n\n\tElements\t\n\tIntegrated Science Instrument Module\n\tOptical Telescope Element\n\tSpacecraft Bus\n\tSunshield\n\n\n\n\n\tRelated\t\n\tAriane 5 (planned launcher)\n\tSpaceWire\n\tOTE Pathfinder\n\tJames E. Webb (namesake)\n\n\n\n\n\t\n\tNASA\n\tESA\n\tCSA\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpace observatories\n\n\tOperating\t\n\tAGILE (since 2007)\n\tAMS-02 (since 2011)\n\tAoi (since 2018)\n\tASTERIA (since 2017)\n\tAstrosat (since 2015)\n\tBRITE constellation (since 2013)\n\tCALET (since 2015)\n\tChandra (AXAF) (since 1999)\n\tDAMPE (since 2015)\n\tFermi (since 2008)\n\tGaia (since 2013)\n\tHXMT (Insight) (since 2017)\n\tHinode (Solar-B) (since 2006)\n\tHiRISE (since 2005)\n\tHisaki (SPRINT-A) (since 2013)\n\tHubble (since 1990)\n\tINTEGRAL (since 2002)\n\tIBEX (since 2008)\n\tIRIS (since 2013)\n\tISS-CREAM (since 2017)\n\tMAXI (since 2009)\n\tMikhailo Lomonosov (since 2016)\n\tMini-EUSO (since 2019)\n\tNCLE (since 2018)\n\tNEOSSat (since 2013)\n\tNICER (since 2017)\n\tNuSTAR (since 2012)\n\tOdin (since 2001)\n\tSDO (since 2010)\n\tSOHO (since 1995)\n\tSOLAR (since 2008)\n\tSpektr-RG (since 2019)\n\tSpitzer (since 2003)\n\tSTEREO (since 2006)\n\tSwift (since 2004)\n\tTESS (since 2018)\n\tWISE (since 2009)\n\tXMM-Newton (since 1999)\n\n\n\n\n\tPlanned\t\n\tCHEOPS (2019)\n\tiWF-MAXI (2019)\n\tPublic Telescope (PST) (2019)\n\tAstro-1 Telescope (2020)\n\tILO-1 (2020)\n\tLUCI (2020)\n\tNano-JASMINE (2020)\n\tORBIS (2020)\n\tSolar Orbiter (SolO) (2020)\n\tIXPE (2021)\n\tJames Webb (JWST) (2021)\n\tLORD (2021)\n\tSVOM (2021)\n\tXPoSat (2021)\n\tEuclid (2022)\n\tSpace Solar Telescope (2022)\n\tXRISM (2022)\n\tXuntian (2022)\n\tK-EUSO (2023)\n\tSolar-C (2023)\n\tSpektr-UV (2023)\n\tSPHEREx (2023)\n\tNear-Earth Object Surveillance Mission (2025+)\n\tWFIRST (2025+)\n\tPLATO (2026)\n\tSpektr-M (2026+)\n\tLiteBIRD (2027)\n\tARIEL (2028)\n\tATHENA (2031)\n\tLISA (2034)\n\n\n\n\n\tProposed\t\n\tArcus\n\tAstroSat-2\n\tEXCEDE\n\tFresnel Imager\n\tFOCAL\n\tHabEx\n\tHibari\n\tHypertelescope\n\tJEM-EUSO\n\tLUVOIR\n\tATLAST\n\tHDST\n\n\n\tLynx\n\tNautilus Deep Space Observatory\n\tNew Worlds Mission\n\tNRO donation to NASA\n\tOST\n\tPhoENiX\n\tSmall-JASMINE\n\tSolar-D\n\tSPICA\n\tTHEIA\n\tTHESEUS\n\n\n\n\n\tRetired\t\n\tAkari (Astro-F) (2006–2011)\n\tALEXIS (1993–2005)\n\tAlouette 1 (1962–1972)\n\tAriel 1 (1962, 1964)\n\tAriel 2 (1964)\n\tAriel 3 (1967–1969)\n\tAriel 4 (1971–1972)\n\tAriel 5 (1974–1980)\n\tAriel 6 (1979–1982)\n\tATM (1973–1974)\n\tASCA (Astro-D) (1993–2000)\n\tAstro-1 (1990)\n\tBBXRT\n\tHUT\n\n\n\tAstro-2 (HUT) (1995)\n\tAstron (1983–1989)\n\tANS (1974–1976)\n\tBeppoSAX (1996–2003)\n\tCHIPSat (2003–2008)\n\tCompton (CGRO) (1991–2000)\n\tCoRoT (2006–2013)\n\tCos-B (1975–1982)\n\tCOBE (1989–1993)\n\tDXS (1993)\n\tEPOCh (2008)\n\tEPOXI (2010)\n\tExplorer 11 (1961)\n\tEXOSAT (1983–1986)\n\tEUVE (1992–2001)\n\tFUSE (1999–2007)\n\tKvant-1 (1987–2001)\n\tGALEX (2003–2013)\n\tGamma (1990–1992)\n\tGinga (Astro-C) (1987–1991)\n\tGranat (1989–1998)\n\tHakucho (CORSA-b) (1979–1985)\n\tHALCA (MUSES-B) (1997–2005)\n\tHEAO-1 (1977–1979)\n\tHerschel (2009–2013)\n\tHinotori (Astro-A) (1981–1991)\n\tHEAO-2 (Einstein Obs.) (1978–1982)\n\tHEAO-3 (1979–1981)\n\tHETE-2 (2000–2008)\n\tHipparcos (1989–1993)\n\tIUE (1978–1996)\n\tIRAS (1983)\n\tIRTS (1995–1996)\n\tISO (1996–1998)\n\tIXAE (1996–2004)\n\tKepler (2009–2018)\n\tKristall (1990–2001)\n\tLEGRI (1997–2002)\n\tLISA Pathfinder (2015–2017)\n\tMOST (2003–2019)\n\tMSX (1996–1997)\n\tOAO-2 (1968–1973)\n\tOAO-3 (Copernicus) (1972–1981)\n\tOrbiting Solar Observatory\n\tOSO 1\n\tOSO 2/OSO B\n\tOSO 3\n\tOSO 4\n\tOSO 5\n\tOSO 6\n\tOSO 7\n\tOSO 8\n\n\n\tOrion 1 (1971)\n\tOrion 2 (1973)\n\tPAMELA (2006–2016)\n\tPicSat (2018)\n\tPlanck (2009–2013)\n\tRELIKT-1 (1983–1984)\n\tR/HESSI (2002–2018)\n\tROSAT (1990–1999)\n\tRXTE (1995–2012)\n\tSAMPEX (1992–2004)\n\tSAS-B (1972–1973)\n\tSAS-C (1975–1979)\n\tSolwind (1979–1985)\n\tSpektr-R (2011–2019)\n\tSuzaku (Astro-EII) (2005–2015)\n\tTaiyo (SRATS) (1975–1980)\n\tTenma (Astro-B) (1983–1985)\n\tUhuru (1970–1973)\n\tVanguard 3 (1959)\n\tWMAP (2001–2010)\n\tYokoh (Solar-A) (1991–2001)\n\n\n\n\n\tHibernating \n(Mission completed)\t\n\tSWAS (1998–2005)\n\tTRACE (1998–2010)\n\n\n\n\n\tLost\t\n\tOAO-1 (1966)\n\tOAO-B (1970)\n\tCORSA (1976)\n\tOSO C (1965)\n\tABRIXAS (1999)\n\tHETE-1 (1996)\n\tWIRE (1999)\n\tAstro-E (2000)\n\tTsubame (2014–2015)\n\tHitomi (Astro-H) (2016)\n\n\n\n\n\tCancelled\t\n\tAOSO\n\tAstro-G\n\tConstellation-X\n\tDarwin\n\tDestiny\n\tEChO\n\tEddington\n\tFAME\n\tFINESSE\n\tGEMS\n\tHOP\n\tIXO\n\tJDEM\n\tLOFT\n\tOSO J\n\tOSO K\n\tSentinel\n\tSIM & SIMlite\n\tSNAP\n\tSPOrt\n\tTAUVEX\n\tTPF\n\tXEUS\n\tXIPE\n\n\n\n\n\tSee also\t\n\tGreat Observatories program\n\tList of space telescopes\n\tList of proposed space observatories\n\tList of X-ray space telescopes\n\n\n\n\n\t\n\t Category\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nExoplanet search projects\n\n\t\n\tExoplanetology\n\tExoplanet\n\n\n\n\n\tGround-based\t\n\tAAPS\n\tAPF\n\tCORALIE\n\tEAPSNet\n\tELODIE\n\tEPICS\n\tESPRESSO\n\tFINDS Exo-Earths\n\tGeneva\n\tHARPS\n\tHARPS-N\n\n\n\tGPI\n\tHATNet\n\tHEK\n\tHiCIAO\n\tHIRES\n\tKELT\n\tLCES\n\tMagellan\n\tMARVELS\n\tMASCARA\n\tMEarth\n\tMicroFUN\n\tMINERVA\n\tAustralis\n\n\n\tMOA\n\tN2K\n\tNGTS\n\tNESSI\n\tOGLE\n\tOPSP\n\tPlanetPol\n\tProject 1640\n\tPARAS\n\tSEEDS\n\tSETI\n\tSOPHIE\n\tSPECULOOS\n\tSPHERE\n\tSuperWASP\n\tSystemic\n\tTrES\n\tXO Telescope\n\tZIMPOL/CHEOPS\n\n\n\n\t\n\n\n\n\tSpace missions\t\n\tPast\t\n\tMOST (2003–2019)\n\tSWEEPS using HST (2006)\n\tCoRoT (2006–2013)\n\tEPOXI using Deep Impact (2008–2013)\n\tKepler (2009–2018)\n\tdetected exoplanets\n\n\n\n\n\n\n\tCurrent\t\n\tGaia (2013–present)\n\tASTERIA (2017–present)\n\tTESS (2018–present)\n\n\n\n\n\tPlanned\t\n\tCHEOPS (2019)\n\tJames Webb Space Telescope (2021)\n\tPLATO (2026)\n\tARIEL (2028)\n\tWFIRST  (mid-2020s)\n\n\n\n\n\tProposed\t\n\tATLAST\n\tEXCEDE\n\tHabEx\n\tHDST\n\tLUVOIR\n\tNautilus Deep Space Observatory\n\tNew Worlds Mission\n\tOST\n\tPEGASE\n\n\n\n\n\tCancelled\t\n\tDarwin\n\tEChO\n\tEddington\n\tSpace Interferometry Mission\n\tTerrestrial Planet Finder\n\n\n\n\n\n\n\n\t\n\tDetection methods\n\tDiscoveries of exoplanets\n\tLists of exoplanets\n\tnearest\n\n\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNASA\n\n\tPolicy and history\t\n\tHistory\t\n\tNACA (1915)\n\tNational Aeronautics and Space Act (1958)\n\tSpace Task Group (1958)\n\tPaine (1986)\n\tRogers (1986)\n\tRide (1987)\n\tSpace Exploration Initiative (1989)\n\tAugustine (1990)\n\tU.S. National Space Policy (1996)\n\tCFUSAI (2002)\n\tCAIB (2003)\n\tVision for Space Exploration (2004)\n\tAldridge (2004)\n\tAugustine (2009)\n\n\n\n\n\tGeneral\t\n\tSpace Race\n\tAdministrator and Deputy Administrator\n\tChief Scientist\n\tAstronaut Corps\n\tRanks and positions\n\tChief\n\n\n\tBudget\n\tSpin-off technologies\n\tNASA TV\n\tNASA Social\n\tLaunch Services Program\n\tMercury Control Center\n\tKennedy Space Center\n\tVehicle Assembly Building\n\tLaunch Complex 39\n\tLaunch Control Center\n\tOperations and Checkout Building\n\n\n\tJohnson Space Center\n\tMission Control\n\tLunar Sample Laboratory\n\n\n\n\n\n\n\n\n\t\n\n\tRobotic programs\t\n\tPast\t\n\tHitchhiker\n\tMariner\n\tMariner Mark II\n\tMESUR\n\tMars Surveyor '98\n\tNew Millennium\n\tLunar Orbiter\n\tPioneer\n\tPlanetary Observer\n\tRanger\n\tSurveyor\n\tViking\n\tProject Prometheus\n\tMars Scout\n\tMars Exploration Rover\n\n\n\n\n\tCurrent\t\n\tLiving With a Star\n\tLunar Precursor Robotic Program\n\tEarth Observing System\n\tGreat Observatories program\n\tExplorer\n\tSmall explorer\n\tVoyager\n\tDiscovery\n\tNew Frontiers\n\tSolar Terrestrial Probes\n\tCommercial Lunar Payload Services\n\n\n\n\n\n\n\n\tHuman spaceflight\nprograms\t\n\tPast\t\n\tX-15 (suborbital)\n\tMercury\n\tGemini\n\tApollo\n\tApollo–Soyuz Test Project (with the Soviet space program)\n\tSkylab\n\tSpace Shuttle\n\tShuttle–Mir (with Roscosmos State Corporation)\n\tConstellation\n\n\n\n\n\tCurrent\t\n\tInternational Space Station\n\tCommercial Orbital Transportation Services\n\tCommercial Crew Development\n\tOrion\n\tArtemis\n\tLunar Gateway\n\n\n\n\n\n\n\n\tIndividual featured\n missions\n(human and robotic)\t\n\tPast\t\n\tCOBE\n\tMercury 3\n\tMercury-Atlas 6\n\tMagellan\n\tPioneer 10\n\tPioneer 11\n\tGalileo\n\tGALEX\n\tGRAIL\n\tWMAP\n\tSpace Shuttle\n\tSojourner rover\n\tSpirit rover\n\tLADEE\n\tMESSENGER\n\tAquarius\n\tCassini\n\tDawn\n\tKepler space telescope\n\tOpportunity rover\n\tRHESSI\n\tobserved\n\n\n\n\n\n\n\tCurrently\noperating\t\n\tMars Reconnaissance Orbiter\n\t2001 Mars Odyssey\n\tNew Horizons\n\tInternational Space Station\n\tHubble Space Telescope\n\tSpitzer\n\tSwift\n\tTHEMIS\n\tMars Exploration Rover\n\tCuriosity rover\n\ttimeline\n\n\n\tInSight\n\tGOES 14\n\tLunar Reconnaissance Orbiter\n\tGOES 15\n\tVan Allen Probes\n\tSolar Dynamics Observatory\n\tJuno\n\tMars Science Laboratory\n\ttimeline\n\n\n\tNuSTAR\n\tVoyager 1\n\tVoyager 2\n\tWISE\n\tMAVEN\n\tMMS\n\tOSIRIS-REx\n\tTransiting Exoplanet Survey Satellite\n\n\n\n\n\tFuture\t\n\tJoint Polar Satellite System\n\tJames Webb Space Telescope\n\tWide Field Infrared Survey Telescope\n\tMars 2020\n\tNISAR\n\tEuropa Clipper\n\n\n\n\n\n\n\n\tCommunications\nand navigation\t\n\tNear Earth Network\n\tSpace Network\n\tDeep Space Network (Goldstone\n\tMadrid\n\tCanberra\n\tSpace Flight Operations Facility)\n\tDeep Space Atomic Clock\n\n\n\n\n\tNASA lists\t\n\tAstronauts\n\tby name\n\tby year\n\tGemini astronauts\n\tApollo astronauts\n\n\n\tList of NASA aircraft\n\tList of NASA missions\n\tuncrewed missions\n\n\n\tList of NASA contractors\n\tList of United States rockets\n\tList of NASA cancellations\n\tList of Space Shuttle missions\n\tcrews\n\n\n\tList of NASA cameras on spacecraft\n\n\n\n\n\tNASA images\nand artwork\t\n\tEarthrise\n\tThe Blue Marble\n\tFamily Portrait\n\tPale Blue Dot\n\n\n\tPillars of Creation\n\tMystic Mountain\n\tSolar System Family Portrait\n\tThe Day the Earth Smiled\n\tFallen Astronaut\n\tLunar plaques\n\tPioneer plaques\n\tVoyager Golden Record\n\tApollo 11 goodwill messages\n\tNASA insignia\n\tGemini and Apollo medallions\n\tMission patches\n\n\n\n\n\tRelated\t\n\tApollo 15 postal covers incident\n\tSpace Mirror Memorial\n\tThe Astronaut Monument\n\tU.S. Astronaut Hall of Fame\n\tSpace program on U.S. stamps\n\tApollo 17 Moon mice\n\tOther primates in space\n\tNASA spinoff technologies\n\n\n\n\n\t\n\t Category\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNASA Goddard Space Flight Center\n\n\tMain articles\t\n\tRobert H. Goddard\n\tGSFC History\n\n\n\n\n\tFacilities\t\n\tWallops Flight Facility (WFF)\n\tGoddard Institute for Space Studies (GISS)\n\tIndependent Verification and Validation Facility (IV&V)\n\tSpacecraft Magnetic Test Facility\n\tSpacecraft Fabrication Facility\n\tColumbia Scientific Balloon Facility (CSBF)\n\n\n\n\n\tNotable missions\nand programs\t\n\tJames Webb Space Telescope (JWST)\n\tCosmic Background Explorer (COBE)\n\tSpace Network\n\tNear Earth Network\n\tLandsat program\n\tGetaway Special\n\tCompton Gamma Ray Observatory (CGRO)\n\tRossi X-ray Timing Explorer (RXTE)\n\tExplorers program\n\tHitchhiker Program\n\tSolar and Heliospheric Observatory (SOHO)\n\tLunar Reconnaissance Orbiter (LRO)\n\tSolar Dynamics Observatory (SDO)\n\tHubble Space Telescope (HST)\n\tTracking and Data Relay Satellite (TDRS)\n\n\n\n\n\tPeople\t\n\tLeadership\t\n\tChristopher Scolese (Director)\n\tGeorge Morrow (Deputy Director)\n\tChristyl Johnson (Deputy Director, Technology and Research Investments)\n\tColleen Hartman (Deputy Director, Science, Operations and Performance)\n\n\n\n\n\tNotable scientists\nand engineers\t\n\tDavid Louis Band\n\tRobert Bindschadler\n\tFred Espenak\n\tGene Carl Feldman\n\tOrlando Figueroa\n\tJames Hansen\n\tMarc Kuchner\n\tLissette Martinez\n\tJohn C. Mather\n\n\n\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nEuropean Space Agency\n\n\t\n\tSpaceports\t\n\tGuiana Space Centre\n\tEsrange\n\n\n\n\n\tLaunch vehicles\t\n\tAriane 5\n\tAriane 6\n\tArianespace Soyuz\n\tVega\n\n\n\n\n\tFacilities\t\n\tSpace Operations Centre\n\tSpace Research and Technology Centre\n\tESA Centre for Earth Observation\n\tEuropean Astronaut Centre\n\tSpace Astronomy Centre\n\tSpace Applications and Telecommunications Centre\n\tConcurrent Design Facility\n\tSpace Telescope European Coordinating Facility\n\n\n\n\n\tCommunications\t\n\tESTRACK\n\tEuropean Data Relay System\n\n\n\n\n\tProgrammes\t\n\tAurora\n\tATV\n\tCopernicus\n\tSentinel\n\n\n\tColumbus\n\tCryoSat\n\tEGNOS\n\tGALILEO\n\tELIPS\n\tExoMars\n\tFLPP\n\tLiving Planet Programme\n\tOrion\n\tSpace Situational Awareness Programme\n\tScience Programme\n\tHorizon 2000\n\tCosmic Vision\n\n\n\tPride\n\n\n\n\n\tPredecessors\t\n\tEuropean Launcher Development Organisation\n\tEuropean Space Research Organisation\n\n\n\n\n\tRelated topics\t\n\tArianespace\n\tESA Television\n\tEUMETSAT\n\tEuropean Space Camp\n\tGEWEX\n\tPlanetary Science Archive\n\n\n\n\n\n\n\n\t\n\tProjects and missions\n\n\tScience\t\n\tSolar physics\t\n\tISEE-2 (1977–87)\n\tUlysses (1990–2009)\n\tSOHO (1995–present)\n\tCluster II (2000–present)\n\tSolar Orbiter (2020)\n\tLagrange (2020s)\n\n\n\n\n\tPlanetary science\t\n\tGiotto (1985–92)\n\tHuygens (1997–2005)\n\tSMART-1 (2003–06)\n\tMars Express (2003–present)\n\tRosetta/Philae (2004–16)\n\tVenus Express (2005–14)\n\tExoMars Trace Gas Orbiter (2016–present)\n\tBepiColombo (2018–present)\n\tRosalind Franklin rover (2020)\n\tJupiter Icy Moons Explorer (2022)\n\tComet Interceptor (2028)\n\n\n\n\n\tAstronomy and\ncosmology\n\t\n\tCos-B (1975–82)\n\tIUE (1978–96)\n\tEXOSAT (1983–86)\n\tHipparcos (1989–93)\n\tHubble (1990–present)\n\tEureca (1992–93)\n\tISO (1995–98)\n\tXMM-Newton (1999–present)\n\tINTEGRAL (2002–present)\n\tCoRoT (2006–13)\n\tPlanck (2009–13)\n\tHerschel (2009–13)\n\tGaia (2013–present)\n\tCHEOPS (2019)\n\tJames Webb (2021)\n\tEuclid (2022)\n\tPLATO (2026)\n\tARIEL (2028)\n\tATHENA (2031)\n\tLISA (2034)\n\n\n\n\n\tEarth observation\t\n\tCopernicus (1988–)\n\tMeteosat First Generation (1977–97)\n\tERS-1 (1991–2000)\n\tERS-2 (1995–2011)\n\tMeteosat Second Generation (2002–present)\n\tEnvisat (2002–12)\n\tDouble Star (2003–07)\n\tMetOp (2006–present)\n\tGOCE (2009–13)\n\tSMOS (2009–present)\n\tCryoSat-2 (2010–present)\n\tSwarm (2013–present)\n\tSentinel-1 / 1A / 1B (2014–present)\n\tSentinel-2 / 2A / 2B (2015–present)\n\tSentinel-3 / 3A / 3B (2016–present)\n\tSentinel-5 Precursor (2017–present)\n\tADM-Aeolus (2018–present)\n\tMeteosat Third Generation (Sentinel-4) (2019)\n\tEarthCARE (2021)\n\tMetOp-SG-A (2021)\n\tBiomass (2022)\n\tMetOp-SG-B (2022)\n\tFLEX (2023)\n\tSMILE (2023)\n\tFORUM (2026)\n\n\n\n\n\n\n\n\tISS spaceflight\t\n\tISS contribution (1998–present)\n\tColumbus (2008–present)\n\tJules Verne (2008)\n\tCupola (2010–present)\n\tJohannes Kepler (2011)\n\tEdoardo Amaldi (2012)\n\tAlbert Einstein (2013)\n\tGeorges Lemaître (2014)\n\tEuropean Robotic Arm (2019)\n\n\n\n\n\n\n\n\tTelecommunications\t\n\tGEOS 2 (1978)\n\tOlympus-1 (1989–93)\n\tArtemis (2001–present)\n\tGIOVE-A (2005–present)\n\tGIOVE-B (2008–present)\n\tHYLAS-1 (2010–present)\n\tGalileo IOV (2011–present)\n\tGalileo FOC (2014–present)\n\tEGNOS\n\tEuropean Data Relay System (2016–present)\n\n\n\n\n\tTechnology\ndemonstrators\n\t\n\tARD (1998)\n\tPROBA-1 (2001–present)\n\tYES2 (2007)\n\tPROBA-2 (2009–present)\n\tPROBA-V (2013–present)\n\tIXV (2015)\n\tLISA Pathfinder (2015–17)\n\tOPS-SAT (2019)\n\tPROBA-3 (2020)\n\tAIDA (2023)\n\n\n\n\n\tCancelled and proposed\t\n\tALTIUS\n\tAriane 5 ME\n\tColumbus Man-Tended Free Flyer\n\tCSTS\n\tDarwin Mission\n\tDon Quijote\n\te.Deorbit\n\tEChO\n\tEddington\n\tEnVision\n\tEXPERT\n\tHermes\n\tHopper\n\tLOFT\n\tLuna 27\n\tLunar Lander\n\tMarco Polo\n\tMarcoPolo-R\n\tMars sample return mission\n\tODINUS\n\tSPICA\n\tSTE-QUEST\n\tTHESEUS\n\tTHOR\n\tXIPE\n\n\n\n\n\tFailed\t\n\tCluster\n\tCryoSat-1\n\tGEOS 1\n\tSchiaparelli EDM\n\n\n\n\n\tFuture missions in italics\n\t Category\n\t Commons\n\t Wikinews\n\t WikiProject\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n Canadian Space Agency\n\n\tCanadian astronauts\t\n\n\tActive\t\n\tJeremy Hansen\n\tDavid Saint-Jacques\n\tJennifer Sidey\n\tJoshua Kutryk\n\n\n\n\n\tRetired\t\n\tMarc Garneau\n\tRoberta Bondar\n\tSteven MacLean\n\tChris Hadfield\n\tRobert Thirsk\n\tBjarni Tryggvason\n\tDafydd Williams\n\tJulie Payette\n\tMichael McKay\n\tKen Money\n\n\n\n\n\tOther\t\n\tGuy Laliberté (space tourist)\n\n\n\n\n\n\n\n\tSatellites\t\n\tAlouette 1\n\tAlouette 2\n\tAnik series\n\tBRITE\n\tCASSIOPE\n\tHermes\n\tISIS 1\n\tISIS 2\n\tM3MSat\n\tMOST\n\tMSAT-1\n\tNEOSSat\n\tNimiq series\n\tRADARSAT-1\n\tRADARSAT-2\n\tRADARSAT Constellation\n\tSCISAT-1\n\tSapphire\n\n\n\n\n\tOther space technology\t\n\tBlack Brant rocket\n\tCanadarm\n\tCanadarm2\n\tDextre\n\tFGS/NIRISS\n\tMOPITT\n\tOSIRIS\n\n\n\n\n\tFacilities\t\n\tJohn H. Chapman Space Centre\n\tDavid Florida Laboratory\n\tSaskatoon CSA Building\n\n\n\n\n\tContractors\t\n\tCOM DEV\n\tMacDonald, Dettwiler and Associates (MDA Space Missions/Spar Aerospace)\n\tMagellan Aerospace (Bristol Aerospace)\n\tTelesat\n\tUTIAS-SFL\n\n\n\n\n\tRelated institutions\t\n\tCanadian Geospace Monitoring\n\tCommunications Research Centre Canada\n\tDefence Research and Development Canada\n\tNational Research Council\n\n\n\n\n\tInternational partners\t\n\tESA\n\tNASA\n\tISRO\n\tJAXA\n\tSNSB\n\n\n\n\n\tOther\t\n\tBell TV\n\tChurchill Rocket Research Range\n\tInternational Space Station\n\tLunar Orbital Platform-Gateway\n\tShaw Direct\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nFuture spaceflights\n\n\tCrewed\t\n\t2019\t\n\tCrew Dragon Demo-2 (December)\n\tBoeing Crewed Flight Test (December)\n\tNew Shepard crewed flight test\n\tVSS Unity VF02\n\n\n\n\n\t2020\t\n\tSoyuz MS-16 (April)\n\tSoyuz MS-17 (October)\n\tShenzhou 12\n\tUSCV-1\n\tUSCV-2\n\n\n\n\n\t2021\t\n\tGaganyaan Crewed Flight 1\n\tShenzhou 13\n\tUSCV-3\n\n\n\n\n\t2022+\t\n\tArtemis 2 (2022)\n\t#dearMoon project (2023)\n\tArtemis 3 (2024)\n\n\n\n\n\n\n\n\tRobotic\t\n\t2019\t\n\tAFSPC-7 (December)\n\tBoeing Orbital Flight Test (October)\n\tCartosat-3 (October)\n\tCHEOPS (December)\n\tGSAT-20 (September)\n\tICON (October)\n\tJCSAT-17 (December)\n\tProgress MS-13 (December)\n\tSpaceX CRS-19 (December)\n\n\n\n\n\t2020\t\n\tALOS-3\n\tALOS-4\n\tArtemis 1 / Orion\n\tLunar Flashlight\n\tNEA Scout\n\tBioSentinel\n\tSkyFire\n\tLunar IceCube\n\tCuSP\n\tLunaH-Map\n\tEQUULEUS\n\tOMOTENASHI\n\tArgoMoon\n\tCislunar Explorers\n\tCU-E3\n\tTeam Miles\n\n\n\tChang'e 5\n\tDream Chaser\n\tHope Mars Mission (July)\n\tHX-1 (July–August)\n\tIngenio\n\tInmarsat-6 F1\n\tKounotori 9 (May)\n\tLandsat 9 (December)\n\tMars 2020 (July–August)\n\tMX-1E (July)\n\tNauka / European Robotic Arm\n\tOrbitBeyond (September)\n\tPrichal\n\tPTD-1\n\tRAPIS-2 / Z-Sat / DRUMS / KOSEN-1\n\tRosalind Franklin rover and Kazachok lander (July)\n\tSolar Orbiter (February)\n\tSpace Complex Alpha\n\tTARANIS\n\tTianhe-1\n\n\n\n\n\t2021\t\n\tAditya-L1\n\tAstrobotic M1 (June)\n\tAEM rovers\n\tUni\n\tEXA/AEC lunar orbiter\n\n\n\tB330\n\tBiomass\n\tCAPSTONE (December)\n\tDART / LICIA (June)\n\tEarthCARE\n\tHakuto-R M1 (October)\n\tIXPE (April)\n\tJames Webb Space Telescope (March)\n\tLucy (October)\n\tLuna 25 (July)\n\tMetOp-SG Series A\n\tNISAR\n\tNova-C (July)\n\tPTScientists\n\tSES-17\n\tSpace RIDER\n\tUN/Dream Chaser\n\tWentian\n\n\n\n\n\t2022\t\n\tDESTINY+\n\tEuclid (June)\n\tHTV-X1\n\tJUICE (June)\n\tKPLO (July)\n\tMetOp-SG Series B\n\tMOM 2 (2022 or 2023)\n\tPower and Propulsion Element\n\tPsyche (August)\n\tPUNCH / TRACERS\n\tSoyuz GVK-1\n\tSpaceX cargo BFR (1st Mars departure)\n\tTEREX-1\n\tXRISM / SLIM (January)\n\n\n\n\n\t2023+\t\n\tHera / APEX / Juventas (2023)\n\tChang'e 6 (2023 or 2024)\n\tEuropa Clipper (2025)\n\n\n\tFLEX (2023)\n\tHakuto-R M2 (March 2023)\n\tLuna 26 (2023)\n\tShukrayaan-1 (2023)\n\tSMILE (2023)\n\tSpektr-UV (2023)\n\tSPHEREx (2023)\n\tGOES-U (2024)\n\tLuna 27 (2024)\n\tMMX (2024)\n\tZhengHe (2024)\n\tLuna 28 (2025+)\n\tDragonfly (2026)\n\tPLATO (2026)\n\tVenera-D (2026 or 2031)\n\tLiteBIRD (2027)\n\tARIEL / Comet Interceptor (2028)\n\tATHENA (2031)\n\tLISA (2034)\n\n\n\n\n\tTBA\t\n\tEnergia-100\n\tEuropa Lander (2025?)\n\tKiwiSAT\n\tLybid 1\n\tNano-JASMINE\n\tNear-Earth Object Surveillance Mission\n\tWFIRST (mid-2020s)\n\n\n\n\n\n\n\n\tRecently\nlaunched\t\n\tZhuhai-1 OHS 2E–2H / Zhuhai-1 OVS 2B (19 September)\n\tBeiDou-3 M23 / BeiDou-3 M24 (22 September)\n\tKounotori 8 (24 September)\n\tYunhai-1 02 (25 September)\n\tSoyuz MS-15 (25 September)\n\tEKS-3 (26 September)\n\n\n\n\n\t\n\tList of proposed missions to the Moon\n\tList of proposed space observatories\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=James_Webb_Space_Telescope&oldid=917539901\"\n\n\t\t\n\t\tCategories: \tJames Webb Space Telescope\n\t2021 in science\n\t2021 in spaceflight\n\tSpace observatories\n\tInfrared telescopes\n\tNASA programs\n\tProposed NASA space probes\n\tEuropean Space Agency space probes\n\tSpace program of Canada\n\tGoddard Space Flight Center\n\tExoplanet search projects\n\tSpacecraft using halo orbits\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tWebarchive template archiveis links\n\tAll articles with dead external links\n\tArticles with dead external links from September 2010\n\tCS1 maint: multiple names: authors list\n\tCS1 maint: uses authors parameter\n\tArticles with short description\n\tUse dmy dates from September 2019\n\tUse American English from March 2018\n\tAll Wikipedia articles written in American English\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from April 2019\n\tArticles with unsourced statements from December 2018\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tBân-lâm-gú\n\tБългарски\n\tBosanski\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\t한국어\n\tहिन्दी\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tҚазақша\n\tLatina\n\tLatviešu\n\tLietuvių\n\tLimburgs\n\tMagyar\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tМонгол\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 24 September 2019, at 09:00 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "28", "dc:title": "James Webb Space Telescope - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/James_Webb_Space_Telescope_2009_top.jpg/1200px-James_Webb_Space_Telescope_2009_top.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-james_webb_space_telescope", "title": "James Webb Space Telescope - Wikipedia"}}