{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLaser propulsion - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tLaser propulsion\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tLaser propulsion is a form of beam-powered propulsion where the energy source is a remote (usually ground-based) laser system and separate from the reaction mass. This form of propulsion differs from a conventional chemical rocket where both energy and reaction mass come from the solid or liquid propellants carried on board the vehicle.\n\n\n  \nA laser launch Heat Exchanger Thruster system\n\n\n\nContents\n\n\n\t1 History\n\t2 Laser-pushed lightsail\n\t2.1 Laser-pushed lightsail\n\t2.2 Photon recycling\n\n\n\n\t3 Laser energized rocket\n\t3.1 Laser thermal rocket\n\t3.2 Ablative laser propulsion\n\t3.3 Pulsed plasma propulsion\n\t3.4 CW plasma propulsion\n\t3.5 Laser electric propulsion\n\n\n\n\t4 See also\n\t5 References\n\t6 External links\n\n\n\n\n\nHistory[edit]\n\nThe basic concepts underlying a photon-propelled \"sail\" propulsion system were developed by Eugene Sanger and the Hungarian physicist György Marx.  Propulsion concepts using laser-energized rockets were developed by Arthur Kantrowitz and Wolfgang Moekel in the 1970s.[1]  An exposition of Kantrowitz's laser propulsion ideas was published in 1988.[2]\n\nLaser propulsion systems may transfer momentum to a spacecraft in two different ways. The first way uses photon radiation pressure to drive momentum transfer and is the principle behind solar sails and laser sails. The second method uses the laser to help expel mass from the spacecraft as in a conventional rocket. This is the more frequently proposed method, but is fundamentally limited in final spacecraft velocities by the rocket equation.\n\n\nLaser-pushed lightsail[edit]\n\nLaser-pushed sails are examples of beam-powered propulsion.\n\n\nLaser-pushed lightsail[edit]\n\nA laser-pushed lightsail is a thin reflective sail similar to a solar sail, in which the sail is being pushed by a laser, rather than the sun.  The advantage of lightsail propulsion is that the vehicle does not carry either the energy source or the reaction mass for propulsion, and hence the limitations of the Tsiolkovsky rocket equation to achieving high velocities are avoided. Use of a laser-pushed lightsail was proposed initially by Marx in 1966,[3]  as a method of Interstellar travel that would avoid extremely high mass ratios by not carrying fuel, and analyzed in detail by physicist Robert L. Forward in 1989.[4]    Further analysis of the concept was done by Landis,[5][6] Mallove and Matloff,[7] Andrews[8] and others.\n\nThe beam has to have a large diameter so that only a small portion of the beam misses the sail due to diffraction and the laser or microwave antenna has to have a good pointing stability so that the craft can tilt its sails fast enough to follow the center of the beam. This gets more important when going from interplanetary travel to interstellar travel, and when going from a fly-by mission, to a landing mission, to a return mission. The laser may alternatively be a large phased array of small devices, which get their energy directly from solar radiation.\n\nThe laser-pushed sail is proposed as a method of propelling a small interstellar probe by the Breakthrough Starshot project.\n\nAnother method of moving a much larger spacecraft to high velocities is by using a laser system to propel a stream of much smaller sails. Each alternative mini sail is slowed down by a laser from the home system so that they collide at ionising velocities. The ionising collisions could then be used to interact with a powerful magnetic field on the spacecraft to provide a force to power and move it. An extension of the idea is to have nuclear materials on the mini sails that undergo fission or fusion to provide a much more powerful force but the collision velocities would have to be much higher.\n\n\nPhoton recycling[edit]\n\nMetzgar and Landis proposed a variant on the laser-pushed sail, in which the photons reflected from the sail are re-used by re-reflecting them back to the sail by a stationary mirror; a \"multi-bounce laser-based sail.\"[9]  This amplifies the force produced by recycling the photons, resulting in considerably higher force produced from the same laser power. There is also a multi-bounce photonic sail configuration which uses a large Fresnel lens around a laser generating system. In this configuration the laser shines light on a probe sail accelerating it outwards which is then reflected back through the Fresnel lens to be reflected off a larger more massive reflector probe going in the other direction. The laser light is reflected back and forth many times improving the force transmitted but importantly allows the large lens to remain in a more stable position as it is not greatly influenced by the laser lights momentum.\n\n\n\nAn optical cavity allows greater re-use of photons, but keeping the beam in the cavity becomes much more challenging. An optical cavity can be made with two high-reflectance mirrors, forming a Fabry–Pérot optical resonance cavity in which any small movement of mirrors would destroy the resonance condition and null photonic thrust. Such optical cavities are used for gravitational wave detection as in LIGO, for their extreme sensitivity to the movement of mirror. Bae originally proposed[10] to use photon recycling for use in a nanometer accuracy formation flight of satellites for this reason. Bae, however, discovered[11] that in an active optical cavity formed by two high-reflectance mirrors and a laser gain medium in between, similar to the typical laser cavity, photon recycling becomes less sensitive to the movement of mirrors. Bae named the laser thruster based on the photon recycling in an active optical cavity Photonic Laser Thruster (PLT).[12] In 2015 his team demonstrated the number of photon recycling up to 1,540 over a distance of a few meters and photonic thrusts up to 3.5 mN with the use of a 500 W laser system. In a laboratory demonstration,[13] a Cubesat (0.75 kg in weight) was propelled with PLT.[14]\n\n\nLaser energized rocket[edit]\n\nThere are several forms of laser propulsion in which the laser is used as an energy source to provide momentum to propellant that is carried on board the rocket.  The use of a laser as the energy source means that the energy provided to the propellant is not limited by the chemical energy of the propellant.\n\n\nLaser thermal rocket[edit]\n\nThe laser thermal rocket (heat exchanger (HX) thruster) is a thermal rocket in which the propellant is heated by energy provided by an external laser beam.[15][16]  The beam heats a solid heat exchanger, which in turn heats an inert liquid propellant, converting it to hot gas which is exhausted through a conventional nozzle. This is similar in principle to nuclear thermal and solar thermal propulsion. Using a large flat heat exchanger allows the laser beam to shine directly on the heat exchanger without focusing optics on the vehicle. The HX thruster has the advantage of working equally well with any laser wavelength and both CW and pulsed lasers, and of having an efficiency approaching 100%. The HX thruster is limited by the heat exchanger material and by radiative losses to relatively low gas temperatures, typically 1000 - 2000 C. For a given temperature, the specific impulse is maximized with the minimum molecular weight reaction mass, and with hydrogen propellant, that provides sufficient specific impulse as high as 600 – 800 seconds, high enough in principle to allow single stage vehicles to reach low Earth orbit. The HX laser thruster concept was developed by Jordin Kare in 1991;[17] a similar microwave thermal propulsion concept was developed independently by Kevin L. Parkin at Caltech in 2001.\n\nA variation on this concept was proposed by Prof. John Sinko and Dr. Clifford Schlecht as a redundant safety concept for assets on orbit.[18] Packets of enclosed propellants are attached to the outside of a space suit, and exhaust channels run from each packet to the far side of the astronaut or tool. A laser beam from a space station or shuttle vaporizes the propellant inside the packs. Exhaust is directed behind the astronaut or tool, pulling the target towards the laser source. To brake the approach, a second wavelength is used to ablate the exterior of the propellant packets on the near side.\n\n\nAblative laser propulsion[edit]\n\nAblative laser propulsion (ALP) is a form of beam-powered propulsion in which an external pulsed laser is used to burn off a plasma plume from a solid metal propellant, thus producing thrust.[19] The measured specific impulse of small ALP setups is very high at about 5000 s (49 kN·s/kg), and unlike the lightcraft developed by Leik Myrabo which uses air as the propellant, ALP can be used in space.\n\nMaterial is directly removed from a solid or liquid surface at high velocities by laser ablation by a pulsed laser. Depending on the laser flux and pulse duration, the material can be simply heated and evaporated, or converted to plasma. Ablative propulsion will work in air or vacuum. Specific impulse values from 200 seconds to several thousand seconds are possible by choosing the propellant and laser pulse characteristics. Variations of ablative propulsion include double-pulse propulsion in which one laser pulse ablates material and a second laser pulse further heats the ablated gas, laser micropropulsion in which a small laser on board a spacecraft ablates very small amounts of propellant for attitude control or maneuvering, and space debris removal, in which the laser ablates material from debris particles in low Earth orbit, changing their orbits and causing them to reenter.\n\nUniversity of Alabama Huntsville Propulsion Research Center[20] has researched ALP.[21]\n\n\nPulsed plasma propulsion[edit]\n\nA high energy pulse focused in a gas or on a solid surface surrounded by gas produces breakdown of the gas (usually air). This causes an expanding shock wave which absorbs laser energy at the shock front (a laser sustained detonation wave or LSD wave); expansion of the hot plasma behind the shock front during and after the pulse transmits momentum to the craft. Pulsed plasma propulsion using air as the working fluid is the simplest form of air-breathing laser propulsion. The record-breaking lightcraft, developed by Leik Myrabo of RPI (Rensselaer Polytechnic Institute) and Frank Mead, works on this principle.\n\nAnother concept of pulsed plasma propulsion is being investigated by Prof. Hideyuki Horisawa.[22]\n\n\nCW plasma propulsion[edit]\n\nA continuous laser beam focused in a flowing stream of gas creates a stable laser sustained plasma which heats the gas; the hot gas is then expanded through a conventional nozzle to produce thrust. Because the plasma does not touch the walls of the engine, very high gas temperatures are possible, as in gas core nuclear thermal propulsion. However, to achieve high specific impulse, the propellant must have low molecular weight; hydrogen is usually assumed for actual use, at specific impulses around 1,000 seconds. CW plasma propulsion has the disadvantage that the laser beam must be precisely focused into the absorption chamber, either through a window or by using a specially-shaped nozzle. CW plasma thruster experiments were performed in the 1970s and 1980s, primarily by Dr. Dennis Keefer of UTSI and Prof. Herman Krier of the University of Illinois at Urbana–Champaign.\n\n\nLaser electric propulsion[edit]\n\nA general class of propulsion techniques in which the laser beam power is converted to electricity, which then powers some type of electric propulsion thruster.\n\nA small quadcopter has flown for 12 hours and 26 minutes charged by a 2.25 kW laser (powered at less than half of its normal operating current), using 170 watt photovoltaic arrays as the power receiver,[23] and a laser has been demonstrated to charge the batteries of an unmanned aerial vehicle in flight for 48 hours.[24]\n\nFor spacecraft, laser electric propulsion is considered as a competitor to solar electric or nuclear electric propulsion for low-thrust propulsion in space. However, Leik Myrabo has proposed high-thrust laser electric propulsion, using magnetohydrodynamics to convert laser energy to electricity and to electrically accelerate air around a vehicle for thrust.\n\n\nSee also[edit]\n\n\tElevator:2010\n\tList of laser articles\n\tOptical lift\n\tRocket engine\n\n\nReferences[edit]\n\n\n\t^ Michaelis, MM and Forbes, A. 2006. Laser propulsion: a review. South African Journal of Science, 102(7/8), 289-295 \n\n\t^ A. Kantrowitz, in  Proceedings of the International Conference on Lasers '87, F. J. Duarte, Ed. (STS Press, Mc Lean, VA, 1988).\n\n\t^ G. Marx, \"Interstellar Vehicle Propelled by Laser Beam,\" Nature, Vol. 211, July 1966, pp. 22-23.\n\n\t^ R. L. Forward, \"Roundtrip Interstellar Travel Using Laser-Pushed lightsails,\" J. Spacecraft and Rockets, Vol. 21, pp 187-195 (Mar-Apr. 1989)\n\n\t^ G. A. Landis, \"Optics and Materials Considerations for a Laser-Propelled Lightsail\", paper IAA-89-664 (text)\n\n\t^ G. A. Landis, \"Small Laser-Pushed Lightsail Interstellar Probe: A Study of Parameter Variations\",  J. British Interplanetary Society, Vol. 50, No. 4, pp. 149-154 (1997); Paper IAA-95-4.1.1.02,\n\n\t^ Eugene Mallove & Gregory Matloff (1989). The Starflight Handbook. John Wiley & Sons, Inc. ISBN 978-0-471-61912-3.\n\n\t^ D. G. Andrews, \"Cost Considerations for Interstellar Missions,\" paper IAA-93-706\n\n\t^ R. A. Metzger and G. A. Landis, \"Multi-Bounce Laser-Based Sails,\" STAIF Conference on Space Exploration Technology, Albuquerque NM, Feb. 11-15, 2001. AIP Conf. Proc. 552, 397. doi:10.1063/1.1357953\n\n\t^ Bae, Young (2007-09-18). Photon Tether Formation Flight (PTFF) for Distributed and Fractionated Space Architectures. AIAA SPACE 2007 Conference & Exposition. Reston, Virigina: American Institute of Aeronautics and Astronautics. doi:10.2514/6.2007-6084. ISBN 9781624100161.\n\n\n\t^ Bae, Young K. (2008). \"Photonic Laser Propulsion: Proof-of-Concept Demonstration\". Journal of Spacecraft and Rockets. 45 (1): 153–155. doi:10.2514/1.32284. ISSN 0022-4650.\n\n\n\t^ Bae, Young (2007-09-18). Photonic Laser Propulsion (PLP): Photon Propulsion Using an Active Resonant Optical Cavity. AIAA SPACE 2007 Conference & Exposition. Reston, Virigina: American Institute of Aeronautics and Astronautics. doi:10.2514/6.2007-6131. ISBN 9781624100161.\n\n\n\t^ Youtube video\n\n\t^ Bae, Young (2016). \"Demonstration of a mN-Class Photonic Laser Thruster\". ResearchGate. International High Power Laser Ablation and Directed Energy Conference. Retrieved 2018-11-22.\n\n\n\t^ H. Krier and R. J. Glumb.  \"Concepts and status of laser-supported rocket propulsion\", Journal of Spacecraft and Rockets, Vol. 21, No. 1 (1984), pp. 70-79.\nhttps://dx.doi.org/10.2514/3.8610\n\n\t^ \"Laser Thermal Propulsion\". Orbit-Raising and Maneuvering Propulsion: Research Status and Needs. 1984. pp. 129–148. doi:10.2514/5.9781600865633.0129.0148. ISBN 978-0-915928-82-8.\n\n\n\t^ [1]  Archived July 24, 2011, at the Wayback Machine\n\n\t^ \"Laser 'tractor beams' could reel in lost astronauts\".\n\n\n\t^ \"Claude AIP 2010\" (PDF).\n\n\n\t^ \"UAH Propulsion Research Center\". Retrieved March 18, 2014.\n\n\n\t^ Grant Bergstue; Richard L. Fork (2011). \"Beamed Energy for Ablative Propulsion in Near Earth Space\" (PDF). International Astronautical Federation. Archived from the original (PDF) on March 18, 2014. Retrieved March 18, 2014. Cite journal requires |journal= (help)\n\n\n\t^ \"Archived copy\". Archived from the original on 2017-02-07. Retrieved 2017-02-06.CS1 maint: archived copy as title (link)\n\n\n\t^ Kare / Nugent et al. \"12-hour hover: Flight demonstration of a laserpowered quadrocopter\" LaserMotive, April 2010. Retrieved: 12 July 2012.\n\n\t^ \"Laser Powers Lockheed Martin’s Stalker UAS For 48 Hours\" sUAS News, 11 July 2012. Retrieved: 12 July 2012.\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Laser propulsion.\n\n\n\tNASA video on Laser Drive Propulsion on YouTube\n\tInvestigations Into a Potential Laser-NASP Transport Technology.  Proceedings of the NASA/USRA Advanced Design Program 6th Annual Summer Conference.  NASA. June 1990.\n\tFinal report of NIAC study on HX launch system\n\t\"The original paper describing ALP\" (PDF). Archived from the original (PDF) on 2006-08-09.\n\n\n\n\t\tv\n\tt\n\te\n\n\nNon-rocket spacelaunch\n\n\tSpaceflight\n\n\tStatic structures\t\n\tCompressive\t\n\tSpace tower\n\tPneumatic freestanding tower\n\n\n\n\n\tTensile\t\n\tOrbiting skyhooks\t\n\tSkyhook\n\tMomentum exchange tether\n\n\n\n\n\tSpace elevators\tSpace elevator\n\n\n\n\n\n\n\t\n\n\tDynamic structures\t\n\tSpace fountain\n\tOrbital ring\n\tLaunch loop\n\tEndo-atmospheric tether\n\n\n\n\n\tProjectile launchers\t\n\tElectrical\t\n\tCoilgun\n\tMass driver\n\tRailgun\n\tStarTram\n\n\n\n\n\tChemical\t\n\tSpace gun\n\tBlast wave accelerator\n\tRam accelerator\n\n\n\n\n\tMechanical\t\n\tSlingatron\n\n\n\n\n\n\n\n\tReaction drives\t\n\tAir launch\n\tSpaceplanes\n\tLaser propulsion\n\tBeam-powered propulsion\n\n\n\n\n\tBuoyant lifting\t\n\tBalloon\n\tBuoyant space port\n\tHigh-altitude platform\n\n\n\n\n\t\n\tSee also\n\tRocket sled launch\n\tMegascale engineering\n\n\n\t Category\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nEmerging technologies\n\n\tFields\t\n\tAgriculture\t\n\tAgricultural robot\n\tCellular agriculture\n\tClosed ecological systems\n\tCultured meat\n\tGenetically modified food\n\tPrecision agriculture\n\tVertical farming\n\n\n\n\n\tArchitecture\t\n\tArcology\n\tBuilding printing\n\tContour crafting\n\n\n\tDomed city\n\n\n\n\n\tBiomedical\t\n\tArtificial uterus\n\tAmpakine\n\tBrain transplant\n\tCryonics\n\tCryoprotectant\n\tCryopreservation\n\tVitrification\n\tSuspended animation\n\n\n\tDe-extinction\n\tGenetic engineering\n\tGene therapy\n\n\n\tHead transplant\n\tIsolated brain\n\tLife extension\n\tStrategies for Engineered Negligible Senescence\n\n\n\tNanomedicine\n\tNanosensors\n\tOrgan printing\n\tPersonalized medicine\n\tRegenerative medicine\n\tStem-cell therapy\n\tTissue engineering\n\n\n\tRobot-assisted surgery\n\tSynthetic biology\n\tSynthetic genomics\n\n\n\tVirotherapy\n\tOncolytic virus\n\n\n\tTricorder\n\tWhole genome sequencing\n\n\n\n\n\tDisplays\t\n\tNext generation\t\n\tFED\n\tFLCD\n\tiMoD\n\tLaser\n\tLPD\n\tOLED\n\tOLET\n\tQD-LED\n\tSED\n\tTPD\n\tTDEL\n\tTMOS\n\tMicroLED\n\n\n\n\n\tScreenless\t\n\tBionic contact lens\n\tHead-mounted display\n\tHead-up display\n\tOptical head-mounted display\n\tVirtual retinal display\n\n\n\n\n\tOther\t\n\tAutostereoscopy\n\tFlexible display\n\tHolographic display\n\tComputer-generated holography\n\n\n\tMulti-primary color display\n\tUltra HD\n\tVolumetric display\n\n\n\n\n\n\n\n\tElectronics\t\n\tElectronic nose\n\tE-textiles\n\tFlexible electronics\n\tMolecular electronics\n\tNanoelectromechanical systems\n\tMemristor\n\tSpintronics\n\tThermal copper pillar bump\n\tTwistronics\n\n\n\n\n\tEnergy\t\n\tProduction\t\n\tAirborne wind turbine\n\tArtificial photosynthesis\n\tBiofuels\n\tCarbon-neutral fuel\n\tConcentrated solar power\n\tFusion power\n\tHome fuel cell\n\tHydrogen economy\n\tMethanol economy\n\tMolten salt reactor\n\tNantenna\n\tPhotovoltaic pavement\n\tSpace-based solar power\n\tVortex engine\n\n\n\n\n\tStorage\t\n\tBeltway battery\n\tCompressed air energy storage\n\tFlywheel energy storage\n\tGrid energy storage\n\tLithium–air battery\n\tMolten-salt battery\n\tNanowire battery\n\tResearch in lithium-ion batteries\n\tSilicon–air battery\n\tThermal energy storage\n\tUltracapacitor\n\n\n\n\n\tOther\t\n\tSmart grid\n\tWireless power\n\n\n\n\n\n\n\n\tInformation and\ncommunications\n\t\n\tAmbient intelligence\n\tInternet of things\n\n\n\tArtificial intelligence\n\tApplications of artificial intelligence\n\tProgress in artificial intelligence\n\tMachine translation\n\tMobile translation\n\tMachine vision\n\tSemantic Web\n\tSpeech recognition\n\n\n\tAtomtronics\n\tCarbon nanotube field-effect transistor\n\tCybermethodology\n\tFourth-generation optical discs\n\t3D optical data storage\n\tHolographic data storage\n\n\n\tGPGPU\n\tMemory\n\tCBRAM\n\tFRAM\n\tMillipede\n\tMRAM\n\tNRAM\n\tPRAM\n\tRacetrack memory\n\tRRAM\n\tSONOS\n\n\n\tOptical computing\n\tRFID\n\tChipless RFID\n\n\n\tSoftware-defined radio\n\tThree-dimensional integrated circuit\n\n\n\n\n\tManufacturing\t\n\t3D printing\n\tClaytronics\n\tMolecular assembler\n\tUtility fog\n\n\n\n\n\tMaterials science\t\n\tAerogel\n\tAmorphous metal\n\tArtificial muscle\n\tConductive polymer\n\tFemtotechnology\n\tFullerene\n\tGraphene\n\tHigh-temperature superconductivity\n\tHigh-temperature superfluidity\n\tLinear acetylenic carbon\n\tMetamaterials\n\tMetamaterial cloaking\n\n\n\tMetal foam\n\tMulti-function structures\n\tNanotechnology\n\tCarbon nanotubes\n\tMolecular nanotechnology\n\tNanomaterials\n\n\n\tPicotechnology\n\tProgrammable matter\n\tQuantum dots\n\tSilicene\n\tSuperalloy\n\tSynthetic diamond\n\n\n\n\n\tMilitary\t\n\tAntimatter weapon\n\tCaseless ammunition\n\tDirected-energy weapon\n\tLaser\n\tMaser\n\tParticle-beam weapon\n\tSonic weapon\n\tCoilgun\n\tRailgun\n\n\n\tPlasma weapon\n\tPure fusion weapon\n\tStealth technology\n\tVortex ring gun\n\n\n\n\n\tNeuroscience\t\n\tArtificial brain\n\tBrain–computer interface\n\tElectroencephalography\n\tMind uploading\n\tBrain-reading\n\tNeuroinformatics\n\n\n\tNeuroprosthetics\n\tBionic eye\n\tBrain implant\n\tExocortex\n\tRetinal implant\n\n\n\n\n\n\n\tQuantum\t\n\tQuantum algorithms\n\tQuantum amplifier\n\tQuantum bus\n\tQuantum channel\n\tQuantum circuit\n\tQuantum complexity theory\n\tQuantum computing\n\tQuantum cryptography\n\tQuantum dynamics\n\tQuantum electronics\n\tQuantum error correction\n\tQuantum imaging\n\tQuantum information\n\tQuantum key distribution\n\tQuantum logic\n\tQuantum logic gates\n\tQuantum machine\n\tQuantum machine learning\n\tQuantum metamaterial\n\tQuantum metrology\n\tQuantum network\n\tQuantum neural network\n\tQuantum optics\n\tQuantum programming\n\tQuantum sensing\n\tQuantum simulator\n\tQuantum teleportation\n\n\n\n\n\tRobotics\t\n\tDomotics\n\tNanorobotics\n\tPowered exoskeleton\n\tSelf-reconfiguring modular robot\n\tSwarm robotics\n\tUncrewed vehicle\n\n\n\n\n\tSpace science\t\n\tLaunch\t\n\tFusion rocket\n\tNon-rocket spacelaunch\n\tMass driver\n\tOrbital ring\n\tSkyhook\n\tSpace elevator\n\tSpace fountain\n\tSpace tether\n\n\n\tReusable launch system\n\n\n\n\n\tPropulsion\t\n\tBeam-powered propulsion\n\tIon thruster\n\tLaser propulsion\n\tPlasma propulsion engine\n\tHelicon thruster\n\tVASIMR\n\n\n\tNuclear pulse propulsion\n\tSolar sail\n\n\n\n\n\tOther\t\n\tInterstellar travel\n\tPropellant depot\n\tLaser communication in space\n\n\n\n\n\n\n\n\tTransport\t\n\tAerial\t\n\tAdaptive compliant wing\n\tBackpack helicopter\n\tDelivery drone\n\tFlying car\n\tHigh-altitude platform\n\tJet pack\n\tPulse detonation engine\n\tScramjet\n\tSpaceplane\n\tSupersonic transport\n\n\n\n\n\tLand\t\n\tAirless tire\n\tAlternative fuel vehicle\n\tHydrogen vehicle\n\n\n\tDriverless car\n\tGround effect train\n\tHyperloop\n\tMaglev train\n\tPersonal rapid transit\n\tTransit Elevated Bus\n\tVactrain\n\tVehicular communication systems\n\n\n\n\n\tPipeline\t\n\tPneumatic transport\n\tAutomated vacuum collection\n\n\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tCloak of invisibility\n\tDigital scent technology\n\tForce field\n\tPlasma window\n\n\n\tImmersive virtual reality\n\tMagnetic refrigeration\n\tPhased-array optics\n\n\n\n\n\n\n\n\tTopics\t\n\tCollingridge dilemma\n\tDifferential technological development\n\tDisruptive Innovation\n\tEphemeralization\n\tExploratory engineering\n\tFictional technology\n\tProactionary principle\n\tTechnological change\n\tTechnological unemployment\n\n\n\tTechnological convergence\n\tTechnological evolution\n\tTechnological paradigm\n\tTechnology forecasting\n\tAccelerating change\n\tMoore's law\n\tTechnological singularity\n\tTechnology scouting\n\n\n\tTechnology readiness level\n\tTechnology roadmap\n\tTranshumanism\n\n\n\n\n\t\n\t Category\n\t List\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Laser_propulsion&oldid=917065003\"\n\n\t\t\n\t\tCategories: \tForce lasers\n\tSpacecraft propulsion\n\tEmerging technologies\n\n\nHidden categories: \tWebarchive template wayback links\n\tCS1 errors: missing periodical\n\tCS1 maint: archived copy as title\n\tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tEspañol\n\tFrançais\n\tPortuguês\n\tРусский\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 22 September 2019, at 02:48 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Laser propulsion - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/9/96/Laser_launch_hx_kare.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-laser_propulsion", "title": "Laser propulsion - Wikipedia"}}