{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLightcraft - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tLightcraft\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nLightcraft being propelled by laser\n\n\n\nThe Lightcraft is a space- or air-vehicle driven by beam-powered propulsion, the energy source powering the craft being external. It has been theoretically conceptualized by aerospace engineering Leik Myrabo at Rensselaer Polytechnic Institute in 1976,[1] who developed the concept further with working prototypes,[2] funded in the 1980s by the Strategic Defense Initiative organization, and the decade after by the Advanced Concept Division of the US Air Force AFRL, NASA's MFSC and the Lawrence Livermore National Laboratory.[3][4][5]\n\nWhen a Lightcraft is in the atmosphere, air is used as the propellant material (reaction mass). In space, it would need to provide the propellant material from onboard tanks or from an ablative solid. By leaving the vehicle's power source on the ground and by using ambient atmosphere as a reaction mass for much of its ascent, a Lightcraft could potentially be capable of delivering a very large percentage of its launch mass to orbit as an SSTO, an impossible task for chemical rockets. As such, a Lightcraft is distinct from a solar sail because it is dependent on the expansion of reaction mass to accelerate rather than being accelerated by light pressure alone. Within the atmosphere, the Lightcraft propulsion is dependent on the external laser power only, so propulsive power is not limited to that generated by usual on-board machinery (i.e. rockets).[6]\n\n\nContents\n\n\n\t1 Types\n\t1.1 Laser-powered propulsion\n\t1.2 Microwave-powered and MHD propulsion\n\n\n\n\t2 Status\n\t3 See also\n\t4 References\n\t5 External links\n\n\n\n\n\nTypes[edit]\n\nLaser-powered propulsion[edit]\n\n  \nProfile view of a laser Lightcraft type 200\n\n\n\nFirst small-scale models used laser propulsion which is a technique still in early stages of development. Lightcraft prototypes are made of solid aluminium machined axisymmetrically. The nose is shaped as a blunted cone for aerodynamical purpose. The rim has an annular air inlet. The aft is a funnel polished as a concave mirror with a pointy tail in the middle extending back out of the body, acting as a parabolic reflector.\n\nA ground-based laser aims a high power pulse to the mirror stern. The beam is reflected and focuses to heat the air at an extremely high temperature up to 30,000 degrees, transforming it in a plasma that violently expands, pushing the craft forward. Air is renewed through the inlet and the cycle is repeated at high frequency, acting as an external pulse detonation engine producing thrust.[7]\n\nIn April 1997, tests by Leik Myrabo in cooperation with the US Army at White Sands Missile Range demonstrated the basic feasibility of propel objects in this way, using a 10-kW ground-based pulsed carbon dioxide laser (1 kJ per pulse, 30 µs pulse at 10 Hz frequency). The test succeeded in reaching over one hundred feet, which compares to Robert Goddard's first test flight of his rocket design.[2]\n\nIn October 2000, a new flight record was set with a flight lasting 10.5 seconds and reaching 71 meters (233 feet) using the same laser, but this time providing an on-board plastic ablative propellant, and rotating the body around its axis at high speed (over 10,000 rpm) to stabilize the craft with a gyroscopic effect.[8][9][6]\n\n\nMicrowave-powered and MHD propulsion[edit]\n\nMore advanced concepts of the Lightcraft replace the laser pulses by a microwave beam or maser that can still be ground-based, or alternatively put into orbit, the beams being emitted from above the ascending craft by a series of space-based solar power satellites that could easier keep track of the Lightcraft along its curved ballistic trajectory.\n\nThe microwave beam detonates the air below the craft exactly like the laser version, but some energy from the beam is also diverted and converted onboard by high-power rectennas into electricity to power an external-flow airbreathing MHD drive called by Myrabo an MHD slipstream accelerator.[10][11][12][13]\n\nAs an MHD accelerator works only with an electrically conductive medium, some of the incoming microwaves are also diverted within the Lightcraft through a series of transparent windows and mirror sections, then re-emitted in the air near the electrodes of the MHD accelerators located around the rim. The air becomes ionized in these places, allowing MHD interaction of Lorentz forces to actively control the airflow around a discoidal shape that otherwise (i.e. passively) has very bad aerodynamical properties due to its largest surface, a flat plate, being perpendicular to the flow.[14]\n\nFinally, a laser or some part of the microwaves are also focused as a plasma torch at some distance above the Lightcraft, creating an aerospike that detaches and mitigates the bow shock wave ahead of the craft when it evolves at supersonic speeds, lowering heat transfert to the walls. The distance and intensity of the aerospike are tuned according to the atmospheric pressure, temperature gradients and velocity of the airflow to actively shape the shock wave so the boundary layer can be optimally controlled by the radial MHD slipstream accelerators.[15][16][17]\n\nThe Lightcraft concept thus combines magnetohydrodynamic active flow control and beam-powered propulsion mechanisms to enable hypersonic flight, solving the classical problem of aerial MHD propulsion (i.e. lack of a light power source offering enough energy to feed such systems) by outsourcing the power source. Using microwaves instead of a laser allows four combined actions: propulsive detonation, shockwave mitigation, ionization control and electrical feeding of MHD drives.[18]\n\n\nStatus[edit]\n\nAfter Leik Myrabo's retirement from Rensselaer Polytechnic Institute in 2011, the homepage of his private company Lightcraft Technologies, Inc. (LTI) disappeared with a temporary notification explaining that a \"site renovation\" was ongoing. The old LTI logo and the small-scale model of the laser Lightcraft prototype of the 1990s were swapped for the occasion with a new logo and an artist image showing a full-scale lenticular microwave-powered Lightcraft with active peripheral MHD slipstream accelerators in orbit above the Earth.[19] This plasma thruster image, which is the same showing on the cover of Myrabo's book about the Lightcraft,[18] is identical in principle to the discoidal MHD aerodyne with \"parietal converter\" described in Jean-Pierre Petit's 1983 comic book about magnetohydrodynamics, The Silent Barrier.[20]\n\nThat presaged new developments but the site went eventually completely offline and never reappeared since. At that time though, laser aerospike and PDE testing continued in the hypersonic wind tunnel of the Laboratory of Hypersonics and Aerothermodynamics at the Department of Aerospace Science and Technology of the Brazilian Air Force in São José dos Campos.[21]\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\tBeam-powered propulsion\n\tMagnetohydrodynamic drive\n\tElevator:2010\n\tNon-rocket spacelaunch\n\tList of laser articles\n\tList of plasma (physics) articles\n\n\nReferences[edit]\n\n\n\t^ \nMyrabo, L.N. (1976). \"MHD propulsion by absorption of laser radiation\" (PDF). Journal of spacecraft and rockets. 13 (8): 466–472. Bibcode:1976JSpRo..13..466M. doi:10.2514/3.27919.\n\n\t^ a b Myrabo, Leik N.; Messitt, Donald G.; Mead Jr., Franklin B. (January 1998). \"Ground and flight tests of a laser propelled vehicle\" (PDF). AIAA-98-1001. 36th AIAA Aerospace Sciences Meeting and Exhibit. Reno, NV. doi:10.2514/6.1998-1001.\n\n\n\t^ Pope, Gregory T. (September 1995). \"Fly by microwaves\" (PDF). Popular Mechanics. pp. 44–45.\n\n\n\t^ Demerjian, Ave (20 February 2009). \"Laser-powered aircraft are the future of flight. Maybe\". Wired. Retrieved 2018-04-05.\n\n\n\t^ Hsu, Jeremy (29 July 2009). \"Laser-Powered Lightcraft 'At the Cusp of Commercial Reality'\". Popular Science. Retrieved 2018-04-05.\n\n\n\t^ a b NewSpace 2010 – Approaching Warp Speed: Advanced Space Propulsion on YouTube (Lightcraft presentation at time 10:00–32:00).\n\n\t^ Gilster, Paul (14 September 2009). \"Lightcraft: A Laser Push to Orbit\". Centauri Dreams. Retrieved 2018-04-05.\n\n\n\t^ Myrabo, Leik N. (July 2001). \"World record flights of beam-riding rocket lightcraft - Demonstration of 'disruptive' propulsion technology\" (PDF). AIAA 2001-3798. 37th Joint Propulsion Conference and Exhibit. Salt Lake City, UT. doi:10.2514/6.2001-3798.\n\n\n\t^ Leonard David (2 November 2000). \"Laser-Boosted Rocket Sets Altitude Record\". space.com. Archived from the original on 2001-04-13.\n\n\n\t^ Myrabo, L. N.; Kerl, J.M.;  et al. (June 1999). \"MHD slipstream accelerator investigation in the RPI hypersonic shock tunnel\" (PDF). AIAA-1999-2842. 35th AIAA/ASME/SAE/ASEE Joint Propulsion Conference and Exhibit. Los Angeles, CA. doi:10.2514/6.1999-2842.\n\n\n\t^ Myrabo, L. N.;  et al. (January 2000). \"Experimental investigation of a 2-D MHD slipstream generator and accelerator with freestream Mach = 7.6 and T(0) = 4100 K\" (PDF). AIAA-00-0446. 38th Aerospace Sciences Meeting and Exhibit. Reno, NV. doi:10.2514/6.2000-446.\n\n\n\t^ Myrabo, L. N.;  et al. (July 2000). \"Experimental Investigation of a 2-D MHD Slipstream Accelerator and Generator\" (PDF). AIAA-00-3486. 36th AIAA/ASME/SAE/ASEE Joint Propulsion Conference and Exhibit. Huntsville, AL. doi:10.2514/6.2000-3486.\n\n\n\t^ Myrabo, L.N.;  et al. (July 2001). \"Experimental Investigation of a 2-D MHD Slipstream Accelerator: Progress Report\" (PDF). AIAA-01-3799. 35th AIAA/ASME/SAE/ASEE Joint Propulsion Conference and Exhibit. Salt Lake City, UT. doi:10.2514/6.2001-3799.\n\n\n\t^ Toro, P.G.P.; Rusak, Z.; Nagamatsu, H.T.; Myrabo, L.N. (January 1998). \"Hypersonic flow over a flat plate\" (PDF). AIAA-98-0683. 36th AIAA Aerospace Sciences Meeting and Exhibit. Reno, NV. doi:10.2514/6.1998-683.\n\n\n\t^ Toro, P.; Myrabo, L.; Nagamatsu, H. (January 1998). Pressure investigation of the hypersonic 'Directed-Energy Air Spike' inlet at Mach number 10 with arc power up to 70 kW (PDF). 36th AIAA Aerospace Sciences Meeting and Exhibit. Reno, NV. doi:10.2514/6.1998-991.\n\n\n\t^ Bracken, R.M.; Myrabo, L.N.; Nagamatsu, H.T.; Meloney, E.D.; Schneider, M.N. (July 2001). \"Experimental and computational investigation of an electric arc air-spike in hypersonic flow with drag measurements\" (PDF). AIAA 01-3797. 35th AIAA/ASME/SAE/ASEE Joint Propulsion Conference and Exhibit. Salt Lake City, UT. doi:10.2514/6.2001-3797.\n\n\n\t^ Minucci, M.A.S.; Toro, P.G.P.; Oliveira, A.C.; Ramos, A.G.; Chanes, J.B.; Pereira, A.L.; Nagamatsu, H.M.T.; Myrabo, L.N. (January 2005). \"Laser-Supported Directed-Energy 'Air Spike' in Hypersonic Flow\" (PDF). Journal of Spacecraft and Rockets. 42 (1): 51–57. Bibcode:2005JSpRo..42...51M. doi:10.2514/1.2676.\n\n\n\t^ a b Myrabo, Leik N.; Lewis, John S. (May 2009). Lightcraft Flight Handbook LTI-20: Hypersonic Flight Transport for an Era Beyond Oil. Collector's Guide Publishing. ISBN 978-1926592039.\n\n\n\t^ \"LTI website\". Lightcraft Technologies, Inc. Archived from the original on 2012-03-09.\n\n\n\t^ Petit, Jean-Pierre (1983). The Silence Barrier (PDF). The Adventures of Archibald Higgins. Savoir Sans Frontières.\n (see \"Archibald's Dream\" pp.62–70).\n\n\t^ Gilster, Paul (15 September 2009). \"Lightcraft Experiments Continue\". Centauri Dreams.\n\n\n\n\n\n\nExternal links[edit]\n\n\tRocketships Laser Propelled LightCraft on YouTube (presentation of the Lightcraft concept)\n\tLaser Pumped Flying Saucer Spacecraft on YouTube (working principles for laser and microwave-powered Lightcraft)\n\tLightCraft Launch Oct 2000 - laserbeam powered propulsion on YouTube (video of the first prototype)\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Lightcraft&oldid=917681805\"\n\n\t\t\n\t\tCategories: \tSpacecraft propulsion\n\tSingle-stage-to-orbit\n\tForce lasers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tDeutsch\n\tFrançais\n\t日本語\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 24 September 2019, at 23:29 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "2", "dc:title": "Lightcraft - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/1/17/Lightcraft.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-lightcraft", "title": "Lightcraft - Wikipedia"}}