{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLine-of-sight propagation - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tLine-of-sight propagation\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tFor other uses, see Line-of-sight (disambiguation).\n  \n  \nLine of sight propagation to an antenna\n\n\n\nLine-of-sight propagation is a characteristic of electromagnetic radiation or acoustic wave propagation which means waves travel in a direct path from the source to the receiver.  Electromagnetic transmission includes light emissions traveling in a straight line. The rays or waves may be diffracted, refracted, reflected, or absorbed by the atmosphere and obstructions with material and generally cannot travel over the horizon or behind obstacles.\n\nIn contrast to line-of-sight propagation, at low frequency (below approximately 3 MHz) due to diffraction, radio waves can travel as ground waves, which follow the contour of the Earth. This enables AM radio stations to transmit beyond the horizon. Additionally, frequencies in the shortwave bands between approximately 1 and 30 MHz, can be reflected back to Earth by the ionosphere, called skywave or \"skip\" propagation, thus giving radio transmissions in this range a potentially global reach. \n\nHowever, at frequencies above 30 MHz (VHF and higher) and in lower levels of the atmosphere, neither of these effects are significant. Thus, any obstruction between the transmitting antenna (transmitter) and the receiving antenna (receiver) will block the signal, just like the light that the eye may sense. Therefore, since the ability to visually see a transmitting antenna (disregarding the limitations of the eye's resolution) roughly corresponds to the ability to receive a radio signal from it, the propagation characteristic at these frequencies is called \"line-of-sight\". The farthest possible point of propagation is referred to as the \"radio horizon\".\n\nIn practice, the propagation characteristics of these radio waves vary substantially depending on the exact frequency and the strength of the transmitted signal (a function of both the transmitter and the antenna characteristics). Broadcast FM radio, at comparatively low frequencies of around 100 MHz, are less affected by the presence of buildings and forests.\n\n\nContents\n\n\n\t1 Impairments to line-of-sight propagation\n\t2 Mobile telephones\n\t3 Radio horizon\n\t3.1 Earth bulge and atmosphere effect\n\t3.2 Geometric distance to horizon\n\t3.3 The actual service range\n\t3.4 Example\n\n\n\n\t4 See also\n\t5 References\n\t6 External links\n\n\n\n\n\nImpairments to line-of-sight propagation[edit]\n\n  \nObjects within the Fresnel zone can disturb line of sight propagation even if they don't block the geometric line between antennas.\n\n\n\nLow-powered microwave transmitters can be foiled by tree branches, or even heavy rain or snow. The presence of objects not in the direct line-of-sight can cause diffraction effects that disrupt radio transmissions. For the best propagation, a volume known as the first Fresnel zone should be free of obstructions. \n\nReflected radiation from the surface of the surrounding ground or salt water can also either cancel out or enhance the direct signal. This effect can be reduced by raising either or both antennas further from the ground: The reduction in loss achieved is known as height gain.\n\nSee also Non-line-of-sight propagation for more on impairments in propagation.\n\nIt is important to take into account the curvature of the Earth for calculation of line-of-sight paths from maps, when a direct visual fix cannot be made. Designs for microwave formerly used ​4⁄3 earth radius to compute clearances along the path.\n\n\nMobile telephones[edit]\n\nAlthough the frequencies used by mobile phones (cell phones) are in the line-of-sight range, they still function in cities. This is made possible by a combination of the following effects:\n\n\n\t​1⁄r 4 propagation over the rooftop landscape[clarification needed]\n\tdiffraction into the \"street canyon\" below\n\tmultipath reflection along the street\n\tdiffraction through windows, and attenuated passage through walls, into the building\n\treflection, diffraction, and attenuated passage through internal walls, floors and ceilings within the building\n\n\nThe combination of all these effects makes the mobile phone propagation environment highly complex, with multipath effects and extensive Rayleigh fading. For mobile phone services, these problems are tackled using:\n\n\n\trooftop or hilltop positioning of base stations\n\tmany base stations (usually called \"cell sites\"). A phone can typically see at least three, and usually as many as six at any given time.\n\t\"sectorized\" antennas at the base stations. Instead of one antenna with omnidirectional coverage, the station may use as few as 3 (rural areas with few customers) or as many as 32 separate antennas, each covering a portion of the circular coverage. This allows the base station to use a directional antenna that is pointing at the user, which improves the signal to noise ratio. If the user moves (perhaps by walking or driving) from one antenna sector to another, the base station automatically selects the proper antenna.\n\trapid handoff between base stations (roaming)\n\tthe radio link used by the phones is a digital link with extensive error correction and detection in the digital protocol\n\tsufficient operation of mobile phone in tunnels when supported by split cable antennas\n\tlocal repeaters inside complex vehicles or buildings\n\n\nA Faraday cage is composed of a conductor that completely surrounds an area on all sides, top, and bottom.  Electromagnetic radiation is blocked where the wavelength is longer than any gaps.  For example, mobile telephone signals are blocked in windowless metal enclosures that approximate a Faraday cage, such as elevator cabins, and parts of trains, cars, and ships.  The same problem can affect signals in buildings with extensive steel reinforcement.\n\n\n  \nTwo stations not in line-of-sight may be able to communicate through an intermediate radio repeater station.\n\n\n\nRadio horizon[edit]\n\nSee also: Radar horizon\n\nThe radio horizon is the locus of points at which direct rays from an antenna are tangential to the surface of the Earth. If the Earth were a perfect sphere without an atmosphere, the radio horizon would be a circle. \n\nThe radio horizon of the transmitting and receiving antennas can be added together to increase the effective communication range. \n\nRadio wave propagation is affected by atmospheric conditions, ionospheric absorption, and the presence of obstructions, for example mountains or trees. \nSimple formulas that include the effect of the atmosphere give the range as:\n\n\n\t\n  \n    \n      \n        \n          \n            h\n            o\n            r\n            i\n            z\n            o\n            n\n          \n          \n            \n              m\n              i\n              l\n              e\n              s\n            \n          \n        \n        ≈\n        1.23\n        ⋅\n        \n          \n            \n              \n                h\n                e\n                i\n                g\n                h\n                t\n              \n              \n                \n                  f\n                  e\n                  e\n                  t\n                \n              \n            \n          \n        \n        .\n      \n    \n    {\\displaystyle \\mathrm {horizon} _{\\mathrm {miles} }\\approx 1.23\\cdot {\\sqrt {\\mathrm {height} _{\\mathrm {feet} }}}.}\n  \n\n\n\n\t\n  \n    \n      \n        \n          \n            h\n            o\n            r\n            i\n            z\n            o\n            n\n          \n          \n            \n              k\n              m\n            \n          \n        \n        ≈\n        3.57\n        ⋅\n        \n          \n            \n              \n                h\n                e\n                i\n                g\n                h\n                t\n              \n              \n                \n                  m\n                  e\n                  t\n                  r\n                  e\n                  s\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle \\mathrm {horizon} _{\\mathrm {km} }\\approx 3.57\\cdot {\\sqrt {\\mathrm {height} _{\\mathrm {metres} }}}}\n  \n\n\n\nThe simple formulas give a best-case approximation of the maximum propagation distance, but are not sufficient to estimate the quality of service at any location.\n\n\nEarth bulge and atmosphere effect[edit]\n\nEarth bulge is a term used in telecommunications. It refers to the circular segment of earth profile that blocks off long distance communications. Since the geometric line of sight passes at varying heights over the Earth, the propagating radio wave encounters slightly different propagation conditions over the path. The usual effect of the declining pressure of the atmosphere with height is to bend radio waves down towards the surface of the Earth, effectively increasing the Earth's radius, and the distance to the radio horizon, by a factor around ​4⁄3.[1] This k-factor can change from its average value depending on weather.\n\n\nGeometric distance to horizon[edit]\n\n  R is the radius of the Earth, h is the height of the transmitter (exaggerated), d is the line of sight distance\n\n\n\nAssuming a perfect sphere with no terrain irregularity, the distance to the horizon from a high altitude transmitter (i.e., line of sight) can readily be calculated.\n\nLet R be the radius of the Earth and h be the altitude of a telecommunication station. The line of sight distance d of this station is given by the Pythagorean theorem;\n\n\n\t\n  \n    \n      \n        \n          d\n          \n            2\n          \n        \n        =\n        (\n        R\n        +\n        h\n        \n          )\n          \n            2\n          \n        \n        −\n        \n          R\n          \n            2\n          \n        \n        =\n        2\n        ⋅\n        R\n        ⋅\n        h\n        +\n        \n          h\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle d^{2}=(R+h)^{2}-R^{2}=2\\cdot R\\cdot h+h^{2}}\n  \n\n\n\nSince the altitude of the station is much less than the radius of the Earth,\n\n\n\t\n  \n    \n      \n        d\n        ≈\n        \n          \n            2\n            ⋅\n            R\n            ⋅\n            h\n          \n        \n      \n    \n    {\\displaystyle d\\approx {\\sqrt {2\\cdot R\\cdot h}}}\n  \n\n\n\nIf the height is given in metres, and distance in kilometres,[2]\n\n\n\t\n  \n    \n      \n        d\n        ≈\n        3.57\n        ⋅\n        \n          \n            h\n          \n        \n      \n    \n    {\\displaystyle d\\approx 3.57\\cdot {\\sqrt {h}}}\n  \n\n\n\nIf the height is given in feet, and the distance in miles,\n\n\n\t\n  \n    \n      \n        d\n        ≈\n        1.23\n        ⋅\n        \n          \n            h\n          \n        \n      \n    \n    {\\displaystyle d\\approx 1.23\\cdot {\\sqrt {h}}}\n  \n\n\n\nThe actual service range[edit]\n\nThe above analysis does not consider the effect of atmosphere on the propagation path of RF signals. In fact, RF signals don’t propagate in straight lines: Because of the refractive effects of atmospheric layers, the propagation paths are somewhat curved. Thus, the maximum service range of the station is not equal to the line of sight (geometric) distance. Usually, a factor k is used in the equation above, modified to be\n\n\n\t\n  \n    \n      \n        d\n        ≈\n        \n          \n            2\n            ⋅\n            k\n            ⋅\n            R\n            ⋅\n            h\n          \n        \n      \n    \n    {\\displaystyle d\\approx {\\sqrt {2\\cdot k\\cdot R\\cdot h}}}\n  \n\n\n\nk > 1 means geometrically reduced bulge and a longer service range. On the other hand, k < 1 means a shorter service range.\n\nUnder normal weather conditions, k is usually chosen[3] to be ​4⁄3. That means that the maximum service range increases by 15%.\n\n\n\t\n  \n    \n      \n        d\n        ≈\n        4.12\n        ⋅\n        \n          \n            h\n          \n        \n      \n    \n    {\\displaystyle d\\approx 4.12\\cdot {\\sqrt {h}}}\n  \n\n\n\nfor h in metres and d in kilometres; or\n\n\n\t\n  \n    \n      \n        d\n        ≈\n        1.41\n        ⋅\n        \n          \n            h\n          \n        \n      \n    \n    {\\displaystyle d\\approx 1.41\\cdot {\\sqrt {h}}}\n  \n\n\n\nfor h in feet and d in miles.\n\nBut in stormy weather, k may decrease to cause fading in transmission. (In extreme cases k can be less than 1.) That is equivalent to a hypothetical decrease in Earth radius and an increase of Earth bulge.[4]\n\n\nExample[edit]\n\nIn normal weather conditions, the service range of a station at an altitude of 1500 m with respect to receivers at sea level can be found as,\n\n\n\t\n  \n    \n      \n        d\n        ≈\n        4.12\n        ⋅\n        \n          \n            1500\n          \n        \n        =\n        160\n        \n          \n             km.\n          \n        \n      \n    \n    {\\displaystyle d\\approx 4.12\\cdot {\\sqrt {1500}}=160{\\mbox{ km.}}}\n  \n\n\n\nSee also[edit]\n\n\tAnomalous propagation\n\tField strength in free space\n\tKnife-edge effect\n\tMultilateration\n\tNon-line-of-sight propagation\n\tOver-the-horizon radar\n\tRadial (radio)\n\tRician fading, stochastic model of line-of-sight propagation\n\tSlant range\n\n\n\n\tRadio portal\n\n\n\nReferences[edit]\n\n\n\t^ Christopher Haslett. (2008). Essentials of radio wave propagation, pp 119–120. Cambridge University Press. ISBN 052187565X.\n\n\t^ Mean radius of the Earth is ≈ 6.37×106 metres = 6370 km. See Earth radius\n\n\t^ Busi, R. (1967). High Altitude VHF and UHF Broadcasting Stations. Technical Monograph 3108-1967. Brussels: European Broadcasting Union.\n\n\t^ This analysis is for high altitude to sea level reception. In microwave radio link chains, both stations are at high altitudes.\n\n\n\n\n\n\t This article incorporates public domain material from the General Services Administration document \"Federal Standard 1037C\" (in support of MIL-STD-188).\n\n\nExternal links[edit]\n\n\thttp://web.telia.com/~u85920178/data/pathlos.htm#bulges\n\tArticle on the importance of Line Of Sight for UHF reception\n\tAttenuation Levels Through Roofs\n\tApproximating 2-Ray Model by using Binomial series by Matthew Bazajian\n\n\n\t\tv\n\tt\n\te\n\n\nElectromagnetic spectrum\n\n\t\n\tGamma rays\n\tX-rays\n\tUltraviolet\n\tVisible\n\tInfrared\n\tMicrowave\n\tRadio\n\n\n← higher frequencies       longer wavelengths →\n\n\n\n\n\tX-rays\t\n\tsoft X-ray\n\thard X-ray\n\n\n\n\n\tUltraviolet\t\n\tExtreme ultraviolet\n\tVacuum ultraviolet\n\tLyman-alpha\n\tFUV\n\tMUV\n\tNUV\n\tUVC\n\tUVB\n\tUVA\n\n\n\n\n\tVisible (optical)\t\n\tViolet\n\tBlue\n\tCyan\n\tGreen\n\tYellow\n\tOrange\n\tRed\n\n\n\n\n\tMicrowaves\t\n\tW band\n\tV band\n\tQ band\n\tKa band\n\tK band\n\tKu band\n\tX band\n\tC band\n\tS band\n\tL band\n\n\n\n\n\tRadio\t\n\tTHF\n\tEHF\n\tSHF\n\tUHF\n\tVHF\n\tHF\n\tMF\n\tLF\n\tVLF\n\tULF\n\tSLF\n\tELF\n\n\n\n\n\tWavelength types\t\n\tMicrowave\n\tShortwave\n\tMedium wave\n\tLongwave\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nModes of radio propagation\n\n\t\n\tLine-of-sight\n\tIonospheric\n\tMeteor burst\n\tSporadic E\n\n\n\tAirplane scatter\n\tTropospheric scatter\n\tEarth–Moon–Earth (EME)\n\tInterstellar Medium (ISM)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Line-of-sight_propagation&oldid=918631274\"\n\n\t\t\n\t\tCategories: \tRadio frequency propagation\n\tIEEE 802.11\n\n\nHidden categories: \tWikipedia articles needing clarification from June 2016\n\tWikipedia articles incorporating text from the Federal Standard 1037C\n\tWikipedia articles incorporating text from MIL-STD-188\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tDeutsch\n\tEspañol\n\t한국어\n\tItaliano\n\tNorsk\n\tNorsk nynorsk\n\tPortuguês\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 29 September 2019, at 16:52 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "7", "dc:title": "Line-of-sight propagation - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Propagation_VHF.PNG/1200px-Propagation_VHF.PNG", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-line-of-sight_propagation", "title": "Line-of-sight propagation - Wikipedia"}}