{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nList of orbits - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tList of orbits\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis is a dynamic list and may never be able to satisfy particular standards for completeness. You can help by expanding it with reliably sourced entries.\n\n  \nComparison of geostationary Earth orbit with GPS, GLONASS, Galileo and Compass (medium Earth orbit) satellite navigation system orbits with the International Space Station, Hubble Space Telescope and Iridium constellation orbits, and the nominal size of the Earth.[a] The Moon's orbit is around 9 times larger (in radius and length) than geostationary orbit.[b]\n\n\n\n  \nVarious Earth orbits to scale; innermost,   the red dotted line represents the orbit of the International Space Station (ISS);      cyan represents low Earth orbit,      yellow represents medium Earth orbit, and   the black dashed line represents geosynchronous orbit.   The green dash-dot line represents the orbit of Global Positioning System (GPS) satellites.\n\n\n\nThe following is a list of types of orbits:\n\n\nContents\n\n\n\t1 Centric classifications\n\t2 Altitude classifications for geocentric orbits\n\t3 Inclination classifications\n\t4 Eccentricity classifications\n\t5 Synchronicity classifications\n\t6 Orbits in galaxies or galaxy models\n\t7 Special classifications\n\t8 Pseudo-orbit classifications\n\t9 See also\n\t10 Notes\n\t11 References\n\n\n\n\n\nCentric classifications[edit]\n\n\tGalactocentric orbit[citation needed]: An orbit about the center of a galaxy. The Sun follows this type of orbit about the galactic center of the Milky Way.\n\tHeliocentric orbit: An orbit around the Sun. In the Solar System, all planets, comets, and asteroids are in such orbits, as are many artificial satellites and pieces of space debris. Moons by contrast are not in a heliocentric orbit but rather orbit their parent object.\n\tGeocentric orbit: An orbit around the planet Earth, such as that of the Moon or of artificial satellites.\n\tLunar orbit (also selenocentric orbit): An orbit around Earth's Moon.\n\tAreocentric orbit: An orbit around the planet Mars, such as that of its moons or artificial satellites.\n\n\nFor orbits centered about planets other than Earth and Mars, the orbit names incorporating Greek terminology is less commonly used\n\n\n\tMercury orbit (Hermocentric or hermiocentric): An orbit around the planet Mercury.\n\tVenus orbit (Aphrodiocentric or cytheriocentric): An orbit around the planet Venus.\n\tJupiter orbit (Jovicentric or zenocentric[1]): An orbit around the planet Jupiter.\n\tSaturn orbit (Kronocentric[1] or saturnocentric): An orbit around the planet Saturn.\n\tUranus orbit (Oranocentric): An orbit around the planet Uranus.\n\tNeptune orbit (Poseidocentric): An orbit around the planet Neptune.[citation needed]\n\n\nAltitude classifications for geocentric orbits[edit]\n\n\tLow Earth orbit (LEO): geocentric orbits with altitudes below 2,000 km (100–1,240 miles).[2]\n\tMedium Earth orbit (MEO): geocentric orbits ranging in altitude from 2,000 km (1,240 miles) to just below geosynchronous orbit at 35,786 kilometers (22,236 mi). Also known as an intermediate circular orbit. These are \"most commonly at 20,200 kilometers (12,600 mi), or 20,650 kilometers (12,830 mi), with an orbital period of 12 hours.\"[3]\n\tGeosynchronous orbit (GSO) and geostationary orbit (GEO) are orbits around Earth matching Earth's sidereal rotation period. Although terms are often used interchangeably, technically a geosynchronous orbit matches the Earth's rotational period, but the definition does not require it to have zero orbital inclination to the equator, and thus is not stationary above a given point on the equator, but may oscillate north and south during the course of a day  Thus, a geostationary orbit is defined as a geosynchronous orbit at zero inclination. Geosynchronous (and geostationary) orbits have a semi-major axis of 42,164 km (26,199 mi).[4]  This works out to an altitude of 35,786 km (22,236 mi).  Both complete one full orbit of Earth per sidereal day (relative to the stars, not the Sun).\n\tHigh Earth orbit: geocentric orbits above the altitude of geosynchronous orbit 35,786 km (22,240 miles).[3]\n\n\nInclination classifications[edit]\n\n\tInclined orbit: An orbit whose inclination in reference to the equatorial plane is not 0.\n\tPolar orbit: An orbit that passes above or nearly above both poles of the planet on each revolution. Therefore, it has an inclination of (or very close to) either 90 degrees or −90 degrees.\n\tPolar Sun-synchronous orbit (SSO): A nearly polar orbit that passes the equator at the same local solar time on every pass. Useful for image-taking satellites because shadows will be the same on every pass.\n\n\n\tNon-inclined orbit: An orbit whose inclination is equal to zero with respect to some plane of reference.\n\tEcliptic orbit: A non-inclined orbit with respect to the ecliptic.\n\tEquatorial orbit: A non-inclined orbit with respect to the equator.\n\n\n\tNear equatorial orbit: An orbit whose inclination with respect to the equatorial plane is nearly zero. This orbit allows for rapid revisit times (for a single orbiting spacecraft) of near equatorial ground sites.\n\n\nEccentricity classifications[edit]\n\nThere are two types of orbits:  closed (periodic) orbits, and open (escape) orbits. Circular and elliptical orbits are closed. Parabolic and hyperbolic orbits are open.  Radial orbits can be either open or closed.\n\n\n\tCircular orbit: An orbit that has an eccentricity of 0 and whose path traces a circle.\n\tElliptic orbit: An orbit with an eccentricity greater than 0 and less than 1 whose orbit traces the path of an ellipse.\n\tGeostationary or geosynchronous transfer orbit (GTO): An elliptic orbit where the perigee is at the altitude of a low Earth orbit (LEO) and the apogee at the altitude of a geostationary orbit.\n\tHohmann transfer orbit: An orbital maneuver that moves a spacecraft from one circular orbit to another using two engine impulses. This maneuver was named after Walter Hohmann.\n\tBallistic capture orbit: a lower-energy orbit than a Hohmann transfer orbit, a spacecraft moving at a lower orbital velocity than the target celestial body is inserted into a similar orbit, allowing the planet or moon to move toward it and gravitationally snag it into orbit around the celestial body.[5]\n\tCoelliptic orbit: A relative reference for two spacecraft—or more generally, satellites—in orbit in the same plane. \"Coelliptic orbits can be defined as two orbits that are coplanar and confocal. A property of coelliptic orbits is that the difference in magnitude between aligned radius vectors is nearly the same, regardless of where within the orbits they are positioned. For this and other reasons, coelliptic orbits are useful in [spacecraft] rendezvous\".[6]\n\n\n\tParabolic orbit: An orbit with the eccentricity equal to 1. Such an orbit also has a velocity equal to the escape velocity and therefore will escape the gravitational pull of the planet. If the speed of a parabolic orbit is increased it will become a hyperbolic orbit.\n\tEscape orbit: A parabolic orbit where the object has escape velocity and is moving directly away from the planet.\n\tCapture orbit: A parabolic orbit where the object has escape velocity and is moving directly toward the planet.\n\n\n\tHyperbolic orbit: An orbit with the eccentricity greater than 1. Such an orbit also has a velocity in excess of the escape velocity and as such, will escape the gravitational pull of the planet and continue to travel infinitely until it is acted upon by another body with sufficient gravitational force.\n\tRadial orbit: An orbit with zero angular momentum and eccentricity equal to 1. The two objects move directly towards or away from each other in a straight-line.\n\tRadial elliptic orbit: A closed elliptic orbit where the object is moving at less than the escape velocity. This is an elliptic orbit with semi-minor axis = 0 and eccentricity = 1. Although the eccentricity is 1, this is not a parabolic orbit.\n\tRadial parabolic orbit: An open parabolic orbit where the object is moving at the escape velocity.\n\tRadial hyperbolic orbit: An open hyperbolic orbit where the object is moving at greater than the escape velocity.  This is a hyperbolic orbit with semi-minor axis = 0 and eccentricity = 1.  Although the eccentricity is 1, this is not a parabolic orbit.\n\n\n\tDecaying orbit A decaying orbit is one with a minimum distance between the two objects that decreases over time due to factors like atmospheric resistance.  Often used to dispose of dying artificial satellites or to aerobrake an interplanetary spacecraft.\n\n\nSynchronicity classifications[edit]\n\n\tSynchronous orbit: An orbit whose period is a rational multiple of the average rotational period of the body being orbited and in the same direction of rotation as that body.  This means the track of the satellite, as seen from the central body, will repeat exactly after a fixed number of orbits.  In practice, only 1:1 ratio (geosynchronous) and 1:2 ratios (semi-synchronous) are common.\n\n\n  \nGeostationary orbit as seen from the north celestial pole. To an observer on the rotating Earth, the red and yellow satellites appear stationary in the sky above Singapore and Africa respectively.\n\n\n\n\tGeosynchronous orbit (GSO): An orbit around the Earth with a period equal to one sidereal day, which is Earth's average rotational period of 23 hours, 56 minutes, 4.091 seconds.  For a nearly circular orbit, this implies an altitude of approximately 35,786 kilometers (22,236 mi).  The orbit's inclination and eccentricity may not necessarily be zero.  If both the inclination and eccentricity are zero, then the satellite will appear stationary from the ground.  If not, then each day the satellite traces out an analemma (i.e. a \"figure-eight\") in the sky, as seen from the ground.  When the orbit is circular and the rotational period has zero inclination, the orbit is considered to also be geostationary.  Also known as a Clarke orbit after the writer Arthur C. Clarke.[3]\n\tGeostationary orbit (GEO): A circular geosynchronous orbit with an inclination of zero. To an observer on the ground this satellite appears as a fixed point in the sky.  \"All geostationary orbits must be geosynchronous, but not all geosynchronous orbits are geostationary.\"[3]\n\tTundra orbit: A synchronous but highly elliptic orbit with significant inclination (typically close to 63.4°) and orbital period of one sidereal day (23 hours, 56 minutes for the Earth). Such a satellite spends most of its time over a designated area of the planet.  The particular inclination keeps the perigee shift small.[citation needed]\n\n\n\tSemi-synchronous orbit: An orbit with  an orbital period equal to half of the average rotational period of the body being orbited and in the same direction of rotation as that body. For Earth this means a period of just under 12 hours at an altitude of approximately 20,200 km (12,544.2 miles) if the orbit is circular.[citation needed]\n\tMolniya orbit: A semi-synchronous variation of a Tundra orbit. For Earth this means an orbital period of just under 12 hours. Such a satellite spends most of its time over two designated areas of the planet.  An inclination of 63.4° is normally used to keep the perigee shift small.[citation needed]\n\n\n\tSupersynchronous orbit: Any orbit in which the orbital period of a satellite or celestial body is greater than the rotational period of the body which contains the barycenter of the orbit.\n\tSubsynchronous orbit: A drift orbit close to but below GSO/GEO. Satellites will drift east.[citation needed]\n\tGraveyard orbit (or, dispersal, junk orbit) : An orbit a few hundred kilometers above geosynchronous that satellites are moved into at the end of their operation.[7][8]\n\tAreosynchronous orbit (ASO): A synchronous orbit around the planet Mars with an orbital period equal in length to Mars' sidereal day, 24.6229 hours.\n\tAreostationary orbit (AEO): A circular areosynchronous orbit on the equatorial plane and about 17,000 km (10,557 miles) above the surface of Mars. To an observer on Mars this satellite would appear as a fixed point in the sky.\n\n\nOrbits in galaxies or galaxy models[edit]\n\n\tBox orbit: An orbit in a triaxial elliptical galaxy that fills in a roughly box-shaped region.\n\tPyramid orbit: An orbit near a massive black hole at the center of a triaxial galaxy.[9] The orbit can be described as a Keplerian ellipse that precesses about the black hole in two orthogonal directions, due to torques from the triaxial galaxy.[10] The eccentricity of the ellipse reaches unity at the four corners of the pyramid, allowing the star on the orbit to come very close to the black hole.\n\tTube orbit: An orbit near a massive black hole at the center of an axisymmetric galaxy. Similar to a pyramid orbit, except that one component of the orbital angular momentum is conserved; as a result, the eccentricity never reaches unity.[10]\n\n\nSpecial classifications[edit]\n\n\tSun-synchronous orbit: An orbit which combines altitude and inclination in such a way that the satellite passes over any given point of the planets's surface at the same local solar time. Such an orbit can place a satellite in constant sunlight and is useful for imaging, spy, and weather satellites.\n\tFrozen orbit: An orbit in which natural drifting due to the central body's shape has been minimized by careful selection of the orbital parameters.\n\tOrbit of the Moon: The orbital characteristics of the Moon. Average altitude of 384,403 kilometres (238,857 mi), elliptical-inclined orbit.\n\tBeyond-low Earth orbit (BLEO) and beyond Earth orbit (BEO) are a broad class of orbits that are energetically farther out than low Earth orbit or require an insertion into a heliocentric orbit as part of a journey that may require multiple orbital insertions, respectively.\n\tNear rectilinear halo orbit (NRHO): an orbit currently planned in cislunar space that could serve as a staging area for future missions in a 2018 NASA concept.[11][12] One proposed is approximately lunar polar with a period of about 6 days.\n\tDistant retrograde orbit (DRO): A stable circular retrograde orbit (usually referring to Lunar Distant Retrograde Orbit). Stability means that satellites in DRO do not need to use station keeping propellant to stay in orbit. The lunar DRO is a high lunar orbit with a radius of approximately 61,500 km.[13] This is proposed as a possible Gateway orbit, outside EM L1 and L2.[12]\n\n\nPseudo-orbit classifications[edit]\n\n  \nA diagram showing the five Lagrangian points in a two-body system with one body far more massive than the other (e.g. the Sun and the Earth). In such a system, L3–L5 are situated slightly outside of the secondary's orbit despite their appearance in this small scale diagram.\n\n\n\n\tHorseshoe orbit: An orbit that appears to a ground observer to be orbiting a certain planet but is actually in co-orbit with the planet. See asteroids 3753 Cruithne and 2002 AA29.\n\tLunar transfer orbit (LTO)[clarification needed] (accomplished with trans-lunar injection, TLI)\n\tPrograde orbit: An orbit with an inclination of less than 90°, or equivalently, an orbit that is in the same direction as the rotation of the primary.[clarification needed]\n\tRetrograde orbit: An orbit with an inclination of more than 90°, or equivalently, an orbit counter to the direction of rotation of the planet. Apart from those in Sun-synchronous orbit, few satellites are launched into retrograde orbit because the quantity of fuel required to launch them is much greater than for a prograde orbit. This is because when the rocket starts out on the ground, it already has an eastward component of velocity equal to the rotational velocity of the planet at its launch latitude. A gravity assist around the moon can reduce the fuel premium.[citation needed]\n\tMars transfer orbit (MTO) also known as trans-Mars injection (TMI) orbit\n\tHalo orbits and Lissajous orbits: These are orbits around a Lagrangian point. Lagrange points are shown in the adjacent diagram, and orbits near these points allow a spacecraft to stay in constant relative position with very little use of fuel. Orbits around the L1 point are used by spacecraft that want a constant view of the Sun, such as the Solar and Heliospheric Observatory. Orbits around L2 are used by missions that always want both Earth and the Sun behind them. This enables a single shield to block radiation from both Earth and the Sun, allowing passive cooling of sensitive instruments. Examples include the Wilkinson Microwave Anisotropy Probe and the upcoming James Webb Space Telescope. L1, L2, and L3 are unstable orbits[6], meaning that small perturbations will cause the orbiting craft to drift out of the orbit without periodic corrections.\n\tP/2 orbit, a highly-stable 2:1 lunar resonant orbit, that will be used for the first time with the spacecraft TESS (Transiting Exoplanet Survey Satellite) in 2018.[14][15]\n\n\nSee also[edit]\n\n\tGeocentric orbits\n\tNon-inclined orbit\n\tOrbital spaceflight\n\tOsculating orbit\n\tParking orbit\n\n\nNotes[edit]\n\n\n\t^ Orbital periods and speeds are calculated using the relations 4π2R3 = T2GM and V2R = GM, where R = radius of orbit in metres, T = orbital period in seconds, V = orbital speed in m/s, G = gravitational constant ≈ 6.673×10−11 Nm2/kg2, M = mass of Earth ≈ 5.98×1024 kg.\n\n\t^ Approximately 8.6 times when the moon is nearest (363 104 km ÷ 42 164 km) to 9.6 times when the moon is farthest (405 696 km ÷ 42 164 km).\n\n\n\n\n\nReferences[edit]\n\n\n\t^ a b Parker, Sybil P. (2002). McGraw-Hill Dictionary of Scientific and Technical Terms Sixth Edition. McGraw-Hill. p. 1772. ISBN 007042313X.\n\n\t^ \"NASA Safety Standard 1740.14, Guidelines and Assessment Procedures for Limiting Orbital Debris\" (PDF). Office of Safety and Mission Assurance. 1 August 1995. p. A-2. Archived from the original (PDF) on 15 February 2013. Low Earth orbit (LEO) - The region of space below the altitude of 2000 km.\n, pages 37–38 (6-1,6-2); figure 6-1.\n\n\t^ a b c d \n\"Orbit: Definition\". Ancillary Description Writer's Guide, 2013. National Aeronautics and Space Administration (NASA) Global Change Master Directory. Archived from the original on 11 May 2013. Retrieved 29 April 2013.\n\n\n\t^ \nVallado, David A. (2007). Fundamentals of Astrodynamics and Applications. Hawthorne, CA: Microcosm Press. p. 31.\n\n\n\t^ \nHadhazy, Adam (22 December 2014). \"A New Way to Reach Mars Safely, Anytime and on the Cheap\". Scientific American. Retrieved 25 December 2014.\n\n\n\t^ \nWhipple, P. H . (17 February 1970). \"Some Characteristics of Coelliptic Orbits – Case 610\" (PDF). Bellcom Inc. Washington: NASA. Archived from the original (PDF) on 21 May 2010. Retrieved 23 May 2012.\n\n\n\t^ \n\"U.S. Government Orbital Debris Mitigation Standard Practices\" (PDF). United States Federal Government. Retrieved 28 November 2013.\n\n\n\t^ \nLuu, Kim; Sabol, Chris (October 1998). \"Effects of perturbations on space debris in supersynchronous storage orbits\" (PDF). Air Force Research Laboratory Technical Reports (AFRL-VS-PS-TR-1998-1093). Retrieved 28 November 2013.\n\n\n\t^ Merritt and Vasilev, ORBITS AROUND BLACK HOLES IN TRIAXIAL NUCLEI\", The Astrophysical Journal 726(2), 61 (2011).\n\n\t^ a b Merritt, David (2013). Dynamics and Evolution of Galactic Nuclei. Princeton: Princeton University Press. ISBN 9780691121017.\n\n\n\t^ NASA Shapes Science Plan for Deep-Space Outpost Near the Moon March 2018\n\n\t^ a b How a New Orbital Moon Station Could Take Us to Mars and Beyond Oct 2017 video with refs\n\n\t^ \"Asteroid Redirect Mission Reference Concept\" (PDF). www.nasa.gov. NASA. Retrieved 14 June 2015.\n\n\n\t^ Keesey, Lori (31 July 2013). \"New Explorer Mission Chooses the 'Just-Right' Orbit\". NASA. Retrieved 5 April 2018.\n\n\n\t^ Overbye, Dennis (26 March 2018). \"Meet Tess, Seeker of Alien Worlds\". The New York Times. Retrieved 5 April 2018.\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nGravitational orbits\n\n\tTypes\t\n\tGeneral\t\n\tBox\n\tCapture\n\tCircular\n\tElliptical / Highly elliptical\n\tEscape\n\tHorseshoe\n\tHyperbolic trajectory\n\tInclined / Non-inclined\n\tLagrangian point\n\tOsculating\n\tParabolic trajectory\n\tParking\n\tSynchronous\n\tsemi\n\tsub\n\n\n\tTransfer orbit\n\n\n\n\n\tGeocentric\t\n\tGeosynchronous\n\tGeostationary\n\tGeostationary transfer\n\n\n\tGraveyard\n\tHigh Earth\n\tLow Earth\n\tMedium Earth\n\tMolniya\n\tNear-equatorial\n\tOrbit of the Moon\n\tPolar\n\tSun-synchronous\n\tTundra\n\n\n\n\n\tAbout other points\t\n\tMars\n\tAreosynchronous\n\tAreostationary\n\n\n\tLagrange points\n\tHalo\n\tLissajous\n\n\n\tLunar\n\tSun\n\tHeliocentric\n\tEarth's orbit\n\n\n\tHeliosynchronous\n\n\n\n\n\n\n\n\n\n\tParameters\t\n\t\tShape\n\tSize\n\n\n\t\n\te  Eccentricity\n\ta  Semi-major axis\n\tb  Semi-minor axis\n\tQ, q  Apsides\n\n\n\n\n\tOrientation\t\n\ti  Inclination\n\tΩ  Longitude of the ascending node\n\tω  Argument of periapsis\n\tϖ  Longitude of the periapsis\n\n\n\n\n\tPosition\t\n\tM  Mean anomaly\n\tν, θ, f  True anomaly\n\tE  Eccentric anomaly\n\tL  Mean longitude\n\tl  True longitude\n\n\n\n\n\tVariation\t\n\tT  Orbital period\n\tn  Mean motion\n\tv  Orbital speed\n\tt0  Epoch\n\n\n\n\n\n\n\n\tManeuvers\t\n\tBi-elliptic transfer\n\tCollision avoidance (spacecraft)\n\tDelta-v\n\tDelta-v budget\n\tGravity assist\n\tGravity turn\n\tHohmann transfer\n\tInclination change\n\tLow energy transfer\n\tOberth effect\n\tPhasing\n\tRocket equation\n\tRendezvous\n\tTransposition, docking, and extraction\n\n\n\n\n\tOrbital mechanics\t\n\tCelestial coordinate system\n\tCharacteristic energy\n\tEscape velocity\n\tEphemeris\n\tEquatorial coordinate system\n\tGround track\n\tHill sphere\n\tInterplanetary Transport Network\n\tKepler's laws of planetary motion\n\tLagrangian point\n\tn-body problem\n\tOrbit equation\n\tOrbital state vectors\n\tPerturbation\n\tRetrograde motion\n\tSpecific orbital energy\n\tSpecific relative angular momentum\n\tTwo-line elements\n\n\n\n\n\t\n\tList of orbits\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=List_of_orbits&oldid=916777337\"\n\n\t\t\n\t\tCategories: \tOrbits\n\tSpace lists\n\n\nHidden categories: \tDynamic lists\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from July 2012\n\tArticles with unsourced statements from May 2016\n\tWikipedia articles needing clarification from December 2017\n\tWikipedia articles needing clarification from March 2018\n\tArticles with unsourced statements from March 2018\n\tUse dmy dates from April 2011\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tFrançais\n\t日本語\n\tSuomi\n\tTürkçe\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 20 September 2019, at 15:52 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "List of orbits - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Comparison_satellite_navigation_orbits.svg/1200px-Comparison_satellite_navigation_orbits.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-list_of_orbits", "title": "List of orbits - Wikipedia"}}