{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMagnetic bearing - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tMagnetic bearing\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nA magnetic bearing\n\n\n\nA magnetic bearing is a type of bearing that supports a load using magnetic levitation. Magnetic bearings support moving parts without physical contact. For instance, they are able to levitate a rotating shaft and permit relative motion with very low friction and no mechanical wear. Magnetic bearings support the highest speeds of all kinds of bearing and have no maximum relative speed.\n\nActive bearings have several advantages: they do not suffer from wear, have low friction, and can often accommodate irregularities in the mass distribution automatically, allowing rotors to spin around their center of mass with very low vibration.\n\nPassive magnetic bearings use permanent magnets and, therefore, do not require any input power but are difficult to design due to the limitations described by Earnshaw's theorem. Techniques using diamagnetic materials are relatively undeveloped and strongly depend on material characteristics. As a result, most magnetic bearings are active magnetic bearings, using electromagnets which require continuous power input and an active control system to keep the load stable. In a combined design, permanent magnets are often used to carry the static load and the active magnetic bearing is used when the levitated object deviates from its optimum position. Magnetic bearings typically require a back-up bearing in the case of power or control system failure.\n\nMagnetic bearings are used in several industrial applications such as electrical power generation, petroleum refinement, machine tool operation and natural gas handling.  They are also used in the Zippe-type centrifuge,[1] for uranium enrichment and in turbomolecular pumps, where oil-lubricated bearings would be a source of contamination.\n\n\nContents\n\n\n\t1 Design\n\t2 History\n\t3 Applications\n\t4 Future advances\n\t5 See also\n\t6 References\n\t7 Further reading\n\t8 External links\n\n\n\n\n\nDesign[edit]\n\n  \nBasic operation for a single axis\n\n\n\nAn active magnetic bearing works on the principle of electromagnetic suspension based on the induction of eddy currents in a rotating conductor. When an electrically conducting material is moving in a magnetic field, a current will be generated in the material that counters the change in the magnetic field (known as Lenz's Law). This generates a current that will result in a magnetic field that is oriented opposite to the one from the magnet. The electrically conducting material is thus\nacting as a magnetic mirror.[2][3][4][5][6][7][8][9][10][11]\n\nThe hardware consists of an electromagnet assembly, a set of power amplifiers which supply current to the electromagnets, a controller, and gap sensors with associated electronics to provide the feedback required to control the position of the rotor within the gap. The power amplifier supplies equal bias current to two pairs of electromagnets on opposite sides of a rotor. This constant tug-of-war is mediated by the controller, which offsets the bias current by equal and opposite perturbations of current as the rotor deviates from its center position.\n\nThe gap sensors are usually inductive in nature and sense in a differential mode.\nThe power amplifiers in a modern commercial application are solid state devices which operate in a pulse width modulation configuration.  The controller is usually a microprocessor or digital signal processor.\n\nTwo types of instabilities are typically present in magnetic bearings. Attractive magnets produce an unstable static force that decreases with increasing distance and increases at decreasing distances. This can cause the bearing to become unbalanced. Secondly, because magnetism is a conservative force, it provides little damping; oscillations may cause loss of successful suspension if any driving forces are present.\n\n\nHistory[edit]\n\nThe table below lists several early patents for active magnetic bearings. Earlier patents for magnetic suspensions can be found but are excluded here because they consist of assemblies of permanent magnets of problematic stability per Earnshaw's Theorem.\n\n\nEarly U.S. patents in active magnetic bearings\n\tInventor(s)\n\tYear\n\tPatent number\n\tTitle\n\n\tBeams, Holmes\n\t1941\n\t2,256,937\n\tSuspension of Rotatable Bodies\n\n\tBeams\n\t1954\n\t2,691,306\n\tMagnetically Supported Rotating Bodies\n\n\tBeams\n\t1962\n\t3,041,482\n\tApparatus for Rotating Freely Suspended Bodies\n\n\tBeams\n\t1965\n\t3,196,694\n\tMagnetic Suspension System\n\n\tWolf\n\t1967\n\t3,316,032\n\tPoly-Phase Magnetic Suspension Transformer\n\n\tLyman\n\t1971\n\t3,565,495\n\tMagnetic Suspension Apparatus\n\n\tHabermann\n\t1973\n\t3,731,984\n\tMagnetic Bearing Block Device for Supporting a Vertical Shaft Adapted for Rotating at High Speed\n\n\tHabermann, Loyen, Joli, Aubert\n\t1974\n\t3,787,100\n\tDevices Including Rotating Members Supported by Magnetic Bearings\n\n\tHabermann, Brunet\n\t1977\n\t4,012,083\n\tMagnetic Bearings\n\n\tHabermann, Brunet, LeClére\n\t1978\n\t4,114,960\n\tRadial Displacement Detector Device for a Magnetic Bearings\n\n\tMeeks, Crawford R\n\t1992\n\t5,111,102\n\tMagnetic Bearing Structure\n\n\n\nJesse Beams from the University of Virginia filed some of the earliest active magnetic bearing patents [12][13]  during World War II.  The patents dealt with ultracentrifuges intended for the enrichment of isotopes of elements needed for the Manhattan Project. However, magnetic bearings did not mature until advances in solid-state electronics and modern computer-based control technology with the work of Habermann[14] and Schweitzer.[15] In 1987, Estelle Croot further improved active magnetic bearing technology,[16] but these designs were not manufactured due to expensive costs of production, which used a laser guidance system. Estelle Croot's research was the subject of three Australian patents [3] and was funded by Nachi Fujikoshi, Nippon Seiko KK and Hitachi, and her calculations were used in other technologies that used rare earth magnets but the active magnetic bearings were only developed to the prototype stage.\n\nKasarda[17] reviews the history of active magnetic bearings in depth.  She notes that the first commercial application of active magnetic bearings was in turbomachinery.  The active magnetic bearing allowed the elimination of oil reservoirs on compressors for the NOVA Gas Transmission Ltd. (NGTL) gas pipelines in Alberta, Canada. This reduced the fire hazard allowing a substantial reduction in insurance costs.  The success of these magnetic bearing installations led NGTL to pioneer the research and development of a digital magnetic bearing control system as a replacement for the analog control systems supplied by the American company Magnetic Bearings Inc. In 1992, NGTL's magnetic bearing research group formed the company Revolve Technologies Inc. [4] for commercializing the digital magnetic bearing technology. The company was later purchased by SKF of Sweden.  The French company S2M, founded in 1976, was the first to commercially market active magnetic bearings. Extensive research on magnetic bearings continues at the University of Virginia in the Rotating Machinery and Controls Industrial Research Program [5].\n\nDuring the decade starting in 1996, the Dutch oil-and-gas company NAM installed twenty gas compressors, each driven by a 23-megawatt variable-speed-drive electric motor.  Each unit was fully equipped with active magnetic bearings on both the motor and the compressor. These compressors are used in the Groningen gas field to extract the remaining gas from this large gas field and to increase the field capacity. The motor-compressor design was done by Siemens and the active magnetic bearings were delivered by Waukesha Bearings (owned by Dover Corporation). (Originally these bearings were designed by Glacier, this company was later taken over by Federal Mogul and is now part of Waukesha Bearings.) By using active magnetic bearings and a direct drive between motor and compressor (without having a gearbox in between) and by applying dry gas seals, a fully dry-dry (oil-free) system was achieved. Applying active magnetic bearings in both the driver and in the compressor (compared to the traditional configuration using gears and ball bearings) results in a relatively simple system with a very wide operating range and high efficiencies, particularly at partial load. As was done in the Groningen field, the full installation can additionally be placed outdoors without the need for a large compressor building.\n\nMeeks[18] pioneered hybrid magnetic bearing designs (US patent 5,111,102) in which permanent magnets provide the bias field and active control coils are used for stability and dynamic control. These designs using permanent magnets for bias fields are smaller and of lighter weight than purely electromagnetic bearings.  The electronic control system is also smaller and requires less electrical power because the bias field is provided by the permanent magnets.\n\nAs the development of the necessary components progressed, scientific interest in the field also increased, peaking in the first International Symposium on Magnetic Bearings held in 1988 in Zürich with the founding of the International Society of Magnetic Bearings by Prof. Schweitzer (ETHZ), Prof. Allaire (University of Virginia), and Prof. Okada (Ibaraki University). Since then, the symposium has developed into a biennial conference series with a permanent portal on magnetic bearing technology [6] where all symposium contributions are made available. The web portal is supported by the international research and industrial community. Joining the hall of fame and earning lifetime achievement awards in 2012 were Prof. Yohji Okada, Prof. Gerhard Schweitzer, and Michael Swann of Waukesha Magnetic Bearings [7].\n\n\nApplications[edit]\n\nMagnetic bearing advantages include very low and predictable friction, and the ability to run without lubrication and in a vacuum. Magnetic bearings are increasingly used in industrial machines such as compressors, turbines, pumps, motors and generators.\n\nMagnetic bearings are commonly used in watt-hour meters by electric utilities to measure home power consumption.  They are also used in energy storage or transportation applications and to support equipment in a vacuum, for example in flywheel energy storage systems[19]. A flywheel in a vacuum has very low wind resistance losses, but conventional bearings usually fail quickly in a vacuum due to poor lubrication.  Magnetic bearings are also used to support maglev trains in order to get low noise and smooth ride by eliminating physical contact surfaces. Disadvantages include high cost, heavy weight and relatively large size.\n\nMagnetic bearings are also used in some centrifugal compressors for chillers with a shaft made up of magnetic material lies between magnetic bearings. A small amount of current provides magnetic levitation to the shaft which remains freely suspended in air ensuring zero friction between the bearing and the shaft.\n\nA new application of magnetic bearings is in artificial hearts.  The use of magnetic suspension in ventricular assist devices was pioneered by Prof. Paul Allaire and Prof. Houston Wood at the University of Virginia, culminating in the first magnetically suspended ventricular assist centrifugal pump (VAD) in 1999.[citation needed]\n\nSeveral ventricular assist devices use magnetic bearings, including the LifeFlow heart pump,[20]\nthe  DuraHeart Left Ventricular Assist System,[21]\nthe Levitronix CentriMag,[22]\nand the Berlin Heart.\nIn these devices, the single moving part is suspended by a combination of  hydrodynamic force and magnetic force.\nBy eliminating physical contact surfaces, magnetic bearings make it easier to reduce areas of high shear stress (which leads to red blood cell damage) and flow stagnation (which leads to clotting) in these blood pumps.[23]\n\nSynchrony Magnetic Bearings, Waukesha Magnetic Bearings, Calnetix Technologies, and S2M are among the magnetic bearing developers and manufacturers worldwide.\n\n\nFuture advances[edit]\n\n  \nAn axial homopolar electrodynamic bearing\n\n\n\nWith the use of an induction-based levitation system present in maglev technologies such as the Inductrack system, magnetic bearings could replace complex control systems by using Halbach Arrays and simple closed loop coils. These systems gain in simplicity, but are less advantageous with regard to eddy current losses. For rotating systems it is possible to use homopolar magnet designs instead of multipole Halbach structures, which reduce losses considerably.\n\nAn example that has bypassed the Earnshaw's theorem issues is the homopolar electrodynamic bearing invented by Dr Torbjörn Lembke.[24][25][26] This is a novel type of electromagnetic bearing based on a passive magnetic technology. It does not require any control electronics to operate and works because the electrical currents generated by motion cause a restoring force.[27][28][29]\n\nThe working principle is based on the induction of eddy currents in a rotating conductor. When an electrically conducting material is moving in a magnetic field, a current will be generated in the material that counters the change in the magnetic field (known as Lenz' Law). This generates a current that will result in a magnetic field that is oriented opposite to the one from the magnet. The electrically conducting material is thus acting as a magnetic mirror.[30][31][32][33][34][35][36][37][38][39]\n\n\nSee also[edit]\n\n\tFlywheel\n\tLevitron\n\tSpin stabilized magnetic levitation\n\tElectrodynamic wheel\n\n\nReferences[edit]\n\n\n\t^ Charles, D., Spinning a Nuclear Comeback, Science, Vol. 315, (30 March 2007)\n\n\t^ Basore P. A., \"Passive Stabilization of Flywheel Magnetic Bearings,\" Master’s thesis, Massachusetts Institute of Technology (USA), 1980.\n\n\t^ Murakami C. and Satoh I., “Experiments of a Very Simple Radial-Passive Magnetic Bearing Based on Eddy Currents”, In Proceedings of the 7th International Symposium on Magnetic Bearings, March 2000.\n\n\t^ Bender D. and Post R. F., “Ambient Temperature Passive Magnetic Bearings for Flywheel Energy Storage Systems”, In Proceedings of the 7th International Symposium on Magnetic Bearings, March 2000.\n\n\t^ Moser R., Regamey Y. J., Sandtner J., and Bleuler H., “Passive Diamagnetic Levitation for Flywheels”, In Proceedings of the 8th International Symposium on Magnetic Bearings, 2002.\n\n\t^ Filatov A. V., McMullen P., Davey K., and Thompson R., “Flywheel Energy Storage System with Homopolar Electrodynamic Magnetic Bearing”, In Proceedings of the 10th International Symposium on Magnetic Bearings, 2006.\n\n\t^ Sandtner J. and Bleuler H., “Electrodynamic Passive Magnetic Bearings with Planar Halbach Arrays”, In Proceedings of the 9th International Symposium on Magnetic Bearings, August 2004.\n\n\t^ Sandtner J. and Bleuler H., “Passive Electrodynamic Magnetic Thrust Bearing Especially Designed for Constant Speed Applications ”, In Proceedings of the 10th International Symposium on Magnetic Bearings, August 2004.\n\n\t^ Amati N., De Lépine X., and Tonoli A., “Modeling of electrodynamic Bearings”, ASME Journal of Vibration and Acoustics, 130, 2008.\n\n\t^ Kluyskens V., Dehez B., “Dynamical electromechanical model for passive magnetic bearings”, IEEE Transactions on Magnetics, 43, pp 3287-3292, 2007.\n\n\t^ Kluyskens V., Dehez B., “Parameterized electromechanical model for magnetic bearings with induced currents”, Journal of System Design and Dynamics - Special Issue on the Eleventh International Symposium on Magnetic Bearings, 2009.[1]\n\n\t^ Beams, J. , Production and Use of High Centrifugal Fields, Science, Vol. 120, (1954)\n\n\t^ Beams, J. , Magnetic Bearings, Paper 810A, Automotive Engineering Conference, Detroit, Michigan, USA, SAE (Jan. 1964)\n\n\t^ Habermann,H. , Liard, G. Practical Magnetic Bearings , IEEE Spectrum, Vol. 16, No. 9, (September 1979)\n\n\t^ Schweitzer, G. , Characteristics of a Magnetic Rotor Bearing for Active Vibration Control, Paper C239/76, First International Conference on Vibrations in Rotating Machinery, (1976)\n\n\t^ Estelle Croot, Australian Inventors Weekly, NSW Inventors Association, Vol. 3, (April 1987)\n\n\t^ Kasarda, M. An Overview of Active Magnetic Bearing Technology and Applications, The Shock and Vibration Digest, Vol.32, No. 2: A Publication of the Shock and Vibration Information Center, Naval Research Laboratory, (March 2000)\n\n\t^ Meeks, C.R., \"Magnetic Bearings - Optimum Design and Application\", Paper\n presented at the International Workshop on Rare Earth Cobalt Permanent Magnets,\n University of Dayton, Dayton, Ohio,  October 14–17, 1974\n\n\t^ Li, Xiaojun; Anvari, Bahar; Palazzolo, Alan; Wang, Zhiyang; Toliyat, Hamid (2018-08-14). \"A Utility Scale Flywheel Energy Storage System with a Shaftless, Hubless, High Strength Steel Rotor\". IEEE Transactions on Industrial Electronics. 65: 6667–6675. doi:10.1109/TIE.2017.2772205.\n\n\t^ \n\"Recent work on the LifeFlow heart pump\".\nLinz Center of Mechatronics GmbH.\n\n\t^ \nSmart, Frank. \"Magnetic levitation heart pump implanted in first U.S. patient\". \"Cardiology Today\". October 2008.\n\n\t^ \nHoshi, H; Shinshi, T; Takatani, S (2006). \"Third-generation Blood Pumps with Mechanical Noncontact Magnetic Bearings\". Artificial Organs. 30 (5): 324–338. doi:10.1111/j.1525-1594.2006.00222.x. PMID 16683949.\n\n\n\t^ \n\"Biological Systems - Heart Assist Pump\".\nAerospace Research Laboratory.\nUniversity of Virginia.\n\n\t^ \"Design and Analysis of a Novel Low Loss Homopolar Electrodynamic Bearing.\" Lembke, Torbjörn. PhD Thesis. Stockholm: Universitetsservice US AB, 2005. \nISBN 91-7178-032-7\n\n\t^ \"3D-FEM Analysis of a Low Loss Homopolar Induction Bearing\" Archived 2011-06-08 at the Wayback Machine Lembke, Torbjörn. 9th International Symposium on Magnetic Bearings (ISMB9). Aug. 2004.\n\n\t^ Seminar at KTH – the Royal Institute of Technology Stockholm. Feb 24. 2010\n\n\t^ Amati, N., Tonoli, A., Zenerino, E., Detoni, J. G., Impinna, F., \"Design Methodology of Electrodynamic Bearings\", XXXVIII Associazione Italiana per l'Analisi delle Solecitazioni, Convegno Nazionale, No. 109, 2009\n\n\t^ Filatov, A. V., Maslen, E. H., and Gillies, G. T., \"A Method of Suspension of Rotating Bodies Using Electromagnetic Forces\", Journal of Applied Physics, Vol. 91\n\n\t^ Filatov, A. V., Maslen, E. H., and Gillies, G. T., \"Stability of an Electrodynamic Suspension\" Journal of Applied Physics, Vol. 92 (2002), pp. 3345-3353.\n\n\t^ Basore P. A., \"Passive Stabilization of Flywheel Magnetic Bearings,\" Master’s thesis, Massachusetts Institute of Technology (USA), 1980.\n\n\t^ Murakami C. and Satoh I., “Experiments of a Very Simple Radial-Passive Magnetic Bearing Based on Eddy Currents”, In Proceedings of the 7th International Symposium on Magnetic Bearings, March 2000.\n\n\t^ Bender D. and Post R. F., “Ambient Temperature Passive Magnetic Bearings for Flywheel Energy Storage Systems”, In Proceedings of the 7th International Symposium on Magnetic Bearings, March 2000.\n\n\t^ Moser R., Regamey Y. J., Sandtner J., and Bleuler H., “Passive Diamagnetic Levitation for Flywheels”, In Proceedings of the 8th International Symposium on Magnetic Bearings, 2002.\n\n\t^ Filatov A. V., McMullen P., Davey K., and Thompson R., “Flywheel Energy Storage System with Homopolar Electrodynamic Magnetic Bearing”, In Proceedings of the 10th International Symposium on Magnetic Bearings, 2006.\n\n\t^ Sandtner J. and Bleuler H., “Electrodynamic Passive Magnetic Bearings with Planar Halbach Arrays”, In Proceedings of the 9th International Symposium on Magnetic Bearings, August 2004.\n\n\t^ Sandtner J. and Bleuler H., “Passive Electrodynamic Magnetic Thrust Bearing Especially Designed for Constant Speed Applications ”, In Proceedings of the 10th International Symposium on Magnetic Bearings, August 2004.\n\n\t^ Amati N., De Lépine X., and Tonoli A., “Modeling of electrodynamic Bearings”, ASME Journal of Vibration and Acoustics, 130, 2008.\n\n\t^ Kluyskens V., Dehez B., “Dynamical electromechanical model for passive magnetic bearings”, IEEE Transactions on Magnetics, 43, pp 3287-3292, 2007.\n\n\t^ Kluyskens V., Dehez B., “Parameterized electromechanical model for magnetic bearings with induced currents”, Journal of System Design and Dynamics - Special Issue on the Eleventh International Symposium on Magnetic Bearings, 2009.[2]\n\n\n\n\n\nFurther reading[edit]\n\n\tSchweitzer, G (2002). \"Active Magnetic Bearings – Chances and Limitations\" (PDF). Archived from the original (PDF) on 2009-02-05. Cite journal requires |journal= (help)\n\n\tChiba, A., Fukao, T., Ichikawa, O., Oshima, M., Takemoto, M., Dorrel, D. (2005). Magnetic Bearings and Bearingless Drives. Newnes.CS1 maint: multiple names: authors list (link)\n\n\tSchweitzer, G., Maslen, H. (2009). Magnetic Bearings, Theory, Design,and Application to Rotating Machinery. Springer.CS1 maint: multiple names: authors list (link)\n\n\tJim Wilson (September 1999). \"Beating Demon Friction\". Popular Mechanics. Archived from the original on 2008-09-05.\n\n\tEstelle Croot (1987–1995). Improved Magnetic Bearings. IPAustralia [Australian Patent Office database entries].\n\n\tT. Lembke (2005). PhD Thesis \"Design and Analysis of a Novel Low Loss Homopolar Electrodynamic Bearing\" (PDF). Stockholm: Universitetsservice US AB. ISBN 91-7178-032-7.\n\n\n\nExternal links[edit]\n\n\tKinematic Models for Design Digital Library (KMODDL) - Movies and photos of hundreds of working mechanical-systems models at Cornell University. Also includes an e-book library of classic texts on mechanical design and engineering.\n\tMADYN2000, Rotordynamics Software supports computer-aided design of Magnetic Bearing controllers and provides multiple analytic reports of design quality.\n\n\n\t\tv\n\tt\n\te\n\n\nMaglev\n\n\tTechnologies\t\n\tLinear induction motor\n\tMagnetic levitation\n\tElectromagnetic suspension (EMS)\n\tElectrodynamic suspension (EDS)\n\tGuideway\n\tMagnetic bearing\n\tServomechanism\n\tEddy current brake\n\tLift-to-drag ratio\n\n\n\n\n\tSystems\t\n\tHigh Speed Surface Transport\n\tInductrack\n\tLaunch loop\n\tVactrain\n\tStarTram\n\tTransrapid\n\n\n\n\n\tLines\t\n\tBeijing S1 Line\n\tBirmingham International Maglev shuttle\n\tCalifornia–Nevada Interstate Maglev\n\tChangsha Maglev Express\n\tDaejon Expo Maglev\n\tIncheon Airport Maglev\n\tLeningrad MagLev System\n\tLinimo\n\tL0 Series Shinkansen\n\tM-Bahn\n\tShanghai Maglev Train\n\tShanghai–Hangzhou Maglev Line\n\tSCMaglev (Chuo Shinkansen)\n\tUK Ultraspeed\n\n\n\n\n\tTransport Accidents\t\n\tLathen train collision\n\n\n\n\n\tProposals in italics\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Magnetic_bearing&oldid=917805327\"\n\n\t\t\n\t\tCategories: \tBearings (mechanical)\n\tMagnetic levitation\n\n\nHidden categories: \tWebarchive template wayback links\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from April 2007\n\tCS1 errors: missing periodical\n\tCS1 maint: multiple names: authors list\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tБългарски\n\tDeutsch\n\tEspañol\n\tفارسی\n\tFrançais\n\tहिन्दी\n\tHrvatski\n\tNederlands\n\t日本語\n\tPolski\n\tRomână\n\tРусский\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tУкраїнська\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 25 September 2019, at 15:38 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Magnetic bearing - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Magneticbearings.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-magnetic_bearing", "title": "Magnetic bearing - Wikipedia"}}