{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOrbital station-keeping - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tOrbital station-keeping\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tIn astrodynamics, the orbital maneuvers made by thruster burns that are needed to keep a spacecraft in a particular assigned orbit are called orbital station-keeping.\n\nFor many Earth satellites the effects of the non-Keplerian forces, i.e. the deviations of the gravitational force of the Earth from that of a homogeneous sphere, gravitational forces from Sun/Moon, solar radiation pressure and air drag, must be counteracted.\n\nThe deviation of Earth's gravity field from that of a homogeneous sphere and gravitational forces from Sun/Moon will in general perturb the orbital plane. For a sun-synchronous orbit the precession of the orbital plane caused by the oblateness of the Earth is a desirable feature that is part of the mission design but the inclination change caused by the gravitational forces of Sun/Moon is undesirable. For geostationary spacecraft the inclination change caused by the gravitational forces of  the Sun & Moon must be counteracted by a rather large expense of fuel, as the inclination should be kept sufficiently small for the spacecraft to be tracked by a non-steerable antenna.\n\nFor spacecraft in low orbits the effects of atmospheric drag must often be compensated for. For some missions this is needed simply to avoid re-entry; for other missions, typically missions for which the orbit should be accurately synchronized with Earth rotation, this is necessary to avoid the orbital period shortening.\n\nSolar radiation pressure will in general perturb the eccentricity (i.e. the eccentricity vector), see Orbital perturbation analysis (spacecraft). For some missions this must be actively counter-acted with manoeuvres. For geostationary spacecraft the eccentricity must be kept sufficiently small for a spacecraft to be tracked with a non-steerable antenna. Also for Earth observation spacecraft for which a very repetitive orbit with a fixed ground track is desirable, the eccentricity vector should be kept as fixed as possible. A large part of this compensation can be done by using a frozen orbit design, but for the fine control manoeuvres with thrusters are needed.\n\nFor spacecraft in a halo orbit around a Lagrangian point station-keeping is even more fundamental, as such an orbit is unstable; without an active control with thruster burns the smallest deviation in position/velocity would result in the spacecraft leaving the orbit completely.[1]\n\n\nContents\n\n\n\t1 Station-keeping in low Earth orbit\n\t2 Station-keeping for Earth observation spacecraft\n\t3 Station-keeping in geostationary orbit\n\t4 Station-keeping at libration points\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nStation-keeping in low Earth orbit[edit]\n\nFor a spacecraft in a very low orbit the atmospheric drag is sufficiently strong to cause a re-entry before the intended end of mission if orbit raising manoeuvres are not executed from time to time.\n\nAn example of this is the International Space Station (ISS), which has an operational altitude above Earth's surface of between 330 and 410 km. Due to atmospheric drag the space station is constantly losing orbital energy. In order to compensate for this loss, which would eventually lead to a re-entry of the station, it has from time to time been re-boosted to a higher orbit. The chosen orbital altitude is a trade-off between the average thrust needed to counter-act the air drag and the delta-v needed to send payloads and people to the station. \nThe upper limitation of orbit altitude is due to the constraints imposed by the Soyuz spacecraft. On 25 April 2008, the Automated Transfer Vehicle \"Jules Verne\" raised the orbit of the ISS for the first time, thereby proving its ability to replace (and outperform) the Soyuz at this task.[citation needed]\n\nGOCE which orbited at 255 km (later reduced to 235 km) used ion thrusters to provide up to 20 mN of thrust to compensate for the drag on its frontal area of about 1 m2.[2]\n\n\nStation-keeping for Earth observation spacecraft[edit]\n\nFor Earth observation spacecraft typically operated in an altitude above the Earth surface of about 700 – 800 km the air-drag is very faint and a re-entry due to air-drag is not a concern.  But if the orbital period should be synchronous with the Earth's rotation to maintain a fixed ground track, the faint air-drag at this high altitude must also be counter-acted by orbit raising manoeuvres in the form of thruster burns tangential to the orbit. These manoeuvres will be very small, typically in the order of a few mm/s of delta-v. If a frozen orbit design is used these very small orbit raising manoeuvres are sufficient to also control the eccentricity vector.\n\nTo maintain a fixed ground track it is also necessary to make out-of-plane manoeuvres to compensate for the inclination change caused by Sun/Moon gravitation. These are executed as thruster burns orthogonal to the orbital plane. For Sun-synchronous spacecraft having a constant geometry relative to the Sun, the inclination change due to the solar gravitation is particularly large; a delta-v in the order of 1–2 m/s per year can be needed to keep the inclination constant.\n\n\nStation-keeping in geostationary orbit[edit]\n\n  \nInclined orbital planes\n\n\n\nFurther information: Geostationary orbit § Orbital stability\n\nFor geostationary spacecraft, thruster burns orthogonal to the orbital plane must be executed to compensate for the effect of the lunar/solar gravitation that perturbs the orbit pole with typically 0.85 degrees per year.[3] The delta-v needed to compensate for this perturbation keeping the inclination to the equatorial plane amounts to in the order 45 m/s per year. This part of the GEO station-keeping is called North-South control.[4]\n\nThe East-West control is the control of the orbital period and the eccentricity vector performed by making thruster burns tangential to the orbit. These burns are then designed to keep the orbital period perfectly synchronous with the Earth rotation and to keep the eccentricity sufficiently small. Perturbation of the orbital period results from the imperfect rotational symmetry of the Earth relative the North/South axis, sometimes called the ellipticity of the Earth equator.  The eccentricity (i.e. the eccentricity vector) is perturbed by the solar radiation pressure. The fuel needed for this East-West control is much less than what is needed for the North-South control.\n\nTo extend the life-time of ageing geostationary spacecraft with little fuel left one sometimes discontinues the North-South control only continuing with the East-West control. As seen from an observer on the rotating Earth the spacecraft will then move North-South with a period of 24 hours. When this North-South movement gets too large a steerable antenna is needed to track the spacecraft. An example of this[when?] is Artemis.[citation needed]\n\nTo save weight, it is crucial for GEO satellites to have the most fuel-efficient propulsion system. Some[which?] modern satellites are therefore employing a high specific impulse system like plasma or ion thrusters.\n\n\nStation-keeping at libration points[edit]\n\nOrbits of spacecraft are also possible around Lagrange points—also referred to as libration points—gravity wells that exist at five points in relation to two larger solar system bodies.  For example, there are five of these points in the Sun-Earth system, five in the Earth-Moon system, and so on.  Small spacecraft may orbit around these gravity wells with a minimum of propellant required for station-keeping purposes.  Two orbits that have been used for such purposes include halo and Lissajous orbits.[5]\n\nOrbits around libration points are dynamically unstable, meaning small departures from equilibrium grow exponentially over time.[1] As a result, spacecraft in libration point orbits must use propulsion systems to perform orbital station-keeping.\n\nOne important libration point is Earth-Sun L1, and three heliophysics missions have been orbiting L1 since approximately 2000.  Station-keeping propellant use can be quite low, facilitating missions that can potentially last decades should other spacecraft systems remain operational.  The three spacecraft—Advanced Composition Explorer (ACE), Solar Heliospheric Observatory (SOHO), and the Global Geoscience WIND satellite—each have annual station-keeping propellant requirements of approximately 1 m/s or less.[5]\nEarth-Sun L2—approximately 1.5 million kilometers from Earth in the anti-sun direction—is another important Lagrangian point, and the ESA Herschel space observatory operated there in a Lissajous orbit during 2009–2013, at which time it ran out of coolant for the space telescope.  Small station-keeping orbital maneuvers were executed approximately monthly to maintain the spacecraft in the station-keeping orbit.[1]\n\nThe James Webb Space Telescope will use propellant to maintain its halo orbit around the Earth-Sun L2, which provides an upper limit to its designed lifetime: it is being designed to carry enough for ten years.[6]\n\n\nSee also[edit]\n\n\tOrbital maneuver\n\tDelta-v budget\n\tOrbital perturbation analysis\n\tTeleoperator Retrieval System (robotic device for attaching to another spacecraft and boosting or changing its orbit)\n\n\nReferences[edit]\n\n\n\t^ a b c \n\"ESA Science & Technology: Orbit/Navigation\". European Space Agency. 14 June 2009. Retrieved 14 February 2015.\n\n\t^ GOCE satellite\n\n\t^ Anderson, Paul;  et al. (2015). Operational Considerations of GEO Debris Synchronization Dynamics (PDF). 66th International Astronautical Congress. Jerusalem, Israel. IAC-15,A6,7,3,x27478.\n\n\n\t^ Soop, E. M. (1994). Handbook of Geostationary Orbits. Springer. \nISBN 978-0-7923-3054-7.\n\n\t^ a b \nRoberts, Craig E. (1 January 2011). \"Long Term Missions at the Sun-Earth Libration Point L1: ACE, SOHO, and WIND\" (pdf). NASA Technical Reports. NASA. 20110008638. Retrieved 14 February 2015. Three heliophysics missions – the Advanced Composition Explorer (ACE), Solar Heliospheric Observatory (SOHO), and the Global Geoscience WIND – have been orbiting the Sun-Earth interior libration point L1 continuously since 1997, 1996, and 2004 ... the typical interval between burns for this trio is about three months, and the typical delta-V is much smaller than 0.5 m/sec. Typical annual stationkeeping costs have been around 1.0 m/sec for ACE and WIND, and much less than that for SOHO. All three spacecraft have ample fuel remaining; barring contingencies all three could, in principle, be maintained at L1 for decades to come.\n\n\n\t^ [1]\n\n\n\n\n\nExternal links[edit]\n\n\tStation-keeping at the Encyclopedia of Astrobiology, Astronomy, and Spaceflight\n\tXIPS Xenon Ion Propulsion Systems\n\t[2] Jules Verne boosts ISS orbit (report from the European Space Agency)\n\n\n\t\tv\n\tt\n\te\n\n\nGravitational orbits\n\n\tTypes\t\n\tGeneral\t\n\tBox\n\tCapture\n\tCircular\n\tElliptical / Highly elliptical\n\tEscape\n\tHorseshoe\n\tHyperbolic trajectory\n\tInclined / Non-inclined\n\tLagrangian point\n\tOsculating\n\tParabolic trajectory\n\tParking\n\tSynchronous\n\tsemi\n\tsub\n\n\n\tTransfer orbit\n\n\n\n\n\tGeocentric\t\n\tGeosynchronous\n\tGeostationary\n\tGeostationary transfer\n\n\n\tGraveyard\n\tHigh Earth\n\tLow Earth\n\tMedium Earth\n\tMolniya\n\tNear-equatorial\n\tOrbit of the Moon\n\tPolar\n\tSun-synchronous\n\tTundra\n\n\n\n\n\tAbout other points\t\n\tMars\n\tAreosynchronous\n\tAreostationary\n\n\n\tLagrange points\n\tHalo\n\tLissajous\n\n\n\tLunar\n\tSun\n\tHeliocentric\n\tEarth's orbit\n\n\n\tHeliosynchronous\n\n\n\n\n\n\n\n\n\n\tParameters\t\n\t\tShape\n\tSize\n\n\n\t\n\te  Eccentricity\n\ta  Semi-major axis\n\tb  Semi-minor axis\n\tQ, q  Apsides\n\n\n\n\n\tOrientation\t\n\ti  Inclination\n\tΩ  Longitude of the ascending node\n\tω  Argument of periapsis\n\tϖ  Longitude of the periapsis\n\n\n\n\n\tPosition\t\n\tM  Mean anomaly\n\tν, θ, f  True anomaly\n\tE  Eccentric anomaly\n\tL  Mean longitude\n\tl  True longitude\n\n\n\n\n\tVariation\t\n\tT  Orbital period\n\tn  Mean motion\n\tv  Orbital speed\n\tt0  Epoch\n\n\n\n\n\n\n\n\tManeuvers\t\n\tBi-elliptic transfer\n\tCollision avoidance (spacecraft)\n\tDelta-v\n\tDelta-v budget\n\tGravity assist\n\tGravity turn\n\tHohmann transfer\n\tInclination change\n\tLow energy transfer\n\tOberth effect\n\tPhasing\n\tRocket equation\n\tRendezvous\n\tTransposition, docking, and extraction\n\n\n\n\n\tOrbital mechanics\t\n\tCelestial coordinate system\n\tCharacteristic energy\n\tEscape velocity\n\tEphemeris\n\tEquatorial coordinate system\n\tGround track\n\tHill sphere\n\tInterplanetary Transport Network\n\tKepler's laws of planetary motion\n\tLagrangian point\n\tn-body problem\n\tOrbit equation\n\tOrbital state vectors\n\tPerturbation\n\tRetrograde motion\n\tSpecific orbital energy\n\tSpecific relative angular momentum\n\tTwo-line elements\n\n\n\n\n\t\n\tList of orbits\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Orbital_station-keeping&oldid=911232648\"\n\n\t\t\n\t\tCategories: \tOrbital maneuvers\n\tAstrodynamics\n\tEarth orbits\n\n\nHidden categories: \tAll articles with unsourced statements\n\tArticles with unsourced statements from June 2009\n\tAll articles with vague or ambiguous time\n\tVague or ambiguous time from January 2016\n\tArticles with unsourced statements from January 2016\n\tAll articles with specifically marked weasel-worded phrases\n\tArticles with specifically marked weasel-worded phrases from May 2018\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tEspañol\n\tBahasa Indonesia\n\tతెలుగు\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 17 August 2019, at 13:32 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "7", "dc:title": "Orbital station-keeping - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-orbital_station-keeping", "title": "Orbital station-keeping - Wikipedia"}}