{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOrbital mechanics - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tOrbital mechanics\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\t\n\tThis article includes a list of references, but its sources remain unclear because it has insufficient inline citations. Please help to improve this article by introducing more precise citations.  (February 2010) (Learn how and when to remove this template message)\n\n\n\n  \nA satellite orbiting the earth has a tangential velocity and an inward acceleration.\n\n\n\n\tPart of a series on\n\tAstrodynamics\n\t\n\t\nOrbital mechanics\n\n\t\nOrbital parameters\n\n\tApsis\n\tArgument of periapsis\n\tAzimuth\n\tEccentricity\n\tInclination\n\tMean anomaly\n\tOrbital nodes\n\tSemi-major axis\n\tTrue anomaly\n\n\n\n\n\t\nTypes of two-body orbits, by \neccentricity\n\n\tCircular orbit\n\tElliptic orbit\n\n\nTransfer orbit \t(Hohmann transfer orbit\n\tBi-elliptic transfer orbit)\n\n\n\n\n\tParabolic orbit\n\tHyperbolic orbit\n\tRadial orbit\n\tDecaying orbit\n\n\n\n\n\t\nEquations\n\n\tDynamical friction\n\tEscape velocity\n\tKepler's equation\n\tKepler's laws of planetary motion\n\tOrbital period\n\tOrbital velocity\n\tSurface gravity\n\tSpecific orbital energy\n\tVis-viva equation\n\n\n\n\n\t\nCelestial mechanics\n\n\t\nGravitational influences\n\n\tBarycenter\n\tHill sphere\n\tPerturbations\n\tSphere of influence\n\n\n\n\n\t\nN-body orbits\nLagrangian points \t(Halo orbits)\n\n\n\n\n\tLissajous orbits\n\tLyapunov orbits\n\n\n\n\n\t\nEngineering and efficiency\n\n\t\nPreflight engineering\n\n\tMass ratio\n\tPayload fraction\n\tPropellant mass fraction\n\tTsiolkovsky rocket equation\n\n\n\n\n\t\nEfficiency measures\n\n\tGravity assist\n\tOberth effect\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nOrbital mechanics or astrodynamics is the application of ballistics and celestial mechanics to the practical problems concerning the motion of rockets and other spacecraft. The motion of these objects is usually calculated from Newton's laws of motion and law of universal gravitation. Orbital mechanics is a core discipline within space-mission design and control.\n\nCelestial mechanics treats more broadly the orbital dynamics of systems under the influence of gravity, including both spacecraft and natural astronomical bodies such as star systems, planets, moons, and comets. Orbital mechanics focuses on spacecraft trajectories, including orbital maneuvers, orbital plane changes, and interplanetary transfers, and is used by mission planners to predict the results of propulsive maneuvers. General relativity is a more exact theory than Newton's laws for calculating orbits, and is sometimes necessary for greater accuracy or in high-gravity situations (e.g. orbits near the Sun).\n\n\nContents\n\n\n\t1 History\n\t2 Practical techniques\n\t2.1 Rules of thumb\n\n\n\n\t3 Laws of astrodynamics\n\t3.1 Escape velocity\n\t3.2 Formulae for free orbits\n\t3.3 Circular orbits\n\t3.4 Elliptical orbits\n\t3.4.1 Orbital period\n\t3.4.2 Velocity\n\t3.4.3 Energy\n\n\n\n\t3.5 Parabolic orbits\n\t3.6 Hyperbolic orbits\n\t3.6.1 Energy\n\t3.6.2 Hyperbolic excess velocity\n\n\n\n\n\n\n\t4 Calculating trajectories\n\t4.1 Kepler's equation\n\t4.2 Conic orbits\n\t4.3 The patched conic approximation\n\t4.4 The universal variable formulation\n\t4.5 Perturbations\n\n\n\n\t5 Orbital maneuver\n\t5.1 Orbital transfer\n\t5.2 Gravity assist and the Oberth effect\n\t5.3 Interplanetary Transport Network and fuzzy orbits\n\n\n\n\t6 See also\n\t7 References\n\t8 Further reading\n\t9 External links\n\n\n\n\n\nHistory[edit]\n\n\t\tThis section needs expansion. You can help by adding to it.  (August 2008)\n\n\n\nUntil the rise of space travel in the twentieth century, there was little distinction between orbital and celestial mechanics. At the time of Sputnik, the field was termed 'space dynamics'.[1] The fundamental techniques, such as those used to solve the Keplerian problem (determining position as a function of time), are therefore the same in both fields. Furthermore, the history of the fields are almost entirely shared.\n\nJohannes Kepler was the first to successfully model planetary orbits to a high degree of accuracy, publishing his laws in 1605. Isaac Newton published more general laws of celestial motion in the first edition of Philosophiæ Naturalis Principia Mathematica (1687), which gave a method for finding the orbit of a body following a parabolic path from three observations.[2] This was used by Edmund Halley to establish the orbits of various comets, including that which bears his name. Newton's method of successive approximation was formalised into an analytic method by Euler in 1744, whose work was in turn generalised to elliptical and hyperbolic orbits by Lambert in 1761-1777.\n\nAnother milestone in orbit determination was Carl Friedrich Gauss's assistance in the \"recovery\" of the dwarf planet Ceres in 1801.  Gauss's method was able to use just three observations (in the form of pairs of right ascension and declination), to find the six orbital elements that completely describe an orbit.  The theory of orbit determination has subsequently been developed to the point where today it is applied in GPS receivers as well as the tracking and cataloguing of newly observed minor planets. Modern orbit determination and prediction are used for operating all types of satellites and space probes, as it is necessary to know their future positions to a high degree of accuracy.\n\nAstrodynamics was developed by astronomer Samuel Herrick beginning in the 1930s. He consulted rocket scientist Robert Goddard and was encouraged to continue his work on space navigation techniques as Goddard believed they would be needed in the future. Astrodynamics numerical techniques were coupled with new powerful computers in the 1960s, and man was ready to travel to the moon and return.\n\n\nPractical techniques[edit]\n\nFurther information: List of orbits\n\nRules of thumb[edit]\n\nThe following rules of thumb are useful for situations approximated by classical mechanics under the standard assumptions of astrodynamics outlined below the rules.  The specific example discussed is of a satellite orbiting a planet, but the rules of thumb could also apply to other situations, such as orbits of small bodies around a star such as the Sun.\n\n\n\tKepler's laws of planetary motion:\n\tOrbits are elliptical, with the heavier body at one focus of the ellipse. Special case of this is a circular orbit (a circle is a special case of ellipse) with the planet at the center.\n\tA line drawn from the planet to the satellite sweeps out equal areas in equal times no matter which portion of the orbit is measured.\n\tThe square of a satellite's orbital period is proportional to the cube of its average distance from the planet.\n\n\n\tWithout applying force (such as firing a rocket engine), the period and shape of the satellite's orbit won't change.\n\tA satellite in a low orbit (or low part of an elliptical orbit) moves more quickly with respect to the surface of the planet than a satellite in a higher orbit (or a high part of an elliptical orbit), due to the stronger gravitational attraction closer to the planet.\n\tIf thrust is applied at only one point in the satellite's orbit, it will return to that same point on each subsequent orbit, though the rest of its path will change.  Thus one cannot move from one circular orbit to another with only one brief application of thrust.\n\tFrom a circular orbit, thrust applied in a direction opposite to the satellite's motion changes orbit to elliptical; the satellite will descend and reach the lowest orbital point (the periapse) at 180 degrees away from the firing point; then it will ascend back. Thrust applied in the direction of the satellite's motion creates an elliptical orbit with its highest point (apoapse) 180 degrees away from the firing point.\n\n\nThe consequences of the rules of orbital mechanics are sometimes counter-intuitive.  For example, if two spacecraft are in the same circular orbit and wish to dock, unless they are very close, the trailing craft cannot simply fire its engines to go faster.  This will change the shape of its orbit, causing it to gain altitude and actually slow down relative to the leading craft, missing the target. The space rendezvous before docking normally takes multiple precisely calculated engine firings in multiple orbital periods requiring hours or even days to complete.\n\nTo the degree that the standard assumptions of astrodynamics do not hold, actual trajectories will vary from those calculated.  For example, simple atmospheric drag is another complicating factor for objects in low Earth orbit.  These rules of thumb are decidedly inaccurate when describing two or more bodies of similar mass, such as a binary star system (see n-body problem). Celestial mechanics uses more general rules applicable to a wider variety of situations. Kepler's laws of planetary motion, which can be mathematically derived from Newton's laws, hold strictly only in describing the motion of two gravitating bodies in the absence of non-gravitational forces; they also describe parabolic and hyperbolic trajectories. In the close proximity of large objects like stars the differences between classical mechanics and general relativity also become important.\n\n\nLaws of astrodynamics[edit]\n\nSee also: Laplace–Runge–Lenz vector\n\nThe fundamental laws of astrodynamics are Newton's law of universal gravitation and Newton's laws of motion, while the fundamental mathematical tool is differential calculus.\n\nEvery orbit and trajectory outside atmospheres is in principle reversible, i.e., in the space-time function the time is reversed. The velocities are reversed and the accelerations are the same, including those due to rocket bursts. Thus if a rocket burst is in the direction of the velocity, in the reversed case it is opposite to the velocity. Of course in the case of rocket bursts there is no full reversal of events, both ways the same delta-v is used and the same mass ratio applies.\n\nStandard assumptions in astrodynamics include non-interference from outside bodies, negligible mass for one of the bodies, and negligible other forces (such as from the solar wind, atmospheric drag, etc.).  More accurate calculations can be made without these simplifying assumptions, but they are more complicated.  The increased accuracy often does not make enough of a difference in the calculation to be worthwhile.\n\nKepler's laws of planetary motion may be derived from Newton's laws, when it is assumed that the orbiting body is subject only to the gravitational force of the central attractor. When an engine thrust or propulsive force is present, Newton's laws still apply, but Kepler's laws are invalidated.  When the thrust stops, the resulting orbit will be different but will once again be described by Kepler's laws.  The three laws are:\n\n\n\tThe orbit of every planet is an ellipse with the sun at one of the foci.\n\tA line joining a planet and the sun sweeps out equal areas during equal intervals of time.\n\tThe squares of the orbital periods of planets are directly proportional to the cubes of the semi-major axis of the orbits.\n\n\nEscape velocity[edit]\n\nMain article: Escape velocity\n\nThe formula for an escape velocity is derived as follows.  The specific energy (energy per unit mass) of any space vehicle is composed of two components, the specific potential energy and the specific kinetic energy. The specific potential energy associated with a planet of mass M is given by\n\n\n\t\n  \n    \n      \n        \n          ϵ\n          \n            p\n          \n        \n        =\n        −\n        \n          \n            \n              G\n              M\n            \n            r\n          \n        \n        \n      \n    \n    {\\displaystyle \\epsilon _{p}=-{\\frac {GM}{r}}\\,}\n  \n\n\n\nwhile the specific kinetic energy of an object is given by\n\n\n\t\n  \n    \n      \n        \n          ϵ\n          \n            k\n          \n        \n        =\n        \n          \n            \n              v\n              \n                2\n              \n            \n            2\n          \n        \n        \n      \n    \n    {\\displaystyle \\epsilon _{k}={\\frac {v^{2}}{2}}\\,}\n  \n\n\n\nSince energy is conserved,\n\n\n\t\n  \n    \n      \n        ϵ\n        =\n        \n          ϵ\n          \n            k\n          \n        \n        +\n        \n          ϵ\n          \n            p\n          \n        \n        ,\n        \n      \n    \n    {\\displaystyle \\epsilon =\\epsilon _{k}+\\epsilon _{p},\\!}\n  \n\n\n\nand so the total specific orbital energy\n\n\n\t\n  \n    \n      \n        ϵ\n        =\n        \n          \n            \n              v\n              \n                2\n              \n            \n            2\n          \n        \n        −\n        \n          \n            \n              G\n              M\n            \n            r\n          \n        \n        \n      \n    \n    {\\displaystyle \\epsilon ={\\frac {v^{2}}{2}}-{\\frac {GM}{r}}\\,}\n  \n\n\n\ndoes not depend on the distance, \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n  \n, from the center of the central body to the space vehicle in question. Therefore, the object can reach infinite \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n  \n only if this quantity is nonnegative, which implies\n\n\n\t\n  \n    \n      \n        v\n        ≥\n        \n          \n            \n              \n                2\n                G\n                M\n              \n              r\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle v\\geq {\\sqrt {\\frac {2GM}{r}}}.}\n  \n\n\n\nThe escape velocity from the Earth's surface is about 11 km/s, but that is insufficient to send the body an infinite distance because of the gravitational pull of the Sun. To escape the Solar System from a location at a distance from the Sun equal to the distance Sun–Earth, but not close to the Earth, requires around 42 km/s velocity, but there will be \"partial credit\" for the Earth's orbital velocity for spacecraft launched from Earth, if their further acceleration (due to the propulsion system) carries them in the same direction as Earth travels in its orbit.\n\n\nFormulae for free orbits[edit]\n\nOrbits are conic sections, so the formula for the distance of a body for a given angle corresponds to the formula for that curve in polar coordinates, which is:\n\n\n\t\n  \n    \n      \n        r\n        =\n        \n          \n            p\n            \n              1\n              +\n              e\n              cos\n              ⁡\n              θ\n            \n          \n        \n      \n    \n    {\\displaystyle r={\\frac {p}{1+e\\cos \\theta }}}\n  \n\n\t\n  \n    \n      \n        μ\n        =\n        G\n        (\n        \n          m\n          \n            1\n          \n        \n        +\n        \n          m\n          \n            2\n          \n        \n        )\n        \n      \n    \n    {\\displaystyle \\mu =G(m_{1}+m_{2})\\,}\n  \n\n\t\n  \n    \n      \n        p\n        =\n        \n          h\n          \n            2\n          \n        \n        \n          /\n        \n        μ\n        \n      \n    \n    {\\displaystyle p=h^{2}/\\mu \\,}\n  \n\n\n\n\n  \n    \n      \n        μ\n      \n    \n    {\\displaystyle \\mu }\n  \n is called the gravitational parameter. \n  \n    \n      \n        \n          m\n          \n            1\n          \n        \n      \n    \n    {\\displaystyle m_{1}}\n  \n and \n  \n    \n      \n        \n          m\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle m_{2}}\n  \n are the masses of objects 1 and 2, and \n  \n    \n      \n        h\n      \n    \n    {\\displaystyle h}\n  \n is the specific angular momentum of object 2 with respect to object 1. The parameter \n  \n    \n      \n        θ\n      \n    \n    {\\displaystyle \\theta }\n  \n is known as the true anomaly, \n  \n    \n      \n        p\n      \n    \n    {\\displaystyle p}\n  \n is the semi-latus rectum, while \n  \n    \n      \n        e\n      \n    \n    {\\displaystyle e}\n  \n is the orbital eccentricity, all obtainable from the various forms of the six independent orbital elements.\n\n\nCircular orbits[edit]\n\nAll bounded orbits where the gravity of a central body dominates are elliptical in nature. A special case of this is the circular orbit, which is an ellipse of zero eccentricity. The formula for the velocity of a body in a circular orbit at distance r from the center of gravity of mass M can be derived as follows:\n\nCentrifugal acceleration matches the acceleration due to gravity.\n\nSo, \n  \n    \n      \n        \n          v\n          \n            2\n          \n        \n        \n          /\n        \n        r\n        =\n        G\n        M\n        \n          /\n        \n        \n          r\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle v^{2}/r=GM/r^{2}}\n  \n\n\nTherefore,\n\n\n\t\n  \n    \n      \n         \n        v\n        =\n        \n          \n            \n              \n                \n                  G\n                  M\n                \n                r\n              \n            \n             \n          \n        \n      \n    \n    {\\displaystyle \\ v={\\sqrt {{\\frac {GM}{r}}\\ }}}\n  \n\n\n\nwhere \n  \n    \n      \n        G\n      \n    \n    {\\displaystyle G}\n  \n is the gravitational constant, equal to\n\n\n\t6.673 84 × 10−11 m3/(kg·s2)\n\n\nTo properly use this formula, the units must be consistent; for example, \n  \n    \n      \n        M\n      \n    \n    {\\displaystyle M}\n  \n must be in kilograms, and \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n  \n must be in meters. The answer will be in meters per second.\n\nThe quantity \n  \n    \n      \n        G\n        M\n      \n    \n    {\\displaystyle GM}\n  \n is often termed the standard gravitational parameter, which has a different value for every planet or moon in the Solar System.\n\nOnce the circular orbital velocity is known, the escape velocity is easily found by multiplying by the square root of 2:\n\n\n\t\n  \n    \n      \n         \n        v\n        =\n        \n          \n            2\n          \n        \n        \n          \n            \n              \n                \n                  G\n                  M\n                \n                r\n              \n            \n             \n          \n        \n        =\n        \n          \n            \n              \n                \n                  2\n                  G\n                  M\n                \n                r\n              \n            \n             \n          \n        \n        .\n      \n    \n    {\\displaystyle \\ v={\\sqrt {2}}{\\sqrt {{\\frac {GM}{r}}\\ }}={\\sqrt {{\\frac {2GM}{r}}\\ }}.}\n  \n\n\n\nTo escape from gravity, the kinetic energy must at least match the negative potential energy.\nSo, \n  \n    \n      \n        1\n        \n          /\n        \n        2\n        m\n        \n          v\n          \n            2\n          \n        \n        =\n        G\n        M\n        m\n        \n          /\n        \n        r\n      \n    \n    {\\displaystyle 1/2mv^{2}=GMm/r}\n  \n and therefore,\n\n\n\t\n  \n    \n      \n        v\n        =\n        \n          \n            \n              \n                \n                  2\n                  G\n                  M\n                \n                r\n              \n            \n             \n          \n        \n        .\n      \n    \n    {\\displaystyle v={\\sqrt {{\\frac {2GM}{r}}\\ }}.}\n  \n\n\n\nElliptical orbits[edit]\n\nIf \n  \n    \n      \n        0\n        <\n        e\n        <\n        1\n      \n    \n    {\\displaystyle 0<e<1}\n  \n, then the denominator of the equation of free orbits varies with the true anomaly \n  \n    \n      \n        θ\n      \n    \n    {\\displaystyle \\theta }\n  \n, but remains positive, never becoming zero. Therefore, the relative position vector remains bounded, having its smallest magnitude at periapsis \n  \n    \n      \n        \n          r\n          \n            p\n          \n        \n      \n    \n    {\\displaystyle r_{p}}\n  \n, which is given by:\n\n\n\t\n  \n    \n      \n        \n          r\n          \n            p\n          \n        \n        =\n        \n          \n            p\n            \n              1\n              +\n              e\n            \n          \n        \n      \n    \n    {\\displaystyle r_{p}={\\frac {p}{1+e}}}\n  \n\n\n\nThe maximum value \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n  \n is reached when \n  \n    \n      \n        θ\n        =\n        \n          180\n          \n            ∘\n          \n        \n      \n    \n    {\\displaystyle \\theta =180^{\\circ }}\n  \n. This point is called the apoapsis, and its radial coordinate, denoted \n  \n    \n      \n        \n          r\n          \n            a\n          \n        \n      \n    \n    {\\displaystyle r_{a}}\n  \n, is\n\n\n\t\n  \n    \n      \n        \n          r\n          \n            a\n          \n        \n        =\n        \n          \n            p\n            \n              1\n              −\n              e\n            \n          \n        \n      \n    \n    {\\displaystyle r_{a}={\\frac {p}{1-e}}}\n  \n\n\n\nLet \n  \n    \n      \n        2\n        a\n      \n    \n    {\\displaystyle 2a}\n  \n be the distance measured along the apse line from periapsis \n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n  \n to apoapsis \n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n, as illustrated in the equation below:\n\n\n\t\n  \n    \n      \n        2\n        a\n        =\n        \n          r\n          \n            p\n          \n        \n        +\n        \n          r\n          \n            a\n          \n        \n      \n    \n    {\\displaystyle 2a=r_{p}+r_{a}}\n  \n\n\n\nSubstituting the equations above, we get:\n\n\n\t\n  \n    \n      \n        a\n        =\n        \n          \n            p\n            \n              1\n              −\n              \n                e\n                \n                  2\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle a={\\frac {p}{1-e^{2}}}}\n  \n\n\n\na is the semimajor axis of the ellipse. Solving for \n  \n    \n      \n        p\n      \n    \n    {\\displaystyle p}\n  \n, and substituting the result in the conic section curve formula above, we get:\n\n\n\t\n  \n    \n      \n        r\n        =\n        \n          \n            \n              a\n              (\n              1\n              −\n              \n                e\n                \n                  2\n                \n              \n              )\n            \n            \n              1\n              +\n              e\n              cos\n              ⁡\n              θ\n            \n          \n        \n      \n    \n    {\\displaystyle r={\\frac {a(1-e^{2})}{1+e\\cos \\theta }}}\n  \n\n\n\nOrbital period[edit]\n\nUnder standard assumptions the orbital period (\n  \n    \n      \n        T\n        \n        \n      \n    \n    {\\displaystyle T\\,\\!}\n  \n) of a body traveling along an elliptic orbit can be computed as:\n\n\n\t\n  \n    \n      \n        T\n        =\n        2\n        π\n        \n          \n            \n              \n                a\n                \n                  3\n                \n              \n              \n                μ\n              \n            \n          \n        \n      \n    \n    {\\displaystyle T=2\\pi {\\sqrt {a^{3} \\over {\\mu }}}}\n  \n\n\n\nwhere:\n\n\n\t\n  \n    \n      \n        μ\n        \n      \n    \n    {\\displaystyle \\mu \\,}\n  \n is standard gravitational parameter,\n\t\n  \n    \n      \n        a\n        \n        \n      \n    \n    {\\displaystyle a\\,\\!}\n  \n is length of semi-major axis.\n\n\nConclusions:\n\n\n\tThe orbital period is equal to that for a circular orbit with the orbit radius equal to the semi-major axis (\n  \n    \n      \n        a\n        \n        \n      \n    \n    {\\displaystyle a\\,\\!}\n  \n),\n\tFor a given semi-major axis the orbital period does not depend on the eccentricity (See also: Kepler's third law).\n\n\nVelocity[edit]\n\nUnder standard assumptions the orbital speed (\n  \n    \n      \n        v\n        \n      \n    \n    {\\displaystyle v\\,}\n  \n) of a body traveling along an elliptic orbit can be computed from the Vis-viva equation as:\n\n\n\t\n  \n    \n      \n        v\n        =\n        \n          \n            μ\n            \n              (\n              \n                \n                  \n                    2\n                    \n                      r\n                    \n                  \n                \n                −\n                \n                  \n                    1\n                    \n                      a\n                    \n                  \n                \n              \n              )\n            \n          \n        \n      \n    \n    {\\displaystyle v={\\sqrt {\\mu \\left({2 \\over {r}}-{1 \\over {a}}\\right)}}}\n  \n\n\n\nwhere:\n\n\n\t\n  \n    \n      \n        μ\n        \n      \n    \n    {\\displaystyle \\mu \\,}\n  \n is the standard gravitational parameter,\n\t\n  \n    \n      \n        r\n        \n      \n    \n    {\\displaystyle r\\,}\n  \n is the distance between the orbiting bodies.\n\t\n  \n    \n      \n        a\n        \n        \n      \n    \n    {\\displaystyle a\\,\\!}\n  \n is the length of the semi-major axis.\n\n\nThe velocity equation for a hyperbolic trajectory has either + \n  \n    \n      \n        \n          \n            1\n            \n              a\n            \n          \n        \n      \n    \n    {\\displaystyle {1 \\over {a}}}\n  \n, or it is the same with the convention that in that case a is negative.\n\n\nEnergy[edit]\n\nUnder standard assumptions, specific orbital energy (\n  \n    \n      \n        ϵ\n        \n      \n    \n    {\\displaystyle \\epsilon \\,}\n  \n) of elliptic orbit is negative and the orbital energy conservation equation (the Vis-viva equation) for this orbit can take the form:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              v\n              \n                2\n              \n            \n            \n              2\n            \n          \n        \n        −\n        \n          \n            μ\n            \n              r\n            \n          \n        \n        =\n        −\n        \n          \n            μ\n            \n              2\n              a\n            \n          \n        \n        =\n        ϵ\n        <\n        0\n      \n    \n    {\\displaystyle {v^{2} \\over {2}}-{\\mu  \\over {r}}=-{\\mu  \\over {2a}}=\\epsilon <0}\n  \n\n\n\nwhere:\n\n\n\t\n  \n    \n      \n        v\n        \n      \n    \n    {\\displaystyle v\\,}\n  \n is the speed of the orbiting body,\n\t\n  \n    \n      \n        r\n        \n      \n    \n    {\\displaystyle r\\,}\n  \n is the distance of the orbiting body from the center of mass of the central body,\n\t\n  \n    \n      \n        a\n        \n      \n    \n    {\\displaystyle a\\,}\n  \n is the semi-major axis,\n\t\n  \n    \n      \n        μ\n        \n      \n    \n    {\\displaystyle \\mu \\,}\n  \n is the standard gravitational parameter.\n\n\nConclusions:\n\n\n\tFor a given semi-major axis the specific orbital energy is independent of the eccentricity.\n\n\nUsing the virial theorem we find:\n\n\n\tthe time-average of the specific potential energy is equal to 2ε\n\tthe time-average of r−1 is a−1\n\n\n\tthe time-average of the specific kinetic energy is equal to -ε\n\n\nParabolic orbits[edit]\n\nIf the eccentricity equals 1, then the orbit equation becomes:\n\n\n\t\n  \n    \n      \n        r\n        =\n        \n          \n            \n              \n                h\n                \n                  2\n                \n              \n            \n            \n              μ\n            \n          \n        \n        \n          \n            \n              1\n            \n            \n              1\n              +\n              cos\n              ⁡\n              θ\n            \n          \n        \n      \n    \n    {\\displaystyle r={{h^{2}} \\over {\\mu }}{{1} \\over {1+\\cos \\theta }}}\n  \n\n\n\nwhere:\n\n\n\t\n  \n    \n      \n        r\n        \n      \n    \n    {\\displaystyle r\\,}\n  \n is the radial distance of the orbiting body from the mass center of the central body,\n\t\n  \n    \n      \n        h\n        \n      \n    \n    {\\displaystyle h\\,}\n  \n is specific angular momentum of the orbiting body,\n\t\n  \n    \n      \n        θ\n        \n      \n    \n    {\\displaystyle \\theta \\,}\n  \n is the true anomaly of the orbiting body,\n\t\n  \n    \n      \n        μ\n        \n      \n    \n    {\\displaystyle \\mu \\,}\n  \n is the standard gravitational parameter.\n\n\nAs the true anomaly θ approaches 180°, the denominator approaches zero, so that r tends towards infinity. Hence, the energy of the trajectory for which e=1 is zero, and is given by:\n\n\n\t\n  \n    \n      \n        ϵ\n        =\n        \n          \n            \n              v\n              \n                2\n              \n            \n            2\n          \n        \n        −\n        \n          \n            μ\n            \n              r\n            \n          \n        \n        =\n        0\n      \n    \n    {\\displaystyle \\epsilon ={v^{2} \\over 2}-{\\mu  \\over {r}}=0}\n  \n\n\n\nwhere:\n\n\n\t\n  \n    \n      \n        v\n        \n      \n    \n    {\\displaystyle v\\,}\n  \n is the speed of the orbiting body.\n\n\nIn other words, the speed anywhere on a parabolic path is:\n\n\n\t\n  \n    \n      \n        v\n        =\n        \n          \n            \n              \n                2\n                μ\n              \n              \n                r\n              \n            \n          \n        \n      \n    \n    {\\displaystyle v={\\sqrt {2\\mu  \\over {r}}}}\n  \n\n\n\nHyperbolic orbits[edit]\n\nIf \n  \n    \n      \n        e\n        >\n        1\n      \n    \n    {\\displaystyle e>1}\n  \n, the orbit formula,\n\n\n\t\n  \n    \n      \n        r\n        =\n        \n          \n            \n              \n                h\n                \n                  2\n                \n              \n            \n            \n              μ\n            \n          \n        \n        \n          \n            \n              1\n            \n            \n              1\n              +\n              e\n              cos\n              ⁡\n              θ\n            \n          \n        \n      \n    \n    {\\displaystyle r={{h^{2}} \\over {\\mu }}{{1} \\over {1+e\\cos \\theta }}}\n  \n\n\n\ndescribes the geometry of the hyperbolic orbit. The system consists of two symmetric curves. The orbiting body occupies one of them; the other one is its empty mathematical image. Clearly, the denominator of the equation above goes to zero when \n  \n    \n      \n        cos\n        ⁡\n        θ\n        =\n        −\n        1\n        \n          /\n        \n        e\n      \n    \n    {\\displaystyle \\cos \\theta =-1/e}\n  \n. we denote this value of true anomaly\n\n\n\t\n  \n    \n      \n        \n          θ\n          \n            ∞\n          \n        \n        =\n        \n          cos\n          \n            −\n            1\n          \n        \n        ⁡\n        \n          (\n          \n            −\n            \n              \n                1\n                e\n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle \\theta _{\\infty }=\\cos ^{-1}\\left(-{\\frac {1}{e}}\\right)}\n  \n\n\n\nsince the radial distance approaches infinity as the true anomaly approaches \n  \n    \n      \n        \n          θ\n          \n            ∞\n          \n        \n      \n    \n    {\\displaystyle \\theta _{\\infty }}\n  \n, known as the true anomaly of the asymptote. Observe that \n  \n    \n      \n        \n          θ\n          \n            ∞\n          \n        \n      \n    \n    {\\displaystyle \\theta _{\\infty }}\n  \n lies between 90° and 180°. From the trigonometric identity \n  \n    \n      \n        \n          sin\n          \n            2\n          \n        \n        ⁡\n        θ\n        +\n        \n          cos\n          \n            2\n          \n        \n        ⁡\n        θ\n        =\n        1\n      \n    \n    {\\displaystyle \\sin ^{2}\\theta +\\cos ^{2}\\theta =1}\n  \n it follows that:\n\n\n\t\n  \n    \n      \n        sin\n        ⁡\n        \n          θ\n          \n            ∞\n          \n        \n        =\n        \n          \n            1\n            e\n          \n        \n        \n          \n            \n              e\n              \n                2\n              \n            \n            −\n            1\n          \n        \n      \n    \n    {\\displaystyle \\sin \\theta _{\\infty }={\\frac {1}{e}}{\\sqrt {e^{2}-1}}}\n  \n\n\n\nEnergy[edit]\n\nUnder standard assumptions, specific orbital energy (\n  \n    \n      \n        ϵ\n        \n      \n    \n    {\\displaystyle \\epsilon \\,}\n  \n) of a hyperbolic trajectory is greater than zero and the orbital energy conservation equation for this kind of trajectory takes form:\n\n\n\t\n  \n    \n      \n        ϵ\n        =\n        \n          \n            \n              v\n              \n                2\n              \n            \n            2\n          \n        \n        −\n        \n          \n            μ\n            \n              r\n            \n          \n        \n        =\n        \n          \n            μ\n            \n              −\n              2\n              a\n            \n          \n        \n      \n    \n    {\\displaystyle \\epsilon ={v^{2} \\over 2}-{\\mu  \\over {r}}={\\mu  \\over {-2a}}}\n  \n\n\n\nwhere:\n\n\n\t\n  \n    \n      \n        v\n        \n      \n    \n    {\\displaystyle v\\,}\n  \n is the orbital velocity of orbiting body,\n\t\n  \n    \n      \n        r\n        \n      \n    \n    {\\displaystyle r\\,}\n  \n is the radial distance of orbiting body from central body,\n\t\n  \n    \n      \n        a\n        \n      \n    \n    {\\displaystyle a\\,}\n  \n is the negative semi-major axis of the orbit's hyperbola,\n\t\n  \n    \n      \n        μ\n        \n      \n    \n    {\\displaystyle \\mu \\,}\n  \n is standard gravitational parameter.\n\n\nHyperbolic excess velocity[edit]\n\nSee also: Characteristic energy\n\nUnder standard assumptions the body traveling along a hyperbolic trajectory will attain at \n  \n    \n      \n        r\n        =\n      \n    \n    {\\displaystyle r=}\n  \n infinity an orbital velocity called hyperbolic excess velocity (\n  \n    \n      \n        \n          v\n          \n            ∞\n          \n        \n        \n        \n      \n    \n    {\\displaystyle v_{\\infty }\\,\\!}\n  \n) that can be computed as:\n\n\n\t\n  \n    \n      \n        \n          v\n          \n            ∞\n          \n        \n        =\n        \n          \n            \n              μ\n              \n                −\n                a\n              \n            \n          \n        \n        \n        \n      \n    \n    {\\displaystyle v_{\\infty }={\\sqrt {\\mu  \\over {-a}}}\\,\\!}\n  \n\n\n\nwhere:\n\n\n\t\n  \n    \n      \n        μ\n        \n        \n      \n    \n    {\\displaystyle \\mu \\,\\!}\n  \n is standard gravitational parameter,\n\t\n  \n    \n      \n        a\n        \n        \n      \n    \n    {\\displaystyle a\\,\\!}\n  \n is the negative semi-major axis of orbit's hyperbola.\n\n\nThe hyperbolic excess velocity is related to the specific orbital energy or characteristic energy by\n\n\n\t\n  \n    \n      \n        2\n        ϵ\n        =\n        \n          C\n          \n            3\n          \n        \n        =\n        \n          v\n          \n            ∞\n          \n          \n            2\n          \n        \n        \n        \n      \n    \n    {\\displaystyle 2\\epsilon =C_{3}=v_{\\infty }^{2}\\,\\!}\n  \n\n\n\nCalculating trajectories[edit]\n\nKepler's equation[edit]\n\nOne approach to calculating orbits (mainly used historically) is to use Kepler's equation:\n\n\n\t\n  \n    \n      \n        M\n        =\n        E\n        −\n        ϵ\n        ⋅\n        sin\n        ⁡\n        E\n      \n    \n    {\\displaystyle M=E-\\epsilon \\cdot \\sin E}\n  \n.\n\n\nwhere M is the mean anomaly, E is the eccentric anomaly, and \n  \n    \n      \n        \n          ϵ\n        \n      \n    \n    {\\displaystyle \\displaystyle \\epsilon }\n  \n is the eccentricity.\n\nWith Kepler's formula, finding the time-of-flight to reach an angle (true anomaly) of \n  \n    \n      \n        θ\n      \n    \n    {\\displaystyle \\theta }\n  \n from periapsis is broken into two steps:\n\n\n\tCompute the eccentric anomaly \n  \n    \n      \n        E\n      \n    \n    {\\displaystyle E}\n  \n from true anomaly \n  \n    \n      \n        θ\n      \n    \n    {\\displaystyle \\theta }\n  \n\n\tCompute the time-of-flight \n  \n    \n      \n        t\n      \n    \n    {\\displaystyle t}\n  \n from the eccentric anomaly \n  \n    \n      \n        E\n      \n    \n    {\\displaystyle E}\n  \n\n\n\nFinding the eccentric anomaly at a given time (the inverse problem) is more difficult. Kepler's equation is transcendental in \n  \n    \n      \n        E\n      \n    \n    {\\displaystyle E}\n  \n, meaning it cannot be solved for \n  \n    \n      \n        E\n      \n    \n    {\\displaystyle E}\n  \n algebraically. Kepler's equation can be solved for \n  \n    \n      \n        E\n      \n    \n    {\\displaystyle E}\n  \n analytically by inversion.\n\nA solution of Kepler's equation, valid for all real values of \n  \n    \n      \n        \n          ϵ\n        \n      \n    \n    {\\displaystyle \\textstyle \\epsilon }\n  \n is:\n\n\n  \n    \n      \n        E\n        =\n        \n          \n            {\n            \n              \n                \n                  \n                    \n                      ∑\n                      \n                        n\n                        =\n                        1\n                      \n                      \n                        ∞\n                      \n                    \n                    \n                      \n                        \n                          M\n                          \n                            \n                              n\n                              3\n                            \n                          \n                        \n                        \n                          n\n                          !\n                        \n                      \n                    \n                    \n                      lim\n                      \n                        θ\n                        →\n                        0\n                      \n                    \n                    \n                      (\n                      \n                        \n                          \n                            \n                              \n                                d\n                              \n                              \n                                \n                                n\n                                −\n                                1\n                              \n                            \n                            \n                              \n                                d\n                              \n                              \n                                θ\n                                \n                                  \n                                  n\n                                  −\n                                  1\n                                \n                              \n                            \n                          \n                        \n                        \n                          (\n                          \n                            \n                              \n                                θ\n                                \n                                  \n                                    θ\n                                    −\n                                    sin\n                                    ⁡\n                                    (\n                                    θ\n                                    )\n                                  \n                                  \n                                    3\n                                  \n                                \n                              \n                            \n                            \n                              n\n                            \n                          \n                          )\n                        \n                      \n                      )\n                    \n                    ,\n                  \n                \n                \n                  ϵ\n                  =\n                  1\n                \n              \n              \n                \n                  \n                    \n                      ∑\n                      \n                        n\n                        =\n                        1\n                      \n                      \n                        ∞\n                      \n                    \n                    \n                      \n                        \n                          M\n                          \n                            n\n                          \n                        \n                        \n                          n\n                          !\n                        \n                      \n                    \n                    \n                      lim\n                      \n                        θ\n                        →\n                        0\n                      \n                    \n                    \n                      (\n                      \n                        \n                          \n                            \n                              \n                                d\n                              \n                              \n                                \n                                n\n                                −\n                                1\n                              \n                            \n                            \n                              \n                                d\n                              \n                              \n                                θ\n                                \n                                  \n                                  n\n                                  −\n                                  1\n                                \n                              \n                            \n                          \n                        \n                        \n                          (\n                          \n                            \n                              \n                                θ\n                                \n                                  θ\n                                  −\n                                  ϵ\n                                  ⋅\n                                  sin\n                                  ⁡\n                                  (\n                                  θ\n                                  )\n                                \n                              \n                            \n                            \n                              n\n                            \n                          \n                          )\n                        \n                      \n                      )\n                    \n                    ,\n                  \n                \n                \n                  ϵ\n                  ≠\n                  1\n                \n              \n            \n            \n          \n        \n      \n    \n    {\\displaystyle E={\\begin{cases}\\displaystyle \\sum _{n=1}^{\\infty }{\\frac {M^{\\frac {n}{3}}}{n!}}\\lim _{\\theta \\to 0}\\left({\\frac {\\mathrm {d} ^{\\,n-1}}{\\mathrm {d} \\theta ^{\\,n-1}}}\\left({\\frac {\\theta }{\\sqrt[{3}]{\\theta -\\sin(\\theta )}}}^{n}\\right)\\right),&\\epsilon =1\\\\\\displaystyle \\sum _{n=1}^{\\infty }{\\frac {M^{n}}{n!}}\\lim _{\\theta \\to 0}\\left({\\frac {\\mathrm {d} ^{\\,n-1}}{\\mathrm {d} \\theta ^{\\,n-1}}}\\left({\\frac {\\theta }{\\theta -\\epsilon \\cdot \\sin(\\theta )}}^{n}\\right)\\right),&\\epsilon \\neq 1\\end{cases}}}\n  \n\n\nEvaluating this yields:\n\n\n  \n    \n      \n        E\n        =\n        \n          \n            {\n            \n              \n                \n                  \n                    x\n                    +\n                    \n                      \n                        1\n                        60\n                      \n                    \n                    \n                      x\n                      \n                        3\n                      \n                    \n                    +\n                    \n                      \n                        1\n                        1400\n                      \n                    \n                    \n                      x\n                      \n                        5\n                      \n                    \n                    +\n                    \n                      \n                        1\n                        25200\n                      \n                    \n                    \n                      x\n                      \n                        7\n                      \n                    \n                    +\n                    \n                      \n                        43\n                        17248000\n                      \n                    \n                    \n                      x\n                      \n                        9\n                      \n                    \n                    +\n                    \n                      \n                        1213\n                        7207200000\n                      \n                    \n                    \n                      x\n                      \n                        11\n                      \n                    \n                    +\n                    \n                      \n                        151439\n                        12713500800000\n                      \n                    \n                    \n                      x\n                      \n                        13\n                      \n                    \n                    ⋯\n                     \n                    \n                      |\n                    \n                     \n                    x\n                    =\n                    (\n                    6\n                    M\n                    \n                      )\n                      \n                        \n                          1\n                          3\n                        \n                      \n                    \n                    ,\n                  \n                \n                \n                  ϵ\n                  =\n                  1\n                \n              \n              \n                \n              \n              \n                \n                  \n                    \n                      \n                        1\n                        \n                          1\n                          −\n                          ϵ\n                        \n                      \n                    \n                    M\n                    −\n                    \n                      \n                        ϵ\n                        \n                          (\n                          1\n                          −\n                          ϵ\n                          \n                            )\n                            \n                              4\n                            \n                          \n                        \n                      \n                    \n                    \n                      \n                        \n                          M\n                          \n                            3\n                          \n                        \n                        \n                          3\n                          !\n                        \n                      \n                    \n                    +\n                    \n                      \n                        \n                          (\n                          9\n                          \n                            ϵ\n                            \n                              2\n                            \n                          \n                          +\n                          ϵ\n                          )\n                        \n                        \n                          (\n                          1\n                          −\n                          ϵ\n                          \n                            )\n                            \n                              7\n                            \n                          \n                        \n                      \n                    \n                    \n                      \n                        \n                          M\n                          \n                            5\n                          \n                        \n                        \n                          5\n                          !\n                        \n                      \n                    \n                    −\n                    \n                      \n                        \n                          (\n                          225\n                          \n                            ϵ\n                            \n                              3\n                            \n                          \n                          +\n                          54\n                          \n                            ϵ\n                            \n                              2\n                            \n                          \n                          +\n                          ϵ\n                          )\n                        \n                        \n                          (\n                          1\n                          −\n                          ϵ\n                          \n                            )\n                            \n                              10\n                            \n                          \n                        \n                      \n                    \n                    \n                      \n                        \n                          M\n                          \n                            7\n                          \n                        \n                        \n                          7\n                          !\n                        \n                      \n                    \n                    +\n                    \n                      \n                        \n                          (\n                          11025\n                          \n                            ϵ\n                            \n                              4\n                            \n                          \n                          +\n                          4131\n                          \n                            ϵ\n                            \n                              3\n                            \n                          \n                          +\n                          243\n                          \n                            ϵ\n                            \n                              2\n                            \n                          \n                          +\n                          ϵ\n                          )\n                        \n                        \n                          (\n                          1\n                          −\n                          ϵ\n                          \n                            )\n                            \n                              13\n                            \n                          \n                        \n                      \n                    \n                    \n                      \n                        \n                          M\n                          \n                            9\n                          \n                        \n                        \n                          9\n                          !\n                        \n                      \n                    \n                    ⋯\n                    ,\n                  \n                \n                \n                  ϵ\n                  ≠\n                  1\n                \n              \n            \n            \n          \n        \n      \n    \n    {\\displaystyle E={\\begin{cases}\\displaystyle x+{\\frac {1}{60}}x^{3}+{\\frac {1}{1400}}x^{5}+{\\frac {1}{25200}}x^{7}+{\\frac {43}{17248000}}x^{9}+{\\frac {1213}{7207200000}}x^{11}+{\\frac {151439}{12713500800000}}x^{13}\\cdots \\ |\\ x=(6M)^{\\frac {1}{3}},&\\epsilon =1\\\\\\\\\\displaystyle {\\frac {1}{1-\\epsilon }}M-{\\frac {\\epsilon }{(1-\\epsilon )^{4}}}{\\frac {M^{3}}{3!}}+{\\frac {(9\\epsilon ^{2}+\\epsilon )}{(1-\\epsilon )^{7}}}{\\frac {M^{5}}{5!}}-{\\frac {(225\\epsilon ^{3}+54\\epsilon ^{2}+\\epsilon )}{(1-\\epsilon )^{10}}}{\\frac {M^{7}}{7!}}+{\\frac {(11025\\epsilon ^{4}+4131\\epsilon ^{3}+243\\epsilon ^{2}+\\epsilon )}{(1-\\epsilon )^{13}}}{\\frac {M^{9}}{9!}}\\cdots ,&\\epsilon \\neq 1\\end{cases}}}\n  \n\n\n\n\nAlternatively, Kepler's Equation can be solved numerically.  First one must guess a value of \n  \n    \n      \n        E\n      \n    \n    {\\displaystyle E}\n  \n and solve for time-of-flight; then adjust \n  \n    \n      \n        E\n      \n    \n    {\\displaystyle E}\n  \n as necessary to bring the computed time-of-flight closer to the desired value until the required precision is achieved.  Usually, Newton's method is used to achieve relatively fast convergence.\n\nThe main difficulty with this approach is that it can take prohibitively long to converge for the extreme elliptical orbits.  For near-parabolic orbits, eccentricity \n  \n    \n      \n        ϵ\n      \n    \n    {\\displaystyle \\epsilon }\n  \n is nearly 1, and plugging \n  \n    \n      \n        e\n        =\n        1\n      \n    \n    {\\displaystyle e=1}\n  \n into the formula for mean anomaly, \n  \n    \n      \n        E\n        −\n        sin\n        ⁡\n        E\n      \n    \n    {\\displaystyle E-\\sin E}\n  \n, we find ourselves subtracting two nearly-equal values, and accuracy suffers.  For near-circular orbits, it is hard to find the periapsis in the first place (and truly circular orbits have no periapsis at all).  Furthermore, the equation was derived on the assumption of an elliptical orbit, and so it does not hold for parabolic or hyperbolic orbits.  These difficulties are what led to the development of the universal variable formulation, described below.\n\n\nConic orbits[edit]\n\nFor simple procedures, such as computing the delta-v for coplanar transfer ellipses, traditional approaches[clarification needed] are fairly effective. Others, such as time-of-flight are far more complicated, especially for near-circular and hyperbolic orbits.\n\n\nThe patched conic approximation[edit]\n\nMain article: Patched conic approximation\n\nThe Hohmann transfer orbit alone is a poor approximation for interplanetary trajectories because it neglects the planets' own gravity.  Planetary gravity dominates the behaviour of the spacecraft in the vicinity of a planet and in most cases Hohmann severely overestimates delta-v, and produces highly inaccurate prescriptions for burn timings.\n\nA relatively simple way to get a first-order approximation of delta-v is based on the 'Patched Conic Approximation' technique. One must choose the one dominant gravitating body in each region of space through which the trajectory will pass, and to model only that body's effects in that region.  For instance, on a trajectory from the Earth to Mars, one would begin by considering only the Earth's gravity until the trajectory reaches a distance where the Earth's gravity no longer dominates that of the Sun.  The spacecraft would be given escape velocity to send it on its way to interplanetary space.  Next, one would consider only the Sun's gravity until the trajectory reaches the neighbourhood of Mars.  During this stage, the transfer orbit model is appropriate.  Finally, only Mars's gravity is considered during the final portion of the trajectory where Mars's gravity dominates the spacecraft's behaviour.  The spacecraft would approach Mars on a hyperbolic orbit, and a final retrograde burn would slow the spacecraft enough to be captured by Mars.\n\nThe size of the \"neighborhoods\" (or spheres of influence) vary with radius \n  \n    \n      \n        \n          r\n          \n            S\n            O\n            I\n          \n        \n      \n    \n    {\\displaystyle r_{SOI}}\n  \n:\n\n\n\t\n  \n    \n      \n        \n          r\n          \n            S\n            O\n            I\n          \n        \n        =\n        \n          a\n          \n            p\n          \n        \n        \n          \n            (\n            \n              \n                \n                  m\n                  \n                    p\n                  \n                \n                \n                  m\n                  \n                    s\n                  \n                \n              \n            \n            )\n          \n          \n            2\n            \n              /\n            \n            5\n          \n        \n      \n    \n    {\\displaystyle r_{SOI}=a_{p}\\left({\\frac {m_{p}}{m_{s}}}\\right)^{2/5}}\n  \n\n\n\nwhere \n  \n    \n      \n        \n          a\n          \n            p\n          \n        \n      \n    \n    {\\displaystyle a_{p}}\n  \n is the semimajor axis of the planet's orbit relative to the Sun; \n  \n    \n      \n        \n          m\n          \n            p\n          \n        \n      \n    \n    {\\displaystyle m_{p}}\n  \n and \n  \n    \n      \n        \n          m\n          \n            s\n          \n        \n      \n    \n    {\\displaystyle m_{s}}\n  \n are the masses of the planet and Sun, respectively.\n\nThis simplification is sufficient to compute rough estimates of fuel requirements, and rough time-of-flight estimates, but it is not generally accurate enough to guide a spacecraft to its destination.  For that, numerical methods are required.\n\n\nThe universal variable formulation[edit]\n\nTo address computational shortcomings of traditional approaches for solving the 2-body problem, the universal variable formulation was developed.  It works equally well for the circular, elliptical, parabolic, and hyperbolic cases, the differential equations converging well when integrated for any orbit.  It also generalizes well to problems incorporating perturbation theory.\n\n\nPerturbations[edit]\n\nThe universal variable formulation works well with the variation of parameters technique, except now, instead of the six Keplerian orbital elements, we use a different set of orbital elements: namely, the satellite's initial position and velocity vectors \n  \n    \n      \n        \n          x\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle x_{0}}\n  \n and \n  \n    \n      \n        \n          v\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle v_{0}}\n  \n at a given epoch \n  \n    \n      \n        t\n        =\n        0\n      \n    \n    {\\displaystyle t=0}\n  \n.  In a two-body simulation, these elements are sufficient to compute the satellite's position and velocity at any time in the future, using the universal variable formulation.  Conversely, at any moment in the satellite's orbit, we can measure its position and velocity, and then use the universal variable approach to determine what its initial position and velocity would have been at the epoch.  In perfect two-body motion, these orbital elements would be invariant (just like the Keplerian elements would be).\n\nHowever, perturbations cause the orbital elements to change over time.  Hence, we write the position element as \n  \n    \n      \n        \n          x\n          \n            0\n          \n        \n        (\n        t\n        )\n      \n    \n    {\\displaystyle x_{0}(t)}\n  \n and the velocity element as \n  \n    \n      \n        \n          v\n          \n            0\n          \n        \n        (\n        t\n        )\n      \n    \n    {\\displaystyle v_{0}(t)}\n  \n, indicating that they vary with time.  The technique to compute the effect of perturbations becomes one of finding expressions, either exact or approximate, for the functions \n  \n    \n      \n        \n          x\n          \n            0\n          \n        \n        (\n        t\n        )\n      \n    \n    {\\displaystyle x_{0}(t)}\n  \n and \n  \n    \n      \n        \n          v\n          \n            0\n          \n        \n        (\n        t\n        )\n      \n    \n    {\\displaystyle v_{0}(t)}\n  \n.\n\nThe following are some effects which make real orbits differ from the simple models based on a spherical earth.  Most of them can be handled on short timescales (perhaps less than a few thousand orbits) by perturbation theory because they are small relative to the corresponding two-body effects.\n\n\n\tEquatorial bulges cause precession of the node and the perigee\n\tTesseral harmonics[3] of the gravity field introduce additional perturbations\n\tLunar and solar gravity perturbations alter the orbits\n\tAtmospheric drag reduces the semi-major axis unless make-up thrust is used\n\n\nOver very long timescales (perhaps millions of orbits), even small perturbations can dominate, and the behaviour can become chaotic. On the other hand, the various perturbations can be orchestrated by clever astrodynamicists to assist with orbit maintenance tasks, such as station-keeping, ground track maintenance or adjustment, or phasing of perigee to cover selected targets at low altitude.\n\n\nOrbital maneuver[edit]\n\nMain article: Orbital maneuver\n\nIn spaceflight, an orbital maneuver is the use of propulsion systems to change the orbit of a spacecraft. For spacecraft far from Earth—for example those in orbits around the Sun—an orbital maneuver is called a deep-space maneuver (DSM).[not verified in body]\n\n\nOrbital transfer[edit]\n\nTransfer orbits are usually elliptical orbits that allow spacecraft to move from one (usually substantially circular) orbit to another.  Usually they require a burn at the start, a burn at the end, and sometimes one or more burns in the middle.\n\n\n\tThe Hohmann transfer orbit requires a minimal delta-v.\n\tA bi-elliptic transfer can require less energy than the Hohmann transfer, if the ratio of orbits is 11.94 or greater,[4] but comes at the cost of increased trip time over the Hohmann transfer.\n\tFaster transfers may use any orbit that intersects both the original and destination orbits, at the cost of higher delta-v.\n\tUsing low thrust engines (such as electrical propulsion), if the initial orbit is supersynchronous to the final desired circular orbit then the optimal transfer orbit is achieved by thrusting continuously in the direction of the velocity at apogee. This method however takes much longer due to the low thrust.[5]\n\n\nFor the case of orbital transfer between non-coplanar orbits, the change-of-plane thrust must be made at the point where the orbital planes intersect (the \"node\"). As the objective is to change the direction of the velocity vector by an angle equal to the angle between the planes, almost all of this thrust should be made when the spacecraft is at the node near the apoapse, when the magnitude of the velocity vector is at its lowest. However, a small fraction of the orbital inclination change can be made at the node near the periapse, by slightly angling the transfer orbit injection thrust in the direction of the desired inclination change. This works because the cosine of a small angle is very nearly one, resulting in the small plane change being effectively \"free\" despite the high velocity of the spacecraft near periapse, as the Oberth Effect due to the increased, slightly angled thrust exceeds the cost of the thrust in the orbit-normal axis.\n\n\n\nA Hohmann transfer from a low circular orbit to a higher circular orbit\n\n\nA bi-elliptic transfer from a low circular starting orbit (dark blue), to a higher circular orbit (red)\n\n\nGeneric two-impulse elliptical transfer between two circular orbits\n\n\nA general transfer from a low circular orbit to a higher circular orbit\n\n\nAn optimal sequence for transferring a satellite from a supersynchronous to a geosynchronous orbit using electric propulsion\n\n\n\n\n\n\nGravity assist and the Oberth effect[edit]\n\nIn a gravity assist, a spacecraft swings by a planet and leaves in a different direction, at a different speed.  This is useful to speed or slow a spacecraft instead of carrying more fuel.\n\nThis maneuver can be approximated by an elastic collision at large distances, though the flyby does not involve any physical contact.  Due to Newton's Third Law (equal and opposite reaction), any momentum gained by a spacecraft must be lost by the planet, or vice versa.  However, because the planet is much, much more massive than the spacecraft, the effect on the planet's orbit is negligible.\n\nThe Oberth effect can be employed, particularly during a gravity assist operation. This effect is that use of a propulsion system works better at high speeds, and hence course changes are best done when close to a gravitating body; this can multiply the effective delta-v.\n\n\nInterplanetary Transport Network and fuzzy orbits[edit]\n\nMain article: Interplanetary Transport Network\n\nSee also: Low energy transfers\n\nIt is now possible to use computers to search for routes using the nonlinearities in the gravity of the planets and moons of the Solar System. For example, it is possible to plot an orbit from high earth orbit to Mars, passing close to one of the Earth's Trojan points.[citation needed] Collectively referred to as the Interplanetary Transport Network, these highly perturbative, even chaotic, orbital trajectories in principle need no fuel beyond that needed to reach the Lagrange point (in practice keeping to the trajectory requires some course corrections). The biggest problem with them is they can be exceedingly slow, taking many years. In addition launch windows can be very far apart.\n\nThey have, however, been employed on projects such as Genesis. This spacecraft visited the Earth-Sun L1 point and returned using very little propellant.\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\n\tAerodynamics\n\tAerospace Engineering\n\tAstrophysics\n\tCanonical units\n\tCelestial mechanics\n\tChaos theory\n\tKepler orbit\n\tLagrangian point\n\tMechanical Engineering\n\tN-body problem\n\tOrbit\n\tOrders of magnitude (speed)\n\tRoche limit\n\tSpacecraft propulsion\n\tTsiolkovsky rocket equation\n\tUniversal variable formulation\n\n\n\n\nReferences[edit]\n\n\n\t^ Thomson, William T. (1961). Introduction to Space Dynamics. New York: Wiley.\n\n\t^ Bate, R. R.; Mueller, D. D.; White, J. E. (1971). Fundamentals of Astrodynamics. Courier Corporation. p. 5. ISBN 978-0-486-60061-1.\n\n\n\t^ Weisstein, Eric W. \"Tesseral Harmonic\". MathWorld. Retrieved 2019-10-07.\n\n\n\t^ Vallado, David Anthony (2001). Fundamentals of Astrodynamics and Applications. Springer. p. 317. ISBN 0-7923-6903-3.\n\n\n\t^ Spitzer, Arnon (1997). Optimal Transfer Orbit Trajectory using Electric Propulsion. USPTO.\n\n\n\n\n\n\n\tCurtis, Howard D., (2009). Orbital Mechanics for Engineering Students, 2e. New York: Elsevier. ISBN 978-0-12-374778-5.CS1 maint: extra punctuation (link) CS1 maint: multiple names: authors list (link)\n\n\tBate, Roger R.; Mueller, Donald D.; White, Jerry E. (1971). Fundamentals of Astrodynamics. New York: Dover Publications. ISBN 0-486-60061-0.\n\n\n\n\tSellers, Jerry J.; Astore, William J.; Giffen, Robert B.; Larson, Wiley J. (2004).  Kirkpatrick, Douglas H. (ed.). Understanding Space: An Introduction to Astronautics (2 ed.). McGraw Hill. p. 228. ISBN 0-07-242468-0.\n\n\n\n\t\"Air University Space Primer, Chapter 8 - Orbital Mechanics\" (PDF). USAF.\n\n\n\nFurther reading[edit]\n\nMany of the options, procedures, and supporting theory are covered in standard works such as:\n\n\n\tBate, R.R.; Mueller, D.D.; White, J.E., (1971). Fundamentals of Astrodynamics. Dover Publications, New York. ISBN 978-0-486-60061-1.CS1 maint: extra punctuation (link) CS1 maint: multiple names: authors list (link)\n\n\tVallado, D. A. (2001). Fundamentals of Astrodynamics and Applications (2nd ed.). Springer. ISBN 978-0-7923-6903-5.\n\n\tBattin, R.H. (1999). An Introduction to the Mathematics and Methods of Astrodynamics. American Institute of Aeronautics & Ast, Washington, D.C. ISBN 978-1-56347-342-5.\n\n\tChobotov, V.A., ed. (2002). Orbital Mechanics (3rd ed.). American Institute of Aeronautics & Ast, Washington, D.C. ISBN 978-1-56347-537-5.\n\n\tHerrick, S. (1971). Astrodynamics: Orbit Determination, Space Navigation, Celestial Mechanics, Volume 1. Van Nostrand Reinhold, London. ISBN 978-0-442-03370-5.\n\n\tHerrick, S. (1972). Astrodynamics: Orbit Correction, Perturbation Theory, Integration, Volume 2. Van Nostrand Reinhold, London. ISBN 978-0-442-03371-2.\n\n\tKaplan, M.H. (1976). Modern Spacecraft Dynamics and Controls. Wiley, New York. ISBN 978-0-471-45703-9.\n\n\tTom Logsdon (1997). Orbital Mechanics. Wiley-Interscience, New York. ISBN 978-0-471-14636-0.\n\n\tJohn E. Prussing & Bruce A. Conway (1993). Orbital Mechanics. Oxford University Press, New York. ISBN 978-0-19-507834-3.\n\n\tM.J. Sidi (2000). Spacecraft Dynamics and Control. Cambridge University Press, New York. ISBN 978-0-521-78780-2.\n\n\tW.E. Wiesel (1996). Spaceflight Dynamics (2nd ed.). McGraw-Hill, New York. ISBN 978-0-07-070110-6.\n\n\tJ.P. Vinti (1998). Orbital and Celestial Mechanics. American Institute of Aeronautics & Ast, Reston, Virginia. ISBN 978-1-56347-256-5.\n\n\tP. Gurfil (2006). Modern Astrodynamics. Butterworth-Heinemann. ISBN 978-0-12-373562-1.\n\n\n\nExternal links[edit]\n\n\tORBITAL MECHANICS (Rocket and Space Technology)\n\tJava Astrodynamics Toolkit\n\tAstrodynamics-based Space Traffic and Event Knowledge Graph\n\n\n\t\tv\n\tt\n\te\n\n\nMajor subfields of astronomy\n\n\t\n\tAstrobiology\n\tAstrochemistry\n\tAstrometry\n\tastrophysics\n\tCosmochemistry\n\tCosmology\n\tExtragalactic astronomy\n\tGalactic astronomy\n\tOrbital mechanics\n\tPhysical cosmology\n\tPlanetary geology\n\tPlanetary science\n\tSolar astronomy\n\tStellar astronomy\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nGravitational orbits\n\n\tTypes\t\n\tGeneral\t\n\tBox\n\tCapture\n\tCircular\n\tElliptical / Highly elliptical\n\tEscape\n\tHorseshoe\n\tHyperbolic trajectory\n\tInclined / Non-inclined\n\tLagrangian point\n\tOsculating\n\tParabolic trajectory\n\tParking\n\tSynchronous\n\tsemi\n\tsub\n\n\n\tTransfer orbit\n\n\n\n\n\tGeocentric\t\n\tGeosynchronous\n\tGeostationary\n\tGeostationary transfer\n\n\n\tGraveyard\n\tHigh Earth\n\tLow Earth\n\tMedium Earth\n\tMolniya\n\tNear-equatorial\n\tOrbit of the Moon\n\tPolar\n\tSun-synchronous\n\tTundra\n\n\n\n\n\tAbout other points\t\n\tMars\n\tAreosynchronous\n\tAreostationary\n\n\n\tLagrange points\n\tHalo\n\tLissajous\n\n\n\tLunar\n\tSun\n\tHeliocentric\n\tEarth's orbit\n\n\n\tHeliosynchronous\n\n\n\n\n\n\n\n\n\n\tParameters\t\n\t\tShape\n\tSize\n\n\n\t\n\te  Eccentricity\n\ta  Semi-major axis\n\tb  Semi-minor axis\n\tQ, q  Apsides\n\n\n\n\n\tOrientation\t\n\ti  Inclination\n\tΩ  Longitude of the ascending node\n\tω  Argument of periapsis\n\tϖ  Longitude of the periapsis\n\n\n\n\n\tPosition\t\n\tM  Mean anomaly\n\tν, θ, f  True anomaly\n\tE  Eccentric anomaly\n\tL  Mean longitude\n\tl  True longitude\n\n\n\n\n\tVariation\t\n\tT  Orbital period\n\tn  Mean motion\n\tv  Orbital speed\n\tt0  Epoch\n\n\n\n\n\n\n\n\tManeuvers\t\n\tBi-elliptic transfer\n\tCollision avoidance (spacecraft)\n\tDelta-v\n\tDelta-v budget\n\tGravity assist\n\tGravity turn\n\tHohmann transfer\n\tInclination change\n\tLow energy transfer\n\tOberth effect\n\tPhasing\n\tRocket equation\n\tRendezvous\n\tTransposition, docking, and extraction\n\n\n\n\n\tOrbital mechanics\t\n\tCelestial coordinate system\n\tCharacteristic energy\n\tEscape velocity\n\tEphemeris\n\tEquatorial coordinate system\n\tGround track\n\tHill sphere\n\tInterplanetary Transport Network\n\tKepler's laws of planetary motion\n\tLagrangian point\n\tn-body problem\n\tOrbit equation\n\tOrbital state vectors\n\tPerturbation\n\tRetrograde motion\n\tSpecific orbital energy\n\tSpecific relative angular momentum\n\tTwo-line elements\n\n\n\n\n\t\n\tList of orbits\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpaceflight\n\n\tGeneral\t\n\tAstrodynamics\n\tHistory\n\tTimeline\n\tSpace Race\n\tAsian Space Race\n\tRecords\n\tAccidents and incidents\n\n\n\tSpace policy\n\tAustralia\n\tChina\n\tEuropean Union\n\tIndia\n\tJapan\n\tRussia\n\tSoviet Union\n\tUnited States\n\n\n\tSpace law\n\tOuter Space Treaty\n\tRescue Agreement\n\tSpace Liability Convention\n\tRegistration Convention\n\tMoon Treaty\n\n\n\tPrivate spaceflight\n\n\n\n\t\n\n\tApplications\t\n\tAstronomy\n\tEarth observation\n\tArchaeology\n\tImagery and mapping\n\tReconnaissance\n\tWeather and environment monitoring\n\n\n\tSatellite communications\n\tInternet\n\tRadio\n\tTelephone\n\tTelevision\n\n\n\tSatellite navigation\n\tCommercial use of space\n\tSpace launch market competition\n\tMilitarisation of space\n\tSpace architecture\n\tSpace exploration\n\tSpace research\n\tSpace technology\n\tSpace weather\n\n\n\n\n\tHuman spaceflight\t\n\tGeneral\t\n\tAstronaut\n\tcommercial\n\n\n\tLife support system\n\tAnimals in space\n\tBioastronautics\n\tSpace suit\n\n\n\tExtravehicular activity\n\tWeightlessness\n\tSpace toilet\n\tSpace tourism\n\tSpace colonization\n\n\n\n\n\tPrograms\t\n\tVostok\n\tMercury\n\tVoskhod\n\tGemini\n\tSoyuz\n\tApollo\n\tSkylab\n\tApollo–Soyuz\n\n\n\tSpace Shuttle\n\tMir\n\tShuttle–Mir\n\n\n\tInternational Space Station\n\tShenzhou\n\tTiangong\n\n\n\n\n\tHealth issues\t\n\tEffect of spaceflight on the human body\n\tSpace adaptation syndrome\n\n\n\tHealth threat from cosmic rays\n\tSpace psychology\n\tPsychological and sociological effects\n\n\n\tSpace and survival\n\tSpace medicine\n\tSpace nursing\n\n\n\n\n\n\n\n\tSpacecraft\t\n\tLaunch vehicle\n\tRocket\n\tSpaceplane\n\tRobotic spacecraft\n\tSatellite\n\tSpace probe\n\tLander\n\tRover\n\tSelf-replicating spacecraft\n\tSpace telescope\n\n\n\tSpacecraft propulsion\n\tRocket engine\n\tElectric propulsion\n\tSolar sail\n\tGravity assist\n\n\n\n\n\n\n\tDestinations\t\n\tSub-orbital\n\tOrbital\n\tGeocentric\n\tGeosynchronous\n\n\n\tInterplanetary\n\tInterstellar\n\tIntergalactic\n\n\n\n\n\tSpace launch\t\n\tDirect ascent\n\tEscape velocity\n\tExpendable and reusable launch systems\n\tLaunch pad\n\tNon-rocket spacelaunch\n\tSpaceport\n\n\n\n\n\tGround segment\t\n\tFlight controller\n\tGround station\n\tPass\n\tMission control center\n\n\n\n\n\tSpace agencies\t\n\t CoNAE\n\t ASA\n\t AEB\n\t CSA\n\t CNSA\n\t ESA\n\t CNES\n\t DLR\n\t ISRO\n\t LAPAN\n\t ISA\n\t ISA\n\t ASI\n\t AEM\n\t JAXA\n\t NADA\n\t KARI\n\t SUPARCO\n\t Roscosmos\n\t SNSA\n\t SSAU\n\t UKSA\n\t NASA\n\n\n\n\n\t\n\t  Category\n\t  Portal\n\t  WikiProject\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Orbital_mechanics&oldid=920048713\"\n\n\t\t\n\t\tCategories: \tAstrodynamics\n\n\nHidden categories: \tArticles lacking in-text citations from February 2010\n\tAll articles lacking in-text citations\n\tArticles to be expanded from August 2008\n\tAll articles to be expanded\n\tArticles using small message boxes\n\tWikipedia articles needing clarification from February 2009\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from September 2011\n\tArticles with unsourced statements from January 2016\n\tCS1 maint: extra punctuation\n\tCS1 maint: multiple names: authors list\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\tWikibooks\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tAsturianu\n\tБеларуская\n\tБългарски\n\tBrezhoneg\n\tCatalà\n\tDeutsch\n\tEspañol\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tBahasa Indonesia\n\tItaliano\n\tҚазақша\n\tКыргызча\n\tNederlands\n\t日本語\n\tOʻzbekcha/ўзбекча\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tTagalog\n\tТоҷикӣ\n\tTürkçe\n\tУкраїнська\n\tاردو\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 7 October 2019, at 11:14 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "66", "dc:title": "Orbital mechanics - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.25", "og:image": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Orbital_motion.gif", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-orbital_mechanics", "title": "Orbital mechanics - Wikipedia"}}