{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nParabolic antenna - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tParabolic antenna\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nA large parabolic satellite communications antenna at Erdfunkstelle Raisting, the biggest facility for satellite communication in the world, in Raisting, Bavaria, Germany. It has a Cassegrain type feed.\n\n\n\nA parabolic antenna is an antenna that uses a parabolic reflector, a curved surface with the cross-sectional shape of a parabola, to direct the radio waves. The most common form is shaped like a dish and is popularly called a dish antenna or parabolic dish. The main advantage of a parabolic antenna is that it has high directivity. It functions similarly to a searchlight or flashlight reflector to direct the radio waves in a narrow beam, or receive radio waves from one particular direction only. Parabolic antennas have some of the highest gains, meaning that they can produce the narrowest beamwidths, of any antenna type.[1][2] In order to achieve narrow beamwidths, the parabolic reflector must be much larger than the wavelength of the radio waves used,[2] so parabolic antennas are used in the high frequency part of the radio spectrum, at UHF and microwave (SHF) frequencies, at which the wavelengths are small enough that conveniently-sized reflectors can be used.\n\nParabolic antennas are used as high-gain antennas for point-to-point communications, in applications such as microwave relay links that carry telephone and television signals between nearby cities, wireless WAN/LAN links for data communications,  satellite communications and spacecraft communication antennas. They are also used in radio telescopes.\n\nThe other large use of parabolic antennas is for radar antennas, in which there is a need to transmit a narrow beam of radio waves to locate objects like ships, airplanes, and guided missiles, and often for weather detection.[2] With the advent of home satellite television receivers, parabolic antennas have become a common feature of the landscapes of modern countries.[2]\n\nThe parabolic antenna was invented by German physicist Heinrich Hertz during his discovery of radio waves in 1887.  He used cylindrical parabolic reflectors with spark-excited dipole antennas at their focus for both transmitting and receiving during his historic experiments.\n\n\n  \nParabolic antennas are based on the geometrical property of the paraboloid that the paths FP1Q1, FP2Q2, FP3Q3 are all the same length.  So a spherical wavefront emitted by a feed antenna at the dish's focus F will be reflected into an outgoing plane wave L travelling parallel to the dish's axis VF.\n\n\n\nContents\n\n\n\t1 Design\n\t1.1 Parabolic reflector\n\t1.2 Feed antenna\n\n\n\n\t2 Types\n\t3 Feed pattern\n\t3.1 Polarization\n\t3.2 Dual reflector shaping\n\n\n\n\t4 History\n\t5 Gain\n\t6 Radiation pattern\n\t6.1 Beamwidth\n\t6.2 Radiation pattern formula\n\n\n\n\t7 See also\n\t8 References\n\t9 External links\n\n\n\n\n\nDesign[edit]\n\nThe operating principle of a parabolic antenna is that a point source of radio waves at the focal point in front of a paraboloidal reflector of conductive material will be reflected into a collimated plane wave beam along the axis of the reflector. Conversely, an incoming plane wave parallel to the axis will be focused to a point at the focal point.\n\nA typical parabolic antenna consists of a metal parabolic reflector with a small feed antenna suspended in front of the reflector at its focus,[2] pointed back toward the reflector. The reflector is a metallic surface formed into a paraboloid of revolution and usually truncated in a circular rim that forms the diameter of the antenna.[2]  In a transmitting antenna, radio frequency current from a transmitter is supplied through a transmission line cable to the feed antenna, which converts it into radio waves.  The radio waves are emitted back toward the dish by the feed antenna and reflect off the dish into a parallel beam. In a receiving antenna the incoming radio waves bounce off the dish and are focused to a point at the feed antenna, which converts them to electric currents which travel through a transmission line to the radio receiver.\n\n\nParabolic reflector[edit]\n\n  \nWire grid-type parabolic antenna used for MMDS data link at a frequency of 2.5-2.7 GHz. It is fed by a vertical dipole under the small aluminum reflector on the boom.  It radiates vertically polarized microwaves.\n\n\n\nThe reflector can be of sheet metal, metal screen, or wire grill construction, and it can be either a circular \"dish\" or various other shapes to create different beam shapes. A metal screen reflects radio waves as well as a solid metal surface as long as the holes are smaller than one-tenth of a wavelength, so screen reflectors are often used to reduce weight and wind loads on the dish. To achieve the maximum gain, it is necessary that the shape of the dish be accurate within a small fraction of a wavelength, to ensure the waves from different parts of the antenna arrive at the focus in phase.  Large dishes often require a supporting truss structure behind them to provide the required stiffness.\n\nA reflector made of a grill of parallel wires or bars oriented in one direction acts as a polarizing filter as well as a reflector. It only reflects linearly polarized radio waves, with the electric field parallel to the grill elements. This type is often used in radar antennas. Combined with a linearly polarized feed horn, it helps filter out noise in the receiver and reduces false returns.\n\nSince a shiny metal parabolic reflector can also focus the sun's rays, and most dishes could concentrate enough solar energy on the feed structure to severely overheat it if they happened to be pointed at the sun, solid reflectors are always given a coat of flat paint.\n\n\nFeed antenna[edit]\n\nThe feed antenna at the reflector's focus is typically a low-gain type such as a half-wave dipole or more often a small horn antenna called a feed horn.  In more complex designs, such as the Cassegrain and Gregorian, a secondary reflector is used to direct the energy into the parabolic reflector from a feed antenna located away from the primary focal point.  The feed antenna is connected to the associated radio-frequency (RF) transmitting or receiving equipment by means of a coaxial cable transmission line or waveguide.\n\nAt the microwave frequencies used in many parabolic antennas,  waveguide is required to conduct the microwaves between the feed antenna and transmitter or receiver.  Because of the high cost of waveguide runs, in many parabolic antennas the RF front end electronics of the receiver is located at the feed antenna, and the received signal is converted to a lower intermediate frequency (IF) so it can be conducted to the receiver through cheaper coaxial cable.  This is called a low-noise block downconverter.  Similarly, in transmitting dishes, the microwave transmitter may be located at the feed point.\n\nAn advantage of parabolic antennas is that most of the structure of the antenna (all of it except the feed antenna) is nonresonant, so it can function over a wide range of frequencies, that is a wide bandwidth. All that is necessary to change the frequency of operation is to replace the feed antenna with one that works at the new frequency. Some parabolic antennas transmit or receive at multiple frequencies by having several feed antennas mounted at the focal point, close together.\n\n\nDish parabolic antennas\n\n\nShrouded microwave relay dishes on a communications tower in Australia.\n\n\nA satellite television dish, an example of an offset fed dish.\n\n\nCassegrain satellite communication antenna in Sweden.\n\n\nOffset Gregorian antenna used in the Allen Telescope Array, a radio telescope at the University of California Berkeley, US.\n\n\n\n\n\n\nShaped-beam parabolic antennas\n\n\nVertical \"orange peel\" antenna for military height finder radar, Germany.\n\n\nEarly cylindrical parabolic antenna, 1931, Nauen, Germany.\n\n\nAir traffic control radar antenna, near Hannover, Germany.\n\n\nASR-9 Airport surveillance radar antenna.\n\n\n\"Orange peel\" antenna for air search radar, Finland.\n\n\n\n\n\nTypes[edit]\n\n  \nMain types of parabolic antenna feeds.\n\n\n\nParabolic antennas are distinguished by their shapes:\n\n\n\tParaboloidal or dish – The reflector is shaped like a paraboloid truncated in a circular rim. This is the most common type. It radiates a narrow pencil-shaped beam along the axis of the dish.\n\tShrouded dish – Sometimes a cylindrical metal shield is attached to the rim of the dish.[3] The shroud shields the antenna from radiation from angles outside the main beam axis, reducing the sidelobes. It is sometimes used to prevent interference in terrestrial microwave links, where several antennas using the same frequency are located close together. The shroud is coated inside with microwave absorbent material. Shrouds can reduce back lobe radiation by 10 dB.[3]\n\n\n\tCylindrical – The reflector is curved in only one direction and flat in the other. The radio waves come to a focus not at a point but along a line. The feed is sometimes a dipole antenna located along the focal line. Cylindrical parabolic antennas radiate a fan-shaped beam, narrow in the curved dimension, and wide in the uncurved dimension. The curved ends of the reflector are sometimes capped by flat plates, to prevent radiation out the ends, and this is called a pillbox antenna.\n\tShaped-beam antennas – Modern reflector antennas can be designed to produce a beam or beams of a particular shape, rather than just the narrow \"pencil\" or \"fan\" beams of the simple dish and cylindrical antennas above.[4] Two techniques are used, often in combination, to control the shape of the beam:\n\tShaped reflectors – The parabolic reflector can be given a noncircular shape, and/or different curvatures in the horizontal and vertical directions, to alter the shape of the beam. This is often used in radar antennas. As a general principle, the wider the antenna is in a given transverse direction, the narrower the radiation pattern will be in that direction.\n\t\"Orange peel\" antenna – Used in search radars, this is a long narrow antenna shaped like the letter \"C\". It radiates a narrow vertical fan shaped beam.\n\n\n\n\n\n\n  \nArray of multiple feed horns on a German airport surveillance radar antenna to control the elevation angle of the beam\n\n\n\n\t\tArrays of feeds – In order to produce an arbitrary shaped beam, instead of one feed horn, an array of feed horns clustered around the focal point can be used. Array-fed antennas are often used on communication satellites, particularly direct broadcast satellites, to create a downlink radiation pattern to cover a particular continent or coverage area. They are often used with secondary reflector antennas such as the Cassegrain.\n\n\n\n\nParabolic antennas are also classified by the type of feed, that is, how the radio waves are supplied to the antenna:[3]\n\n\n\tAxial, prime focus, or front feed – This is the most common type of feed, with the feed antenna located in front of the dish at the focus, on the beam axis, pointed back toward the dish.  A disadvantage of this type is that the feed and its supports block some of the beam, which limits the aperture efficiency to only 55–60%.[3]\n\tOff-axis or offset feed – The reflector is an asymmetrical segment of a paraboloid, so the focus, and the feed antenna, are located to one side of the dish. The purpose of this design is to move the feed structure out of the beam path, so it does not block the beam. It is widely used in home satellite television dishes, which are small enough that the feed structure would otherwise block a significant percentage of the signal. Offset feed can also be used in multiple reflector designs such as the Cassegrain and Gregorian, below.\n\tCassegrain – In a Cassegrain antenna, the feed is located on or behind the dish, and radiates forward, illuminating a convex hyperboloidal secondary reflector at the focus of the dish. The radio waves from the feed reflect back off the secondary reflector to the dish, which reflects them forward again, forming the outgoing beam. An advantage of this configuration is that the feed, with its waveguides and \"front end\" electronics does not have to be suspended in front of the dish, so it is used for antennas with complicated or bulky feeds, such as large satellite communication antennas and radio telescopes. Aperture efficiency is on the order of 65–70%[3]\n\tGregorian – Similar to the Cassegrain design except that the secondary reflector is concave, (ellipsoidal) in shape. Aperture efficiency over 70% can be achieved.[3]\n\n\nFeed pattern[edit]\n\n  \nEffect of the feed antenna radiation pattern (small pumpkin-shaped surface)  on spillover.  Left: With a low gain feed antenna, significant parts of its radiation fall outside the dish.  Right: With a higher gain feed, almost all its radiation is emitted within the angle of the dish.\n\n\n   \nThe radiation pattern of the feed antenna has to be tailored to the shape of the dish, because it has a strong influence on the aperture efficiency, which determines the antenna gain (see Gain section below).  Radiation from the feed that falls outside the edge of the dish is called \"spillover\" and is wasted, reducing the gain and increasing the backlobes, possibly causing interference or (in receiving antennas) increasing susceptibility to ground noise.  However, maximum gain is only achieved when the dish is uniformly \"illuminated\" with a constant field strength to its edges.   So the ideal radiation pattern of a feed antenna would be a constant field strength throughout the solid angle of the dish, dropping abruptly to zero at the edges.  However, practical feed antennas have radiation patterns that drop off gradually at the edges, so the feed antenna is a compromise between acceptably low spillover and adequate illumination.  For most front feed horns, optimum illumination is achieved when the power radiated by the feed horn is 10 dB less at the dish edge than its maximum value at the center of the dish.[5]\n\n\nPolarization[edit]\n\nThe pattern of electric and magnetic fields at the mouth of a parabolic antenna is simply a scaled up image of the fields radiated by the feed antenna, so the polarization is determined by the feed antenna.  In order to achieve maximum gain, the feed antenna in the transmitting and receiving antenna must have the same polarization. \n[6]  For example, a vertical dipole feed antenna will radiate a beam of radio waves with their electric field vertical, called vertical polarization.  The receiving feed antenna must also have vertical polarization to receive them;  if the feed is horizontal (horizontal polarization) the antenna will suffer a severe loss of gain.\n\nTo increase the data rate, some parabolic antennas transmit two separate radio channels on the same frequency with orthogonal polarizations, using separate feed antennas; this is called a dual polarization antenna.  For example, satellite television signals are transmitted from the satellite on two separate channels at the same frequency using right and left circular polarization.  In a home satellite dish, these are received by two small monopole antennas in the feed horn, oriented at right angles.  Each antenna is connected to a separate receiver.\n\nIf the signal from one polarization channel is received by the oppositely polarized antenna, it will cause crosstalk that degrades the signal-to-noise ratio.  The ability of an antenna to keep these orthogonal channels separate is measured by a parameter called cross polarization discrimination (XPD).  In a transmitting antenna, XPD is the fraction of power from an antenna of one polarization radiated in the other polarization.  For example, due to minor imperfections a dish with a vertically polarized feed antenna will radiate a small amount of its power in horizontal polarization; this fraction is the XPD.  In a receiving antenna, the XPD is the ratio of signal power received of the opposite polarization to power received in the same antenna of the correct polarization, when the antenna is illuminated by two orthogonally polarized radio waves of equal power.  If the antenna system has inadequate XPD, cross polarization interference cancelling  (XPIC) digital signal processing algorithms can often be used to decrease crosstalk.\n\n\nDual reflector shaping[edit]\n\nIn the Cassegrain and Gregorian antennas, the presence of two reflecting surfaces in the signal path offers additional possibilities for improving performance.  When the highest performance is required, a technique called \"dual reflector shaping\" may be used.  This involves changing the shape of the sub-reflector to direct more signal power to outer areas of the dish, to map the known pattern of the feed into a uniform illumination of the primary, to maximize the gain. However, this results in a secondary that is no longer precisely hyperbolic (though it is still very close), so the constant phase property is lost.  This phase error, however, can be compensated for by slightly tweaking the shape of the primary mirror.   The result is a higher gain, or gain/spillover ratio, at the cost of surfaces that are trickier to fabricate and test.[7][8]  Other dish illumination patterns can also be synthesized, such as patterns with high taper at the dish edge for ultra-low spillover sidelobes, and patterns with a central \"hole\" to reduce feed shadowing.\n\n\nHistory[edit]\n\n  \nThe first parabolic antenna, built by Heinrich Hertz in 1888.\n\n\n\nThe idea of using parabolic reflectors for radio antennas was taken from optics, where the power of a parabolic mirror to focus light into a beam has been known since classical antiquity.  The designs of some specific types of parabolic antenna, such as the Cassegrain and Gregorian, come from similarly named analogous types of reflecting telescope, which were invented by astronomers during the 15th century.[9][2]\n\nGerman physicist Heinrich Hertz constructed the world's first parabolic reflector antenna in 1888.[2] The antenna was a cylindrical parabolic reflector made of zinc sheet metal supported by a wooden frame, and had a spark-gap excited 26 cm dipole as a feed antenna along the focal line.  Its aperture was 2 meters high by 1.2 meters wide, with a focal length of 0.12 meters, and was used at an operating frequency of about 450 MHz.   With two such antennas, one used for transmitting and the other for receiving, Hertz demonstrated the existence of radio waves which had been predicted by James Clerk Maxwell some 22 years earlier.[10]  However, the early development of radio  was limited to lower frequencies at which parabolic antennas were unsuitable, and they were not widely used until after World War 2, when microwave frequencies began to be exploited.\n\nItalian radio pioneer Guglielmo Marconi used a parabolic reflector during the 1930s in investigations of UHF transmission from his boat in the Mediterranean.[9]  In 1931 a  1.7 GHz microwave relay telephone link across the English Channel using 10 ft. (3 meter) diameter dishes was demonstrated.[9]  The first large parabolic antenna, a 9 m dish, was built in 1937 by pioneering radio astronomer Grote Reber in his backyard,[2] and the sky survey he did with it was one of the events that founded the field of radio astronomy.[9]\n\nThe development of radar during World War II provided a great impetus to parabolic antenna research, and saw the evolution of shaped-beam antennas, in which the curve of the reflector is different in the vertical and horizontal directions, tailored to produce a beam with a particular shape.[9]  After the war very large parabolic dishes were built as radio telescopes.  The 100 meter Green Bank Radio Telescope at Green Bank, West Virginia, the first version of which was completed in 1962, is currently the world's largest fully steerable parabolic dish.\n\nDuring the 1960s dish antennas became widely used in terrestrial microwave relay communication networks, which carried telephone calls and television programs across continents.[9]  The first parabolic antenna used for satellite communications was constructed in 1962 at Goonhilly in Cornwall, England to communicate with the Telstar satellite.  The Cassegrain antenna was developed in Japan in 1963 by NTT, KDDI and Mitsubishi Electric.[11]  The advent in the 1970s of computer design tools such as NEC capable of calculating the radiation pattern of parabolic antennas has led to the development of sophisticated asymmetric, multireflector and multifeed designs in recent years.\n\n\nGain[edit]\n\n  \nArecibo radio telescope, in Puerto Rico, US. At 1000 ft (300 m) in diameter, it is the second largest \"dish\" antenna in the world. The reflector's shape is actually spherical, not paraboloidal, to reduce aberration when it is focused off axis.\n\n\n  \nMain article: Antenna gain\n\nThe directive qualities of an antenna are measured by a dimensionless parameter called its gain, which is the ratio of the power received by the antenna from a source along its beam axis to the power received by a hypothetical isotropic antenna.  This is \n\n\n\t\n  \n    \n      \n        G\n        =\n        \n          \n            \n              A\n              \n                antenna\n              \n            \n            \n              A\n              \n                isotropic\n              \n            \n          \n        \n      \n    \n    {\\displaystyle G={A_{\\text{antenna}} \\over A_{\\text{isotropic}}}}\n  \n\n\n\nThe aperture \n  \n    \n      \n        \n          A\n          \n            antenna\n          \n        \n      \n    \n    {\\displaystyle A_{\\text{antenna}}}\n  \n of the antenna is equal to the area of the physical aperture \n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n multiplied by a factor \n  \n    \n      \n        \n          e\n          \n            A\n          \n        \n      \n    \n    {\\displaystyle e_{\\text{A}}}\n  \n between 0 and 1 called the aperture efficiency: \n  \n    \n      \n        \n          A\n          \n            antenna\n          \n        \n        =\n        \n          e\n          \n            A\n          \n        \n        A\n      \n    \n    {\\displaystyle A_{\\text{antenna}}=e_{\\text{A}}A}\n  \n.   The aperture of an isotropic antenna (see the article Antenna aperture) is  \n\n\n\t\n  \n    \n      \n        \n          A\n          \n            isotropic\n          \n        \n        =\n        \n          \n            \n              λ\n              \n                2\n              \n            \n            \n              4\n              π\n            \n          \n        \n      \n    \n    {\\displaystyle A_{\\text{isotropic}}={\\lambda ^{2} \\over 4\\pi }}\n  \n\n\n\nThus the gain of a parabolic antenna is:[12]\n\n\n\t\n  \n    \n      \n        G\n        =\n        \n          \n            \n              4\n              π\n              A\n            \n            \n              λ\n              \n                2\n              \n            \n          \n        \n        \n          e\n          \n            A\n          \n        \n        =\n        \n          \n            (\n            \n              \n                \n                  π\n                  d\n                \n                λ\n              \n            \n            )\n          \n          \n            2\n          \n        \n        \n          e\n          \n            A\n          \n        \n      \n    \n    {\\displaystyle G={\\frac {4\\pi A}{\\lambda ^{2}}}e_{A}=\\left({\\frac {\\pi d}{\\lambda }}\\right)^{2}e_{A}}\n  \n\n\n\nwhere:\n\n\n\t\n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n is the area of the antenna aperture, that is, the mouth of the parabolic reflector.  For a circular dish antenna, \n  \n    \n      \n        A\n        =\n        π\n        \n          d\n          \n            2\n          \n        \n        \n          /\n        \n        4\n      \n    \n    {\\displaystyle A=\\pi d^{2}/4}\n  \n, giving the second formula above.\n\t\n  \n    \n      \n        d\n      \n    \n    {\\displaystyle d}\n  \n is the diameter of the parabolic reflector, if it is circular\n\t\n  \n    \n      \n        λ\n      \n    \n    {\\displaystyle \\lambda }\n  \n is the wavelength of the radio waves.\n\t\n  \n    \n      \n        \n          e\n          \n            A\n          \n        \n      \n    \n    {\\displaystyle e_{A}}\n  \n is a dimensionless parameter between 0 and 1 called the aperture efficiency.  The aperture efficiency of typical parabolic antennas is 0.55 to 0.70.\n\n\nIt can be seen that, as with any aperture antenna, the larger the aperture is, compared to the wavelength, the higher the gain.  The gain increases with the square of the ratio of aperture width to wavelength, so large parabolic antennas, such as those used for spacecraft communication and radio telescopes, can have extremely high gain.  Applying the above formula to the 25-meter-diameter antennas often used in radio telescope arrays and satellite ground antennas at a wavelength of 21 cm (1.42 GHz, a common radio astronomy frequency), yields an approximate maximum gain of 140,000 times or about 50 dBi (decibels above the isotropic level).  The largest parabolic dish antennas in the world are the Five-hundred-meter Aperture Spherical radio Telescope in southwest China, and the Arecibo radio telescope in Arecibo, Puerto Rico, US, which both have effective apertures of about 300 meters.  The gain of these dishes at 3 GHz is roughly 90 million, or 80 dBi.\n\nAperture efficiency  eA  is a catchall variable which accounts for various losses that reduce the gain of the antenna from the maximum that could be achieved with the given aperture.  The major factors reducing the aperture efficiency in parabolic antennas are:.[13]\n\n\n\tFeed spillover - Some of the radiation from the feed antenna falls outside the edge of the dish and so doesn't contribute to the main beam.\n\tFeed illumination taper - The maximum gain for any aperture antenna is only achieved when the intensity of the radiated beam is constant across the entire aperture area.  However the radiation pattern from the feed antenna usually tapers off toward the outer part of the dish, so the outer parts of the dish are \"illuminated\" with a lower intensity of radiation.  Even if the feed provided constant illumination across the angle subtended by the dish, the outer parts of the dish are farther away from the feed antenna than the inner parts, so the intensity would drop off with distance from the center.  So the intensity of the beam radiated by a parabolic antenna is maximum at the center of the dish and falls off with distance from the axis, reducing the efficiency.\n\tAperture blockage - In front-fed parabolic dishes where the feed antenna is located in front of the dish in the beam path (and in Cassegrain and Gregorian designs as well), the feed structure and its supports block some of the beam.  In small dishes such as home satellite dishes, where the size of the feed structure is comparable with the size of the dish, this can seriously reduce the antenna gain.  To prevent this problem these types of antennas often use an offset feed, where the feed antenna is located to one side, outside the beam area.  The aperture efficiency for these types of antennas can reach 0.7 to 0.8.\n\tShape errors - random surface errors in the shape of the reflector reduce efficiency. The loss is approximated by Ruze's Equation.\n\n\nFor theoretical considerations of mutual interference (at frequencies between 2 and c. 30 GHz - typically in the Fixed Satellite Service) where specific antenna performance has not been defined, a reference antenna based on Recommendation ITU-R S.465 is used to calculate the interference, which will include the likely sidelobes for off-axis effects.\n\n\nRadiation pattern[edit]\n\n  \nRadiation pattern of a German parabolic antenna.  The main lobe (top) is only a few degrees wide.  The sidelobes are all at least 20 dB below (1/100 the power density of) the main lobe, and most are 30 dB below. (If this pattern was drawn with linear power levels instead of logarithmic dB levels, all lobes other than the main lobe would be much too small to see.)\n\n\n\nIn parabolic antennas, virtually all the power radiated is concentrated in a narrow main lobe along the antenna's axis.     The residual power is radiated in sidelobes, usually much smaller, in other directions.   Because in parabolic antennas the reflector aperture is much larger than the wavelength, due to diffraction there are usually many narrow sidelobes, so the sidelobe pattern is complex.  There is also usually a backlobe, in the opposite direction to the main lobe, due to the spillover radiation from the feed antenna that misses the reflector.\n\n\nBeamwidth[edit]\n\nThe angular width of the beam radiated  by high-gain antennas is measured by the half-power beam width (HPBW), which is the angular separation between the points on the antenna radiation pattern at which the power drops to one-half (-3 dB) its maximum value.  For parabolic antennas, the HPBW  θ is given by:[5][14]\n\n\n\t\n  \n    \n      \n        θ\n        =\n        k\n        λ\n        \n          /\n        \n        d\n        \n      \n    \n    {\\displaystyle \\theta =k\\lambda /d\\,}\n  \n\n\n\nwhere k is a factor which varies slightly depending on the shape of the reflector and the feed illumination pattern.  For an ideal uniformly illuminated parabolic reflector and θ in degrees, k would be 57.3 (the number of degrees in a radian).  For a \"typical\" parabolic antenna k is approximately 70.[14]\n\nFor a typical 2 meter satellite dish operating on C band (4 GHz), this formula gives a beamwidth of about 2.6°.  For the Arecibo antenna at 2.4 GHz the beamwidth is 0.028°.  It can be seen that parabolic antennas can produce very narrow beams, and aiming them can be a problem.  Some parabolic dishes are equipped with a boresight so they can be aimed accurately at the other antenna.\n\nIt can be seen there is an inverse relation between gain and beam width.  By combining the beamwidth equation with the gain equation, the relation is:[14]\n\n\n\t\n  \n    \n      \n        G\n        =\n        \n          \n            (\n            \n              \n                \n                  π\n                  k\n                \n                θ\n              \n            \n            )\n          \n          \n            2\n          \n        \n         \n        \n          e\n          \n            A\n          \n        \n      \n    \n    {\\displaystyle G=\\left({\\frac {\\pi k}{\\theta }}\\right)^{2}\\ e_{A}}\n  \n\n\n\n  \nThe angle theta is normal to the aperture.\n\n\n\nRadiation pattern formula[edit]\n\nThe radiation from a large paraboloid with uniform illuminated aperture is essentially equivalent to that from a circular aperture of the same diameter D in an infinite metal plate with a uniform plane wave incident on the plate.[15]\n\nThe radiation-field pattern can be calculated by applying Huygens' principle in a similar way to a rectangular aperture. The electric field pattern can be found by evaluating the Fraunhofer diffraction integral over the circular aperture. It can also be determined through Fresnel zone equations.[16]\n\n\n  \n    \n      \n        E\n        =\n        ∫\n        ∫\n        \n          \n            A\n            \n              r\n              \n                1\n              \n            \n          \n        \n        \n          e\n          \n            j\n            (\n            ω\n            t\n            −\n            β\n            \n              r\n              \n                1\n              \n            \n            )\n          \n        \n        d\n        S\n        =\n        ∫\n        ∫\n        \n          e\n          \n            2\n            π\n            i\n            (\n            l\n            x\n            +\n            m\n            y\n            )\n            \n              /\n            \n            λ\n          \n        \n        d\n        S\n      \n    \n    {\\displaystyle E=\\int \\int {\\frac {A}{r_{1}}}e^{j(\\omega t-\\beta r_{1})}dS=\\int \\int e^{2\\pi i(lx+my)/\\lambda }dS}\n  \n\n\nwhere \n  \n    \n      \n        β\n        =\n        ω\n        \n          /\n        \n        c\n        =\n        2\n        π\n        \n          /\n        \n        λ\n      \n    \n    {\\displaystyle \\beta =\\omega /c=2\\pi /\\lambda }\n  \n. Using polar coordinates \n  \n    \n      \n        x\n        =\n        ρ\n        ⋅\n        cos\n        ⁡\n        θ\n        ,\n        \n        y\n        =\n        ρ\n        ⋅\n        sin\n        ⁡\n        θ\n      \n    \n    {\\displaystyle x=\\rho \\cdot \\cos \\theta ,\\quad y=\\rho \\cdot \\sin \\theta }\n  \n. Taking account of symmetry,\n\n\n  \n    \n      \n        E\n        =\n        \n          ∫\n          \n            0\n          \n          \n            2\n            π\n          \n        \n        d\n        θ\n        \n          ∫\n          \n            0\n          \n          \n            \n              ρ\n              \n                0\n              \n            \n          \n        \n        \n          e\n          \n            2\n            π\n            i\n            ρ\n            cos\n            ⁡\n            θ\n            l\n            \n              /\n            \n            λ\n          \n        \n        ρ\n        d\n        ρ\n      \n    \n    {\\displaystyle E=\\int \\limits _{0}^{2\\pi }d\\theta \\int \\limits _{0}^{\\rho _{0}}e^{2\\pi i\\rho \\cos \\theta l/\\lambda }\\rho d\\rho }\n  \n\n\nand using first-order Bessel function gives the electric field pattern \n  \n    \n      \n        E\n        (\n        θ\n        )\n      \n    \n    {\\displaystyle E(\\theta )}\n  \n,\n\n\n\n\n  \n    \n      \n        E\n        (\n        θ\n        )\n        =\n        \n          \n            \n              2\n              λ\n            \n            \n              π\n              D\n            \n          \n        \n        \n          \n            \n              \n                J\n                \n                  1\n                \n              \n              [\n              (\n              π\n              D\n              \n                /\n              \n              λ\n              )\n              sin\n              ⁡\n              θ\n              ]\n            \n            \n              sin\n              ⁡\n              θ\n            \n          \n        \n      \n    \n    {\\displaystyle E(\\theta )={\\frac {2\\lambda }{\\pi D}}{\\frac {J_{1}[(\\pi D/\\lambda )\\sin \\theta ]}{\\sin \\theta }}}\n  \n\n\n\n\n\nwhere \n  \n    \n      \n        D\n      \n    \n    {\\displaystyle D}\n  \n is the diameter of the antenna's aperture in meters,  \n  \n    \n      \n        λ\n      \n    \n    {\\displaystyle \\lambda }\n  \n is the wavelength in meters, \n  \n    \n      \n        θ\n      \n    \n    {\\displaystyle \\theta }\n  \n is the angle in radians from the antenna's symmetry axis as shown in the figure, and \n  \n    \n      \n        \n          J\n          \n            1\n          \n        \n      \n    \n    {\\displaystyle J_{1}}\n  \nis the first-order Bessel function. Determining the first nulls of the radiation pattern gives the beamwidth \n  \n    \n      \n        \n          θ\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle \\theta _{0}}\n  \n. The term \n  \n    \n      \n        \n          J\n          \n            1\n          \n        \n        (\n        x\n        )\n        =\n        0\n      \n    \n    {\\displaystyle J_{1}(x)=0}\n  \n whenever \n  \n    \n      \n        x\n        =\n        3.83\n      \n    \n    {\\displaystyle x=3.83}\n  \n. Thus,\n\n\n  \n    \n      \n        \n          θ\n          \n            0\n          \n        \n        =\n        arcsin\n        ⁡\n        \n          \n            \n              3.83\n              λ\n            \n            \n              π\n              D\n            \n          \n        \n        =\n        arcsin\n        ⁡\n        \n          \n            \n              1.22\n              λ\n            \n            D\n          \n        \n      \n    \n    {\\displaystyle \\theta _{0}=\\arcsin {\\frac {3.83\\lambda }{\\pi D}}=\\arcsin {\\frac {1.22\\lambda }{D}}}\n  \n.\n\nWhen the aperture is large the angle \n  \n    \n      \n        \n          θ\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle \\theta _{0}}\n  \n is very small, so \n  \n    \n      \n        arcsin\n        ⁡\n        (\n        x\n        )\n      \n    \n    {\\displaystyle \\arcsin(x)}\n  \n is approximataly equal to \n  \n    \n      \n        x\n      \n    \n    {\\displaystyle x}\n  \n. This gives the common beamwidth formulas,[15]\n\n\n\n\n  \n    \n      \n        \n          θ\n          \n            0\n          \n        \n        ≈\n        \n          \n            \n              1.22\n              λ\n            \n            D\n          \n        \n        \n        \n          (in radians)\n        \n        =\n        \n          \n            \n              70\n              λ\n            \n            D\n          \n        \n        \n        \n          (in degrees)\n        \n      \n    \n    {\\displaystyle \\theta _{0}\\approx {\\frac {1.22\\lambda }{D}}\\,{\\text{(in radians)}}={\\frac {70\\lambda }{D}}\\,{\\text{(in degrees)}}}\n  \n\n\n\n\n\nSee also[edit]\n\n\tCassegrain antenna\n\tFeed horn\n\tOffset dish antenna\n\tParabolic reflector\n\tRadio telescope\n\tSatellite dish\n\tSatellite television\n\tSimulsat (a quasi parabolic antenna which is spherical in one plane and parabolic in another)\n\n\nReferences[edit]\n\n\n\t^ Straw, R. Dean, Ed. (2000). The ARRL Antenna Book, 19th Ed. US: American Radio Relay League. p. 19.15. ISBN 978-0-87259-817-1.\n\n\t^ a b c d e f g h i Stutzman, Warren L.; Gary A. Thiele (2012). Antenna Theory and Design, 3rd Ed. US: John Wiley & Sons. pp. 391–392. ISBN 978-0470576649.\n\n\n\t^ a b c d e f Lehpamer, Harvey (2010). Microwave transmission networks: Planning, Design, and Deployment. US: McGraw Hill Professional. pp. 268–272. ISBN 978-0-07-170122-8.\n\n\n\t^ A. David Olver (1994) Microwave Horns and Feeds, p. 61-62\n\n\t^ a b Straw, R. Dean, Ed. (2000). The ARRL Antenna Book, 19th Ed. US: American Radio Relay League. p. 18.14. ISBN 978-0-87259-817-1.\n\n\n\t^ Seybold, John S. (2005). Introduction to RF Propagation. John Wiley and Sons. pp. 55–58. ISBN 978-0471743682.\n\n\n\t^ Galindo, V. (1964). \"Design of dual-reflector antennas with arbitrary phase and amplitude distributions\". IEEE Transactions on Antennas and Propagation. IEEE. 12 (4): 403–408. doi:10.1109/TAP.1964.1138236.\n\n\n\t^ Willams, WF (1983). \"RF Design and Predicted Performance for a Future 34-Meter Shaped Dual-Reflector Antenna System Using the Common Aperture XS Feedhorn\" (PDF). Telecommunications and Data Acquisition Progress Report. 73: 74–84.\n\n\n\t^ a b c d e f Olver, A. David (1994). Microwave horns and feeds. US: IET. p. 3. ISBN 978-0-7803-1115-2.\n\n\n\t^ Love, Allan W. \"Large Space Antenna Concepts for ESGP\" (PDF). Rockwell International. Retrieved 2009-07-31.\n\n\n\t^ Makino, Shigero (2006). \"Historical review of reflector antenna systems developed for satellite communication by MELCO\" (PDF). ISAP2006-International Symposium on Antennas and Propagation. Mitsubishi Electric Corp. Retrieved 2011-12-24.\n on ISAP website\n\n\t^ Anderson, Harry R. (2003). Fixed broadband wireless system design. US: John Wiley & Sons. pp. 206–207. ISBN 978-0-470-84438-0.\n\n\n\t^ Pattan, Bruno (1993). Satellite systems: principles and technologies. US: Springer. p. 267. ISBN 978-0-442-01357-8.\n\n\n\t^ a b c Minoli, Daniel (2009). Satellite Systems Engineering in an IPv6 Environment. US: CRC Press. p. 78. ISBN 978-1-4200-7868-8.\n\n\n\t^ a b Kraus, John Daniel; Marhefka, Ronald J. (2002). Antennas for all applications. McGraw-Hill. ISBN 9780072321036.\n\n\n\t^ John C. Slater & Nathaniel H. Frank. Introduction to Theoretical Physics.\n\n\n\n\n\nExternal links[edit]\n\n Media related to Parabolic antennas at Wikimedia Commons\n\n\n\tWiFi: Parabolic Dish with BiQuad feeder\n\tOnline Satellite Finder Based on Google Maps\n\tAntenna types: Parabolic Antenna for WiFi\n\tOnline pointing utility using google maps, and each satellite channel list: http://www.dishpointer.com/\n\tAnimation of Propagation from a Parabolic Dish Antenna from YouTube\n\tParabolic reflector antenna tutorial Theory and practice\n\tApplet of gain of parabolic antenna.\n\n\n\t\tv\n\tt\n\te\n\n\nAntenna types\n\n\tIsotropic\t\n\tIsotropic radiator\n\n\n\n\n\tOmnidirectional\t\n\tBatwing antenna\n\tBiconical antenna\n\tCage aerial\n\tChoke ring antenna\n\tCoaxial antenna\n\tCrossed field antenna\n\tDielectric resonator antenna\n\tDipole antenna\n\tDiscone antenna\n\tFolded unipole antenna\n\tFranklin antenna\n\tGround-plane antenna\n\tHalo antenna\n\tHelical antenna\n\tJ-pole antenna\n\tMast radiator\n\tMonopole antenna\n\tRandom wire antenna\n\tRubber ducky antenna\n\tTurnstile antenna\n\tT2FD antenna\n\tT-antenna\n\tUmbrella antenna\n\tWhip antenna\n\n\n\n\n\tDirectional\t\n\tAdcock antenna\n\tAS-2259 Antenna\n\tAWX antenna\n\tBeverage antenna\n\tCantenna\n\tCassegrain antenna\n\tCollinear antenna array\n\tConformal antenna\n\tCorner reflector antenna\n\tCurtain array\n\tDipole antenna\n\tFolded inverted conformal antenna\n\tFractal antenna\n\tG5RV antenna\n\tGizmotchy\n\tHelical antenna\n\tHorn antenna\n\tInverted-F antenna\n\tInverted vee antenna\n\tLog-periodic antenna\n\tLoop antenna\n\tMicrostrip antenna\n\tMoxon antenna\n\tOffset dish antenna\n\tPatch antenna\n\tPhased array\n\tPlanar array\n\tParabolic antenna\n\tPlasma antenna\n\tQuad antenna\n\tReflective array antenna\n\tRegenerative loop antenna\n\tRhombic antenna\n\tSector antenna\n\tShort backfire antenna\n\tSloper antenna\n\tSlot antenna\n\tSterba antenna\n\tVivaldi antenna\n\tWokFi\n\tYagi–Uda antenna\n\n\n\n\n\tApplication-specific\t\n\tALLISS\n\tCorner reflector (passive)\n\tEvolved antenna\n\tGround dipole\n\tReconfigurable antenna\n\tRectenna\n\tReference antenna\n\tWullenweber\n\tTelevision antenna\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nTelecommunications\n\n\tHistory\t\n\tBeacon\n\tBroadcasting\n\tCable protection system\n\tCable TV\n\tCommunications satellite\n\tComputer network\n\tDrums\n\tElectrical telegraph\n\tFax\n\tHeliographs\n\tHydraulic telegraph\n\tInternet\n\tMass media\n\tMobile phone\n\tOptical telecommunication\n\tOptical telegraphy\n\tPager\n\tPhotophone\n\tPrepaid mobile phone\n\tRadio\n\tRadiotelephone\n\tSatellite communications\n\tSemaphore\n\tSmartphone\n\tSmoke signals\n\tTelecommunications history\n\tTelautograph\n\tTelegraphy\n\tTeleprinter (teletype)\n\tTelephone\n\tThe Telephone Cases\n\tTelevision\n\tUndersea telegraph line\n\tVideoconferencing\n\tVideophone\n\tVideotelephony\n\tWhistled language\n\n\n\n\t\n\n\tPioneers\t\n\tEdwin Howard Armstrong\n\tJohn Logie Baird\n\tPaul Baran\n\tAlexander Graham Bell\n\tTim Berners-Lee\n\tJagadish Chandra Bose\n\tVint Cerf\n\tClaude Chappe\n\tDonald Davies\n\tLee de Forest\n\tPhilo Farnsworth\n\tReginald Fessenden\n\tElisha Gray\n\tErna Schneider Hoover\n\tCharles K. Kao\n\tHedy Lamarr\n\tInnocenzo Manzetti\n\tGuglielmo Marconi\n\tAntonio Meucci\n\tRadia Perlman\n\tAlexander Stepanovich Popov\n\tJohann Philipp Reis\n\tHenry Sutton\n\tNikola Tesla\n\tCamille Tissot\n\tAlfred Vail\n\tCharles Wheatstone\n\tVladimir K. Zworykin\n\n\n\n\n\tTransmission\nmedia\t\n\tCoaxial cable\n\tFiber-optic communication\n\tOptical fiber\n\n\n\tFree-space optical communication\n\tMolecular communication\n\tRadio waves\n\tTransmission line\n\n\n\n\n\tNetwork topology\nand switching\t\n\tLinks\n\tNodes\n\tTerminal node\n\tNetwork switching (circuit\n\tpacket)\n\tTelephone exchange\n\n\n\n\n\tMultiplexing\t\n\tSpace-division\n\tFrequency-division\n\tTime-division\n\tPolarization-division\n\tOrbital angular-momentum\n\tCode-division\n\n\n\n\n\tNetworks\t\n\tARPANET\n\tBITNET\n\tCellular network\n\tComputer\n\tCYCLADES\n\tEthernet\n\tFidoNet\n\tInternet\n\tInternet2\n\tISDN\n\tLAN\n\tMobile\n\tNGN\n\tNPL network\n\tPublic Switched Telephone\n\tRadio\n\tTelecommunications equipment\n\tTelevision\n\tTelex\n\tWAN\n\tWireless network\n\tWorld Wide Web\n\n\n\n\n\t\n\t Category\n\t Outline\n\t Portal\n\t Commons\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Parabolic_antenna&oldid=906111766\"\n\n\t\t\n\t\tCategories: \tRadio frequency antenna types\n\tAntennas (radio)\n\tSatellite broadcasting\n\n\nHidden categories: \tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\t한국어\n\tՀայերեն\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tҚазақша\n\tLëtzebuergesch\n\tമലയാളം\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tУкраїнська\n\t粵語\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 13 July 2019, at 18:16 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "304", "dc:title": "Parabolic antenna - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Erdfunkstelle_Raisting_2.jpg/1200px-Erdfunkstelle_Raisting_2.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-parabolic_antenna", "title": "Parabolic antenna - Wikipedia"}}