{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRadio receiver - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tRadio receiver\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nA bedside clock radio that combines a radio receiver with an alarm clock.\n\n\n\n  \nA modern communications receiver, used in two-way radio communication stations to talk with remote locations by shortwave radio.\n\n\n\n  \nGirl listening to vacuum tube radio in the 1940s. During the golden age of radio, 1925-1950, families gathered to listen to the home radio receiver in the evening\n\n\n\nIn radio communications, a radio receiver, also known as a receiver, wireless or simply radio is an electronic device that receives radio waves and converts the information carried by them to a usable form. It is used with an antenna. The antenna intercepts radio waves (electromagnetic waves) and converts them to tiny alternating currents which are applied to the receiver, and the receiver extracts the desired information. The receiver uses electronic filters to separate the desired radio frequency signal from all the other signals picked up by the antenna, an electronic amplifier to increase the power of the signal for further processing, and finally recovers the desired information through demodulation.\n\nThe information produced by the receiver may be in the form of sound, moving images (television), or data.[1] A radio receiver may be a separate piece of electronic equipment, or an electronic circuit within another device. Radio receivers are very widely used in modern technology, as components of communications, broadcasting, remote control, and wireless networking systems.  \nIn consumer electronics, the terms radio and radio receiver are often used specifically for receivers designed to reproduce  sound transmitted by radio broadcasting stations, historically the first mass-market commercial radio application.\n\n\nContents\n\n\n\t1 Broadcast radio receivers\n\t1.1 Modulation types\n\t1.1.1 AM and FM\n\t1.1.2 Digital audio broadcasting (DAB)\n\n\n\n\t1.2 Reception\n\t1.3 Types of broadcast receiver\n\n\n\n\t2 Other applications\n\t3 How receivers work\n\t3.1 Filtering, amplification, and demodulation\n\t3.1.1 AM demodulation\n\n\n\n\t3.2 Tuned radio frequency (TRF) receiver\n\t3.3 The superheterodyne design\n\t3.4 Automatic gain control (AGC)\n\n\n\n\t4 History\n\t4.1 Spark era\n\t4.1.1 Coherer receiver\n\t4.1.2 Other early detectors\n\t4.1.3 Tuning\n\t4.1.3.1 Inductive coupling\n\t4.1.3.2 Patent disputes\n\n\n\n\t4.1.4 Crystal radio receiver\n\t4.1.5 Heterodyne receiver and BFO\n\n\n\n\t4.2 Vacuum tube era\n\t4.2.1 The first vacuum tube receivers\n\t4.2.2 Regenerative (autodyne) receiver\n\t4.2.3 Superregenerative receiver\n\t4.2.4 TRF receiver\n\t4.2.5 Neutrodyne receiver\n\t4.2.6 Reflex receiver\n\t4.2.7 Superheterodyne receiver\n\n\n\n\t4.3 Semiconductor era\n\t4.3.1 Digital technologies\n\n\n\n\t4.4 Portable radios\n\n\n\n\t5 See also\n\t6 References\n\t7 Further reading\n\n\n\n\n\nBroadcast radio receivers[edit]\n\nThe most familiar form of radio receiver is a broadcast receiver, often just called a radio, which receives audio programs intended for public reception transmitted by local radio stations.  The sound is reproduced either by a loudspeaker in the radio or an earphone which plugs into a jack on the radio.  The radio requires electric power, provided either by batteries inside the radio or a power cord which plugs into an electric outlet.   All radios have a volume control to adjust the loudness of the audio, and some type of \"tuning\" control to select the radio station to be received.\n\n\nModulation types[edit]\n\nModulation is the process of adding information to a radio carrier wave.\n\n\nAM and FM[edit]\n\nTwo types of modulation are used in analog radio broadcasting systems; AM and FM.\n\nIn amplitude modulation (AM) the strength of the radio signal is varied by the audio signal.  AM broadcasting is allowed in the AM broadcast bands which are between 148 and 283 kHz in the longwave range, and between 526 and 1706 kHz in the medium frequency (MF) range of the radio spectrum.  AM broadcasting is also permitted in shortwave bands, between about 2.3 and 26 MHz, which are used for long distance international broadcasting.\n\nIn frequency modulation (FM) the frequency of the radio signal is varied slightly by the audio signal. FM broadcasting is permitted in the FM broadcast bands between about 65 and 108 MHz in the very high frequency (VHF) range.  The exact frequency ranges vary somewhat in different countries.\n\nFM stereo radio stations broadcast in stereophonic sound (stereo), transmitting two sound channels representing left and right microphones.   A stereo receiver contains the additional circuits and parallel signal paths to reproduce the two separate channels.  A monaural receiver, in contrast, only receives a single audio channel that is a combination (sum) of the left and right channels.[2][3][4]  While AM stereo transmitters and receivers exist, they have not achieved the popularity of FM stereo.\n\nMost modern radios are  \"AM/FM\" radios, and are able to receive both AM and FM radio stations, and have a switch to select which band to receive.\n\n\nDigital audio broadcasting (DAB)[edit]\n\nMain article: Digital audio broadcasting\n\nDigital audio broadcasting (DAB) is an advanced radio technology which debuted in some countries in 1998 that transmits audio from terrestrial radio stations as a digital signal rather than an analog signal as AM and FM do.  Its advantages are that DAB has the potential to provide higher quality sound than FM (although many stations do not choose to transmit at such high quality), has greater immunity to radio noise and interference, makes better use of scarce radio spectrum bandwidth, and provides advanced user features such as electronic program guide, sports commentaries, and image slideshows.  Its disadvantage is that it is incompatible with previous radios so that a new DAB receiver must be purchased.   As of 2017, 38 countries offer DAB, with 2,100 stations serving listening areas containing 420 million people.   Most countries plan an eventual switchover from FM to DAB.  The United States and Canada have chosen not to implement DAB.\n\nDAB radio stations work differently from AM or FM stations: a single DAB station transmits a wide 1,500 kHz bandwidth signal that carries from 9 to 12 channels from which the listener can choose.  Broadcasters can transmit a channel at a range of different bit rates, so different channels can have different audio quality.   In different countries DAB stations broadcast in either Band III (174–240 MHz) or L band (1.452–1.492 GHz).\n\n\nReception[edit]\n\nThe signal strength of radio waves decreases the farther they travel from the transmitter, so a radio station can only be received within a limited range of its transmitter.   The range depends on the power of the transmitter, the sensitivity of the receiver, atmospheric and internal noise,  as well as any geographical obstructions such as hills between transmitter and receiver.  AM broadcast band radio waves travel as ground waves which follow the contour of the Earth, so AM radio stations can be reliably received at hundreds of miles distance.  Due to their higher frequency, FM band radio signals cannot  travel far beyond the visual horizon; limiting reception distance to about 40 miles (64 km), and can be blocked by hills between the transmitter and receiver.  However FM radio is less susceptible to interference from radio noise (RFI, sferics, static) and has higher fidelity; better frequency response and less audio distortion, than AM.   So in many countries serious music is only broadcast by FM stations, and AM stations specialize in radio news, talk radio, and sports.   Like FM, DAB signals travel by line of sight so reception distances are limited by the visual horizon to about 30–40 miles (48–64 km).\n\n\nTypes of broadcast receiver[edit]\n\nRadios are made in a range of styles and functions:\n\n\n\tTable radio - A self-contained radio with speaker designed to sit on a table.\n\tClock radio - A bedside table radio that also includes an alarm clock.  The alarm clock can be set to turn on the radio in the morning instead of an alarm, to wake the owner.\n\tTuner - A high fidelity AM/FM radio receiver in a component home audio system.  It has no speakers but outputs an audio signal which is fed into the system and played through the system's speakers.\n\tPortable radio - a radio powered by batteries that can be carried with a person.  Radios are now often integrated with other audio sources in CD players and portable media players.\n\tBoom box - a portable battery-powered high fidelity stereo sound system in the form of a box with a handle, which became popular during the mid 1970s.\n\tTransistor radio - an older term for a portable pocket-sized broadcast radio receiver. Made possible by the invention of the transistor and developed in the 1950s, transistor radios were hugely popular during the 1960s and early 1970s, and changed the public's listening habits.\n\n\n\tCar radio - An AM/FM radio integrated into the dashboard of a vehicle, used for entertainment while driving. Virtually all modern cars and trucks are equipped with radios, which usually also includes a CD player.\n\tSatellite radio receiver - subscription radio receiver that receives audio programming from a direct broadcast satellite. The subscriber must pay a monthly fee.  They are mostly designed as car radios.\n\tShortwave receiver - This is a broadcast radio that also receives the shortwave bands.  It is used for shortwave listening.\n\tAV receivers are a common component in a high-fidelity or home-theatre system; in addition to receiving radio programming, the receiver will also  contain switching and amplifying functions to interconnect and control the other components of the system.\n\n\nOther applications[edit]\n\nRadio receivers are essential components of all systems that use radio.  Besides broadcast receivers, described above, radio receivers are used in a huge variety of electronic systems in modern technology. They can be a separate piece of equipment (a radio), or a subsystem incorporated into other electronic devices. A transceiver is a transmitter and receiver combined in one unit.  Below is a list of a few of the most common types, organized by function\n\n\n\tBroadcast television reception - Televisions receive a video signal representing a moving image, composed of a sequence of still images, and a synchronized audio signal representing the associated sound.   The television channel received by a TV occupies a wider bandwidth than an audio signal, from 600 kHz to 6 MHz.\n\tTerrestrial television receiver, broadcast television or just television (TV) - Televisions contains an integral receiver (TV tuner) which receives free broadcast television from local television stations on TV channels in the VHF and UHF bands.\n\tSatellite TV receiver - a set-top box which receives subscription direct-broadcast satellite television, and displays it on an ordinary television.  A rooftop satellite dish receives many channels all modulated on a Ku band microwave downlink signal from a geostationary direct broadcast satellite 22,000 miles (35,000 km) above the Earth, and the signal is converted to a lower intermediate frequency and transported to the box through a coaxial cable. The subscriber pays a monthly fee.\n\n\n\tTwo-way voice communications - A two-way radio is an audio transceiver, a receiver and transmitter in the same device, used for bidirectional person-to-person voice communication.  The radio link may be half-duplex, using a single radio channel in which only one radio can transmit at a time. so different users take turns talking, pressing a push to talk button on their radio which switches on the transmitter.  Or the radio link may be full duplex, a bidirectional link using two radio channels so both people can talk at the same time, as in a cell phone.\n\tCellphone - a portable telephone that is connected to the telephone network by radio signals exchanged with a local antenna called a cell tower.  Cellphones have highly automated digital receivers working in the UHF and microwave band that receive the incoming side of the duplex voice channel, as well as a control channel that handles dialing calls and switching the phone between cell towers.  They usually also have several other receivers that connect them with other networks: a WiFi modem, a bluetooth modem, and a GPS receiver. The cell tower has sophisticated multichannel receivers that receive the signals from many cell phones simultaneously.\n\tCordless phone - a landline telephone in which the handset is portable and communicates with the rest of the phone by a short range duplex radio link, instead of being attached by a cord.  Both the handset and the base station have radio receivers operating in the UHF band that receive the short range bidirectional duplex radio link.\n\tCitizens band radio - a two-way half-duplex radio operating in the 27 MHz band that can be used without a license. They are often installed in vehicles and used by truckers and delivery services.\n\tWalkie-talkie - a handheld short range half-duplex two-way radio.\n\t  \nHandheld scanner\n\n\nScanner - a receiver that continuously monitors multiple frequencies or radio channels by stepping through the channels repeatedly, listening briefly to each channel for a transmission. When a transmitter is found the receiver stops at that channel.  Scanners are used to monitor emergency police, fire, and ambulance frequencies, as well as other two way radio frequencies such as citizens band.  Scanning capabilities have also become a standard feature in communications receivers, walkie-talkies, and other two-way radios.\n\t  \nModern communications receiver, ICOM RC-9500\n\n\nCommunications receiver or shortwave receiver - a general purpose audio receiver covering the LF, MF, shortwave (HF), and VHF bands.  Used mostly with a separate shortwave transmitter for two-way voice communication in communication stations, amateur radio stations, and for shortwave listening.\n\n\n\tOne-way (simplex) voice communications\n\tWireless microphone receiver - these receive the short range signal from wireless microphones used onstage by musical artists, public speakers, and television personalities.\n\t  \nBaby monitor. The receiver is on the left\n\n\nBaby monitor - this is a cribside appliance for mothers of infants that transmits the baby's sounds to a receiver carried by the mother, so she can monitor the baby while she is in other parts of the house.  Many baby monitors now have video cameras to show a picture of the baby.\n\n\n\tData communications\n\tWireless (WiFi) modem - an automated short range digital data transmitter and receiver on a portable wireless device that communicates by microwaves with a nearby access point, a router or gateway, connecting the portable device with a local computer network (WLAN) to exchange data with other devices.\n\tBluetooth modem - a very short range (up to 10 m) 2.4-2.83 GHz  data transceiver on a portable wireless device used as a substitute for a wire or cable connection, mainly to exchange files between portable devices and connect cellphones and music players with wireless earphones.\n\tMicrowave relay - a long distance high bandwidth point-to-point data transmission link consisting of a dish antenna and transmitter that transmits a beam of microwaves to another dish antenna and receiver. Since the antennas must be in line-of-sight, distances are limited by the visual horizon to 30–40 miles. Microwave links are used for private business data, wide area computer networks (WANs), and by telephone companies to transmit distance phone calls and television signals between cities.\n\n\n\tSatellite communications - Communication satellites are used for data transmission between widely separated points on Earth.  Other satellites are used for search and rescue, remote sensing, weather reporting and scientific research.  Radio communication with satellites and spacecraft can involve very long path lengths, from 35,786 km (22,236 mi) for geosynchronous satellites to billions of kilometers for interplanetary spacecraft. This and the limited power available to a spacecraft transmitter mean very sensitive receivers must be used.\n\tSatellite transponder - A receiver and transmitter in a communications satellite that receives multiple data channels carrying long distance telephone calls, television signals. or internet traffic on a microwave uplink signal from a satellite ground station and retransmits the data to another ground station on a different downlink frequency.  In a direct broadcast satellite the transponder broadcasts a stronger signal directly to satellite radio or satellite television receivers in consumer's homes.\n\tSatellite ground station receiver - communication satellite ground stations receive data from communications satellites orbiting the Earth.  Deep space ground stations such as those of the NASA Deep Space Network receive the weak signals from distant scientific spacecraft on interplanetary exploration missions.  These have large dish antennas around 85 ft (25 m) in diameter, and extremely sensitive radio receivers similar to radio telescopes.  The RF front end of the receiver is often cryogenically cooled to −195.79 °C (−320 °F) by liquid nitrogen to reduce radio noise in the circuit.\n\n\n\tRemote control - Remote control receivers receive digital commands that control a device, which may be as complex as a space vehicle or unmanned aerial vehicle, or as simple as a garage door opener. Remote control systems often also incorporate a telemetry channel to transmit data on the state of the controlled device back to the controller. Radio controlled model and other models include multichannel receivers in model cars, boats, airplanes, and helicopters.  A short-range radio system is used in keyless entry systems.\n\tRadiolocation - This is the use of radio waves to determine the location or direction of an object.\n\tRadar - a device that transmits a narrow beam of microwaves which reflect from a target back to a receiver, used to locate objects such as aircraft, spacecraft, missiles, ships or land vehicles.  The reflected waves from the target are received by a receiver usually connected to the same antenna, indicating the direction to the target.  Widely used in aviation, shipping, navigation, weather forecasting, space flight, vehicle collision avoidance systems, and the military.\n\tGlobal navigation satellite system (GNSS) receiver, such as a GPS receiver used with the US Global Positioning System - the most widely used electronic navigation device.  An automated digital receiver that receives simultaneous data signals from several satellites in low Earth orbit.  Using extremely precise time signals it calculates the distance to the satellites, and from this the receiver's location on Earth.  GNSS receivers are sold as portable devices, and are also incorporated in cell phones, vehicles and weapons, even artillery shells.\n\tVOR receiver - navigational instrument on an aircraft that uses  the VHF signal from VOR navigational beacons between 108 and 117.95 MHz to determine the direction to the beacon very accurately, for air navigation.\n\tWild animal tracking receiver - a receiver with  a directional antenna used to track wild animals which have been tagged with a small VHF transmitter, for wildlife management purposes.\n\n\n\tOther\n\tTelemetry receiver - this receives data signals to monitor conditions of a process.  Telemetry is used to monitor missile and spacecraft in flight, well logging during oil and gas drilling, and unmanned scientific instruments in remote locations.\n\tMeasuring receiver - a calibrated, laboratory grade radio receiver used to measure the characteristics of radio signals.  Often incorporates a spectrum analyzer.\n\tRadio telescope - specialized antenna and radio receiver used as a scientific instrument to study weak radio waves from astronomical radio sources in space like stars, nebulas and galaxies in radio astronomy.  They are the most sensitive radio receivers that exist, having large parabolic (dish) antennas up to 500 meters in diameter, and extremely sensitive radio circuits.  The RF front end of the receiver is often cryogenically cooled by liquid nitrogen to reduce radio noise.\n\n\n\n\nHow receivers work[edit]\n\nSee also: Radio receiver design\n\n  \nSymbol for an antenna\n\n\n\nA radio receiver is connected to an antenna which converts some of the energy from the incoming radio wave into a tiny radio frequency AC voltage which is applied to the receiver's input.   An antenna typically consists of an arrangement of metal conductors.  The oscillating electric and magnetic fields of the radio wave push the electrons in the antenna back and forth, creating an oscillating voltage.\n\nThe antenna may be enclosed inside the receiver's case, as with the ferrite loop antennas of AM radios and the flat inverted F antenna of cell phones; attached to the outside of the receiver, as with whip antennas used on FM radios, or mounted separately and connected to the receiver by a cable, as with rooftop television antennas and satellite dishes.\n\n\nFiltering, amplification, and demodulation[edit]\n\nPractical radio receivers perform three basic functions on the signal from the antenna: filtering, amplification, and demodulation:[5]\n\n\n  \nSymbol for a bandpass filter used in block diagrams of radio receivers\n\n\n\n\tBandpass filtering:  Radio waves from many transmitters pass through the air simultaneously without interfering with each other.  These can be separated in the receiver because they have different frequencies; that is, the radio wave from each transmitter oscillates at a different rate.  To separate out the desired radio signal, the bandpass filter allows the frequency of the desired radio transmission to pass through, and blocks signals at all other frequencies.\n\n\n\tThe bandpass filter consists of one or more resonant circuits (tuned circuits). The resonant circuit is connected between the antenna input and ground.  When the incoming radio signal is at the resonant frequency, the resonant circuit has high impedance and the radio signal from the desired station is passed on to the following stages of the receiver.  At all other frequencies the resonant circuit has low impedance, so signals at these frequencies are conducted to ground.\n\n\n\t\tBandwidth and selectivity: See graphs.  The information (modulation) in a radio transmission is contained in two narrow bands of frequencies called sidebands (SB) on either side of the carrier frequency (C), so the filter has to pass a band of frequencies, not just a single frequency.  The band of frequencies received by the receiver is called its passband (PB), and the width of the passband in kilohertz is called the bandwidth (BW).  The bandwidth of the filter must be wide enough to allow the sidebands through without distortion, but narrow enough to block any interfering transmissions on adjacent frequencies (such as S2 in the diagram).  The ability of the receiver to reject unwanted radio stations near in frequency to the desired station is an important parameter called selectivity determined by the filter.  In modern receivers quartz crystal, ceramic resonator, or surface acoustic wave (SAW) filters are often used which have sharper selectivity compared to networks of capacitor-inductor tuned circuits.\n\tTuning:  To select a particular station the radio is \"tuned\" to the frequency of the desired transmitter.  The radio has a dial or digital display showing the frequency it is tuned to. Tuning is adjusting the frequency of the receiver's passband to the frequency of the desired radio transmitter.  Turning the tuning knob changes the resonant frequency of the tuned circuit.  When the resonant frequency is equal to the radio transmitter's frequency the tuned circuit oscillates in sympathy, passing the signal on to the rest of the receiver.\n\n\n\n\n\nThe frequency spectrum of a typical radio signal from an AM or FM radio transmitter. It consists of a strong component (C) at the carrier wave frequency fC, with the modulation contained in narrow frequency bands called sidebands (SB) just above and below the carrier.\n\n\n\n\n(right graph) How the bandpass filter selects a single radio signal S1 from all the radio signals received by the antenna. From top, the graphs show  the voltage from the antenna applied to the filter Vin, the transfer function of the filter T, and the voltage at the output of the filter Vout as a function of frequency f.  The transfer function T is the amount of signal that gets through the filter at each frequency:\n\n  \n    \n      \n        \n          V\n          \n            o\n            u\n            t\n          \n        \n        (\n        f\n        )\n        =\n        \n          T\n        \n        (\n        f\n        )\n        \n          V\n          \n            i\n            n\n          \n        \n        (\n        f\n        )\n      \n    \n    {\\displaystyle V_{out}(f)={\\text{T}}(f)V_{in}(f)}\n  \n\n\n\n\n\n\n\n  \nSymbol for an amplifier\n\n\n      \n\tAmplification: The  power of the radio waves picked up by a receiving antenna decreases with the square of its distance from the transmitting antenna.  Even with the powerful transmitters used in radio broadcasting stations, if the receiver is more than a few miles from the transmitter the power intercepted by the receiver's antenna is very small, perhaps as low as picowatts.  To increase the power of the  recovered signal, an amplifier circuit uses electric power from batteries or the wall plug to increase the amplitude (voltage or current) of the signal.  In most modern receivers, the electronic components which do the actual amplifying are transistors.\n\n\n\tReceivers usually have several stages of amplification: the radio signal from the bandpass filter is amplified to make it powerful enough to drive the demodulator, then the audio signal from the demodulator is amplified to make it powerful enough to operate the speaker.  The degree of amplification of a radio receiver is measured by a parameter called its sensitivity, which is the minimum signal strength of a station at the antenna, measured in microvolts, necessary to receive the signal clearly, with a certain signal-to-noise ratio.  Since it is easy to amplify a signal to any desired degree, the limit to the sensitivity of many modern receivers is not the degree of amplification but random electronic noise present in the circuit, which can drown out a weak radio signal.\n\n\n  \nSymbol for a demodulator\n\n\n \n\tDemodulation:  After the radio signal is filtered and amplified, the receiver must extract the information-bearing modulation signal from the modulated radio frequency carrier wave.  This is done by a circuit called a demodulator (detector). Each type of modulation requires a different type of demodulator\n\n\n\t\tan AM receiver that receives an (amplitude modulated) radio signal uses an AM demodulator\n\tan FM receiver that receives a frequency modulated signal uses an FM demodulator\n\tan FSK receiver which receives frequency shift keying (used to transmit digital data in wireless devices) uses an FSK demodulator\n\n\n\tMany other types of modulation are also used for specialized purposes.\n\n\nThe modulation signal output by the demodulator is usually amplified to increase its strength, then the information is converted back to a human-usable form by some type of transducer. An audio signal, representing sound, as in a broadcast radio, is converted to sound waves by an earphone or loudspeaker.  A video signal, representing moving images, as in a television receiver, is converted to light by a display.  Digital data, as in a wireless modem, is applied as input to a computer or microprocessor, which interacts with human users.\n\n\nAM demodulation[edit]\n\nMain article: Envelope detector\n\n  \nEnvelope detector circuit\n\n\n\n  \nHow an envelope detector works\n\n\n  \n\tThe easiest type of demodulation to understand is AM demodulation, used in AM radios to recover the audio modulation signal, which represents sound and is converted to sound waves by the radio's speaker.  It is accomplished by a circuit called an envelope detector (see circuit), consisting of a diode (D) with a bypass capacitor (C) across its output.\n\n\n\tSee graphs.  The amplitude modulated radio signal from the tuned circuit is shown at (A).  The rapid oscillations are the radio frequency carrier wave.  The audio signal (the sound) is contained in the slow variations (modulation) of the amplitude (size) of the waves.  If it was applied directly to the speaker, this signal cannot be converted to sound, because the audio excursions are the same on both sides of the axis, averaging out to zero, which would result in no net motion of the speaker's diaphragm. (B) When this signal is applied as input VI to the detector, the diode (D) conducts current in one direction but not in the opposite direction, thus allowing through pulses of current on only one side of the signal.  In other words, it rectifies the AC current to a pulsing DC current. The resulting voltage VO applied to the load RL no longer averages zero; its peak value is proportional to the audio signal. (C)  The bypass capacitor (C) is charged up by the current pulses from the diode, and its voltage follows the peaks of the pulses, the envelope of the audio wave.  It performs a smoothing (low pass filtering) function, removing the radio frequency carrier pulses, leaving the low frequency audio signal to pass through the load RL.   The audio signal is amplified and applied to earphones or a speaker.\n\n\n\n\nTuned radio frequency (TRF) receiver[edit]\n\nMain article: Tuned radio frequency receiver\n\n  \nBlock diagram of a tuned radio frequency receiver.  To achieve enough selectivity to reject stations on adjacent frequencies, multiple cascaded bandpass filter stages had to be used.  The dotted line indicates that the bandpass filters must be tuned together.\n\n\n\nIn the simplest type of radio receiver, called a tuned radio frequency (TRF) receiver,  the three functions above are performed consecutively:[6] (1) the mix of radio signals from the antenna is filtered to extract the signal of the desired transmitter; (2) this oscillating voltage is sent through a radio frequency (RF) amplifier to increase its strength to a level sufficient to drive the demodulator; (3) the demodulator recovers the modulation signal (which in broadcast receivers is an audio signal, a voltage oscillating at an audio frequency rate representing the sound waves) from the modulated radio carrier wave; (4) the modulation signal  is amplified further in an audio amplifier, then is applied to a loudspeaker or earphone to convert it to sound waves.\n\nAlthough the TRF receiver is used in a few applications, it has practical disadvantages which make it inferior to the superheterodyne receiver below, which is used in most applications.[6]  The drawbacks stem from the fact that in the TRF the filtering, amplification, and demodulation are done at the high frequency of the incoming radio signal.  The bandwidth of a filter increases with its center frequency, so as the TRF receiver is tuned to different frequencies its bandwidth varies.   Most important, the increasing congestion of the radio spectrum requires that radio channels be spaced very close together in frequency.  It is extremely difficult to build filters operating at radio frequencies that have a narrow enough bandwidth to separate closely spaced radio stations.  TRF receivers typically must have many cascaded tuning stages to achieve adequate selectivity.   The Advantages section below describes how the superheterodyne receiver overcomes these problems.\n\n\nThe superheterodyne design[edit]\n\nMain article: Superheterodyne receiver\n\n  \nBlock diagram of a superheterodyne receiver. The dotted line indicates that the RF filter and local oscillator must be tuned in tandem.\n\n\n\nThe superheterodyne receiver, invented in 1918  by Edwin Armstrong[7] is the design used in almost all modern receivers[8][6][9][10]  except a few specialized applications.\n\nIn the superheterodyne, the radio frequency signal from the antenna is shifted down to a lower \"intermediate frequency\" (IF), before it is processed.[11][12][13][14]  The incoming radio frequency signal from the antenna is mixed with an unmodulated signal generated by a local oscillator (LO) in the receiver.  The mixing is done in a nonlinear circuit called the \"mixer\".    The result at the output of the mixer is a heterodyne or beat frequency at the difference between these two frequencies.  The process is similar to the way two musical notes at different frequencies played together produce a beat note.  This lower frequency is called the intermediate frequency (IF).  The IF signal  also has all the information that was present in the original RF signal.   The IF signal passes through  filter and amplifier stages,[9] then is demodulated in a detector, recovering the original modulation.\n\nThe receiver is easy to tune; to receive a different frequency it is only necessary to change the local oscillator frequency.  The stages of the receiver after the mixer operates at the fixed intermediate frequency (IF) so the IF bandpass filter does not have to be adjusted to different frequencies.  The fixed frequency allows modern receivers to use sophisticated quartz crystal, ceramic resonator, or surface acoustic wave (SAW) IF filters that have very high Q factors, to improve selectivity.\n\nThe RF filter on the front end of the receiver is needed to prevent interference from any radio signals at the image frequency.  Without an input filter the receiver can receive incoming RF signals at two different frequencies,.[15][10][14][16]   The receiver can be designed to receive on either of these two frequencies; if the receiver is designed to receive on one, any other radio station or radio noise on the other frequency may pass through and interfere with the desired signal. A single tunable RF filter stage rejects the image frequency; since these are relatively far from the desired frequency, a simple filter provides adequate rejection. Rejection of interfering signals much closer in frequency to the desired signal is handled by the multiple sharply-tuned stages of the intermediate frequency amplifiers, which do no need to change their tuning.[10]  This filter does not need great selectivity, but as the receiver is tuned to different frequencies it must \"track\" in tandem with the local oscillator.  The RF filter also serves to limit the bandwidth applied to the RF amplifier, preventing it from being overloaded by strong out-of-band signals.\n\n\n  \nBlock diagram of a dual-conversion superheterodyne receiver\n\n\n\nTo achieve both good image rejection and selectivity, many modern superhet receivers  use two intermediate frequencies; this is called a dual-conversion or double-conversion superheterodyne.[6]  The incoming RF signal is first mixed with one local oscillator signal in the first mixer to convert it to a high IF frequency, to allow efficient filtering out of the image frequency, then this first IF is mixed with a second local oscillator signal in a second mixer to convert it to a low IF frequency for good bandpass filtering.  Some receivers even use triple-conversion.\n\nAt the cost of the extra stages, the superheterodyne receiver provides the advantage of greater selectivity than can be achieved with a TRF design. Where very high frequencies are in use, only the initial stage of the receiver needs to operate at the highest frequencies; the remaining stages can provide much of the receiver gain at lower frequencies which may be easier to manage. Tuning is simplified compared to a multi-stage TRF design, and only two stages need to track over the tuning range. The total amplification of the receiver is divided between three amplifiers at different frequencies; the RF, IF, and audio amplifier. This reduces problems with feedback and parasitic oscillations that are encountered in receivers where most of the amplifier stages operate at the same frequency, as in the TRF receiver.[11] \n\nThe most important advantage is that better selectivity can be achieved by doing the filtering at the lower intermediate frequency.[6][9][11] One of the most important parameters of a receiver is its bandwidth, the band of frequencies it accepts. In order to reject nearby interfering stations or noise, a narrow bandwidth is required.   In all known filtering techniques, the bandwidth of the filter increases in proportion with the frequency, so by performing the filtering at the lower  \n  \n    \n      \n        \n          f\n          \n            IF\n          \n        \n        \n      \n    \n    {\\displaystyle f_{\\text{IF}}\\,}\n  \n, rather than the frequency of the original radio signal \n  \n    \n      \n        \n          f\n          \n            RF\n          \n        \n        \n      \n    \n    {\\displaystyle f_{\\text{RF}}\\,}\n  \n, a narrower bandwidth can be achieved.  Modern FM and television broadcasting, cellphones and other communications services, with their narrow channel widths, would be impossible without the superheterodyne.[9]\n\n\nAutomatic gain control (AGC)[edit]\n\nMain article: Automatic gain control\n\nThe signal strength (amplitude) of the radio signal from a receiver's antenna varies drastically, by orders of magnitude, depending on how far away the radio transmitter is, how powerful it is, and propagation conditions along the path of the radio waves.[17]  The strength of the signal received from a given transmitter varies with time due to changing propagation conditions of the path through which the radio wave passes, such as multipath interference; this is called fading.[17][6]  In an AM receiver the amplitude of the audio signal from the detector, and the sound volume, is proportional to the amplitude of the radio signal, so fading causes variations in the volume.  In addition as the receiver is tuned between strong and weak stations, the volume of the sound from the speaker would vary drastically.  Without an automatic system to handle it, in an AM receiver constant adjustment of the volume control would be required.\n\nWith other types of modulation like FM or FSK the amplitude of the modulation does not vary with the radio signal strength, but in all types the demodulator requires a certain range of signal amplitude to operate properly.[6][18]  Insufficient signal amplitude will cause an increase of noise in the demodulator, while excessive signal amplitude will cause amplifier stages to overload (saturate), causing distortion (clipping) of the signal.\n\nTherefore, almost all modern receivers include a feedback control system which monitors the average level of the radio signal at the detector, and adjusts the gain of the amplifiers to give the optimum signal level for demodulation.[6][18][17]   This is called automatic gain control (AGC).  AGC can be compared to the dark adaptation mechanism in the human eye; on entering a dark room the gain of the eye is increased by the iris opening.[17]  In its simplest form an AGC system consists of a rectifier which converts the RF signal to a varying DC level, a lowpass filter to smooth the variations and produce an average level.[18]  This is applied as a control signal to an earlier amplifier stage, to control its gain. In a superheterodyne receiver AGC is usually applied to the IF amplifier, and there may be a second AGC loop to control the gain of the RF amplifier to prevent it from overloading, too.\n\nIn certain receiver designs such as modern digital receivers, a related problem is DC offset of the signal.  This is corrected by a similar feedback system.\n\n\nHistory[edit]\n\nMain article: History of radio\n\nRadio waves were first identified in German physicist Heinrich Hertz's 1887 series of experiments to prove James Clerk Maxwell's electromagnetic theory.  Hertz used spark-excited dipole antennas to generate the waves and micrometer spark gaps attached to dipole and loop antennas to detect them.[19][20][21]  These primitive devices are more accurately described as radio wave sensors, not \"receivers\", as they could only detect radio waves within about 100 feet of the transmitter, and were not used for communication but instead as laboratory instruments in scientific experiments.\n\n\nSpark era[edit]\n\nMain article: Wireless telegraphy\n\n  \nGuglielmo Marconi, who built the first radio receivers,  with his early spark transmitter (right) and coherer receiver (left) from the 1890s. The receiver records the Morse code on paper tape\n\n\n\n  \nGeneric block diagram of an unamplified radio receiver from the wireless telegraphy era[22]\n\n\n\n  \nExample of transatlantic radiotelegraph message recorded on paper tape by a siphon recorder at RCA's New York receiving center in 1920. The translation of the Morse code is given below the tape.\n\n\n\nThe first radio transmitters, used during the initial three decades of radio from 1887 to 1917, a period called the spark era,  were spark gap transmitters which generated radio waves by discharging a capacitance through an electric spark.[23][24][25]  Each spark produced a transient pulse of radio waves which decreased rapidly to zero.[19][21]   These damped waves could not be modulated to carry sound, as in modern AM and FM transmission.   So spark transmitters could not transmit  sound, and instead transmitted information by radiotelegraphy. The transmitter was switched on and off rapidly by the operator using a telegraph key, creating different length pulses of damped radio waves  (\"dots\" and \"dashes\") to spell out text messages in Morse code.[21][24]\n\nTherefore, the first radio receivers did not have to extract an audio signal from the radio wave like modern receivers, but just detected the presence of the radio signal, and produced a sound during the \"dots\" and \"dashes\".[21]  The device which did this was called a \"detector\".  Since there were no amplifying devices at this time, the sensitivity of the receiver mostly depended on the detector. Many different detector devices were tried.   Radio receivers during the spark era consisted of these parts:[6]\n\n\n\tAn antenna, to intercept the radio waves and convert them to tiny radio frequency electric currents.\n\tA tuned circuit, consisting of a capacitor connected to a coil of wire, which acted as a bandpass filter to select the desired signal out of all the signals picked up by the antenna.   Either the capacitor or coil was adjustable to tune the receiver to the frequency of different transmitters.  The earliest receivers, before 1897, did not have tuned circuits, they responded to all radio signals picked up by their antennas, so they had little frequency-discriminating ability and received any transmitter in their vicinity.[26]  Most receivers used a pair of tuned circuits with their coils magnetically coupled, called a resonant transformer (oscillation transformer) or \"loose coupler\".\n\tA detector, which produced a pulse of DC current for each damped wave received.\n\tAn indicating device such as an earphone, which converted the pulses of current into sound waves.  The first receivers used an electric bell instead.  Later receivers in commercial wireless systems used a Morse siphon recorder,[19] which consisted of an ink pen mounted on a needle swung by an electromagnet (a galvanometer)  which drew a line on a moving paper tape. Each string of damped waves constituting a Morse \"dot\" or \"dash\" caused the needle to swing over, creating a displacement of the line, which could be read off the tape.   With such an automated receiver a radio operator didn't have to continuously monitor the receiver.\n\n\nThe signal from the spark gap transmitter consisted of damped waves repeated at an audio frequency rate, from 120 to perhaps 4000 per second, so in the earphone the signal sounded like a musical tone or buzz, and the Morse code \"dots\" and \"dashes\" sounded like beeps.\n\nThe first person to use radio waves for communication was Guglielmo Marconi.[24][27]  Marconi invented little himself, but he  was first to believe that radio could be a practical communication medium, and singlehandedly developed the first wireless telegraphy systems, transmitters and receivers, beginning in 1894-5,[27] mainly by improving technology invented by others.[24][28][29][30]\n[31][32]  Oliver Lodge and Alexander Popov were also experimenting with similar radio wave receiving apparatus at the same time in 1894-5,[29][33] but they are not known to have transmitted Morse code during this period,[24][27] just strings of random pulses.  Therefore, Marconi is usually given credit for building the first radio receivers.\n\n\nCoherer receiver[edit]\n\nMain article: Coherer\n\n  \nCoherer from 1904 as developed by Marconi.\n\n\n\n\n\nOne of Marconi's first coherer receivers, used in his \"black box\" demonstration at Toynbee Hall, London, 1896. The coherer is at right, with the \"tapper\" just behind it, The relay is at left, batteries are in background\n\n\nA typical commercial radiotelegraphy receiver from the first decade of the 20th century.   The coherer (right) detects the pulses of radio waves, and the \"dots\" and \"dashes\" of Morse code were recorded in ink on paper tape by a siphon recorder (left) and transcribed later.\n\n\n\n\n\nThe first radio receivers invented by Marconi, Oliver Lodge and Alexander Popov in 1894-5 used a primitive radio wave detector called a coherer, invented in 1890 by Edouard Branly and improved by Lodge and Marconi.[19][24][26][29][33][34][35]  The coherer was a glass tube with metal electrodes at each end, with loose metal powder between the electrodes.[19][24][36]  It initially had a high resistance.  When a radio frequency voltage was applied to the electrodes, its resistance dropped and it conducted electricity. In the receiver the coherer was connected directly between the antenna and ground.  In addition to the antenna, the coherer was connected in a DC circuit with a battery and relay. When the incoming radio wave reduced the resistance of the coherer, the current from the battery flowed through it, turning on the relay to ring a bell or make a mark on a paper tape in a siphon recorder.   In order to restore the coherer to its previous nonconducting state to receive the next pulse of radio waves, it had to be tapped mechanically to disturb the metal particles.[19][24][33][37]  This was done by a \"decoherer\", a clapper which struck the tube, operated by an electromagnet powered by the relay.\n\nThe coherer is an obscure antique device, and even today there is some uncertainty about the exact physical mechanism by which the various types worked.[19][28][38]   However it can be seen that it was essentially a bistable device, a radio-wave-operated switch, and so it did not have the ability to rectify the radio wave to demodulate the later amplitude modulated (AM) radio transmissions that carried sound.[19][28]\n\nIn a long series of experiments Marconi found that by using an elevated wire monopole antenna instead of Hertz's dipole antennas he could transmit longer distances, beyond the curve of the Earth, demonstrating that radio was not just a laboratory curiosity but a commercially viable communication method.  This culminated in his historic transatlantic wireless transmission on December 12, 1901 from Poldhu, Cornwall to St. John's, Newfoundland, a distance of  3500 km (2200 miles), which was received by a coherer.[28][32]  However the usual range of coherer receivers even with the powerful transmitters of this era was limited to a few hundred miles.\n\nThe coherer remained the dominant detector used in early radio receivers for about 10 years,[36] until replaced by the crystal detector and electrolytic detector around 1907.  In spite of much development work, it was a very crude unsatisfactory device.[19][24]  It was not very sensitive, and also responded to impulsive radio noise (RFI), such as nearby lights being switched on or off, as well as to the intended signal.[24][36] Due to the cumbersome mechanical \"tapping back\" mechanism it was limited to a data rate of about 12-15 words per minute of Morse code, while a spark-gap transmitter could transmit Morse at up to 100 WPM with a paper tape machine.[39][40]\n\n\n\n\nOther early detectors[edit]\n\n  \nExperiment to use human brain as a radio wave detector, 1902\n\n\n\nThe coherer's poor performance motivated a great deal of research to find better radio wave detectors, and many were invented.  Some strange devices were tried; researchers experimented with using frog legs[41] and even a human brain[42] from a cadaver as detectors.[19][43]\n\nBy the first years of the 20th century, experiments in using amplitude modulation (AM) to transmit sound by radio (radiotelephony) were being made.   So a second goal of detector research was to find detectors that could demodulate an AM signal, extracting the audio (sound) signal from the radio carrier wave.  It was found by trial and error that this could be done by a detector that  exhibited \"asymmetrical conduction\"; a device that conducted current in one direction but not in the other.[44]  This rectified the alternating current radio signal, removing one side of the carrier cycles, leaving a pulsing DC current whose amplitude varied with the audio modulation signal.  When applied to an earphone this would reproduce the transmitted sound.\n\nBelow are the detectors that saw wide use before vacuum tubes took over around 1920.[45][46]  All except the magnetic detector could rectify and therefore receive AM signals:\n\n\n\n\n  \nMagnetic detector\n\n\n\n\tMagnetic detector - Developed by Guglielmo Marconi in 1902 from a method invented by Ernest Rutherford and used by the Marconi Co. until it adopted the Audion vacuum tube around 1912, this was a mechanical device consisting of an endless band of iron wires which passed between two pulleys turned by a windup mechanism.[47][48][49][50]   The iron wires passed through a coil of fine wire attached to the antenna, in a magnetic field created by two magnets.  The hysteresis of the iron induced a pulse of current in a sensor coil each time a radio signal passed through the exciting coil.  The magnetic detector was used on shipboard receivers due to its insensitivity to vibration.  One was part of the wireless station of the RMS Titanic which was used to summon help during its famous 15 April 1912 sinking.[51]\n\n\n\n\n  \nElectrolytic detector\n\n\n\n\tElectrolytic detector  (\"liquid barretter\") - Invented in 1903 by Reginald Fessenden, this consisted of a thin silver-plated platinum wire enclosed in a glass rod, with the tip making contact with the surface of a cup of nitric acid.[19][48][52][53][54]  The electrolytic action caused current to be conducted in only one direction.  The detector was used until about 1910.[48] Electrolytic detectors that Fessenden had installed on US Navy ships received the first AM radio broadcast on Christmas Eve, 1906, an evening of Christmas music transmitted by Fessenden using his new alternator transmitter.[19]\n\n\n\n\n\n\nEarly Fleming valve.\n\n\nMarconi valve receiver for use on ships had two Fleming valves (top) in case one burned out. It was used on the RMS Titanic.\n\n\n\n\n\n\tThermionic diode (Fleming valve) - The first vacuum tube, invented in 1904 by John Ambrose Fleming, consisted of an evacuated glass bulb containing two electrodes: a cathode consisting of a hot wire filament similar to that in an incandescent light bulb, and a metal plate anode.[26][55][56][57]   Fleming, a consultant to Marconi, invented the valve as a more sensitive detector for transatlantic wireless reception.  The filament was heated by a separate current through it and emitted electrons into the tube by thermionic emission, an effect which had been discovered by Thomas Edison.  The radio signal was applied between the cathode and anode.  When the anode was positive, a current of electrons flowed from the cathode to the anode, but when the anode was negative the electrons were repelled and no current flowed.   The Fleming valve was used to a limited extent but was not popular because it was expensive, had limited filament life, and was not as sensitive as electrolytic or crystal detectors.[55]\n\n\n\n\n  \nA galena cat's whisker detector from a 1920s crystal radio\n\n\n\n\tCrystal detector  (cat's whisker detector) - invented around 1904-1906 by Henry H. C. Dunwoody and Greenleaf Whittier Pickard, based on Karl Ferdinand Braun's  1874 discovery of \"asymmetrical conduction\" in crystals, these were the most successful and widely used detectors before the vacuum tube era[44][45] and gave their name to the crystal radio receiver (below).[48][58][59]   One of the first semiconductor electronic devices, a crystal detector consisted of a pea-sized pebble of a crystalline semiconductor mineral such as galena (lead sulfide) whose surface was touched by a fine springy metal wire mounted on an adjustable arm.[26] This functioned as a primitive diode which conducted electric current in only one direction. In addition to their use in crystal radios, carborundum crystal detectors were also used in some early vacuum tube radios because they were more sensitive than the vacuum tube grid-leak detector.\n\n\n\n\nDuring the vacuum tube era, the term \"detector\" changed from meaning a radio wave detector to mean a demodulator, a device that could extract the audio modulation signal from a radio signal.  That is its meaning today.\n\n\nTuning[edit]\n\n\"Tuning\" means adjusting the frequency of the receiver to the frequency of the desired radio transmission.  The first receivers had no tuned circuit, the detector was connected directly between the antenna and ground. Due to the lack of any frequency selective components besides the antenna,  the bandwidth of the receiver was equal to the broad bandwidth of the antenna.[25][26][34][60]  This was acceptable and even necessary because the first Hertzian spark transmitters also lacked a tuned circuit. Due to the impulsive nature of the spark, the energy of the radio waves was spread over a very wide band of frequencies.[61][62]  To receive enough energy from this wideband signal the receiver had to have a wide bandwidth also.\n\nWhen more than one spark transmitter was radiating in a given area, their frequencies overlapped, so their signals interfered with each other, resulting in garbled reception.[25][60][63] Some method was needed to allow the receiver to select which transmitter's signal to receive.[63][64] Multiple wavelengths produced by a poorly tuned transmitter caused the signal to \"dampen\", or die down, greatly reducing the power and range of transmission.[65]  In 1892, William Crookes gave a lecture[66] on radio in which he suggested using resonance to reduce the bandwidth of transmitters and receivers. Different transmitters could then be \"tuned\" to transmit on different frequencies so they didn't interfere.[32][61][67]   The receiver would also have a resonant circuit (tuned circuit), and could receive a particular transmission by \"tuning\" its resonant circuit to the same frequency as the transmitter, analogously to tuning a musical instrument to resonance with another.  This is the system used in all modern radio.\n\nTuning was used in Hertz's original experiments[68] and practical application of tuning showed up in the early to mid 1890s in wireless systems not specifically designed for radio communication. Nikola Tesla's March 1893 lecture demonstrating the wireless transmission of power for lighting (mainly by what he thought was ground conduction[69]) included elements of tuning. The wireless lighting system consisted of a spark-excited grounded resonant transformer with a wire antenna which transmitted power across the room to another resonant transformer tuned to the frequency of the transmitter, which lighted a Geissler tube.[29][67] Use of tuning in free space \"Hertzian waves\" (radio) was explained and demonstrated in Oliver Lodge's 1894 lectures on Hertz's work.[70] At the time Lodge was demonstrating the physics and optical qualities of radio waves instead of attempting to build a communication system but he would go on to develop methods (patented in 1897) of tuning radio (what he called \"syntony\"), including using variable inductance to tune antennas.[71][72][73]\n\nBy 1897 the advantages of tuned systems had become clear, and Marconi and the other wireless researchers had incorporated tuned circuits, consisting of capacitors and inductors connected together, into their transmitters and receivers.[25][29][32][34][60][72]  The tuned circuit acted like an electrical analog of a tuning fork.  It had a high impedance at its resonant frequency, but a low impedance at all other frequencies.  Connected between the antenna and the detector it served as a bandpass filter, passing the signal of the desired station to the detector, but routing all other signals to ground.[26]  The frequency of the station received f was determined by the capacitance C and inductance L in the tuned circuit:    \n\n\n\t\t\n  \n    \n      \n        f\n        =\n        \n          \n            1\n            \n              2\n              π\n              \n                \n                  L\n                  C\n                \n              \n            \n          \n        \n        \n      \n    \n    {\\displaystyle f={1 \\over 2\\pi {\\sqrt {LC}}}\\,}\n  \n\n\n\n\n\n\n\nInductive coupling[edit]\n\n  \nMarconi's inductively coupled coherer receiver from his controversial April 1900 \"four circuit\" patent no. 7,777.\n\n\n\n\n\nBraun receiving transformer from 1904\n\n\nCrystal receiver from 1914 with \"loose coupler\" tuning transformer.  The secondary coil (1) can be slid in or out of the primary (in box) to adjust the coupling. Other components: (2) primary tuning capacitor, (3) secondary tuning capacitor, (4) loading coil, (5) crystal detector, (8) headphones\n\n\n\n\n\nIn order to reject radio noise and interference from other transmitters near in frequency to the desired station, the bandpass filter (tuned circuit) in the receiver has to have a narrow bandwidth, allowing only a narrow band of frequencies through.[25][26]  The form of bandpass filter that was used in the first receivers, which has continued to be used in receivers until recently, was the  double-tuned inductively-coupled circuit, or resonant transformer (oscillation transformer or RF transformer).[25][29][32][34][72][74]   The antenna and ground were connected to a coil of wire, which was magnetically coupled to a second coil with a capacitor across it, which was connected to the detector.[26]  The RF alternating current from the antenna through the primary coil created a magnetic field which induced a current in the secondary coil which fed the detector.  Both primary and secondary were tuned circuits;[60] the primary coil resonated with the capacitance of the antenna, while the secondary coil resonated with the capacitor across it. Both were adjusted to the same resonant frequency.\n\nThis circuit had two advantages.[26]  One was that by using the correct turns ratio, the impedance of the antenna could be matched to the impedance of the receiver, to transfer maximum RF power to the receiver.  Impedance matching was important to achieve maximum receiving range in the unamplified receivers of this era.[22][26]  The coils usually had taps which could be selected by a multiposition switch.  The second advantage was that due to \"loose coupling\" it had a much narrower bandwidth than a simple tuned circuit, and the bandwidth could be adjusted.[25][74]  Unlike in an ordinary transformer, the two coils were \"loosely coupled\"; separated physically so not all the magnetic field from the primary passed through the secondary, reducing the mutual inductance.  This gave the coupled tuned circuits much \"sharper\" tuning, a narrower bandwidth than a single tuned circuit.  In the \"Navy type\" loose coupler (see picture), widely used with crystal receivers, the smaller secondary coil was mounted on a rack which could be slid in or out of the primary coil, to vary the mutual inductance between the coils.[25][75]  When the operator encountered an interfering signal at a nearby frequency, the secondary could be slid further out of the primary, reducing the coupling, which narrowed the bandwidth, rejecting the interfering signal.  A disadvantage was that all three adjustments in the loose coupler - primary tuning, secondary tuning, and coupling - were interactive; changing one changed the others. So tuning in a new station was a process of successive adjustments.\n\nSelectivity became more important as spark transmitters were replaced by continuous wave transmitters which transmitted on a narrow band of frequencies, and broadcasting led to a proliferation of closely spaced radio stations crowding the radio spectrum.[26]   Resonant transformers continued to be used as the bandpass filter in vacuum tube radios, and new forms such as the variometer were invented.[75][76]    Another advantage of the double-tuned transformer for AM reception was that when properly adjusted it had a \"flat top\" frequency response curve as opposed to the \"peaked\" response of a single tuned circuit.[77]  This allowed it to pass the sidebands of AM modulation on either side of the carrier with little distortion, unlike a single tuned circuit which attenuated the higher audio frequencies.   Until recently the bandpass filters in the superheterodyne circuit used in all modern receivers were made with resonant transformers, called IF transformers.\n\n\nPatent disputes[edit]\n\nMarconi's initial radio system had relatively poor tuning limiting its range and adding to interference.[78] To overcome this drawback he developed a four circuit system with tuned coils in \"syntony\" at both the transmitters and receivers.[78] His 1900 British #7,777 (four sevens) patent for tuning filed in April 1900 and granted a year later opened the door to patents disputes since it infringed on the Syntonic patents of Oliver Lodge, first filed in May 1897, as well as patents filed by Ferdinand Braun.[78] Marconi was able to obtain patents in the UK and France but the US version of his tuned four circuit patent, filed in November 1900, was initially rejected based on it being anticipated by Lodge's tuning system, and refiled versions were rejected because of the prior patents by Braun, and Lodge.[79] A further clarification and re-submission was rejected because it infringed on parts of two prior patents Tesla had obtained for his wireless power transmission system.[80] Marconi's lawyers managed to get a resubmitted patent reconsidered by another examiner who initially rejected it due to a pre-existing John Stone Stone tuning patent, but it was finally approved it in June 1904 based on it having a unique system of variable inductance tuning that was different from Stone[81][82] who tuned by varying the length of the antenna.[79] When Lodge's Syntonic patent was extended in 1911 for another 7 years the Marconi Company agreed to settle that patent dispute, purchasing Lodge's radio company with its patent in 1912, giving them the priority patent they needed.[83][84] Other patent disputes would crop up over the years including a 1943 US Supreme Court ruling on the Marconi Companies ability to sue the US government over patent infringement during World War I. The Court rejected the Marconi Companies suit saying they could not sue for patent infringement when their own patents did not seem to have priority over the patents of Lodge, Stone, and Tesla.[29][67]\n\n\n\n\nCrystal radio receiver[edit]\n\nMain article: Crystal radio\n\n\n\nPrior to 1920 the crystal receiver was the main type used in wireless telegraphy stations, and sophisticated models were made, like this Marconi Type 106 from 1915.\n\n\nFamily listening to the first broadcasts around 1920 with a crystal receiver.  The mother and father have to share an earphone\n\n\nAfter vacuum tube receivers appeared around 1920, the crystal set became a simple cheap alternative radio used by youth and the poor.\n\n\n\n\n\n\n\nSimple crystal radio. The capacitance of the wire antenna connected to the coil serves as the capacitor in the tuned circuit.\n\n\nTypical \"loose coupler\" crystal radio circuit\n\n\n\n\n\nAlthough it was invented in 1904 in the wireless telegraphy era, the crystal radio receiver could also rectify AM transmissions and served as a bridge to the broadcast era.  In addition to being the main type used in commercial  stations during the wireless telegraphy era, it was the first receiver to be used widely by the public.[85]  During the first two decades of the 20th century, as radio stations began to transmit in AM voice (radiotelephony) instead of radiotelegraphy, radio listening became a popular hobby, and the crystal was the simplest, cheapest detector.   The millions of people who purchased or homemade these inexpensive reliable receivers created the mass listening audience for the first radio broadcasts, which began around 1920.[86] By the late 1920s the crystal receiver was superseded by vacuum tube receivers and became commercially obsolete.  However it continued to be used by youth and the poor until World War 2.[85]  Today these simple radio receivers are constructed by students as educational science projects.\n\nThe crystal radio used a cat's whisker detector, invented by Harrison H. C. Dunwoody and Greenleaf Whittier Pickard in 1904, to extract the audio from the radio frequency signal.[26][48][87]   It consisted of a mineral crystal, usually galena,  which was lightly touched by a fine springy wire (the \"cat whisker\") on an adjustable arm.[48][88]  The resulting crude semiconductor junction functioned as a Schottky barrier diode, conducting in  only one direction.  Only particular sites on the crystal surface worked as detector junctions, and the junction could be disrupted by the slightest vibration.  So a usable site was found by trial and error before each use; the operator would drag the cat's whisker across the crystal until the radio began functioning. Frederick Seitz, a later semiconductor researcher, wrote:\n\n\nSuch variability, bordering on what seemed the mystical, plagued the early history of crystal detectors and caused many of the vacuum tube experts of a later generation to regard the art of crystal rectification as being close to disreputable.[89]\n\n\nThe crystal radio was unamplified and ran off the power of the radio waves received from the radio station, so it had to be listened to with earphones; it could not drive a loudspeaker.[26][88]  It required a long wire antenna, and its sensitivity depended on how large the antenna was.  During the wireless era it was used in commercial and military longwave stations with huge antennas to receive long distance radiotelegraphy traffic, even including transatlantic traffic.[90][91]  However, when used to receive broadcast stations a typical home crystal set had a more limited range of about 25 miles.[92]  In sophisticated crystal radios the \"loose coupler\" inductively coupled tuned circuit was used to increase the Q.   However it still had poor selectivity compared to modern receivers.[88]\n\n\n\n\nHeterodyne receiver and BFO[edit]\n\nMain article: Heterodyne\n\n  \nRadio receiver with Poulsen \"tikker\" consisting of a commutator disk turned by a motor to interrupt the carrier.\n\n\n\nBeginning around 1905 continuous wave (CW) transmitters began to replace spark transmitters for radiotelegraphy because they had much greater range.  The first continuous wave transmitters were the Poulsen arc invented in 1904 and the Alexanderson alternator developed 1906-1910, which were replaced by vacuum tube transmitters beginning around 1920.[21]\n\nThe continuous wave radiotelegraphy signals produced by these transmitters required a different method of reception.[93][94]   The radiotelegraphy signals produced by spark gap transmitters consisted of strings of damped waves repeating at an audio rate, so the \"dots\" and \"dashes\" of Morse code were audible as a tone or buzz in the receivers' earphones.    However the new continuous wave radiotelegraph signals simply consisted of pulses of unmodulated carrier (sine waves).  These were inaudible in the receiver headphones.  To receive this new modulation type, the receiver had to produce some kind of tone during the pulses of carrier.\n\nThe first crude device that did this was the tikker, invented in 1908 by Valdemar Poulsen.[45][93]\n[95]  This was a vibrating interrupter with a capacitor at the tuner output which served as a rudimentary modulator, interrupting the carrier at an audio rate, thus producing a buzz in the earphone when the carrier was present.[8]  A similar device was the \"tone wheel\" invented by Rudolph Goldschmidt, a wheel spun by a motor with contacts spaced around its circumference, which made contact with a stationary brush.\n\n\n  \nFessenden's heterodyne radio receiver circuit\n\n\n\nIn 1901 Reginald Fessenden had invented a better means of accomplishing this.[93][95][96][97]   In his heterodyne receiver an unmodulated sine wave radio signal at a frequency fO offset from the incoming radio wave carrier fC was applied to a rectifying detector such as a crystal detector or electrolytic detector, along with the radio signal from the antenna.  In the detector the two signals mixed, creating two new heterodyne (beat) frequencies at the sum fC + fO and the difference  fC − fO between these frequencies.  By choosing fO correctly the lower heterodyne fC − fO  was in the audio frequency range, so it was audible as a tone in the earphone whenever the carrier was present.  Thus the \"dots\" and \"dashes\" of Morse code were audible as musical \"beeps\".  A major attraction of this method during this pre-amplification period was that the heterodyne receiver actually amplified the signal somewhat, the detector had \"mixer gain\".[95]\n\nThe receiver was ahead of its time, because when it was invented there was no oscillator capable of producing the radio frequency sine wave  fO with the required stability.[98]  Fessenden first used his large radio frequency alternator,[8] but this wasn't practical for ordinary receivers.  The heterodyne receiver remained a laboratory curiosity until a cheap compact source of continuous waves appeared, the vacuum tube electronic oscillator[95] invented by Edwin Armstrong and Alexander Meissner in 1913.[45][99]  After this it became the standard method of receiving CW radiotelegraphy.  The heterodyne oscillator is the ancestor of the beat frequency oscillator (BFO) which is used to receive radiotelegraphy in communications receivers today.  The heterodyne oscillator had to be retuned each time the receiver was tuned to a new station, but in modern superheterodyne receivers the BFO signal beats with the fixed intermediate frequency, so the beat frequency oscillator can be a fixed frequency.\n\nArmstrong later used Fessenden's heterodyne principle in his superheterodyne receiver (below).[95][8]\n\n\n\n\nVacuum tube era[edit]\n\n  \nUnlike today, when almost all radios use a variation of the superheterodyne design, during the 1920s vacuum tube radios used a variety of competing circuits.\n\n\n\n  \nDuring the \"Golden Age of Radio\" (1920 to 1950), families gathered to listen to the home radio in the evening, such as this Zenith console model 12-S-568 from 1938, a 12 tube superheterodyne with pushbutton tuning and 12 inch cone speaker.\n\n\n\nThe Audion (triode) vacuum tube  invented by Lee De Forest in 1906 was the first practical amplifying device and revolutionized radio.[55]  Vacuum tube transmitters replaced spark transmitters and made possible four new types of modulation: continuous wave (CW) radiotelegraphy, amplitude modulation (AM) around 1915 which could carry audio (sound), frequency modulation (FM) around 1938 which had much improved audio quality, and single sideband (SSB).\n\nThe amplifying vacuum tube used energy from a battery or electrical outlet to increase the power of the radio signal, so vacuum tube receivers could be more sensitive and have a greater reception range than the previous unamplified receivers. The increased audio output power also allowed them to drive loudspeakers instead of earphones, permitting more than one person to listen.  The first loudspeakers were produced around 1915.  These changes caused radio listening to evolve explosively from a solitary hobby to a popular social and family pastime.  The development of amplitude modulation (AM) and vacuum tube transmitters during World War I, and the availability of cheap receiving tubes after the war, set the stage for the start of AM broadcasting, which sprang up spontaneously around 1920.\n\nThe advent of radio broadcasting increased the market for radio receivers greatly, and transformed them into a consumer product.[100][101][102] At the beginning of the 1920s the radio receiver was a forbidding high-tech device, with many cryptic knobs and controls requiring technical skill to operate, housed in an unattractive black metal box, with a tinny-sounding horn loudspeaker.[101]   By the 1930s, the broadcast receiver had become a piece of furniture, housed in an attractive wooden case, with standardized controls anyone could use, which occupied a respected place in the home living room.  In the early radios the multiple tuned circuits required multiple knobs to be adjusted to tune in a new station.  One of the most important ease-of-use innovations was \"single knob tuning\", achieved by linking the tuning capacitors together mechanically.[101][102]   The dynamic cone loudspeaker invented in 1924 greatly improved audio frequency response over the previous horn speakers, allowing music to be  reproduced with good fidelity.[101][103] Convenience features like large lighted dials, tone controls, pushbutton tuning, tuning indicators and automatic gain control (AGC) were added.[100][102]  The receiver market was divided into the above broadcast receivers and communications receivers, which were used for two-way radio communications such as shortwave radio.[104]\n\nA vacuum tube receiver required several power supplies at different voltages, which in early radios were supplied by separate batteries.  By 1930 adequate rectifier tubes were developed, and the expensive batteries were replaced by a transformer power supply that worked off the house current.[100][101]\n\nVacuum tubes were bulky, expensive, had a limited lifetime, consumed a large amount of power and produced a lot of waste heat, so the number of tubes a receiver could economically have was a limiting factor.  Therefore, a goal of tube receiver design was to get the most performance out of a limited number of tubes.  The major radio receiver designs, listed below,  were invented during the vacuum tube era.\n\nA defect in many early vacuum tube receivers was that the amplifying stages could oscillate, act as an oscillator, producing unwanted radio frequency alternating currents.[26][105][106]  These parasitic oscillations mixed with the carrier of the radio signal in the detector tube, producing audible beat notes (heterodynes); annoying whistles, moans, and howls in the speaker.  The oscillations were caused by feedback in the amplifiers; one major feedback path was the capacitance between the plate and grid in early triodes.[105][106]  This was solved by the Neutrodyne circuit, and later the development of the tetrode and pentode around 1930.\n\nEdwin Armstrong is one of the most important figures in radio receiver history, and during this period invented technology which continues to dominate radio communication.[8]  He was the first to give a correct explanation of how De Forest's triode tube worked.   He invented the feedback oscillator, regenerative receiver, the superregenerative receiver, the superheterodyne receiver, and modern frequency modulation (FM).\n\n\n\n\nThe first vacuum tube receivers[edit]\n\n  \nDe Forest's first commercial Audion receiver, the RJ6 which came out in 1914.  The Audion tube was always mounted upside down, with its delicate filament loop hanging down, so it did not sag and touch the other electrodes in the tube.\n\n\n\n\n\n\n\n\n\nExample of single tube triode grid-leak receiver from 1920, the first type of amplifying radio receiver. In the grid leak circuit, electrons attracted to the grid during the positive half cycles of the radio signal charge the grid capacitor with a negative voltage of a few volts, biasing the grid near its cutoff voltage, so the tube conducts only during the positive half-cycles, rectifying the radio carrier.\n\n\n\n\nThe first amplifying vacuum tube, the Audion, a crude triode, was invented in 1906 by Lee De Forest as a more sensitive detector for radio receivers, by adding a third electrode to the thermionic diode detector, the Fleming valve.[55][76][107][108]  It was not widely used until its amplifying ability was recognized around 1912.[55]  The first tube receivers, invented by De Forest and built by hobbyists until the mid 1920s, used a single Audion which functioned as a grid-leak detector which both rectified and amplified the radio signal.[76][105][109] There was uncertainty about the operating principle of the Audion until Edwin Armstrong explained both its amplifying and demodulating functions in a 1914 paper.[110][111][112]  The grid-leak detector circuit was also used in regenerative, TRF, and early superheterodyne receivers (below) until the 1930s.\n\nTo give enough output power to drive a loudspeaker, 2 or 3 additional Audion stages were needed for audio amplification.[76]  Many early hobbyists could only afford a single tube receiver, and listened to the radio with earphones, so early tube amplifiers and speakers were sold as add-ons.\n\nIn addition to very low gain of about 5 and a short lifetime of about 30 – 100 hours, the primitive Audion had erratic characteristics because it was  incompletely evacuated. De Forest believed that ionization of residual air was key to Audion operation.[113][114]  This made it a more sensitive detector[113] but also caused its electrical characteristics to vary during use.[76][107] As the tube heated up, gas released from the metal elements would change the pressure in the tube, changing the plate current and other characteristics, so it required periodic bias adjustments to keep it at the correct operating point.   Each Audion stage usually had a rheostat to adjust the filament current, and often a potentiometer or multiposition switch to control the plate voltage.  The filament rheostat was also used as a volume control.  The many controls made multitube Audion receivers complicated to operate.\n\nBy 1914, Harold Arnold at Western Electric and Irving Langmuir at GE realized that the residual gas was not necessary; the Audion could operate on electron conduction alone.[107][113][114]    They evacuated tubes to a lower pressure of 10−9 atm, producing the first \"hard vacuum\" triodes.  These more stable tubes did not require bias adjustments, so radios had fewer controls and were easier to operate.[107]   During World War I civilian radio use was prohibited, but by 1920 large-scale production of vacuum tube radios began. The \"soft\" incompletely evacuated tubes were used as detectors through the 1920s then became obsolete.\n\n\n\n\nRegenerative (autodyne) receiver[edit]\n\nMain article: Regenerative receiver\n\n  \nBlock diagram of regenerative receiver\n\n\n\n  \nCircuit of single tube Armstrong regenerative receiver\n\n\n\n\n\nHomemade Armstrong regenerative receiver, 1922. The \"tickler\" coil (L3) is visible on the front panel, coupled to the input tuning coils.\n\n\nCommercial regenerative receiver from the early 1920s, the Paragon RA-10 (center) with separate 10R single tube RF amplifier (left) and three tube DA-2 detector and 2-stage audio amplifier unit (right).  The 4 cylindrical dry cell \"A\" batteries (right rear) powered the tube filaments, while the 2 rectangular \"B\" batteries provided plate voltage.\n\n\nHomemade one-tube Armstrong regenerative receiver from the 1940s. The tickler coil is a variometer winding mounted on a shaft inside the tuning coil (upper right) which can be rotated by a knob on the front panel.\n\n\n\n\n\nThe regenerative receiver, invented by Edwin Armstrong[115] in 1913 when he was a 23-year-old college student,[116]  was used very widely until the late 1920s particularly by hobbyists who could only afford a single-tube radio. Today transistor versions of the circuit are still used in a few inexpensive applications like walkie-talkies.  In the regenerative receiver the gain (amplification) of a vacuum tube or transistor is increased by using regeneration (positive feedback); some of the energy from the tube's output  circuit is fed back into the input circuit with a feedback loop.[26][105][117][118][119]  The early vacuum tubes had very low gain (around 5).  Regeneration could not only increase the gain of the tube enormously, by a factor of 15,000 or more, it also increased the Q factor of the tuned circuit, decreasing (sharpening) the bandwidth of the receiver by the same factor, improving selectivity greatly.[105][117][118] The receiver had a control to adjust the feedback.   The tube also acted as a grid-leak detector to rectify the AM signal.[105]\n\nAnother advantage of the circuit was that the tube could be made to oscillate, and thus a single tube could serve as both a beat frequency oscillator and a detector, functioning as a heterodyne receiver to make CW radiotelegraphy transmissions audible.[105][117][118]  This mode was called an autodyne receiver.  To receive radiotelegraphy, the feedback was increased until the tube oscillated, then the oscillation frequency was tuned to one side of the transmitted signal.  The incoming radio carrier signal and local oscillation signal mixed in the tube and produced an audible heterodyne (beat) tone at the difference between the frequencies.\n\nA widely used design was the Armstrong circuit, in which a \"tickler\" coil in the plate circuit was coupled to the tuning coil in the grid circuit, to provide the feedback.[26][105][119] The feedback was controlled by a variable resistor, or alternately by moving the two windings physically closer together to increase loop gain, or apart to reduce it.[117]  This was done by an adjustable air core transformer called a variometer (variocoupler).  Regenerative detectors were sometimes also used in TRF and superheterodyne receivers.\n\nOne problem with the regenerative circuit was that when used with large amounts of regeneration the selectivity (Q) of the tuned circuit could be too sharp, attenuating the AM sidebands, thus distorting the audio modulation.[120]  This was usually the limiting factor on the amount of feedback that could be employed.\n\nA more serious drawback was that it could act as an inadvertent radio transmitter, producing interference (RFI) in nearby receivers.[26][105][117][118][119][121] In AM reception, to get the most sensitivity the tube was operated very close to instability and could easily break into oscillation (and in CW reception did oscillate), and the resulting radio signal was radiated by its wire antenna.  In nearby receivers, the regenerative's signal would beat with the signal of the station being received in the detector, creating annoying heterodynes, (beats), howls and whistles.[26]   Early regeneratives which oscillated easily were called \"bloopers\", and were made illegal in Europe.  One preventative measure was to use a stage of RF amplification before the regenerative detector, to isolate it from the antenna.[105][117]  But by the mid 1920s \"regens\" were no longer sold by the major radio manufacturers.[26]\n\n\n\n\nSuperregenerative receiver[edit]\n\nMain article: Regenerative receiver § Superregenerative receiver\n\n  \nArmstrong presenting his superregenerative receiver, June 28, 1922, Columbia University\n\n\n\nThis was a receiver invented by Edwin Armstrong in 1922 which used regeneration in a more sophisticated way, to give greater gain.[106][122][123][124][125]  It was used in a few shortwave receivers in the 1930s, and is used today in a few cheap high frequency applications such as walkie-talkies and garage door openers.\n\nIn the regenerative receiver the loop gain of the feedback loop was less than one, so the tube (or other amplifying device) did not oscillate but was close to oscillation, giving large gain.[122]   In the superregenerative receiver, the loop gain was made equal to one, so the amplifying device actually began to oscillate, but the oscillations were interrupted periodically.[106][9]  This allowed a single tube to produce gains of over 106.\n\n\n\n\nTRF receiver[edit]\n\nMain article: Tuned radio frequency receiver\n\n\n\nEarly 6 tube TRF receiver from around 1920. The 3 large knobs adjust the 3 tuned circuits to tune in stations\n\n\nAtwater-Kent TRF receiver from the 1920s with 2 RF stages (left), detector and two audio amplifier tubes (right).  The loudspeaker consists of an earphone coupled to an acoustic horn which amplifies the sound.\n\n\nTuning a Neutrodyne TRF receiver with 3 tuned circuits (large knobs), 1924. For each station the index numbers on the dials had to be written down so that the station could be found again.\n\n\n\n\n\nThe tuned radio frequency (TRF) receiver, invented in 1916 by Ernst Alexanderson, improved both sensitivity and selectivity by using several stages of amplification before the detector, each with a tuned circuit, all tuned to the frequency of the station.[26][106][9][126][127]\n\nA major problem of early TRF receivers was that they were complicated to tune, because each resonant circuit had to be adjusted to the frequency of the station before the radio would work.[26][106]  In later TRF receivers the tuning capacitors were linked together mechanically (\"ganged\") on a common shaft so they could be adjusted with one knob, but in early receivers the frequencies of the tuned circuits could not be made to \"track\" well enough to allow this, and each tuned circuit had its own tuning knob.[9][128]  Therefore, the knobs had to be turned simultaneously.   For this reason most TRF sets had no more than three tuned RF stages.[105][120]\n\nA second problem was that the multiple radio frequency stages, all tuned to the same frequency, were prone to oscillate,[128][129] and the parasitic oscillations mixed with the radio station's carrier in the detector, producing audible heterodynes (beat notes), whistles and moans, in the speaker.[26][105][106][127]  This was solved by the invention of the Neutrodyne circuit (below) and the development of the tetrode later around 1930, and better shielding between stages.[127]\n\nToday the TRF design is used in a few integrated (IC) receiver chips.  From the standpoint of modern receivers the disadvantage of the TRF is that the gain and bandwidth of the tuned RF stages are not constant but vary as the receiver is tuned to different frequencies.[129]  Since the bandwidth of a filter with a given Q is proportional to the frequency, as the receiver is tuned to higher frequencies its bandwidth increases.[11][15]\n\n\n\n\nNeutrodyne receiver[edit]\n\nMain article: Neutrodyne\n\n  \nHazeltine's prototype Neutrodyne receiver, presented at a March 2, 1923 meeting of the Radio Society of America at Columbia University.\n\n\n\nThe Neutrodyne receiver, invented in 1922 by Louis Hazeltine,[130][131] was a TRF receiver with a \"neutralizing\" circuit added to each radio amplification stage to cancel the feedback to prevent the oscillations which caused the annoying whistles in the TRF.[26][106][127][128][132]  In the neutralizing circuit a capacitor fed a feedback current from the plate circuit to the grid circuit which was 180° out of phase with the feedback which caused the oscillation, canceling it.[105]  The Neutrodyne was popular until the advent of cheap tetrode tubes around 1930.\n\n\n\n\nReflex receiver[edit]\n\nMain article: Reflex receiver\n\n  \nBlock diagram of simple single tube reflex receiver\n\n\n\nThe reflex receiver, invented in 1914 by Wilhelm Schloemilch and Otto von Bronk,[133] and rediscovered and extended to multiple tubes in 1917 by Marius Latour[133][134] and William H. Priess, was a design used in some inexpensive radios of the 1920s[135] which enjoyed a resurgence in small portable tube radios of the 1930s[136] and again in a few of the first transistor radios in the 1950s.[106][137]  It is another example of an ingenious circuit invented to get the most out of a limited number of active devices.   In the reflex receiver the RF signal from the tuned circuit is passed through one or more amplifying tubes or transistors, demodulated in a detector, then the resulting audio signal is passed again though the same amplifier stages for audio amplification.[106]  The separate radio and audio signals present simultaneously in the amplifier do not interfere with each other since they are at different frequencies, allowing the amplifying tubes to do \"double duty\".  In addition to single tube reflex receivers, some TRF and superheterodyne receivers had several stages \"reflexed\".[137]   Reflex radios were prone to a defect called \"play-through\" which meant that the volume of audio did not go to zero when the volume control was turned down.[137]\n\n\n\n\nSuperheterodyne receiver[edit]\n\nMain article: Superheterodyne receiver\n\n  \nThe first superheterodyne receiver built at Armstrong's Signal Corps laboratory in Paris during World War I. It is constructed in two sections, the mixer and local oscillator (left) and three IF amplification stages and a detector stage (right). The intermediate frequency was 75 kHz.\n\n\n\n\n\n\n\n\n\nDuring the 1940s the vacuum tube superheterodyne receiver was refined into a cheap-to-manufacture form called the \"All American Five\" because it only required 5 tubes, which was used in almost all broadcast radios until the end of the tube era in the 1970s.\n\n\n\n\nThe superheterodyne, invented in 1918 during World War I by Edwin Armstrong[7] when he was in the Signal Corps, is the design used in almost all modern receivers, except a few specialized applications.[8][9][10]  It is a more complicated design than the other receivers above, and when it was invented required 6 - 9 vacuum tubes, putting it beyond the budget of most consumers, so it was initially used mainly in commercial and military communication stations.[12]  However, by the 1930s the \"superhet\" had replaced all the other receiver types above.\n\nIn the superheterodyne, the \"heterodyne\" technique invented by Reginald Fessenden is used to shift the frequency of the radio signal down to a lower \"intermediate frequency\" (IF), before it is processed.[11][12][13] Its operation and advantages over the other radio designs in this section are described above in The superheterodyne design\n\nBy the 1940s the superheterodyne AM broadcast receiver was refined into a cheap-to-manufacture design called the \"All American Five\", because it only used five vacuum tubes: usually a converter (mixer/local oscillator), an IF amplifier, a detector/audio amplifier, audio power amplifier, and a rectifier.  This design was used for virtually all commercial radio receivers until the transistor replaced the vacuum tube in the 1970s.\n\n\n\n\nSemiconductor era[edit]\n\n  \nA modern smartphone has several digital radio transmitters and receivers to connect to different devices; a cellular receiver, a wireless modem, a bluetooth modem, and a GPS receiver\n\n\n\nThe invention of the transistor in 1947 revolutionized radio technology, making truly portable receivers possible, beginning with transistor radios in the late 1950s.  Although portable vacuum tube radios were made, tubes were bulky and inefficient, consuming large amounts of power and requiring several large batteries to produce the filament and plate voltage.  Transistors did not require a heated filament, reducing power consumption, and were smaller and much less fragile than vacuum tubes.\n\n\nDigital technologies[edit]\n\nThe development of integrated circuits (ICs) in the 1970s created another revolution, allowing an entire radio receiver to be put on a chip.  ICs reversed the economics of radio design used with vacuum tube receivers. Since the marginal cost of adding additional amplifying devices (transistors) to the chip was essentially zero, the size and cost of the receiver was dependent not on how many active components were used, but on the passive components; inductors and capacitors, which could not be integrated easily on the chip.[19]\n\nAs a result, the current trend in receivers is to use digital circuitry on the chip to do functions that were formerly done by analog circuits which require passive components.  In a digital receiver the IF signal is sampled and digitized, and the bandpass filtering and detection functions are performed by digital signal processing (DSP) on the chip.  Another benefit of DSP is that the properties of the receiver; channel frequency, bandwidth, gain, etc. can be dynamically changed by software to react to changes in the environment; these systems are known as software-defined radios or cognitive radio.\n\nMany of the functions performed by analog electronics can be performed by software instead.  The benefit is that software is not affected by temperature, physical variables, electronic noise and manufacturing defects.[138]\n\nDigital signal processing permits signal processing techniques that would be cumbersome, costly, or otherwise infeasible with analog methods.  A digital signal is essentially a stream or sequence of numbers that relay a message through some sort of medium such as a wire. DSP hardware can tailor the bandwidth of the receiver to current reception conditions and to the type of signal.  A typical analog only receiver may have a limited number of fixed bandwidths, or only one, but a DSP receiver may have 40 or more individually selectable filters.  DSP is used in cell phone systems to reduce the data rate required to transmit voice.\n\n\"PC radios\", or radios that are designed to be controlled by a standard PC are controlled by specialized PC software using a serial port connected to the radio. A \"PC radio\" may not have a front-panel at all, and may be designed exclusively for computer control, which reduces cost.\n\nSome PC radios have the great advantage of being field upgradable by the owner. New versions of the DSP firmware can be downloaded from the manufacturer's web site and uploaded into the flash memory of the radio. The manufacturer can then in effect add new features to the radio over time, such as adding new filters, DSP noise reduction, or simply to correct bugs.\n\nA full-featured radio control program allows for scanning and a host of other functions and, in particular, integration of databases in real-time, like a \"TV-Guide\" type capability. This is particularly helpful in locating all transmissions on all frequencies of a particular broadcaster, at any given time. Some control software designers have even integrated Google Earth to the shortwave databases, so it is possible to \"fly\" to a given transmitter site location with a click of a mouse. In many cases the user is able to see the transmitting antennas where the signal is originating from.\n\nSince the Graphical User Interface to the radio has considerable flexibility, new features can be added by the software designer. Features that can be found in advanced control software programs today include a band table, GUI controls corresponding to traditional radio controls, local time clock and a UTC clock, signal strength meter, a database for shortwave listening with lookup capability, scanning capability, or text-to-speech interface.\n\nThe next level in integration is \"software-defined radio\", where all filtering, modulation and signal manipulation is done in software. This may be a PC soundcard or by a dedicated piece of DSP hardware. There will be a RF front-end to supply an intermediate frequency to the software defined radio.   These systems can provide additional capability over \"hardware\" receivers. For example, they can record large swaths of the radio spectrum to a hard drive for \"playback\" at a later date. The same SDR that one minute is demodulating a simple AM broadcast may also be able to decode an HDTV broadcast in the next. An open-source project called GNU Radio is dedicated to evolving a high-performance SDR.\n\nAll-digital radio transmitters and receivers present the possibility of advancing the capabilities of radio.[139]\n\n\nPortable radios[edit]\n\nCompanies first began manufacturing radios advertised as portables shortly after the start of commercial broadcasting in the early 1920s. The vast majority of tube radios of the era used batteries and could be set up and operated anywhere, but most did not have features designed for portability such as handles and built in speakers. Some of the earliest portable tube radios were the Winn \"Portable Wireless Set No. 149\" that appeared in 1920 and the Grebe Model KT-1 that followed a year later. Crystal sets such as the Westinghouse Aeriola Jr. and the RCA Radiola 1 were also advertised as portable radios.[140] \n\nThanks to miniaturized vacuum tubes first developed in 1940, smaller portable radios appeared on the market from manufacturers such as Zenith and General Electric. First introduced in 1942, Zenith's Trans-Oceanic line of portable radios were designed to provide entertainment broadcasts as well as being able to tune into weather, marine and international shortwave stations. By the 1950s, a \"golden age\" of tube portables included lunchbox-sized tube radios like the Emerson 560, that featured molded plastic cases. So-called \"pocket portable\" radios like the RCA BP10 had existed since the 1940s, but their actual size was compatible with only the largest of coat pockets.[140] \n\nThe development of the bipolar junction transistor in the early 1950s resulted in it being licensed to a number of electronics companies, such as Texas Instruments, who produced a limited run of transistorized radios as a sales tool. The Regency TR-1, made by the Regency Division of I.D.E.A. (Industrial Development Engineering Associates) of Indianapolis, Indiana, was launched in 1951. The era of true, shirt-pocket sized portable radios followed, with manufacturers such as Sony, Zenith, RCA, DeWald, and Crosley offering various models.[140]\n\n\nSee also[edit]\n\n\t\tWikimedia Commons has media related to Radio receivers.\n\n\n\n\tRadio portal\n\n\n\n\tShortwave radio\n\tDielectric wireless receiver\n\tDigital Audio Broadcast (DAB)\n\tDirect conversion receiver\n\tMinimum detectable signal\n\tRadiogram (furniture)\n\tReceiver (information theory)\n\tSelectivity (electronic)\n\tSensitivity (electronics)\n\tNoise (electronics)\n\tDistortion\n\tSatnav\n\tTelecommunication\n\tTelevision receive-only\n\tTuner (radio)\n\n\nReferences[edit]\n\n\n\t^ Radio-Electronics, Radio Receiver Technology\n\n\t^ Pizzi, Skip; Jones, Graham (2014). A Broadcast Engineering Tutorial for Non-Engineers. CRC Press. p. 208. ISBN 978-1317906834.\n\n\t^ Libbey, Robert (1994). Signal And Image Processing Sourcebook. Springer Science and Business Media. p. 63. ISBN 978-0442308612.\n\n\n\t^ Olsen, George H. (2013). Electronics Made Simple. Elsevier. p. 258. ISBN 978-1483140780.\n\n\n\t^ Ganguly, Partha Kumar (2015). Principles of Electronics. PHI Learning Pvt. Ltd. pp. 286–289. ISBN 978-8120351240.\n\n\n\t^ a b c d e f g h i Rudersdorfer, Ralf (2013). Radio Receiver Technology: Principles, Architectures and Applications. John Wiley and Sons. ISBN 978-1118647844.\n Chapter 1\n\n\t^ a b Armstrong, Edwin H. (February 1921). \"A new system of radio frequency amplification\". Proceedings of the Institute of Radio Engineers. 9 (1): 3–11. Retrieved December 23, 2015.\n\n\n\t^ a b c d e f Lee, Thomas H. (2004) The Design of CMOS Radio Frequency Integrated Circuits, 2nd Ed., p. 14-15\n\n\t^ a b c d e f g h Dixon, Robert (1998). Radio Receiver Design. CRC Press. pp. 57–61. ISBN 978-0824701611.\n\n\n\t^ a b c d Williams, Lyle Russell (2006) The New Radio Receiver Building Handbook, p. 28-30\n\n\t^ a b c d e Army Technical Manual TM 11-665: C-W and A-M Radio Transmitters and Receivers, 1952, p. 195-197\n\n\t^ a b c McNicol, Donald (1946) Radio's Conquest of Space, p. 272-278\n\n\t^ a b Terman, Frederick E. (1943) Radio Engineers' Handbook, p. 636-638\n\n\t^ a b Carr, Joseph J. (2001). The Technician's Radio Receiver Handbook: Wireless and Telecommunication Technology. Newnes. pp. 8–11. ISBN 978-0750673198.\n\n\n\t^ a b Rembovsky, Anatoly; Ashikhmin, Alexander; Kozmin, Vladimir;  et al. (2009). Radio Monitoring: Problems, Methods and Equipment. Springer Science and Business Media. p. 26. ISBN 978-0387981000.\n\n\n\t^ Terman, Frederick E. (1943) Radio Engineers' Handbook, p. 645\n\n\t^ a b c d Drentea, Cornell (2010). Modern Communications Receiver Design and Technology. Artech House. pp. 325–330. ISBN 978-1596933101.\n\n\n\t^ a b c Hagen, Jon B. (1996). Radio-Frequency Electronics: Circuits and Applications. Cambridge Univ. Press. p. 60. ISBN 978-0521553568.\n\n\n\t^ a b c d e f g h i j k l m Lee, Thomas H. (2004). The Design of CMOS Radio-Frequency Integrated Circuits, 2nd Ed. UK: Cambridge University Press. pp. 1–8. ISBN 978-0521835398.\n\n\n\t^ Appleyard, Rollo (October 1927). \"Pioneers of Electrical Communication part 5 - Heinrich Rudolph Hertz\" (PDF). Electrical Communication. 6 (2): 67. Retrieved December 19, 2015.\n\n\n\t^ a b c d e Phillips, Vivian J. (1980). Early Radio Wave Detectors. London: Inst. of Electrical Engineers. pp. 4–12. ISBN 978-0906048245.\n\n\n\t^ a b Rudersdorfer, Ralf (2013). Radio Receiver Technology: Principles, Architectures and Applications. John Wiley and Sons. pp. 1–2. ISBN 978-1118647844.\n\n\n\t^ Nahin, Paul J. (2001). The Science of Radio: With Matlab and Electronics Workbench Demonstration, 2nd Ed. Springer Science & Business Media. pp. 45–48. ISBN 978-0387951508.\n\n\n\t^ a b c d e f g h i j Coe, Lewis (2006). Wireless Radio: A History. McFarland. pp. 3–8. ISBN 978-0786426621.\n\n\n\t^ a b c d e f g h McNicol, Donald (1946). Radio's Conquest of Space. Murray Hill Books. pp. 57–68.\n\n\n\t^ a b c d e f g h i j k l m n o p q r s t u v w Carr, Joseph (1990). Old Time Radios! Restoration and Repair. McGraw-Hill Professional. pp. 5–13. ISBN 978-0071507660.\n\n\n\t^ a b c Beauchamp, Ken (2001). History of Telegraphy. IET. pp. 184–186. ISBN 978-0852967928.\n\n\n\t^ a b c d Nahin, Paul J. (2001) The Science of Radio, p. 53-56\n\n\t^ a b c d e f g Klooster, John W. (2007). Icons of Invention. ABC-CLIO. pp. 159–161. ISBN 978-0313347436.\n\n\n\t^ McNicol, Donald (1946). Radio's Conquest of Space. Murray Hill Books. pp. 37–45.\n\n\n\t^ Hong, Sungook (2001). Wireless: From Marconi's Black-box to the Audion. MIT Press. pp. 1–2. ISBN 978-0262082983.\n\n\n\t^ a b c d e Sarkar et al (2006) History of Wireless, p. 349-358, archive Archived 2016-05-17 at the Portuguese Web Archive\n\n\t^ a b c Fleming, John Ambrose (1910). The Principles of Electric Wave Telegraphy and Telephony, 2nd Ed. London: Longmans, Green and Co. pp. 420–428.\n\n\n\t^ a b c d Stone, Ellery W. (1919). Elements of Radiotelegraphy. D. Van Nostrand Co. pp. 203–208.\n\n\n\t^ Phillips, Vivian 1980 Early Radio Wave Detectors, p. 18-21\n\n\t^ a b c McNicol, Donald (1946) Radio's Conquest of Space, p. 107-113\n\n\t^ Phillips, Vivian 1980 Early Radio Wave Detectors, p. 38-42\n\n\t^ Phillips, Vivian 1980 Early Radio Wave Detectors, p. 57-60\n\n\t^ Maver, William Jr. (August 1904). \"Wireless Telegraphy To-Day\". American Monthly Review of Reviews. 30 (2): 192. Retrieved January 2, 2016.\n\n\n\t^ Aitken, Hugh G.J. (2014). The Continuous Wave: Technology and American Radio, 1900-1932. Princeton Univ. Press. p. 190. ISBN 978-1400854608.\n\n\n\t^ \"Frog's leg method of detecting wireless waves\". Electrical Review and Western Electrician. 62 (3): 164. January 18, 1913. Retrieved January 30, 2018.\n\n\n\t^ Collins, Archie Frederick (February 22, 1902). \"The effect of electric waves on the human brain\". Electrical World and Engineer. 39 (8): 335–338. Retrieved January 26, 2018.\n\n\n\t^ Phillips, Vivian 1980 Early Radio Wave Detectors, p. 198-203\n\n\t^ a b Phillips, Vivian 1980 Early Radio Wave Detectors, p. 205-209\n\n\t^ a b c d Marriott, Robert H. (September 17, 1915). \"United States Radio Development\". Proc. Of the Inst. Of Radio Engineers. 5 (3): 184. doi:10.1109/jrproc.1917.217311. Retrieved 2010-01-19.\n\n\n\t^ Secor, H. Winfield (January 1917). \"Radio Detector Development\". Electrical Experimenter. 4 (9): 652–656. Retrieved January 3, 2016.\n\n\n\t^ McNicol, Donald (1946). Radio's Conquest of Space. Murray Hill Books. pp. 121–123.\n\n\n\t^ a b c d e f Stone, Ellery (1919) Elements of Radiotelegraphy, p. 209-221\n\n\t^ Fleming, John Ambrose (1910) The Principles of Electric Wave Telegraphy and Telephony, p. 446-455\n\n\t^ Phillips, Vivian 1980 Early Radio Wave Detectors, p. 85-108\n\n\t^ Stephenson, Parks (November 2001). \"The Marconi Wireless Installation in R.M.S. Titanic\". Old Timer's Bulletin. 42 (4). Retrieved May 22, 2016.\n copied on Stephenson's marconigraph.com personal website\n\n\t^ McNicol, Donald (1946) Radio's Conquest of Space, p. 115-119\n\n\t^ Fleming, John Ambrose (1910) The Principles of Electric Wave Telegraphy and Telephony, p. 460-464\n\n\t^ Phillips, Vivian 1980 Early Radio Wave Detectors, p. 65-81\n\n\t^ a b c d e Lee, Thomas H. (2004) The Design of CMOS Radio Frequency Integrated Circuits, 2nd Ed., p. 9-11\n\n\t^ McNicol, Donald (1946) Radio's Conquest of Space, p. 157-162\n\n\t^ Fleming, John Ambrose (1910) The Principles of Electric Wave Telegraphy and Telephony, p. 476-483\n\n\t^ McNicol, Donald (1946) Radio's Conquest of Space, p. 123-131\n\n\t^ Fleming, John Ambrose (1910) The Principles of Electric Wave Telegraphy and Telephony, p. 471-475\n\n\t^ a b c d Hong, Sungook (2001). Wireless: From Marconi's Black-box to the Audion. MIT Press. pp. 89–100. ISBN 978-0262082983.\n\n\n\t^ a b Aitken, Hugh 2014 Syntony and Spark: The origins of radio, p. 70-73\n\n\t^ Beauchamp, Ken (2001) History of Telegraphy, p. 189-190\n\n\t^ a b Kennelly, Arthur E. (1906). Wireless Telegraphy: An Elementary Treatise. New York: Moffatt, Yard and Co. pp. 173–183.\n\n\n\t^ Aitken, Hugh 2014 Syntony and Spark: The origins of radio, p. 31-48\n\n\t^ Jed Z. Buchwald, Scientific Credibility and Technical Standards in 19th and early 20th century Germany and Britain, Springer Science & Business Media - 1996, page 158\n\n\t^ Crookes, William (February 1, 1892). \"Some Possibilities of Electricity\". The Fortnightly Review. 51: 174–176. Retrieved August 19, 2015.\n\n\n\t^ a b c Rockman, Howard B. (2004). Intellectual Property Law for Engineers and Scientists. John Wiley and Sons. pp. 196–199. ISBN 978-0471697398.\n\n\n\t^ Cecil Lewis Fortescue, Wireless Telegraphy, Read Books Ltd - 2013, chapter XIII\n\n\t^ Hong, Sungook (2001). Wireless: From Marconi's Black-box to the Audion. MIT Press. p. 199. ISBN 978-0262082983.\n\n\n\t^ Peter Rowlands, Oliver Lodge and the Liverpool Physical Society, Liverpool University Press - 1990, page 117\n\n\t^ Jed Z. Buchwald, Scientific Credibility and Technical Standards in 19th and early 20th century Germany and Britain, Springer Science & Business Media - 1996, pages 158-159\n\n\t^ a b c Aitken, Hugh G.J. (2014). Syntony and Spark: The Origins of Radio. Princeton Univ. Press. p. 255. ISBN 978-1400857883.\n\n\n\t^ Thomas H. Lee, The Design of CMOS Radio-Frequency Integrated Circuits, Cambridge University Press - 2004, page 35\n\n\t^ a b McNicol, Donald (1946) Radio's Conquest of Space, p. 242-253\n\n\t^ a b Marx, Harry J.; Van Muffling, Adrian (1922). Radio Reception. New York: G. Putnam's Sons. pp. 95–103.\n\n\n\t^ a b c d e McNicol, Donald (1946) Radio's Conquest of Space, p. 254-259\n\n\t^ Terman, Frederick E. (1943). Radio Engineers' Handbook (PDF). New York: McGraw-Hill Book Co. p. 170.\n\n\n\t^ a b c Hong, Sungook (2001). Wireless: From Marconi's Black-box to the Audion. MIT Press. pp. 91-99\n\n\t^ a b Howard B. Rockman, Intellectual Property Law for Engineers and Scientists, John Wiley & Sons - 2004, page 198\n\n\t^ U.S. Patent No. 649,621, 3/15/1900, and part of 645,576, 3/20/1900 (filed Sept. 2, 1897) Marconi Wireless Telegraph Co. of America v. United States. United States v. Marconi Wireless Telegraph Co. of America. 320 U.S. 1 (63 S.Ct. 1393, 87 L.Ed. 1731) \n\n\t^ US Patent no. 714,756, John Stone Stone Method of electric signaling, filed: February 8, 1900, granted: December 2, 1902\n\n\t^ Marconi Wireless Telegraph Co. of America v. United States. United States v. Marconi Wireless Telegraph Co. of America. 320 U.S. 1 (63 S.Ct. 1393, 87 L.Ed. 1731) \n\n\t^ Hong, Sungook (2001). Wireless: From Marconi's Black-box to the Audion. MIT Press. p. 48\n\n\t^ Susan J. Douglas, Listening in: Radio and the American Imagination, U of Minnesota Press, page 50\n\n\t^ a b Basalla, George (1988). The Evolution of Technology. UK: Cambridge University Press. p. 44. ISBN 978-0-521-29681-6.\n\n\n\t^ Corbin, Alfred (2006). The Third Element: A Brief History of Electronics. AuthorHouse. pp. 44–45. ISBN 978-1-4208-9084-6.\n\n\n\t^ Army Technical Manual TM 11-665: C-W and A-M Radio Transmitters and Receivers. US Dept. of the Army. 1952. pp. 167–169.\n\n\n\t^ a b c Williams, Lyle Russell (2006). The New Radio Receiver Building Handbook. Lulu. pp. 20–24. ISBN 978-1847285263.\n\n\n\t^ Riordan, Michael; Lillian Hoddeson (1988). Crystal fire: the invention of the transistor and the birth of the information age. USA: W. W. Norton & Company. pp. 19–21. ISBN 978-0-393-31851-7.\n\n\n\t^ Beauchamp, Ken (2001). History of Telegraphy. Institution of Electrical Engineers. p. 191. ISBN 978-0852967928.\n\n\n\t^ Bucher, Elmer Eustice (1917). Practical Wireless Telegraphy. New York: Wireless Press. p. 306.\n\n\n\t^ Lescarboura, Austin C. (1922). Radio for Everybody. New York: Scientific American Publishing Co. pp. 93–94.\n\n\n\t^ a b c Lauer, Henri; Brown, Harry L. (1920). Radio Engineering Principles. McGraw-Hill. pp. 135–142.\n\n\n\t^ Phillips, Vivian 1980 Early Radio Wave Detectors, p. 172-185\n\n\t^ a b c d e McNicol, Donald (1946). Radio's Conquest of Space. New York: Murray Hill Books. pp. 133–136.\n\n\n\t^ US patent no. 1050441, Reginald A. Fessenden, Electrical signaling apparatus, filed July 27, 1905; granted January 14, 1913\n\n\t^ Hogan, John V. L. (April 1921). \"The Heterodyne Receiver\". The Electric Journal. 18 (4): 116–119. Retrieved January 28, 2016.\n\n\n\t^ Nahin, Paul J. (2001) The Science of Radio, p. 91\n\n\t^ McNicol, Donald (1946) Radio's Conquest of Space, p. 267-270\n\n\t^ a b c McNicol, Donald (1946) Radio's Conquest of Space, p. 341-344\n\n\t^ a b c d e Wurtzler, Steve J. (2007). Electric Sounds: Technological Change and the Rise of Corporate Mass Media. Columbia Univ. Press. pp. 147–148. ISBN 978-0231510080.\n\n\n\t^ a b c Nebeker, Frederik (2009). Dawn of the Electronic Age: Electrical Technologies in the Shaping of the Modern World, 1914 to 1945. John Wiley and Sons. pp. 159–160. ISBN 978-0470409749.\n\n\n\t^ McNicol, Donald (1946) Radio's Conquest of Space, p. 336-340\n\n\t^ Terman, Frederick E. (1943) Radio Engineers' Handbook, p. 656\n\n\t^ a b c d e f g h i j k l m Williams, Lyle Russell (2006). The New Radio Receiver Building Handbook. Lulu. pp. 24–27. ISBN 978-1847285263.\n\n\n\t^ a b c d e f g h i j Lee, Thomas H. (2004) The Design of CMOS Radio Frequency Integrated Circuits, 2nd Ed., p. 15-18\n\n\t^ a b c d Okamura, Sōgo (1994). History of Electron Tubes. IOS Press. pp. 17–22. ISBN 978-9051991451.\n\n\n\t^ De Forest, Lee (January 1906). \"The Audion; A New Receiver for Wireless Telegraphy\". Trans. AIEE. 25: 735–763. doi:10.1109/t-aiee.1906.4764762. Retrieved January 7, 2013.\n The link is to a reprint of the paper in the Scientific American Supplement, No. 1665, November 30, 1907, p.348-350, copied on Thomas H. White's United States Early Radio History website\n\n\t^ Terman, Frederick E. (1943). Radio Engineers' Handbook (PDF). New York: McGraw-Hill Book Co. pp. 564–565.\n\n\n\t^ Armstrong, Edwin (December 12, 1914). \"Operating features of the Audion\". Electrical World. 64 (24): 1149–1152. Bibcode:1916NYASA..27..215A. doi:10.1111/j.1749-6632.1916.tb55188.x. Retrieved May 14, 2017.\n\n\n\t^ McNicol, Donald (1946) Radio's Conquest of Space, p. 180\n\n\t^ Lee, Thomas H. (2004) The Design of CMOS Radio Frequency Integrated Circuits, 2nd Ed., p. 13\n\n\t^ a b c Langmuir, Irving (September 1915). \"The Pure Electron Discharge and its Applications in Radio Telegraphy and Telephony\" (PDF). Proceedings of the IRE. 3 (3): 261–293. doi:10.1109/jrproc.1915.216680. Retrieved January 12, 2016.\n\n\n\t^ a b Tyne, Gerald F. J. (December 1943). \"The Saga of the Vacuum Tube, Part 9\" (PDF). Radio News. 30 (6): 30–31, 56, 58. Retrieved June 17, 2016.\n\n\n\t^ Armstrong, Edwin H. (September 1915). \"Some recent developments in the Audion receiver\" (PDF). Proc. IRE. 3 (9): 215–247. doi:10.1109/JRPROC.1915.216677. Retrieved August 29, 2012.\n\n\n\t^ Armstrong, Edwin H. (April 1921). \"The Regenerative Circuit\". The Electrical Journal. 18 (4): 153–154. Retrieved January 11, 2016.\n\n\n\t^ a b c d e f Army Technical Manual TM 11-665: C-W and A-M Radio Transmitters and Receivers, 1952, p. 187-190\n\n\t^ a b c d Terman, Frederick E. (1943) Radio Engineers' Handbook, p. 574-575\n\n\t^ a b c McNicol, Donald (1946) Radio's Conquest of Space, p. 260-262\n\n\t^ a b Langford-Smith, F. (1953). Radiotron Designer's Handbook, 4th Ed (PDF). Wireless Press for RCA. pp. 1223–1224.\n\n\n\t^ In the early 1920s Armstrong, David Sarnoff head of RCA, and other radio pioneers testified before the US Congress on the need for legislation against radiating regenerative receivers.  Wing, Willis K. (October 1924). \"The Case Against the Radiating Receiver\" (PDF). Broadcast Radio. 5 (6): 478–482. Retrieved January 16, 2016.\n\n\n\t^ a b Army Technical Manual TM 11-665: C-W and A-M Radio Transmitters and Receivers, 1952, p. 190-193\n\n\t^ Terman, Frederick E. (1943). Radio Engineers' Handbook (PDF). New York: McGraw-Hill Book Co. pp. 662–663.\n\n\n\t^ Williams, Lyle Russell (2006) The New Radio Receiver Building Handbook, p. 31-32\n\n\t^ McNicol, Donald (1946) Radio's Conquest of Space, p. 279-282\n\n\t^ Army Technical Manual TM 11-665: C-W and A-M Radio Transmitters and Receivers, 1952, p. 170-175\n\n\t^ a b c d McNicol, Donald (1946) Radio's Conquest of Space, p. 263-267\n\n\t^ a b c Army Technical Manual TM 11-665: C-W and A-M Radio Transmitters and Receivers, 1952, p. 177-179\n\n\t^ a b Terman, Frederick E. (1943). Radio Engineers' Handbook (PDF). New York: McGraw-Hill Book Co. pp. 438–439.\n\n\n\t^ US Patent No. 1450080, Louis Alan Hazeltine, \"Method and electric circuit arrangement for neutralizing capacity coupling\"; filed August 7, 1919; granted March 27, 1923\n\n\t^ Hazeltine, Louis A. (March 1923). \"Tuned Radio Frequency Amplification With Neutralization of Capacity Coupling\" (PDF). Proc. Of the Radio Club of America. 2 (8): 7–12. Retrieved March 7, 2014.\n[permanent dead link]\n\n\t^ Terman, Frederick E. (1943). Radio Engineers' Handbook (PDF). New York: McGraw-Hill Book Co. pp. 468–469.\n\n\n\t^ a b Grimes, David (May 1924). \"The Story of Reflex and Radio Frequency\" (PDF). Radio in the Home. 2 (12): 9–10. Retrieved January 24, 2016.\n\n\n\t^ US Patent no. 1405523, Marius Latour Audion or lamp relay or amplifying apparatus, filed December 28, 1917; granted February 7, 1922\n\n\t^ McNicol, Donald (1946) Radio's Conquest of Space, p. 283-284\n\n\t^ \"Reflexing Today: Operating economy with the newer tubes\" (PDF). Radio World. 23 (17): 3. July 8, 1933. Retrieved January 16, 2016.\n[permanent dead link]\n\n\t^ a b c Langford-Smith, F. (1953). Radiotron Designer's Handbook, 4th Ed (PDF). Wireless Press for RCA. pp. 1140–1141.\n\n\n\t^ \"History of the Radio Receiver\". Radio-Electronics.Com. Archived from the original on 2007-09-16. Retrieved 2007-11-23.\n\n\n\t^ Pizzicato Comes of Age\n\n\t^ a b c Michael B. Schiffer (1991). The Portable Radio in American Life. University of Arizona Press. pp. 66–. ISBN 978-0-8165-1284-3.\n\n\n\n\n\nFurther reading[edit]\n\n\tCommunications Receivers, Third Edition,  Ulrich L. Rohde, Jerry Whitaker,  McGraw Hill, New York, 2001, \nISBN 0-07-136121-9\n\tBuga, N.; Falko A.; Chistyakov N.I. (1990).  Chistyakov N.I. (ed.). Radio Receiver Theory. Translated from the Russian by Boris V. Kuznetsov. Moscow: Mir Publishers. ISBN 978-5-03-001321-3  First published in Russian as «Радиоприёмные устройства»\n\n\n\n\t\tv\n\tt\n\te\n\n\nTelecommunications\n\n\tHistory\t\n\tBeacon\n\tBroadcasting\n\tCable protection system\n\tCable TV\n\tCommunications satellite\n\tComputer network\n\tDrums\n\tElectrical telegraph\n\tFax\n\tHeliographs\n\tHydraulic telegraph\n\tInternet\n\tMass media\n\tMobile phone\n\tOptical telecommunication\n\tOptical telegraphy\n\tPager\n\tPhotophone\n\tPrepaid mobile phone\n\tRadio\n\tRadiotelephone\n\tSatellite communications\n\tSemaphore\n\tSmartphone\n\tSmoke signals\n\tTelecommunications history\n\tTelautograph\n\tTelegraphy\n\tTeleprinter (teletype)\n\tTelephone\n\tThe Telephone Cases\n\tTelevision\n\tUndersea telegraph line\n\tVideoconferencing\n\tVideophone\n\tVideotelephony\n\tWhistled language\n\n\n\n\t\n\n\tPioneers\t\n\tEdwin Howard Armstrong\n\tJohn Logie Baird\n\tPaul Baran\n\tAlexander Graham Bell\n\tTim Berners-Lee\n\tJagadish Chandra Bose\n\tVint Cerf\n\tClaude Chappe\n\tDonald Davies\n\tLee de Forest\n\tPhilo Farnsworth\n\tReginald Fessenden\n\tElisha Gray\n\tErna Schneider Hoover\n\tCharles K. Kao\n\tHedy Lamarr\n\tInnocenzo Manzetti\n\tGuglielmo Marconi\n\tAntonio Meucci\n\tRadia Perlman\n\tAlexander Stepanovich Popov\n\tJohann Philipp Reis\n\tHenry Sutton\n\tNikola Tesla\n\tCamille Tissot\n\tAlfred Vail\n\tCharles Wheatstone\n\tVladimir K. Zworykin\n\n\n\n\n\tTransmission\nmedia\t\n\tCoaxial cable\n\tFiber-optic communication\n\tOptical fiber\n\n\n\tFree-space optical communication\n\tMolecular communication\n\tRadio waves\n\tTransmission line\n\n\n\n\n\tNetwork topology\nand switching\t\n\tLinks\n\tNodes\n\tTerminal node\n\tNetwork switching (circuit\n\tpacket)\n\tTelephone exchange\n\n\n\n\n\tMultiplexing\t\n\tSpace-division\n\tFrequency-division\n\tTime-division\n\tPolarization-division\n\tOrbital angular-momentum\n\tCode-division\n\n\n\n\n\tNetworks\t\n\tARPANET\n\tBITNET\n\tCellular network\n\tComputer\n\tCYCLADES\n\tEthernet\n\tFidoNet\n\tInternet\n\tInternet2\n\tISDN\n\tLAN\n\tMobile\n\tNGN\n\tNPL network\n\tPublic Switched Telephone\n\tRadio\n\tTelecommunications equipment\n\tTelevision\n\tTelex\n\tWAN\n\tWireless network\n\tWorld Wide Web\n\n\n\n\n\t\n\t Category\n\t Outline\n\t Portal\n\t Commons\n\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4050974-6\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Radio_receiver&oldid=917432861\"\n\n\t\t\n\t\tCategories: \tReceiver (radio)\n\n\nHidden categories: \tWebarchive template other archives\n\tCS1: Julian–Gregorian uncertainty\n\tAll articles with dead external links\n\tArticles with dead external links from April 2018\n\tArticles with permanently dead external links\n\tArticles with dead external links from August 2018\n\tCommons category link is on Wikidata\n\tWikipedia articles with GND identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tAsturianu\n\tAvañe'ẽ\n\tБашҡортса\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tEspañol\n\tEsperanto\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tÍslenska\n\tItaliano\n\tעברית\n\tҚазақша\n\tKreyòl ayisyen\n\tລາວ\n\tLatina\n\tLatviešu\n\tLietuvių\n\tMagyar\n\tNederlands\n\t日本語\n\tNorsk nynorsk\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tسنڌي\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t吴语\n\tייִדיש\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 23 September 2019, at 20:10 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "36", "dc:title": "Radio receiver - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Radio-with-Alarm_clock.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-radio_receiver", "title": "Radio receiver - Wikipedia"}}