{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRadio wave - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tRadio wave\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about the radiation. For the generic oscillation, see Radio frequency. For the electronics, see Radio frequency engineering. For the British broadcasting station, see Radio Wave. For other uses, see Radio Waves (disambiguation).\n\n  \nAnimation of a half-wave dipole antenna radiating radio waves, showing the electric field lines.  The antenna in the center is two vertical metal rods connected to a radio transmitter (not shown). The transmitter applies an alternating electric current to the rods, which charges them alternately positive (+) and negative (−).  Loops of electric field leave the antenna and travel away at the speed of light; these are the radio waves. In this animation the action is shown slowed down enormously.\n\n\n\nRadio waves are a type of electromagnetic radiation with wavelengths in the electromagnetic spectrum longer than infrared light. Radio waves have frequencies as high as 300 gigahertz (GHz) to as low as 30 hertz (Hz).[1] At 300 GHz, the corresponding wavelength is 1 mm, and at 30 Hz is 10,000 km. Like all other electromagnetic waves, radio waves travel at the speed of light in vacuum.  They are generated by electric charges undergoing acceleration, such as time varying electric currents.[2]  Naturally occurring radio waves are emitted by lightning and astronomical objects. \n\nRadio waves are generated artificially by transmitters and received by radio receivers, using antennas.   Radio waves are very widely used in modern technology for fixed and mobile radio communication, broadcasting, radar and other navigation systems, communications satellites, wireless computer networks and many other applications. Different frequencies of radio waves have different propagation characteristics in the Earth's atmosphere; long waves can diffract around obstacles like mountains and follow the contour of the earth (ground waves), shorter waves can reflect off the ionosphere and return to earth beyond the horizon (skywaves), while much shorter wavelengths bend or diffract very little and travel on a line of sight, so their propagation distances are limited to the visual horizon.\n\nTo prevent interference between different users, the artificial generation and use of radio waves is strictly regulated by law, coordinated by an international body called the International Telecommunications Union (ITU), which defines radio waves as \"electromagnetic waves of frequencies arbitrarily lower than 3 000 GHz, propagated in space without artificial guide\".[3] The radio spectrum is divided into a number of radio bands on the basis of frequency, allocated to different uses.\n\n\n  \nDiagram of the electric fields (E) and magnetic fields (H) of radio waves emitted by a monopole radio transmitting antenna (small dark vertical line in the center). The E and H fields are perpendicular, as implied by the phase diagram in the lower right.\n\n\n\nContents\n\n\n\t1 Discovery and exploitation\n\t2 Speed, wavelength, and frequency\n\t3 Propagation\n\t4 Radio communication\n\t5 Biological and environmental effects\n\t6 Measurement\n\t7 See also\n\t8 Notes\n\t9 References\n\n\n\n\n\nDiscovery and exploitation[edit]\n\nMain article: History of radio\n\nRadio waves were first predicted by mathematical work done in 1867 by British mathematical physicist James Clerk Maxwell.[4] Maxwell noticed wavelike properties of light and similarities in electrical and magnetic observations. His mathematical theory, now called Maxwell's equations, described light waves and radio waves as waves of electromagnetism that travel in space, radiated by a charged particle as it undergoes acceleration. In 1887, Heinrich Hertz demonstrated the reality of Maxwell's electromagnetic waves by experimentally generating radio waves in his laboratory,[5] showing that they exhibited the same wave properties as light:  standing waves, refraction, diffraction, and polarization.  Radio waves, originally called \"Hertzian waves\",[6] were first used for communication in the mid 1890s by Guglielmo Marconi, who developed the first practical radio transmitters and receivers.  The modern term \"radio wave\" replaced the original name \"Hertzian wave\" around 1912.\n\n\nSpeed, wavelength, and frequency[edit]\n\n  \nAnimated diagram of a half-wave dipole antenna receiving a radio wave.  The antenna consists of two metal rods connected to a receiver R.  The electric field (E, green arrows) of the incoming wave pushes the electrons in the rods back and forth, charging the ends alternately positive (+) and negative (−).  Since the length of the antenna is one half the wavelength of the wave, the oscillating field induces standing waves of voltage (V, represented by red band) and current in the rods. The oscillating currents (black arrows) flow down the transmission line and through the receiver (represented by the resistance R).\n\n\n\nRadio waves in a vacuum travel at the speed of light.[7][8] When passing through a material medium, they are slowed according to that object's permeability and permittivity.  Air is thin enough that in the Earth's atmosphere radio waves travel very close to the speed of light.\n\nThe wavelength is the distance from one peak of the wave's electric field (wave's peak/crest) to the next, and is inversely proportional to the frequency of the wave. The distance a radio wave travels in one second, in a vacuum, is 299,792,458 meters (983,571,056 ft) which is the wavelength of a 1 hertz radio signal. A 1 megahertz radio signal has a wavelength of 299.8 meters (984 ft).\n\n\nPropagation[edit]\n\nMain article: Radio propagation\n\n\tPart of series on\n\tRadio\n\t\n\t\nForms\n\t\nRadio (overland) • Satellite radio • Internet radio\n\t\nUses and forms\n\t\nTalk radio • Internet talk radio • Music radio • Call-in (radio)\n\t\nDevelopments\n\t\nRadio station • \n\n\nMost listened-to programs •\n\t\nPhysics and engineering\n\t\nRadio waves • Radio tower • Radio signal\n\t\tv\n\tt\n\te\n\n\n\n\n\nThe study of radio propagation, how radio waves move in free space and over the surface of the Earth, is vitally important in the design of practical radio systems.  Radio waves passing through different environments experience reflection, refraction, polarization, diffraction, and absorption.  Different frequencies experience different combinations of these phenomena in the Earth's atmosphere, making certain radio bands more useful for specific purposes than others.  Practical radio systems mainly use three different techniques of radio propagation to communicate:[9]\n\n\n\tLine of sight: This refers to radio waves that travel in a straight line from the transmitting antenna to the receiving antenna.  It does not necessarily require a cleared sight path; at lower frequencies radio waves can pass through buildings, foliage and other obstructions.  This is the only method of propagation possible at frequencies above 30 MHz.  On the surface of the Earth, line of sight propagation is limited by the visual horizon to about 64 km (40 mi).   This is the method used by cell phones, FM, television broadcasting and radar.  By using dish antennas to transmit beams of microwaves, point-to-point microwave relay links transmit telephone and television signals over long distances up to the visual horizon.   Ground stations can communicate with satellites and spacecraft billions of miles from Earth.\n\tIndirect propagation: Radio waves can reach points beyond the line-of-sight by diffraction and reflection.[9]  Diffraction allows a radio wave to bend around obstructions such as a building edge, a vehicle, or a turn in a hall.  Radio waves also partially reflect from surfaces such as walls, floors, ceilings, vehicles and the ground.  These propagation methods occur in short range radio communication systems such as cell phones, cordless phones, walkie-talkies, and wireless networks.  A drawback of this mode is multipath propagation, in which radio waves travel from the transmitting to the receiving antenna via multiple paths.  The waves interfere, often causing fading and other reception problems.\n\n\n\tGround waves: At lower frequencies below 2 MHz, in the medium wave and longwave bands, due to diffraction vertically polarized radio waves can bend over hills and mountains, and propagate beyond the horizon, traveling as surface waves which follow the contour of the Earth.   This allows mediumwave and longwave broadcasting stations to have coverage areas beyond the horizon, out to hundreds of miles.  As the frequency drops, the losses decrease and the achievable range increases.  Military very low frequency (VLF) and extremely low frequency (ELF) communication systems can communicate over most of the Earth, and with submarines hundreds of feet underwater.\n\tSkywaves: At medium wave and shortwave wavelengths, radio waves reflect off conductive layers of charged particles (ions) in a part of the atmosphere called the ionosphere.   So radio waves directed at an angle into the sky can return to Earth beyond the horizon;  this is called \"skip\" or \"skywave\" propagation.  By using multiple skips communication at intercontinental distances can be achieved.  Skywave propagation is variable and dependent on atmospheric conditions; it is most reliable at night and in the winter. Widely used during the first half of the 20th century, due to its unreliability skywave communication has mostly been abandoned.    Remaining uses are by military over-the-horizon (OTH) radar systems, by some automated systems, by radio amateurs, and by shortwave broadcasting stations to broadcast to other countries.\n\n\nRadio communication[edit]\n\nMain article: Radio\n\nIn radio communication systems, information is carried across space using radio waves.  At the sending end, the information to be sent, in the form of a time-varying electrical signal, is applied to a radio transmitter.[10]  The information signal can be an audio signal representing sound from a microphone, a video signal representing moving images from a video camera, or a digital signal representing data from a computer.  In the transmitter, an electronic oscillator generates an alternating current oscillating at a radio frequency, called the carrier wave because it serves to \"carry\" the information through the air.  The information signal is used to modulate the carrier, altering some aspect of it, \"piggybacking\" the information on the carrier.  The modulated carrier is amplified and applied to an antenna.  The oscillating current pushes the electrons in the antenna back and forth, creating oscillating electric and magnetic fields, which radiate the energy away from the antenna as radio waves.  The radio waves carry the information to the receiver location.\n\nAt the receiver, the oscillating electric and magnetic fields of the incoming radio wave push the electrons in the receiving antenna back and forth, creating a tiny oscillating voltage which is a weaker replica of the current in the transmitting antenna.[10]  This voltage is applied to the radio receiver, which extracts the information signal.  The receiver first uses a bandpass filter to separate the desired radio station's radio signal from all the other radio signals picked up by the antenna, then amplifies the signal so it is stronger, then finally extracts the information-bearing modulation signal in a demodulator.  The recovered signal is sent to a loudspeaker or earphone to produce sound, or a television display screen to produce a visible image, or other devices.  A digital data signal is applied to a computer or microprocessor, which interacts with a human user.\n\nThe radio waves from many transmitters pass through the air simultaneously without interfering with each other.  They can be separated in the receiver because each transmitter's radio waves oscillate at a different rate, in other words each transmitter has a different frequency, measured in kilohertz (kHz), megahertz (MHz) or gigahertz (GHz).  The bandpass filter in the receiver consists of a tuned circuit which acts like a resonator, similarly to a tuning fork.[10]  It has a natural resonant frequency at which it oscillates.  The resonant frequency is set equal to the frequency of the desired radio station.  The oscillating radio signal from the desired station causes the tuned circuit to oscillate in sympathy, and it passes the signal on to the rest of the receiver.  Radio signals at other frequencies are blocked by the tuned circuit and not passed on.\n\n\nBiological and environmental effects[edit]\n\nRadio waves are nonionizing radiation, which means they do not have enough energy to separate electrons from atoms or molecules, ionizing them, or break chemical bonds, causing chemical reactions or DNA damage.  The main effect of absorption of radio waves by materials is to heat them, similarly to the infrared waves radiated by sources of heat such as a space heater or wood fire.  The oscillating electric field of the wave causes polar molecules to vibrate back and forth, increasing the temperature; this is how a microwave oven cooks food.  However, unlike infrared waves, which are mainly absorbed at the surface of objects and cause surface heating, radio waves are able to penetrate the surface and deposit their energy inside materials and biological tissues.   The depth to which radio waves penetrate decreases with their frequency, and also depends on the material's resistivity and permittivity; it is given by a parameter called the skin depth of the material, which is the depth within which 63% of the energy is deposited.   For example, the 2.45 GHz radio waves (microwaves) in a microwave oven penetrate most foods approximately 2.5 to 3.8 cm (1 to 1.5 inches).   Radio waves have been applied to the body for 100 years in the medical therapy of diathermy for deep heating of body tissue, to promote increased blood flow and healing.  More recently they have been used to create higher temperatures in hyperthermia treatment and to kill cancer cells.  Looking into a source of radio waves at close range, such as the waveguide of a working radio transmitter, can cause damage to the lens of the eye by heating. A strong enough beam of radio waves can penetrate the eye and heat the lens enough to cause cataracts.[11][12][13][14][15]\n\nSince the heating effect is in principle no different from other sources of heat, most research into possible health hazards of exposure to radio waves has focused on \"nonthermal\" effects; whether radio waves have any effect on tissues besides that caused by heating.      Electromagnetic radiation has been classified by the International Agency for Research on Cancer (IARC) as \"Possibly carcinogenic to humans\".[16][17] The conceivable evidence of cancer risk via personal exposure to RF-EMF with mobile telephone use was identified.[18]\n\nRadio waves can be shielded against by a conductive metal sheet or screen, an enclosure of sheet or screen is called a Faraday cage.   A metal screen shields against radio waves as well as a solid sheet as long as the holes in the screen are smaller than about 1/20 of wavelength of the waves.[19]\n\n\nMeasurement[edit]\n\nSince radio frequency radiation has both an electric and a magnetic component, it is often convenient to express intensity of radiation field in terms of units specific to each component. The unit volts per meter (V/m) is used for the electric component, and the unit amperes per meter (A/m) is used for the magnetic component. One can speak of an electromagnetic field, and these units are used to provide information about the levels of electric and magnetic field strength at a measurement location.\n\nAnother commonly used unit for characterizing an RF electromagnetic field is power density. Power density is most accurately used when the point of measurement is far enough away from the RF emitter to be located in what is referred to as the far field zone of the radiation pattern.[20] In closer proximity to the transmitter, i.e., in the \"near field\" zone, the physical relationships between the electric and magnetic components of the field can be complex, and it is best to use the field strength units discussed above. Power density is measured in terms of power per unit area, for example, milliwatts per square centimeter (mW/cm2). When speaking of frequencies in the microwave range and higher, power density is usually used to express intensity since exposures that might occur would likely be in the far field zone.\n\n\nSee also[edit]\n\n\t\tLook up radio wave in Wiktionary, the free dictionary.\n\n\n\n\tRadio portal\n\tTelecommunication portal\n\n\n\n\tRadio astronomy\n\tTelevision transmitter\n\n\nNotes[edit]\n\n\n\t^ Altgelt, CA (2005). \"The World's Largest \"Radio\" Station\" (PDF). hep.wisc.edu. High Energy Physics @ UW Madison. Retrieved 9 Jan 2019.\n\n\t^ Ellingson SW (2016). Radio Systems Engineering. Cambridge University Press. pp. 16–17. ISBN 1316785165.\n\n\n\t^ \"Ch. 1: Terminology and technical characteristics - Terms and definitions\". Radio Regulations (PDF). Geneva: ITU. 2016. p. 7. ISBN 9789261191214.\n\n\n\t^ Harman PM (1998). The natural philosophy of James Clerk Maxwell. Cambridge, England: Cambridge University Press. p. 6. ISBN 0-521-00585-X.\n\n\n\t^ Rubin, J. \"Heinrich Hertz: The Discovery of Radio Waves\". Juliantrubin.com. Retrieved 8 Nov 2011.\n\n\n\t^ White, TH. \"United States Early Radio History. Section 22: Word Origins\". earlyradiohistory.us. Retrieved 9 Jan 2019.\n\n\n\t^ \"Electromagnetic Frequency, Wavelength and Energy Ultra Calculator\". 1728.org. 1728 Software Systems. Retrieved 15 Jan 2018.\n\n\n\t^ \"How Radio Waves Are Produced\". NRAO. Archived from the original on 28 Mar 2014. Retrieved 15 Jan 2018.\n\n\n\t^ a b Seybold JS (2005). \"1.2 Modes of Propagation\". Introduction to RF Propagation. John Wiley and Sons. pp. 3–10. ISBN 0471743682.\n\n\n\t^ a b c Brain, M (7 Dec 2000). \"How Radio Works\". HowStuffWorks.com. Retrieved 11 Sep 2009.\n\n\n\t^ Kitchen R (2001). RF and Microwave Radiation Safety Handbook (2nd ed.). Newnes. pp. 64–65. ISBN 0750643552.\n\n\n\t^ VanderVorst A, Rosen A, Kotsuka Y (2006). RF/Microwave Interaction with Biological Tissues. John Wiley & Sons. pp. 121–122. ISBN 0471752045.\n\n\n\t^ Graf RF, Sheets W (2001). Build Your Own Low-power Transmitters: Projects for the Electronics Experimenter. Newnes. p. 234. ISBN 0750672447.\n\n\n\t^ Elder JA, Cahill DF (1984). \"Biological Effects of RF Radiation\". Biological Effects of Radiofrequency Radiation. US EPA. pp. 5.116–5.119.\n\n\n\t^ Hitchcock RT, Patterson RM (1995). Radio-Frequency and ELF Electromagnetic Energies: A Handbook for Health Professionals. Industrial Health and Safety Series. John Wiley & Sons. pp. 177–179. ISBN 9780471284543.\n\n\n\t^ \"IARC Classifies Radiofrequency Electromagnetic Fields as Possibly Carcinogenic to Humans\" (PDF). www.iarc.fr (Press Release). WHO. 31 May 2011. Retrieved 9 Jan 2019.\n\n\n\t^ \"Agents Classified by the IARC Monographs, Volumes 1–123\". monographs.iarc.fr. IARC. 9 Nov 2018. Retrieved 9 Jan 2019.\n\n\n\t^  Baan, R; Grosse, Y; Lauby-Secretan, B;  et al. (2014). \"Radiofrequency Electromagnetic Fields: evaluation of cancer hazards\" (PDF). monographs.iarc.fr (conference poster). IARC. Retrieved 9 Jan 2019.\n\n\n\t^ Kimmel WD, Gerke D (2018). Electromagnetic Compatibility in Medical Equipment: A Guide for Designers and Installers. Routledge. p. 6.67. ISBN 9781351453370.\n\n\n\t^ National Association of Broadcasters (1996). Antenna & Tower Regulation Handbook. NAB, Science and Technology Department. p. 186. ISBN 9780893242367. Archived from the original on 1 May 2018.\n\n\n\n\n\nReferences[edit]\n\n\tMaxwell, James Clerk (1865). \"VIII. A Dynamical Theory of the Electromagnetic Field\". Philosophical Transactions of the Royal Society of London. 155: 459–512. doi:10.1098/rstl.1865.0008.\n\n\tHertz, Heinrich Rudolph (1893). Electric waves: being researches on the propagation of electric action with finite velocity through space. Cornell University Library. ISBN 9781429740364.\n\n\tRawer, Karl (1993). Wave Propagation in the Ionosphere. Developments in electromagnetic theory and applications series. Dordrecht: Kluwer Academic. ISBN 9780792307754. OCLC 26257685.\n\n\n\n\t\tv\n\tt\n\te\n\n\nRadio spectrum (ITU)\n\n\t\t\nELF     \n   3 Hz/100 Mm  \n  30 Hz/10 Mm\n\n\n\n\t\nSLF         \n  30 Hz/10 Mm   \n 300 Hz/1 Mm\n\n\n\n\t\nULF         \n 300 Hz/1 Mm    \n   3 kHz/100 km\n\n\n\n\t\nVLF          \n   3 kHz/100 km \n  30 kHz/10 km\n\n\n\n\t\nLF                \n  30 kHz/10 km  \n 300 kHz/1 km\n\n\n\n\t\nMF             \n 300 kHz/1 km   \n   3 MHz/100 m\n\n\n\n\t\nHF               \n   3 MHz/100 m  \n  30 MHz/10 m\n\n\n\n\t\nVHF         \n  30 MHz/10 m   \n 300 MHz/1 m\n\n\n\n\t\nUHF        \n 300 MHz/1 m    \n   3 GHz/100 mm\n\n\n\n\t\nSHF        \n   3 GHz/100 mm \n  30 GHz/10 mm\n\n\n\n\t\nEHF    \n  30 GHz/10 mm  \n 300 GHz/1 mm\n\n\n\n\t\nTHF \n 300 GHz/1 mm   \n   3 THz/0.1 mm\n\n\n\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nElectromagnetic spectrum\n\n\t\n\tGamma rays\n\tX-rays\n\tUltraviolet\n\tVisible\n\tInfrared\n\tMicrowave\n\tRadio\n\n\n← higher frequencies       longer wavelengths →\n\n\n\n\n\tX-rays\t\n\tsoft X-ray\n\thard X-ray\n\n\n\n\n\tUltraviolet\t\n\tExtreme ultraviolet\n\tVacuum ultraviolet\n\tLyman-alpha\n\tFUV\n\tMUV\n\tNUV\n\tUVC\n\tUVB\n\tUVA\n\n\n\n\n\tVisible (optical)\t\n\tViolet\n\tBlue\n\tCyan\n\tGreen\n\tYellow\n\tOrange\n\tRed\n\n\n\n\n\tMicrowaves\t\n\tW band\n\tV band\n\tQ band\n\tKa band\n\tK band\n\tKu band\n\tX band\n\tC band\n\tS band\n\tL band\n\n\n\n\n\tRadio\t\n\tTHF\n\tEHF\n\tSHF\n\tUHF\n\tVHF\n\tHF\n\tMF\n\tLF\n\tVLF\n\tULF\n\tSLF\n\tELF\n\n\n\n\n\tWavelength types\t\n\tMicrowave\n\tShortwave\n\tMedium wave\n\tLongwave\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nRadiation (physics and health)\n\n\tMain articles\t\n\tNon-ionizing radiation\t\n\tAcoustic radiation force\n\tInfrared\n\tLight\n\tStarlight\n\tSunlight\n\tMicrowave\n\tRadio waves\n\tUltraviolet\n\n\n\n\n\tIonizing radiation\t\n\tRadioactive decay\n\tCluster decay\n\tBackground radiation\n\tAlpha particle\n\tBeta particle\n\tGamma ray\n\tCosmic ray\n\tNeutron radiation\n\tNuclear fission\n\tNuclear fusion\n\tNuclear reactors\n\tNuclear weapons\n\tParticle accelerators\n\tRadioactive materials\n\tX-ray\n\n\n\n\n\t\n\tEarth's energy budget\n\tElectromagnetic radiation\n\tSynchrotron radiation\n\tThermal radiation\n\tBlack-body radiation\n\tParticle radiation\n\tGravitational Radiation\n\tCosmic background radiation\n\tCherenkov radiation\n\tAskaryan radiation\n\tBremsstrahlung\n\tUnruh radiation\n\tDark radiation\n\n\n\n\n\n\n\n\tRadiation \nand health\t\n\tRadiation syndrome\n\tacute\n\tchronic\n\n\n\tHealth physics\n\tDosimetry\n\tElectromagnetic radiation and health\n\tLaser safety\n\tLasers and aviation safety\n\tMedical radiography\n\tMobile phone radiation and health\n\tRadiation protection\n\tRadiation therapy\n\tRadioactivity in the life sciences\n\tRadioactive contamination\n\tRadiobiology\n\tBiological dose units and quantities\n\tWireless electronic devices and health\n\tRadiation Heat-transfer\n\n\n\n\n\tRelated articles\t\n\tHalf-life\n\tNuclear physics\n\tRadioactive source\n\tRadiation hardening\n\tList of civilian radiation accidents\n\t1996 Costa Rica accident\n\t1987 Goiânia accident\n\t1984 Moroccan accident\n\t1990 Zaragoza accident\n\n\n\n\n\tSee also: the categories Radiation effects, Radioactivity, Radiobiology, and Radiation protection.\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4176841-3\n\tNARA: 10675684\n\tNDL: 00561394\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Radio_wave&oldid=917671245\"\n\n\t\t\n\t\tCategories: \tRadio technology\n\tWaves\n\tElectromagnetic spectrum\n\n\nHidden categories: \tWikipedia articles with GND identifiers\n\tWikipedia articles with NARA identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAlemannisch\n\tአማርኛ\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBosanski\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\tХальмг\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tJawa\n\tქართული\n\tҚазақша\n\tKiswahili\n\tLatina\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tမြန်မာဘာသာ\n\tNederlands\n\tनेपाली\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tతెలుగు\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t粵語\n\tŽemaitėška\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 24 September 2019, at 22:19 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Radio wave - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Dipole_xmting_antenna_animation_4_408x318x150ms.gif", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-radio_wave", "title": "Radio wave - Wikipedia"}}