{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRadio - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tRadio\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tTechnology of using radio waves to carry information\n\nThis article is about science and technology. For broadcasting, see radio broadcasting. For other uses, see Radio (disambiguation).\n\n\t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Radio\" – news · newspapers · books · scholar · JSTOR  (April 2016) (Learn how and when to remove this template message)\n\n\n\n  \nA variety of radio antennas on Sandia peak near Albuquerque, New Mexico, US. Transmitting antennas are often located on mountain peaks, to give maximum transmission range.\n\n\n\nRadio is the technology of signaling and communicating using radio waves.[1][2][3] Radio waves are electromagnetic waves of frequency between 30 hertz (Hz) and 300 gigahertz (GHz). They are generated by an electronic device called a transmitter connected to an antenna which radiates the waves, and received by a radio receiver connected to another antenna. Radio is very widely used in modern technology, in radio communication, radar, radio navigation, remote control, remote sensing and other applications. In radio communication, used in radio and television broadcasting, cell phones, two-way radios, wireless networking and satellite communication among numerous other uses, radio waves are used to carry information across space from a transmitter to a receiver, by modulating the radio signal (impressing an information signal on the radio wave by varying some aspect of the wave) in the transmitter. In radar, used to locate and track objects like aircraft, ships, spacecraft and missiles, a beam of radio waves emitted by a radar transmitter reflects off the target object, and the reflected waves reveal the object's location. In radio navigation systems such as GPS and VOR, a mobile receiver receives radio signals from navigational radio beacons whose position is known, and by precisely measuring the arrival time of the radio waves the receiver can calculate its position on Earth. In wireless radio remote control devices like drones, garage door openers, and keyless entry systems, radio signals transmitted from a controller device control the actions of a remote device.\n\nApplications of radio waves which do not involve transmitting the waves significant distances, such as RF heating used in industrial processes and microwave ovens, and medical uses such as diathermy and MRI machines, are not usually called radio.  The noun radio is also used to mean a broadcast radio receiver.\n\nRadio waves were first identified and studied by German physicist Heinrich Hertz in 1886. The first practical radio transmitters and receivers were developed around 1895-6 by Italian Guglielmo Marconi, and radio began to be used commercially around 1900. To prevent interference between users, the emission of radio waves is strictly regulated by law, coordinated by an international body called the International Telecommunications Union (ITU), which allocates frequency bands in the radio spectrum for different uses.\n\n\n\n\nContents\n\n\n\t1 Radio technology\n\t1.1 Radio communication\n\t1.2 Bandwidth\n\t1.3 ITU frequency bands\n\n\n\n\t2 Regulation\n\t3 Applications\n\t3.1 Broadcasting\n\t3.1.1 Audio\n\t3.1.2 Television\n\t3.1.3 Time and frequency\n\n\n\n\t3.2 Jamming\n\t3.3 Two way voice communication\n\t3.4 One way voice communication\n\t3.5 Data communications\n\t3.6 Space communication\n\t3.7 Radar\n\t3.8 Radiolocation\n\t3.9 Remote control\n\t3.10 Scientific research\n\n\n\n\t4 Etymology\n\t5 History\n\t6 See also\n\t7 References\n\t8 External links\n\n\n\n\n\nRadio technology[edit]\n\nRadio waves are radiated by electric charges undergoing acceleration.[4] They are generated artificially by time varying electric currents, consisting of electrons flowing back and forth in a metal conductor called an antenna.[5] In transmission, a transmitter generates an alternating current of radio frequency which is applied to an antenna. The antenna radiates the power in the current as radio waves. When the waves strike the antenna of a radio receiver, they push the electrons in the metal back and forth, inducing a tiny alternating current. The radio receiver connected to the receiving antenna detects this oscillating current and amplifies it. \n\nAs they travel farther from the transmitting antenna, radio waves spread out so their signal strength (intensity in watts per square meter) decreases, so radio transmissions can only be received within a limited range of the transmitter, the distance depending on the transmitter power, antenna radiation pattern, receiver sensitivity, noise level, and presence of obstructions between transmitter and receiver.  An omnidirectional antenna transmits or receives radio waves in all directions, while a directional antenna or high gain antenna transmits radio waves in a beam in a particular direction, or receives waves from only one direction. \n\nRadio waves travel through a vacuum at the speed of light, and in air at very close to the speed of light, so the wavelength of a radio wave, the distance in meters between adjacent crests of the wave, is inversely proportional to its frequency. \n\n\nRadio communication[edit]\n\n  \nRadio communication.  Information such as sound is converted by a transducer such as a microphone to an electrical signal, which modulates a radio wave produced by the transmitter. A receiver intercepts the radio wave and extracts the information-bearing modulation signal, which is converted back to a human usable form with another transducer such as a loudspeaker.\n\n\n\n  \nComparison of AM and FM modulated radio waves\n\n\n\nIn radio communication systems, information is carried across space using radio waves.  At the sending end, the information to be sent is converted by some type of transducer to a time-varying electrical signal called the modulation signal.[6] The modulation signal may be an audio signal representing sound from a microphone, a video signal representing moving images from a video camera, or a digital signal consisting of a sequence of bits representing binary data from a computer.  The modulation signal is applied to a radio transmitter.  In the transmitter, an electronic oscillator generates an alternating current oscillating at a radio frequency, called the carrier wave because it serves to \"carry\" the information through the air.  The information signal is used to modulate the carrier, varying some aspect of the carrier wave, impressing the information on the carrier.  Different radio systems use different modulation methods:\n\n\n\tAM (amplitude modulation) – in an AM transmitter, the amplitude (strength) of the radio carrier wave is varied by the modulation signal.\n\tFM (frequency modulation) – in an FM transmitter, the frequency of the radio carrier wave is varied by the modulation signal.\n\tFSK (frequency shift keying) – used in wireless digital devices to transmit digital signals, the frequency of the carrier wave is shifted periodically between two frequencies that represent the two binary digits, 0 and 1, to transmit a sequence of bits.\n\tOFDM (orthogonal frequency division multiplexing) – a family of complicated digital modulation methods very widely used in high bandwidth systems such as WiFi networks, cellphones, digital television broadcasting, and digital audio broadcasting (DAB) to transmit digital data using a minimum of radio spectrum bandwidth.  OFDM has higher spectral efficiency and more resistance to fading than AM or FM.  Multiple radio carrier waves closely spaced in frequency are transmitted within the radio channel, with each carrier modulated with bits from the incoming bitstream so multiple bits are being sent simultaneously, in parallel.  At the receiver the carriers are demodulated and the bits are combined in the proper order into one bitstream.\n\n\nMany other types of modulation are also used. In some types a carrier wave is not transmitted but just one or both modulation sidebands.  The modulated carrier is amplified in the transmitter, and applied to a transmitting antenna which radiates the energy as radio waves.   The radio waves carry the information to the receiver location.\n\nAt the receiver, the radio wave induces a tiny oscillating voltage in the receiving antenna which is a weaker replica of the current in the transmitting antenna.[6] This voltage is applied to the radio receiver, which amplifies the weak radio signal so it is stronger, then demodulates it, extracting the original modulation signal from the modulated carrier wave.  The modulation signal is converted by a transducer back to a human-usable form: an audio signal is converted to sound waves by a loudspeaker or earphones, a video signal is converted to images by a display, while a digital signal is applied to a computer or microprocessor, which interacts with human users. \n\nThe radio waves from many transmitters pass through the air simultaneously without interfering with each other because each transmitter's radio waves oscillate at a different rate, in other words each transmitter has a different frequency, measured in kilohertz (kHz), megahertz (MHz) or gigahertz (GHz).   The receiving antenna typically picks up the radio signals of many transmitters.  The receiver uses tuned circuits to select the radio signal desired out of all the signals picked up by the antenna, and reject the others.  A tuned circuit (also called resonant circuit or tank circuit) acts like a resonator, similarly to a tuning fork.[6] It has a natural resonant frequency at which it oscillates.  The resonant frequency of the receiver's tuned circuit is adjusted by the user to the frequency of the desired radio station; this is called \"tuning\".  The oscillating radio signal from the desired station causes the tuned circuit to resonate, oscillate in sympathy, and it passes the signal on to the rest of the receiver.  Radio signals at other frequencies are blocked by the tuned circuit and not passed on.\n\n\nBandwidth[edit]\n\n  \nFrequency spectrum of a typical modulated AM or FM radio signal.  It consists of a component C at the carrier wave frequency \n  \n    \n      \n        \n          f\n          \n            c\n          \n        \n      \n    \n    {\\displaystyle f_{c}}\n  \n with the information (modulation) contained in two narrow bands of frequencies called sidebands (SB) just above and below the carrier frequency.\n\n\n\nA modulated radio wave, carrying an information signal, occupies a range of frequencies.  See diagram.  The information (modulation) in a radio signal is usually concentrated in narrow frequency bands called sidebands (SB) just above and below the carrier frequency.  The width in hertz of the frequency range that the radio signal occupies, the highest frequency minus the lowest frequency, is called its bandwidth (BW).  A given amount of bandwidth can carry the same amount of information (data rate in bits per second) regardless of where in the radio frequency spectrum it is located, so bandwidth is a measure of information-carrying capacity. The bandwidth required by a radio transmission depends on the data rate of the information (modulation signal) being sent, and the spectral efficiency of the modulation method used; how much data it can transmit in each kilohertz of bandwidth.  Different types of information signals carried by radio have different data rates.  For example, a television (video) signal has a greater data rate than an audio signal.\n\nThe radio spectrum, the total range of radio frequencies that can be used for communication in a given area, is a fixed resource.[3] Each radio transmission occupies a portion of the total bandwidth available.  Radio bandwidth is regarded as an economic good which has a monetary cost and is in increasing demand.  In some parts of the radio spectrum the right to use a frequency band or even a single radio channel is bought and sold for millions of dollars.  So there is an incentive to employ technology to minimize the bandwidth used by radio services.  \n\nIn recent years there has been a transition from analog to digital radio transmission technologies.  Part of the reason for this is that digital modulation can often transmit more information (a greater data rate) in a given bandwidth than analog modulation, by using data compression algorithms, which reduce redundancy in the data to be sent, and more efficient modulation.  Other reasons for the transition is that digital modulation has greater noise immunity than analog, digital signal processing chips have more power and flexibility than analog circuits, and a wide variety of types of information can be transmitted using the same digital modulation.  \n\nBecause it is a fixed resource which is in demand by an increasing number of users, the radio spectrum has become increasingly congested in recent decades, and the need to use it more effectively is driving many additional radio innovations such as trunked radio systems, spread spectrum (ultra-wideband) transmission, frequency reuse, dynamic spectrum management, frequency pooling, and cognitive radio.\n\n\nITU frequency bands[edit]\n\nThe ITU arbitrarily divides the radio spectrum into 12 bands, each beginning at a wavelength which is a power of ten (10n) metres, with corresponding frequency of 3 times a power of ten, and each covering a decade of frequency or wavelength.[3] Each of these bands has a traditional name:\n\n\n\tBand name\tAbbreviation\tFrequency\tWavelength\tBand name\tAbbreviation\tFrequency\tWavelength\n\n\tExtremely low frequency\tELF\t3 – 30 Hz\t100,000–10,000 km\tHigh frequency\tHF\t3 – 30 MHz\t100–10 m\n\n\tSuper low frequency\tSLF\t30 – 300 Hz\t10,000–1,000 km\tVery high frequency\tVHF\t30 – 300 MHz\t10–1 m\n\n\tUltra low frequency\tULF\t300 – 3000 Hz\t1,000–100 km\tUltra high frequency\tUHF\t300 – 3000 MHz\t100–10 cm\n\n\tVery low frequency\tVLF\t3 – 30 kHz\t100–10 km\tSuper high frequency\tSHF\t3 – 30 GHz\t10–1 cm\n\n\tLow frequency\tLF\t30 – 300 kHz\t10–1 km\tExtremely high frequency\tEHF\t30 – 300 GHz\t10–1 mm\n\n\tMedium frequency\tMF\t300 – 3000 kHz\t1000-100 m\tTremendously high frequency\tTHF\t300 – 3000 GHz\t1–0.1 mm\n\n\n\nRegulation[edit]\n\nThe airwaves are a resource shared by many users.  Two radio transmitters in the same area that attempt to transmit on the same frequency will interfere with each other, causing garbled reception, so neither transmission may be received clearly. Interference with radio transmissions can not only have a large economic cost, it can be life threatening (for example, in the case of interference with emergency communications or air traffic control).\n\nTo prevent interference between different users, the emission of radio waves is strictly regulated by national laws, coordinated by an international body, the International Telecommunications Union (ITU), which allocates bands in the radio spectrum for different uses.[3] Radio transmitters must be licensed by governments, under a variety of license classes depending on use, and are restricted to certain frequencies and power levels.  In some classes, such as radio and television broadcasting stations, the transmitter is given a unique identifier consisting of a string of letters and numbers called a callsign, which must be used in all transmissions.  The radio operator must hold a government license, such as the general radiotelephone operator license in the US, obtained by taking a test demonstrating adequate technical and legal knowledge of safe radio operation. \n\nExceptions to the above rules allow the unlicensed operation by the public of low power short range transmitters in consumer products such as cell phones, cordless phones, wireless devices, walkie-talkies, citizens band radios, wireless microphones, garage door openers, and baby monitors. In the US, these fall under Part 15 of the Federal Communications Commission (FCC) regulations.   Many of these devices use the ISM bands, a series of frequency bands throughout the radio spectrum reserved for unlicensed use.  Although they can be operated without a license, like all radio equipment these devices generally must be type-approved before sale.\n\n\nApplications[edit]\n\nBelow are some of the most important uses of radio, organized by function.\n\n\nBroadcasting[edit]\n\nMain article: Broadcasting\n\n\nAM radio station\n\n\nFM radio station\n\n\nTelevision station\n\n\nBroadcasting antennas\n\n\n\n\nBroadcasting is the one-way transmission of information from a radio transmitter to receivers belonging to a public audience. Since the radio waves become weaker with distance, a broadcasting station can only be received within a limited distance of its transmitter.  Systems which broadcast from satellites can generally be received over an entire country or continent.  Older terrestrial radio and television paid for by commercial advertising or governments.  In subscription systems like satellite television and satellite radio the customer pays a monthly fee.  In these systems the radio signal is encrypted and can only be decrypted by the receiver, which is controlled by the company and can be deactivated if the customer doesn't pay his bill.  \n\nBroadcasting uses several parts of the radio spectrum, depending on the type of signals transmitted and the desired target audience. Long-wave and medium-wave signals can give reliable coverage of areas several hundred kilometres across, but have more limited information carrying capacity and so work best with audio signals (speech and music), and are subject to natural and artificial sources of interfering noise.  The shortwave bands have greater potential range, but are more subject to interference by distant stations and varying atmospheric conditions that affect reception.\n\nIn very high frequency band, greater than 30 megahertz, the Earth's atmosphere has less of an effect on the range of signals, and line-of-sight propagation becomes the principle mode. These higher frequencies permit the great bandwidth required for television broadcasting.  Since natural and artificial noise sources are less present at these frequencies, high-quality audio transmission is possible, using frequency modulation.  \n\n\n  \nFM broadcast transmitter of radio station KWNR, Las Vegas which transmits on 95.5 MHz with a power of 35 kW\n\n\n\nAudio[edit]\n\nAnalog audio is the earliest form of radio broadcast. AM broadcasting dates to the early 1900s. FM broadcasting was introduced in the late 1930s with improved fidelity.\n\nDigital audio broadcasting (DAB) debuted in some countries in 1998. It transmits audio as a digital signal rather than an analog signal as AM and FM do.  DAB has the potential to provide higher quality sound than FM (although many stations do not choose to transmit at such high quality), has greater immunity to radio noise and interference, makes better use of scarce radio spectrum bandwidth, and provides advanced user features such as electronic program guides.  Its disadvantage is that it is incompatible with previous radios so that a new DAB receiver must be purchased.   Most countries plan an eventual switchover from FM to DAB.  The United States and Canada have chosen not to implement DAB.\n\nA single DAB station transmits a 1,500 kHz bandwidth signal that carries from 9 to 12 channels of digital audio modulated by OFDM from which the listener can choose.  Broadcasters can transmit a channel at a range of different bit rates, so different channels can have different audio quality.   In different countries DAB stations broadcast in either Band III (174–240 MHz) or L band (1.452–1.492 GHz) in the UHF range, so like FM reception is limited by the visual horizon to about 40 miles (64 km).\n\nDigital Radio Mondiale (DRM) is a competing digital terrestrial radio standard developed mainly by broadcasters as a higher spectral efficiency replacement for legacy AM and FM broadcasting.  Mondiale means \"worldwide\" in French and Italian, and DRM, developed in 2001, is currently supported by 23 countries and has been adopted by some European and Eastern broadcasters beginning in 2003. The DRM30 mode uses the AM broadcast bands below 30 MHz and is intended as a replacement for AM and shortwave broadcasting, and the DRM+ mode uses VHF frequencies centered on the FM broadcast band and is intended as a replacement for FM broadcasting.  It is incompatible with existing radio receivers and requires listeners to purchase a new DRM receiver. The modulation used is a form of OFDM called COFDM in which up to 4 carriers are transmitted in a channel formerly occupied by a single AM or FM signal, modulated by quadrature amplitude modulation (QAM).  The DRM system is designed to be as compatible as possible with existing AM and FM radio transmitters, so much of the equipment in existing radio stations will not have to be replaced.    \n\n\nSatellite radio is a subscription radio service that broadcasts CD quality digital audio direct to subscribers' receivers using a microwave downlink signal from a direct broadcast communication satellite in geostationary orbit 22,000 miles above the Earth.  It is mostly intended for car radios in vehicles.   Satellite radio uses the 2.3 GHz S band in North America, in other parts of the world, it uses the 1.4 GHz L band allocated for DAB. \n  \nTelevision receiver\n\n\n\nTelevision[edit]\n\nTelevision broadcasting is the transmission of moving images by radio, which consist of sequences of still images, which are displayed on a screen on a television receiver (a \"television\" or TV) along with a synchronized audio (sound) channel.  Television (video) signals occupy a wider bandwidth than broadcast radio (audio) signals.  Analog television, the original television technology, required 6 MHz, so the television frequency bands are divided into 6 MHz channels, now called \"RF channels\".  The current television standard, introduced beginning in 2006, is a digital format called HDTV (high definition television), which transmits pictures at higher resolution, typically 1080 pixels high by 1920 pixels wide, at a rate of 25 or 30 frames per second.  Digital television (DTV) transmission systems, which replaced older analog television in a transition beginning in 2006, use image compression and high efficiency digital modulation such as OFDM and 8VSB to transmit HDTV video within a smaller bandwidth than the old analog channels, saving scarce radio spectrum space.  Therefore each of the 6 MHz analog RF channels now carries up to 7 DTV channels – these are called \"virtual channels\". Digital television receivers have a different behavior in the presence of poor reception or noise than analog television, called the \"digital cliff\" effect.  Unlike analog television, in which increasingly poor reception causes the picture quality to gradually degrade, in digital television picture quality is not affected by poor reception until, at a certain point, the receiver stops working and the screen goes black.  \n\n\nTerrestrial television, over-the-air (OTA) television, or broadcast television – the oldest television technology, is the transmission of television signals from land-based television stations to television receivers (called televisions or TVs) in viewer's homes.  Terrestrial television broadcasting uses the bands 41 – 88 MHz (VHF low band or Band I, carrying RF channels 1–6), 174 – 240 MHz, (VHF high band or Band III; carrying RF channels 7–13), and 470 – 614 MHz (UHF Band IV and Band V; carrying RF channels 14 and up).  The exact frequency boundaries vary in different countries.  Propagation is by line-of-sight, so reception is limited by the visual horizon to 30–40 miles (48–64 km).   In the US effective radiated power (ERP) of television transmitters is limited to 35 kW in the VHF low band, 50 kW in the VHF high band, and 220 kW in UHF band; most TV stations operate below 75% of the limit.  In most areas viewers use a simple \"rabbit ears\" dipole antenna on top of the TV, but viewers in fringe reception areas more than 15 miles from a station usually have to use an outdoor antenna mounted on the roof to get adequate reception.   \n  \nSatellite television dish on a residence\n\n\n\nSatellite television – a set-top box which receives subscription direct-broadcast satellite television, and displays it on an ordinary television. A direct broadcast satellite in geostationary orbit 22,200 miles (35,700 km) above the Earth's equator transmits many channels (up to 900) modulated on a 12.2 to 12.7 GHz Ku band microwave downlink signal to a rooftop satellite dish antenna on the subscriber's residence.  The microwave signal is converted to a lower intermediate frequency at the dish and conducted into the building by a coaxial cable to a set-top box connected to the subscriber's TV, where it is demodulated and displayed. The subscriber pays a monthly fee.\n\n\nTime and frequency[edit]\n\nGovernments operate long-range radio standard frequency and time signal services. These are implement by time stations which continuously broadcast extremely accurate time signals produced by atomic clocks, as a reference to synchronize other clocks.  Examples are BPC, DCF77, JJY, MSF, RTZ, TDF, WWV, and YVTO.  One use is in radio clocks and watches, which include an automated receiver which periodically (usually weekly) receives and decodes the time signal and resets the watch's internal quartz clock to the correct time, thus allowing a small watch or desk clock to have the same accuracy as an atomic clock.  Government time stations are declining in number because GPS satellites and the Internet Network Time Protocol (NTP) provide equally accurate time standards.\n\n\nJamming[edit]\n\nRadio jamming is the deliberate radiation of radio signals designed to interfere with reception of other radio signals. Since radio waves can pass beyond national borders, some totalitarian countries which practice censorship use jamming to prevent their citizens from listening to broadcasts from radio stations in other countries.  Jamming is usually accomplished by a powerful transmitter which generates noise on the same frequency as the target transmitter.  During wartime, militaries use jamming to interfere with enemies' tactical radio communication.\n\n\nTwo way voice communication[edit]\n\nMain article: Two-way radio\n\n\n\n\n\n\n\n(left) Modern cellphone. (right) Cellular phone tower shared by antennas belonging to 3 different networks.\n\n\n\n\nA two-way radio is an audio transceiver, a receiver and transmitter in the same device, used for bidirectional person-to-person voice communication with other users with similar radios. An older term for this mode of communication is radiotelephony.  The radio link may be half-duplex, as in a walkie-talkie, using a single radio channel in which only one radio can transmit at a time, so different users take turns talking, pressing a \"push to talk\" button on their radio which switches off the receiver and switches on the transmitter.  Or the radio link may be full duplex, a bidirectional link using two radio channels so both people can talk at the same time, as in a cell phone.\n\n\n\tCell phone – a portable wireless telephone that is connected to the telephone network by radio signals exchanged with a local antenna at a cellular base station (cell tower).[7] The service area covered by the provider is divided into small geographical areas called \"cells\", each served by a separate base station antenna and multichannel transceiver.  All the cell phones in a cell communicate with this antenna on separate frequency channels, assigned from a common pool of frequencies.\n\n\n\tThe purpose of cellular organization is to conserve radio bandwidth by frequency reuse.  Low power transmitters are used so the radio waves used in a cell do not travel far beyond the cell, allowing the same frequencies to be reused in geographically separated cells.  When a user carrying a cellphone crosses from one cell to another, his phone is automatically \"handed off\" seamlessly to the new antenna and assigned new frequencies.  Cellphones have a highly automated full duplex digital transceiver using OFDM modulation using two digital radio channels, each carrying one direction of the bidirectional conversation, as well as a control channel that handles dialing calls and \"handing off\" the phone to another cell tower.  Existing 2G, 3G, and 4G networks use frequencies in the UHF and low microwave range, between 700 MHz and 3 GHz.  The cell phone transmitter adjusts its power output to use the minimum power necessary to communicate with the cell tower; 0.6 W when near the tower, up to 3 W when farther away.  Cell tower channel transmitter power is 50 W.  Current generation phones, called smartphones, have many functions besides making telephone calls, and therefore have several other radio transmitters and receivers that connect them with other networks: usually a WiFi modem, a Bluetooth modem, and a GPS receiver.\n\n\n\t\t5G cellular network – next generation cellular networks which began deployment in 2019.  Their major advantage is much higher data rates than previous cellular networks, up to 10 Gbps; 100 times faster than the previous cellular technology, 4G LTE.    The higher data rates are achieved by using higher frequency radio waves in or near the millimeter wave band, around 28 and 39 GHz.  Since millimeter waves are absorbed by atmospheric gases they have shorter range than microwaves.  Therefore 5G cells will be the size of a city block, smaller than the cells in previous cellular networks which could be many miles across.  Instead of a large cell base station and antenna tower, 5G networks will have many small antennas attached to utility poles and buildings.\n\n\n\n\n  \nSatellite phones, showing the large antennas needed to communicate with the satellite\n\n\n\n\tSatellite phone (satphone) – a portable wireless telephone similar to a cell phone, connected to the telephone network through a radio link to an orbiting communications satellite instead of through cell towers.  They are more expensive than cell phones; but their advantage is that, unlike a cell phone which is limited to areas covered by cell towers, satphones can be used over most or all of the geographical area of the Earth.  In order for the phone to communicate with a satellite using a small omnidirectional antenna, first generation systems use satellites in low earth orbit, about 400–700 miles (640–1,100 km) above the surface.  With an orbital period of about 100 minutes a satellite can only be in view of a phone for about 4 - 15 minutes, so the call is \"handed off\" to another satellite when one passes beyond the local horizon. Therefore large numbers of satellites, about 40 to 70, are required to ensure that at least one satellite is in view continuously from each point on Earth.  Other satphone systems use satellites in geostationary orbit in which only a few satellites are needed, but these cannot be used at high latitudes because of terrestrial interference.\n\tCordless phone- a landline telephone in which the handset is portable and communicates with the rest of the phone by a short range full duplex radio link, instead of being attached by a cord.  Both the handset and the base station have low power FM radio transceivers operating in the UHF band that handle the short range bidirectional radio link.    \nFirefighter using walkie-talkie\n\n\n\n\tLand mobile radio system – short range mobile or portable half-duplex radio transceivers operating in the VHF or UHF band that can be used without a license.  They are often installed in vehicles, with the mobile units communicating with a dispatcher at a fixed base station.  Special systems with reserved frequencies are used by first responder services; police, fire, ambulance, and emergency services and other government services.  Other systems are made for use by commercial firms such as taxi and delivery services.  VHF systems use channels in the range 30–50 MHz and 150–172 MHz.  UHF systems use the 450–470 MHz band and in some areas the 470–512 MHz range.  In general, VHF systems have longer range than UHF but require longer antennas. AM or FM modulation is mainly used, but digital systems such as DMR are being introduced.  Radiated power is typically limited to 4 watts.[7] These systems have a fairly limited range, usually 3 to 20 miles (4.8 to 32 km) depending on terrain. Repeaters installed on tall buildings, hills or mountain peaks are often used to increase the range, when it is desired to cover a larger area than line-of-sight.  Examples of land mobile systems are CB, FRS, GMRS, and MURS.  Modern digital systems, called trunked radio systems, have a digital channel management system using a control channel which automatically assigns frequency channels to user groups.\n\tWalkie-talkie – a battery powered portable handheld half-duplex two-way radio, used in land mobile radio systems.\n\n\n\tAirband – Half-duplex radio system used by aircraft pilots to talk to other aircraft and ground-based air traffic controllers.  This vital system is the main communication channel for air traffic control.  For most communication in overland flights in air corridors a VHF-AM system using channels between 108–137 MHz in the VHF band are used.   This system has a typical transmission range of 200 miles (320 km) for aircraft flying at cruising altitude. For flights in more remote areas, such as transoceanic airline flights, aircraft use the HF band or channels on the Inmarsat or Iridium satphone satellites.   Military aircraft also use a dedicated UHF-AM band from 225.0–399.95 MHz.\n\tMarine radio – medium range transceivers on ships, used for ship-to-ship, ship-to-air and ship-to-shore communication with harbormasters They use FM channels between 156 and 174 MHz in the VHF band with up to 25 watts power, giving them a range of about 60 miles (97 km).  Some channels are half-duplex and some are full-duplex, to be compatible with the telephone network, to allow users to make telephone calls through a marine operator.\n\tAmateur radio – long range half-duplex two way radio used by hobbyists for noncommercial purposes: recreational radio contacts with other amateurs, volunteer emergency communication during disasters, contests, and experimentation. Radio amateurs must hold an amateur radio license and are given a unique callsign that must be used as an identifier in transmissions.   Amateur radio is restricted to small frequency bands, the amateur radio bands, spaced throughout the radio spectrum from 136 kHz to 2.4 GHz.  Within these bands amateurs are allowed freedom to transmit on any frequency with a wide variety of modulation methods.  In addition to radiotelephony, amateurs are the only radio operators still using obsolete Morse code radiotelegraphy.\n\n\nOne way voice communication[edit]\n\nOne way, unidirectional radio transmission is called simplex.  \n\n\n\tBaby monitor –  this is a cribside appliance for mothers of infants that transmits the baby's sounds to a receiver carried by the mother, so she can monitor the baby while she is in other parts of the house.  These transmit in FM on 49.300, 49.830, 49.845, 49.860, or 49.875 MHz with low power.   Many baby monitors have duplex channels so the mother can talk to the baby, and video cameras to show a picture of the baby, this is called a baby cam.\n\tWireless microphone – a battery powered microphone with a short-range transmitter which is handheld or worn on a person's body which transmits its sound by radio to a nearby receiver unit connected to a sound system.  Wireless microphones are used by public speakers, performers, and television personalities so they can move freely without trailing a microphone cord.  Analog models transmit in FM on unused portions of the television broadcast frequencies in the VHF and UHF bands.  Some models transmit on two frequency channels for diversity reception to prevent nulls from interrupting transmission as the performer moves around.  Some models use digital modulation to prevent unauthorized reception by scanner radio receivers; these operate in the 900 MHz, 2.4 GHz or 6 GHz ISM bands.\n\n\nData communications[edit]\n\nMain article: Data communications\n\n\tWireless networking – automated radio links which transmit digital data between computers and other wireless devices using radio waves, linking the devices together transparently in a computer network.   Computer networks can transmit any form of data: in addition to email and web pages, they also carry phone calls (VoIP), audio, and video content (called streaming media).   Security is more of an issue for wireless networks than for wired networks since anyone nearby with a wireless modem can access the signal and attempt to log in. The radio signals of wireless networks are encrypted using WPA.    \nLaptop computer and typical home wireless router (right) connecting it to the Internet\n\n\n\n\tWireless LAN (wireless local area network or WiFi) – based on the IEEE 802.11 standards, these are the most widely used computer networks, used to implement local area networks without cables, linking computers, laptops, cell phones, video game consoles, smart TVs and printers in a home or office together, and to a wireless router connecting them to the Internet with a wire or cable connection.  Wireless routers in public places like libraries, hotels and coffee shops create wireless access points (hotspots) to allow the public to access the Internet with portable devices like smartphones, tablets or laptops.  Each device exchanges data using a wireless modem (wireless network interface controller), an automated microwave transmitter and receiver with an omnidirectional antenna that works in the background, exchanging data packets with the router.  WiFi uses channels in the 2.4 GHz and 5 GHz ISM bands with OFDM (orthogonal frequency division multiplexing) modulation to transmit data at high rates.  The transmitters in Wifi modems are limited to a radiated power of 200 mW to 1 watt, depending on country. They have a maximum indoor range of about 150 ft (50 m) on 2.4 GHz and 50 ft (20 m) on 5 GHz.    \nNeighborhood wireless WAN router on telephone pole\n\n\n\n\tWireless WAN (wireless wide area network, WWAN) – a variety of technologies that provide wireless internet access over a wider area than Wifi networks do – from an office building, to a campus, to a neighborhood, to an entire city.  The most common technologies used are: cellular modems, that exchange computer data by radio with cell towers; satellite internet access; and lower frequencies in the UHF band, which have a longer range than WiFi frequencies.  Since WWAN networks are much more expensive and complicated to administer than WiFi networks, their use so far has generally been limited to private networks operated by large corporations.\n\tBluetooth – a very short range wireless interface on a portable wireless device used as a substitute for a wire or cable connection, mainly to exchange files between portable devices and connect cellphones and music players with wireless headphones.  The transmission power is limited to 1 milliwatt, giving it a very short range of up to 10 m (30 feet).  The system uses frequency-hopping spread spectrum transmission, in which successive data packets are transmitted in a pseudorandom order on one of 79 1 MHz Bluetooth channels between 2.4–2.83 GHz in the ISM band.  This allows Bluetooth networks to operate in the presence of noise, other wireless devices and other Bluetooth networks using the same frequencies, since the chance of another device attempting to transmit on the same frequency at the same time as the Bluetooth modem is low.  In the case of such a \"collision\" the Bluetooth modem just retransmits the data packet on another frequency.\n\tPacket radio – a long-distance peer-to-peer wireless ad-hoc network in which data packets are exchanged between computer controlled radio modems (transmitter/receivers) called nodes, which may be separated by miles, and may be mobile.  Each node only communicates with neighboring nodes, so packets of data are passed from node to node until they reach their destination.  Uses the X.25 network protocol. Packet radio systems are used to a limited degree by commercial telecommunications companies and by the amateur radio community.\n\n\n\tText messaging (texting) – this is a service on cell phones, allowing a user to type a short alphanumeric message and send it to another phone number, and the text is displayed on the recipient's phone screen.  It is based on the Short Message Service (SMS) which transmits using spare bandwidth on the control radio channel used by cell phones to handle background functions like dialing and cell handoffs. Due to technical limitations of the channel, text messages are limited to 160 alphanumeric characters.\n\n\n  \nParabolic antennas of microwave relay links on tower in Australia.\n\n\n\n\tMicrowave relay – a long distance high bandwidth point-to-point digital data transmission link consisting of a microwave transmitter connected to a dish antenna that transmits a beam of microwaves to another dish antenna and receiver. Since the antennas must be in line-of-sight, distances are limited by the visual horizon to 30–40 miles (48–64 km). Microwave links are used for private business data, wide area computer networks (WANs), and by telephone companies to transmit long distance phone calls and television signals between cities.\n\tTelemetry – automated one-way (simplex) transmission of measurements and operation data from a remote process or device to a receiver for monitoring.  Telemetry is used for in-flight monitoring of missiles, drones, satellites, and weather balloon radiosondes, sending scientific data back to Earth from interplanetary spacecraft, communicating with electronic biomedical sensors implanted in the human body, and well logging. Multiple channels of data are often transmitted using frequency division multiplexing or time division multiplexing. Telemetry is starting to be used in consumer applications such as:\n\tAutomated meter reading – electric power meters, water meters, and gas meters that, when triggered by an interrogation signal, transmit their readings by radio to a utility reader vehicle at the curb, to eliminate the need for an employee to go on the customer's property to manually read the meter.\n\tElectronic toll collection – on toll roads, an alternative to manual collection of tolls at a toll booth, in which a transponder in a vehicle, when triggered by a roadside transmitter, transmits a signal to a roadside receiver to register the vehicle's use of the road, enabling the owner to be billed for the toll.\n\n\n\n\n  \nRFID tag from a DVD\n\n\n\n\tRadio Frequency Identification (RFID) – identification tags containing a tiny radio transponder (receiver and transmitter) which are attached to merchandise.  When it receives an interrogation pulse of radio waves from a nearby reader unit, the tag transmits back an ID number, which can be used to inventory goods.  Passive tags, the most common type, have a chip powered by the radio energy received from the reader, rectified by a diode, and can be as small as a grain of rice.    They are incorporated in products, clothes, railroad cars, library books, airline baggage tags and are implanted under the skin in pets and livestock (microchip implant) and even people. Privacy concerns have been addressed with tags that use encrypted signals and authenticate the reader before responding.  Passive tags use 125–134 kHz, 13, 900 MHz and 2.4 and 5 GHz ISM bands and have a short range.    Active tags, powered by a battery, are larger but can transmit a stronger signal, giving them a range of hundreds of meters.\n\tSubmarine communication – When submerged, submarines are cut off from all ordinary radio communication with their military command authorities by the conductive seawater.  However radio waves of low enough frequencies, in the VLF (30 to 3 kHz) and ELF (below 3 kHz) bands are able to penetrate seawater.  Navies operate large shore transmitting stations with power output in the megawatt range to transmit encrypted messages to their submarines in the world's oceans.  Due to the small bandwidth, these systems cannot transmit voice, only text messages at a slow data rate. The communication channel is one-way, since the long antennas needed to transmit VLF or ELF waves cannot fit on a submarine.  VLF transmitters use miles long wire antennas like umbrella antennas.     A few nations use ELF transmitters operating around 80 Hz, which can communicate with submarines at lower depths.  These use even larger antennas called ground dipoles, consisting of two ground (Earth) connections 23–60 km (14–37 mi) apart, linked by overhead transmission lines to a power plant transmitter.\n\n\nSpace communication[edit]\n\nMain article: Space communication\n\n  \nRussian satellite ground station\n\n\n\nThis is radio communication between a spacecraft and an Earth-based ground station, or another spacecraft.  \nCommunication with spacecraft involves the longest transmission distances of any radio links, up to billions of kilometers for interplanetary spacecraft.  In order to receive the weak signals from distant spacecraft, satellite ground stations use large parabolic \"dish\" antennas up to 25 metres (82 ft) in diameter and extremely sensitive receivers. High frequencies in the microwave band are used, since microwaves pass through the ionosphere without refraction, and at microwave frequencies the high gain antennas needed to focus the radio energy into a narrow beam pointed at the receiver are small and take up a minimum of space in a satellite. Portions of the UHF, L, C, S, ku and ka band are allocated for space communication.   A radio link which transmits data from the Earth's surface to a spacecraft is called an uplink, while a link which transmits data from the spacecraft to the ground is called a downlink.  \n\n\n  \nCommunications satellite belonging to Azerbaijan\n\n\n\n\tCommunication satellite – an artificial satellite used as a telecommunications relay to transmit data between widely separated points on Earth.  These are used because the microwaves used for telecommunications travel by line of sight and so cannot propagate around the curve of the Earth.  There are currently over 2000 communication satellites in orbit around the Earth.  Most are in geostationary orbit 22,200 miles (35,700 km) above the equator, so that the satellite appears stationary at the same point in the sky, so the satellite dish antennas of ground stations can be aimed permanently at that spot and do not have to move to track it.  In a satellite ground station a microwave transmitter and large satellite dish antenna transmits a microwave uplink beam to the satellite.  The uplink signal carries many channels of telecommunications traffic, such as long distance telephone calls, television programs, and internet signals, using a technique called frequency-division multiplexing (FDM).  On the satellite a transponder receives the signal, translates it to a different downlink frequency to avoid interfering with the uplink signal, and retransmits it down to another ground station, which may be widely separated from the first.  There the downlink signal is demodulated and the telecommunications traffic it carries is sent to its local destinations through landlines.  Communication satellites typically have several dozen transponders on different frequencies, which are leased by different users.\n\tDirect broadcast satellite – a geostationary communication satellite that transmits retail programming directly to receivers in subscriber's homes and vehicles on Earth, in satellite radio and TV systems.  It uses a higher transmitter power than other communication satellites, to allow the signal to be received by consumers with a small unobtrusive antenna.  For example, satellite television uses downlink frequencies from 12.2 to 12.7 GHz in the ku band transmitted at 100 to 250 watts, which can be received by relatively small 43–80 cm (17–31 in) satellite dishes mounted on the outside of buildings.\n\n\nRadar[edit]\n\nMain article: Radar\n\n  \nMilitary air traffic controller on US Navy aircraft carrier monitors aircraft on radar screen\n\n\n\nRadar is a radiolocation method used to locate and track aircraft, spacecraft, missiles, ships, vehicles, and also to map weather patterns and terrain. A radar set consists of a transmitter and receiver.  The transmitter emits a narrow beam of radio waves which is swept around the surrounding space.  When the beam strikes a target object, radio waves are reflected back to the receiver.  The direction of the beam reveals the object's location.  Since radio waves travel at a constant speed close to the speed of light, by measuring the brief time delay between the outgoing pulse and the received \"echo\", the range to the target can be calculated.  The targets are often displayed graphically on a map display called a radar screen.   Doppler radar can measure a moving object's velocity, by measuring the change in frequency of the return radio waves due to the Doppler effect.  \n\nRadar sets mainly use high frequencies in the microwave bands, because these frequencies create strong reflections from objects the size of vehicles and can be focused into narrow beams with compact antennas.  Parabolic (dish) antennas are widely used.  In most radars the transmitting antenna also serves as the receiving antenna; this is called a monostatic radar.  A radar which uses separate transmitting and receiving antennas is called a bistatic radar.\n\n\n  \nASR-8 airport surveillance radar antenna.  It rotates once every 4.8 seconds.  The rectangular antenna on top is the secondary radar.\n\n\n\n\tAirport surveillance radar – In aviation, radar is the main tool of air traffic control.  A rotating dish antenna sweeps a vertical fan-shaped beam of microwaves around the airspace and the radar set shows the location of aircraft as \"blips\" of light on a display called a radar screen.  Airport radar operates at 2.7 – 2.9 GHz in the microwave S band.  In large airports the radar image is displayed on multiple screens in an operations room called the TRACON (Terminal Radar Approach Control), where air traffic controllers direct the aircraft by radio to maintain safe aircraft separation.\n\tSecondary surveillance radar – Aircraft carry radar transponders, transceivers which when triggered by the incoming radar signal transmit a return microwave signal.   This causes the aircraft to show up more strongly on the radar screen.  The radar which triggers the transponder and receives the return beam, usually mounted on top of the primary radar dish, is called the secondary surveillance radar.  Since radar cannot measure an aircraft's altitude with any accuracy, the transponder also transmits back the aircraft's altitude measured by its altimeter, and an ID number identifying the aircraft, which is displayed on the radar screen.\n\n\n\tElectronic countermeasures (ECM) – Military defensive electronic systems designed to degrade enemy radar effectiveness, or deceive it with false information, to prevent enemies from locating local forces.   It often consists of powerful microwave transmitters that can mimic enemy radar signals to create false target indications on the enemy radar screens.\n\tRadar altimeter – a specialized radar on an aircraft that measures the altitude of the aircraft above terrain by bouncing a radio beam off the ground surface and measuring the time for the echo to return.\n\n\n  \nRotating marine radar antenna on ship.\n\n\n\n\tMarine radar – an X band radar on ships used to detect nearby ships and obstructions like bridges.  A rotating antenna sweeps a vertical fan-shaped beam of microwaves around the water surface surrounding the craft out to the horizon.\n\tWeather radar – A Doppler radar which maps weather systems and measures wind speeds by reflection of microwaves from raindrops.\n\tPhased-array radar – a radar set that uses a phased array, a computer-controlled antenna that can steer the radar beam quickly to point in different directions without moving the antenna.  Phased-array radars were developed by the military to track fast-moving missiles and aircraft.  They are widely used in military equipment and are now spreading to civilian applications.\n\tSynthetic aperture radar(SAR) – a specialized airborne radar set that produces a high-resolution map of ground terrain.  The radar is mounted on an aircraft or spacecraft and the radar antenna radiates a beam of radio waves sideways at right angles to the direction of motion, toward the ground.  In processing the return radar signal, the motion of the vehicle is used to simulate a large antenna, giving the radar a higher resolution.\n\tGround-penetrating radar – a specialized radar instrument which is rolled along the ground surface in a cart and transmits a beam of radio waves into the ground, producing an image of subsurface objects.  Frequencies from 100 MHz to a few GHz are used.  Since radio waves cannot penetrate very far into earth, the depth of GPR is limited to about 50 feet.\n\tCollision avoidance system – a short range radar or LIDAR system on an automobile or vehicle that detects if the vehicle is about to collide with an object and applies the brakes to prevent the collision.\n\tRadar fuze – a detonator for an aerial bomb which uses a radar altimeter to measure the height of the bomb above the ground as it falls and detonates it at a certain altitude.\n\tRadar speed gun – A handheld Doppler radar used by traffic police to measure the speed of vehicles to determine if they are obeying the local speed limit.  When the officer points the gun at a vehicle and presses a trigger, its speed appears on a numeric display.  Speed guns use the X band or Ku band.\n\n\nRadiolocation[edit]\n\nMain article: Radiolocation\n\nRadiolocation is a generic term covering a variety of techniques which use radio waves to find the location of objects, or for navigation\n\n\n  \nA personal navigation assistant GPS receiver in a car, which can give driving directions to a destination.\n\n\n\n\tGlobal Navigation Satellite System (GNSS) or satnav system – A system of satellites which allows geographical location on Earth (latitude, longitude, and altitude/elevation) to be determined to high precision (within a few metres) by small portable navigation instruments, by timing the arrival of radio signals from the satellites.  These are the most widely used navigation systems today.  The main satellite navigation systems are the US Global Positioning System (GPS), Russia's GLONASS, China's BeiDou Navigation Satellite System (BDS) and the European Union's Galileo.\n\tGlobal Positioning System(GPS) – The most widely used satellite navigation system, maintained by the US Air Force, which uses a constellation of 31 satellites in low Earth orbit.  The orbits of the satellites are distributed so at any time at least four satellites are above the horizon over each point on Earth.   Each satellite has an onboard atomic clock and transmits a continuous radio signal containing a precise time signal as well as its current position. Two frequencies are used, 1.2276 and 1.57542 GHz. Since the velocity of radio waves is virtually constant, the delay of the radio signal from a satellite is proportional to the distance of the receiver from the satellite.  By receiving the signals from at least four satellites a GPS receiver can calculate its position on Earth by comparing the arrival time of the radio signals.     Since each satellite's position is known precisely at any given time, from the delay the position of the receiver can be calculated by a microprocessor in the receiver. The position can be displayed as latitude and longitude, or as a marker on an electronic map.   GPS receivers are incorporated in almost all cellphones and in vehicles such as automobiles, aircraft, and ships, and are used to guide drones, missiles, cruise missiles, and even artillery shells to their target, and handheld GPS receivers are produced for hikers and the military.\n\n\n\n\n\tRadio beacon – a fixed location terrestrial radio transmitter which transmits a continuous radio signal used by aircraft and ships for navigation.  The locations of beacons are plotted on navigational maps used by aircraft and ships.  \nVOR/DME aircraft radio navigation beacon\n\n\n\n\tVery High Frequency Omnidirectional Range (VOR) – a worldwide aircraft radio navigation system consisting of fixed ground radio beacons transmitting between 108.00 and 117.95 MHz in the VHF band.  An automated navigational instrument on the aircraft displays a bearing to a nearby VOR transmitter. A VOR beacon transmits two signals simultaneously on different frequencies.  A directional antenna transmits a beam of radio waves that rotates like a lighthouse at a fixed rate, 30 times per second. When the directional beam is facing north, an omnidirectional antenna transmits a pulse. By measuring the difference in phase of these two signals, an aircraft can determine its bearing (or \"radial\") from the station accurately.   By taking a bearing on two VOR beacons an aircraft can determine its position (called a \"fix\") to an accuracy of about 90 metres (300 ft).  Most VOR beacons also have a distance measuring capability, called distance measuring equipment (DME); these are called VOR/DME's.  The aircraft transmits a radio signal to the VOR/DME beacon and a transponder transmits a return signal.  From the propagation delay between the transmitted and received signal the aircraft can calculate its distance from the beacon.  This allows an aircraft to determine its location \"fix\" from only one VOR beacon.  Since line-of-sight VHF frequencies are used VOR beacons have a range of about 200 miles for aircraft at cruising altitude.  TACAN is a similar military radio beacon system which transmits in 962–1213 MHz, and a combined VOR and TACAN beacon is called a VORTAC.    In 2000 there were about 3000 VOR beacons worldwide, but this number is declining as aviation switches to the RNAV system that relies on Global Positioning System satellite navigation.\n\tNon-directional beacon (NDB) – Legacy fixed radio beacons used before the VOR system that transmit a simple signal in all directions for aircraft or ships to use for radio direction finding.   Aircraft use automatic direction finder (ADF) receivers which use a directional antenna to determine the bearing to the beacon.  By taking bearings on two beacons they can determine their position.  NDBs use frequencies between 190 and 1750 kHz in the LF and MF bands which propagate beyond the horizon as ground waves or skywaves much farther than VOR beacons.  They transmit a callsign consisting of one to 3 Morse code letters as an identifier.    \nEPIRB emergency locator beacon on a ship\n\n\n\n\n\n\tEmergency locator beacon – a portable battery powered radio transmitter used in emergencies to locate airplanes, vessels, and persons in distress and in need of immediate rescue.  Various types of emergency locator beacons are carried by aircraft, ships, vehicles, hikers and cross-country skiers.  In the event of an emergency, such as the aircraft crashing, the ship sinking, or a hiker becoming lost, the transmitter is deployed and begins to transmit a continuous radio signal, which is used by search and rescue teams to quickly find the emergency and render aid.  The latest generation Emergency Position Indicating Rescue Beacons (EPIRBs) contain a GPS receiver, and broadcast to rescue teams their exact location within 20 meters.\n\tCospas-Sarsat – an international humanitarian consortium of governmental and private agencies which acts as a dispatcher for search and rescue operations.  It operates a network of about 47 satellites carrying radio receivers, which detect distress signals from emergency locator beacons anywhere on Earth transmitting on the international Cospas distress frequency of 406 MHz.  The satellites calculate the geographic location of the beacon within 2 km by measuring the Doppler frequency shift of the radio waves due to the relative motion of the transmitter and the satellite, and quickly transmit the information to the appropriate local first responder organizations, which perform the search and rescue.\n\n\n\n\n  \nWildlife officer tracking radio tagged mountain lion\n\n\n    \n\tRadio direction finding (RDF) – this is a general technique, used since the early 1900s, of using specialized radio receivers with directional antennas (RDF receivers) to determine the exact bearing of a radio signal, to determine the location of the transmitter.  The location of a terrestrial transmitter can be determined by simple triangulation from bearings taken by two RDF stations separated geographically, as the point where the two bearing lines cross, this is called a \"fix\".  Military forces use RDF to locate enemy forces by their tactical radio transmissions, counterintelligence services use it to locate clandestine transmitters used by espionage agents, and governments use it to locate unlicensed transmitters or interference sources.  Older RDF receivers used rotatable loop antennas, the antenna is rotated until the radio signal strength is weakest, indicating the transmitter is in one of the antenna's two nulls.  The nulls are used since they are sharper than the antenna's lobes (maxima).   More modern receivers use phased array antennas which have much greater angular resolution.\n\tAnimal migration tracking – a widely used technique in wildlife biology, conservation biology, and wildlife management in which small battery-powered radio transmitters are attached to wild animals so their movements can be tracked with a directional RDF receiver. Sometimes the transmitter is implanted in the animal.  The VHF band is typically used since antennas in this band are fairly compact.  The receiver has a directional antenna (typically a small Yagi) which is rotated until the received signal is strongest; at this point the antenna is pointing in the direction of the animal.  Sophisticated systems used in recent years use satellites to track the animal, or geolocation tags with GPS receivers which record and transmit a log of the animal's location.\n\n\n\n\nRemote control[edit]\n\nMain article: Radio control\n\n  \nUS Air Force MQ-1 Predator drone flown remotely by a pilot on the ground\n\n\n\nRadio remote control is the use of electronic control signals sent by radio waves from a transmitter to control the actions of a device at a remote location.  Remote control systems may also include telemetry channels in the other direction, used to transmit real-time information of the state of the device back to the control station.  Unmanned spacecraft are an example of remote controlled machines, controlled by commands transmitted by satellite ground stations.  Most handheld remote controls used to control consumer electronics products like televisions or DVD players actually operate by infrared light rather than radio waves, so are not examples of radio remote control.  A security concern with remote control systems is spoofing, in which an unauthorized person transmits an imitation of the control signal to take control of the device.  Examples of radio remote control:\n\n\n\tUnmanned aerial vehicle (UAV, drone) – A drone is an aircraft without an onboard pilot, flown by remote control by a pilot in another location, usually in a piloting station on the ground.  They are used by the military for reconnaissance and ground attack, and more recently by the civilian world for news reporting and aerial photography.   The pilot uses aircraft controls like a joystick or steering wheel, which create control signals which are transmitted to the drone by radio to control the flight surfaces and engine.  A telemetry system transmits back a video image from a camera in the drone to allow the pilot to see where he is going, and data from a GPS receiver giving the real-time position of the aircraft.  UAVs have sophisticated onboard automatic pilot systems that maintain stable flight and only require manual control to change directions.\n\n\n  \nRemote keyless entry fob for a car\n\n\n \n\tKeyless entry system  – a short-range handheld battery powered key fob transmitter, included with most modern cars, which can lock and unlock the doors of a vehicle from outside, eliminating the need to use a key.  When a button is pressed, the transmitter sends a coded radio signal to a receiver in the vehicle, operating the locks.  The fob must be close to the vehicle, typically within 5 to 20 meters.  North America and Japan use a frequency of 315 MHz, while Europe uses 433.92 and 868 MHz.  Some models can also remotely start the engine, to warm up the car.  A security concern with all keyless entry systems is a replay attack, in which a thief uses a special receiver (\"code grabber\") to record the radio signal during opening, which can later be replayed to open the door.  To prevent this, keyless systems use a rolling code system in which a pseudorandom number generator in the remote control generates a different random key each time it is used.  To prevent thieves from simulating the pseudorandom generator to calculate the next key, the radio signal is also encrypted.\n\tGarage door opener – a short-range handheld transmitter which can open or close a building's electrically operated garage door from outside, so the owner can open the door when he drives up in his car, and close it after he leaves.  When a button is pressed the control transmits a coded FSK radio signal to a receiver in the opener, raising or lowering the door.  Modern openers use 310, 315 or 390 MHz.  To prevent a thief using a replay attack, modern openers use a rolling code system.\n\n\n\n\n  \nQuadcopter, a popular remote-controlled toy\n\n\n\n\tRadio-controlled models – a popular hobby is playing with radio-controlled model boats, cars, airplanes, and helicopters (quadcopters) which are controlled by radio signals from a handheld console with a joystick.  Most recent transmitters use the 2.4 GHz ISM band with multiple control channels modulated with PWM, PCM or FSK.\n\tWireless doorbell – A residential doorbell that uses wireless technology to eliminate the need to run wires through the building walls.  It consists of a doorbell button beside the door containing a small battery powered transmitter.  When the doorbell is pressed it sends a signal to a receiver inside the house with a speaker that sounds chimes to indicate someone is at the door.  They usually use the 2.4 GHz ISM band.  The frequency channel used can usually be changed by the owner in case another nearby doorbell is using the same channel.\n\n\n\n\nScientific research[edit]\n\n  \nArecibo radio telescope, in Puerto Rico\n\n\n\n\tRadio astronomy is the scientific study of radio waves emitted by astronomical objects.  Radio astronomers use radio telescopes, large radio antennas and receivers, to receive and study the radio waves from astronomical radio sources.  Since astronomical radio sources are so far away, the radio waves from them are extremely weak, requiring extremely sensitive receivers, and radio telescopes are the most sensitive radio receivers in existence.  They use large parabolic (dish) antennas up to 500 meters (2,000 ft) in diameter to collect enough radio wave energy to study.  The RF front end electronics of the receiver is often cooled by liquid nitrogen to reduce thermal noise.   Multiple antennas are often linked together in arrays which function as a single antenna, to increase collecting power.  In Very Long Baseline Interferometry (VLBI) radio telescopes on different continents are linked, which can achieve the resolution of an antenna thousands of miles in diameter.\n\tRemote sensing – in radio, remote sensing is the reception of electromagnetic waves radiated by natural objects or the atmosphere for scientific research.  All warm objects emit microwaves and the spectrum emitted can be used to determine temperature.  Microwave radiometers are used in meteorology and earth sciences to determine temperature of the atmosphere and earth surface, as well as chemical reactions in the atmosphere.\n\n\nEtymology[edit]\n\nThe word \"radio\" is derived from the Latin word \"radius\", meaning \"spoke of a wheel, beam of light, ray\". It was first applied to communications in 1881 when, at the suggestion of French scientist Ernest Mercadier, Alexander Graham Bell adopted \"radiophone\" (meaning \"radiated sound\") as an alternate name for his photophone optical transmission system.[8] However, this invention would not be widely adopted.\n\nFollowing Heinrich Hertz's discovery of the existence of radio waves in 1886, a variety of terms were initially used for this radiation, including \"Hertzian waves\", \"electric waves\", and \"ether waves\".  The first practical radio communications systems, developed by Guglielmo Marconi in 1894-5, transmitted telegraph signals by radio waves, so radio communication was first called \"wireless telegraphy\".  Up until about 1910 the term \"wireless telegraphy\" also included a variety of other experimental systems for transmitting telegraph signals without wires, including electrostatic induction, electromagnetic induction and aquatic and earth conduction, so there was a need for a more precise term referring exclusively to electromagnetic radiation.\n\nThe first use of radio- in conjunction with electromagnetic radiation appears to have been by French physicist Édouard Branly, who in 1890 developed the coherer detector, which he called in French a radio-conducteur.[9] The radio- prefix was later used to form additional descriptive compound and hyphenated words, especially in Europe. For example, in early 1898 the British publication The Practical Engineer included a reference to \"the radiotelegraph\" and \"radiotelegraphy\",[10] The French text of both the 1903 and 1906 Berlin Radiotelegraphic Conventions includes the phrases \"radiotélégraphique\" and \"radiotélégrammes\".\n\nThe use of \"radio\" as a standalone word dates back to at least December 30, 1904, when instructions issued by the British Post Office for transmitting telegrams specified that \"The word 'Radio'... is sent in the Service Instructions\".[11] This practice was universally adopted, and the word \"radio\" introduced internationally, by the 1906 Berlin Radiotelegraphic Convention, which included a Service Regulation specifying that \"Radiotelegrams shall show in the preamble that the service is 'Radio'\".\n\nThe switch to \"radio\" in place of \"wireless\" took place slowly and unevenly in the English-speaking world. Lee de Forest helped popularize the new word in the United States—in early 1907 he founded the DeForest Radio Telephone Company, and his letter in the June 22, 1907 Electrical World about the need for legal restrictions warned that \"Radio chaos will certainly be the result until such stringent regulation is enforced\".[12] The United States Navy would also play a role. Although its translation of the 1906 Berlin Convention used the terms \"wireless telegraph\" and \"wireless telegram\", by 1912 it began to promote the use of \"radio\" instead. The term started to become preferred by the general public in the 1920s with the introduction of broadcasting. (the word broadcasting originated with the agricultural term meaning roughly \"scattering seeds widely\".) British Commonwealth countries continued to commonly use the term \"wireless\" until the mid-20th century, though the magazine of the British Broadcasting Corporation in the UK has been called Radio Times since its founding in the early 1920s.\n\nIn recent years \"wireless\" has gained renewed popularity as a more general term for devices communicating using electromagnetic radiation, either radio waves or light, due to the rapid growth of short-range computer networking, e.g., wireless local area networks Wi-Fi, and Bluetooth, as well as cell phones, to distinguish these uses from traditional \"radio\" communication, such as broadcasting.\n\n\nHistory[edit]\n\n\tSee History of radio, Invention of radio, Timeline of radio, History of broadcasting\n\n\nSee also[edit]\n\n\n\tRadio portal\n\n\n\n\tOutline of radio\n\tElectromagnetic radiation and health\n\tRadio quiet zone\n\n\nReferences[edit]\n\n\n\t^ \"Radio\". Oxford Living Dictionaries. Oxford University Press. 2019. Retrieved 26 February 2019.\n\n\t^ \"Definition of radio\". Encyclopedia. PCMagazine website, Ziff-Davis. 2018. Retrieved 26 February 2019.\n\n\n\t^ a b c d Ellingson, Steven W. (2016). Radio Systems Engineering. Cambridge University Press. pp. 1–4. ISBN 978-1316785164.\n\n\n\t^ Serway, Raymond; Faughn, Jerry; Vuille, Chris (2008). College Physics, 8th Ed. Cengage Learning. p. 714. ISBN 0495386936.\n\n\n\t^ Ellingson, Steven W. (2016). Radio Systems Engineering. Cambridge University Press. pp. 16–17. ISBN 1316785165.\n\n\n\t^ a b c Brain, Marshall (2000-12-07). \"How Radio Works\". HowStuffWorks.com. Retrieved 2009-09-11.\n\n\n\t^ a b Brain, Marshall; Jeff Tyson & Julia Layton (2018). \"How Cell Phones Work\". How Stuff Works. InfoSpace Holdings LLC. Retrieved 31 December 2018.\n\n\n\t^ \"Production of Sound by Radiant Energy\" by Alexander Graham Bell, Popular Science Monthly, July, 1881, pages 329–330: \"[W]e have named the apparatus for the production and reproduction of sound in this way the \"photophone\", because an ordinary beam of light contains the rays which are operative. To avoid in future any misunderstandings upon this point, we have decided to adopt the term \"radiophone\", proposed by M. Mercadier, as a general term signifying the production of sound by any form of radiant energy...\"\n\n\t^ \"The Genesis of Wireless Telegraphy\" by A. Frederick Collins, Electrical World and Engineer, May 10, 1902, page 811.\n\n\t^ \"Wireless Telegraphy\", The Practical Engineer, February 25, 1898, page 174. \"Dr. O. J. Lodge, who preceded Marconi in making experiments in what may be called \"ray\" telegraphy or radiotelegraphy by a year or two, has devised a new method of sending and receiving the messages. The reader will understand that in the radiotelegraph electric waves forming the signals of the message start from the sending instrument and travel in all directions like rays of light from a lamp, only they are invisible.\"\n\n\t^ \"Wireless Telegraphy\", The Electrical Review (London), January 20, 1905, page 108, quoting from the British Post Office's December 30, 1904 Post Office Circular.\n\n\t^ \"Interference with Wireless Messages\", Electrical World, June 22, 1907, page 1270.\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to:\n Radio (category)\n\n\n\n\t\tWikiquote has quotations related to: Radio\n\n\n\t\tv\n\tt\n\te\n\n\nInternational Morse code\n\n\tTransmission methods\t\n\tElectrical telegraph\n\tOn–off keying\n\tContinuous wave\n\tModulated continuous wave\n\tHeliograph\n\tSignal lamp\n\n\n\n\n\tNotable signals\t\n\tSOS\n\tCQD\n\tMorse code mnemonics\n\tProsigns for Morse code\n\tMorse code abbreviations\n\tQ code\n\tZ code\n\n\n\n\n\tOther writing systems\nin Morse code\t\n\tAmerican Morse code\n\tGreek alphabet\n\tCyrillic script\n\tRussian\n\n\n\tHebrew script\n\tArabic script\n\tWabun code\n\tChinese telegraph code\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nTelecommunications\n\n\tHistory\t\n\tBeacon\n\tBroadcasting\n\tCable protection system\n\tCable TV\n\tCommunications satellite\n\tComputer network\n\tDrums\n\tElectrical telegraph\n\tFax\n\tHeliographs\n\tHydraulic telegraph\n\tInternet\n\tMass media\n\tMobile phone\n\tOptical telecommunication\n\tOptical telegraphy\n\tPager\n\tPhotophone\n\tPrepaid mobile phone\n\tRadio\n\tRadiotelephone\n\tSatellite communications\n\tSemaphore\n\tSmartphone\n\tSmoke signals\n\tTelecommunications history\n\tTelautograph\n\tTelegraphy\n\tTeleprinter (teletype)\n\tTelephone\n\tThe Telephone Cases\n\tTelevision\n\tUndersea telegraph line\n\tVideoconferencing\n\tVideophone\n\tVideotelephony\n\tWhistled language\n\n\n\n\t\n\n\tPioneers\t\n\tEdwin Howard Armstrong\n\tJohn Logie Baird\n\tPaul Baran\n\tAlexander Graham Bell\n\tTim Berners-Lee\n\tJagadish Chandra Bose\n\tVint Cerf\n\tClaude Chappe\n\tDonald Davies\n\tLee de Forest\n\tPhilo Farnsworth\n\tReginald Fessenden\n\tElisha Gray\n\tErna Schneider Hoover\n\tCharles K. Kao\n\tHedy Lamarr\n\tInnocenzo Manzetti\n\tGuglielmo Marconi\n\tAntonio Meucci\n\tRadia Perlman\n\tAlexander Stepanovich Popov\n\tJohann Philipp Reis\n\tHenry Sutton\n\tNikola Tesla\n\tCamille Tissot\n\tAlfred Vail\n\tCharles Wheatstone\n\tVladimir K. Zworykin\n\n\n\n\n\tTransmission\nmedia\t\n\tCoaxial cable\n\tFiber-optic communication\n\tOptical fiber\n\n\n\tFree-space optical communication\n\tMolecular communication\n\tRadio waves\n\tTransmission line\n\n\n\n\n\tNetwork topology\nand switching\t\n\tLinks\n\tNodes\n\tTerminal node\n\tNetwork switching (circuit\n\tpacket)\n\tTelephone exchange\n\n\n\n\n\tMultiplexing\t\n\tSpace-division\n\tFrequency-division\n\tTime-division\n\tPolarization-division\n\tOrbital angular-momentum\n\tCode-division\n\n\n\n\n\tNetworks\t\n\tARPANET\n\tBITNET\n\tCellular network\n\tComputer\n\tCYCLADES\n\tEthernet\n\tFidoNet\n\tInternet\n\tInternet2\n\tISDN\n\tLAN\n\tMobile\n\tNGN\n\tNPL network\n\tPublic Switched Telephone\n\tRadio\n\tTelecommunications equipment\n\tTelevision\n\tTelex\n\tWAN\n\tWireless network\n\tWorld Wide Web\n\n\n\n\n\t\n\t Category\n\t Outline\n\t Portal\n\t Commons\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nAnalog and digital audio broadcasting\n\n\tTerrestrial\t\n\tRadio modulation\t\n\tAM\n\tFM\n\tCOFDM\n\n\n\n\n\tFrequency allocations\t\n\tLW (LF)\n\tMW (MF)\n\tSW (HF)\n\tVHF (low / mid / high)\n\tL band (UHF)\n\n\n\n\n\tDigital systems\t\n\tCAM-D\n\tDAB/DAB+\n\tDRM/DRM+\n\tFMeXtra\n\tHD Radio\n\tCDR\n\tDVB-T2 Lite\n\n\n\n\n\n\n\n\tSatellite\t\n\tFrequency allocations\t\n\tC band\n\tKu band\n\tL band\n\tS band\n\n\n\n\n\tDigital systems\t\n\tADR\n\tDAB-S\n\tDVB-SH\n\tS-DMB\n\tSDR\n\n\n\n\n\tCommercial radio providers\t\n\tSirius XM Holdings\n\tSiriusXM Canada\n\n\n\n\n\n\n\n\tCodecs\t\n\tAAC\n\tAMR-WB+\n\tHDC\n\tHE-AAC\n\tMPEG-1 Audio Layer II\n\n\n\n\n\tSubcarrier signals\t\n\tAMSS\n\tDirectBand\n\tPAD\n\tRDS/RBDS\n\tSCA/SCMO\n\tDARC\n\n\n\n\n\t\n\tRelated topics\n\n\tTechnical (audio)\t\n\tAudio data compression\n\tAudio signal processing\n\n\n\n\n\tTechnical (AM stereo formats)\t\n\tBelar\n\tC-QUAM\n\tHarris\n\tKahn-Hazeltine\n\tMagnavox\n\n\n\n\n\tTechnical (emission)\t\n\tAM broadcasting\n\tAM expanded band\n\tCable radio\n\tDigital radio\n\tError detection and correction\n\tFM broadcast band\n\tFM broadcasting\n\tMultipath propagation\n\tShortwave relay station\n\n\n\n\n\tCultural\t\n\tHistory of radio\n\tInternational broadcasting\n\n\n\n\n\t\n\tComparison of radio systems\n\n\n\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nRadio spectrum (ITU)\n\n\t\t\nELF     \n   3 Hz/100 Mm  \n  30 Hz/10 Mm\n\n\n\n\t\nSLF         \n  30 Hz/10 Mm   \n 300 Hz/1 Mm\n\n\n\n\t\nULF         \n 300 Hz/1 Mm    \n   3 kHz/100 km\n\n\n\n\t\nVLF          \n   3 kHz/100 km \n  30 kHz/10 km\n\n\n\n\t\nLF                \n  30 kHz/10 km  \n 300 kHz/1 km\n\n\n\n\t\nMF             \n 300 kHz/1 km   \n   3 MHz/100 m\n\n\n\n\t\nHF               \n   3 MHz/100 m  \n  30 MHz/10 m\n\n\n\n\t\nVHF         \n  30 MHz/10 m   \n 300 MHz/1 m\n\n\n\n\t\nUHF        \n 300 MHz/1 m    \n   3 GHz/100 mm\n\n\n\n\t\nSHF        \n   3 GHz/100 mm \n  30 GHz/10 mm\n\n\n\n\t\nEHF    \n  30 GHz/10 mm  \n 300 GHz/1 mm\n\n\n\n\t\nTHF \n 300 GHz/1 mm   \n   3 THz/0.1 mm\n\n\n\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nMedia culture\n\n\tMedia\t\n\tMass media\n\tMainstream media\n\t24-hour news cycle\n\tCorporate media\n\tNews broadcasting\n\tNews media\n\tFilm\n\tInternet\n\tRadio\n\tTelevision\n\n\n\n\n\tIdeology\t\n\tMainstream\n\tAdvanced capitalism\n\tAmerican Dream\n\tBipartisanship\n\tConsumerism\n\tPensée unique\n\tPop music\n\n\n\n\n\tDeception\t\n\tForms\t\n\tAdvertising\n\tPropaganda\n\tFake news\n\n\n\tPublic relations\n\tSpin\n\tTabloid journalism\n\n\n\n\n\tTechniques\t\n\tCult of personality\n\tDumbing down\n\tFraming\n\tMedia circus\n\tMedia event\n\tNarcotizing dysfunction\n\tRecuperation\n\tSensationalism\n\n\n\n\n\tOthers\t\n\tCatch and kill\n\tCrowd manipulation\n\tManaging the news\n\tMedia manipulation\n\n\n\n\n\n\n\n\tPhilosophers\t\n\tTheodor W. Adorno\n\tJean Baudrillard\n\tEdward Bernays\n\tNoam Chomsky\n\tGuy Debord\n\tWalter Lippmann\n\tMarshall McLuhan\n\n\n\n\n\tCounterculture\t\n\tBoycott\n\tCall-out culture\n\tCancel culture\n\tCivil disobedience\n\tCulture jamming\n\tDemonstration\n\tGraffiti\n\tOccupation\n\tPolitical satire\n\tProtest\n\tPunk\n\tStrike action\n\n\n\n\n\tIn academia\t\n\tInfluence of mass media\n\tMedia studies\n\tSemiotic democracy\n\tThe Lonely Crowd\n\n\n\n\n\tIssues\t\n\tAnonymity\n\tConcentration of media ownership\n\tFreedom of speech\n\tMedia bias\n\tPrivacy\n\n\n\n\n\tSynonyms\t\n\tAdvanced capitalism\n\tCulture industry\n\tMass society\n\tPost-Fordism\n\tSociety of the Spectacle\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Radio&oldid=917966363\"\n\n\t\t\n\t\tCategories: \tAdvertising by medium\n\tRadio\n\tBritish inventions\n\tItalian inventions\n\tMedia formats\n\tPromotion and marketing communications\n\n\nHidden categories: \tArticles with short description\n\tArticles needing additional references from April 2016\n\tAll articles needing additional references\n\tPages using multiple image with auto scaled images\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tDeutsch\n\tفارسی\n\tFrançais\n\t贛語\n\tItaliano\n\tҚазақша\n\tКыргызча\n\tLingála\n\tBahasa Melayu\n\tမြန်မာဘာသာ\n\tPatois\n\tPolski\n\tRomână\n\tРусский\n\tၽႃႇသႃႇတႆး \n\tTagalog\n\tதமிழ்\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t吴语\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 26 September 2019, at 10:20 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "15", "dc:title": "Radio - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Radio_towers_on_Sandia_Peak_-_closeup.jpg/1200px-Radio_towers_on_Sandia_Peak_-_closeup.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-radio", "title": "Radio - Wikipedia"}}