{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRadiation hardening - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tRadiation hardening\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tNot to be confused with hard radiation.\n\nRadiation hardening is process of making electronic components and circuits resistant to damage or malfunction caused by high levels of ionizing radiation (particle radiation and high-energy electromagnetic radiation),[1] especially for environments in outer space and high-altitude flight, around nuclear reactors and particle accelerators, or during nuclear accidents or nuclear warfare.\n\nMost semiconductor electronic components are susceptible to radiation damage, and radiation-hardened components are based on their non-hardened equivalents, with some design and manufacturing variations that reduce the susceptibility to radiation damage. Due to the extensive development and testing required to produce a radiation-tolerant design of a microelectronic chip, radiation-hardened chips tend to lag behind the most recent developments.\n\nRadiation-hardened products are typically tested to one or more resultant effects tests, including total ionizing dose (TID), enhanced low dose rate effects (ELDRS), neutron and proton displacement damage, and single event effects (SEE, SET, SEL and SEB).\n\n\nContents\n\n\n\t1 Problems caused by radiation\n\t2 Major radiation damage sources\n\t3 Radiation effects on electronics\n\t3.1 Fundamental mechanisms\n\t3.1.1 Lattice displacement\n\t3.1.2 Ionization effects\n\n\n\n\t3.2 Resultant effects\n\t3.2.1 Total ionizing dose effects\n\t3.2.2 Transient dose effects\n\t3.2.3 Systems-generated EMP effects\n\n\n\n\t3.3 Digital damage: SEE\n\t3.3.1 Single-event transient\n\t3.3.2 Single-event upset\n\t3.3.3 Single-event latchup\n\t3.3.4 Single-event snapback\n\t3.3.5 Single-event induced burnout\n\t3.3.6 Single-event gate rupture\n\n\n\n\t3.4 SEE testing\n\n\n\n\t4 Radiation-hardening techniques\n\t4.1 Physical\n\t4.2 Logical\n\n\n\n\t5 Military and space industry applications\n\t6 Nuclear hardness for telecommunication\n\t6.1 Notes\n\n\n\n\t7 Examples of rad-hard computers\n\t8 See also\n\t9 References\n\t10 Books and Reports\n\t11 External links\n\n\n\n\n\nProblems caused by radiation[edit]\n\nSee also: Radiation damage\n\nEnvironments with high levels of ionizing radiation create special design challenges. A single charged particle can knock thousands of electrons loose, causing electronic noise and signal spikes. In the case of digital circuits, this can cause results which are inaccurate or unintelligible. This is a particularly serious problem in the design of satellites, spacecraft, military aircraft, nuclear power stations, and nuclear weapons. In order to ensure the proper operation of such systems, manufacturers of integrated circuits and sensors intended for the military or aerospace markets employ various methods of radiation hardening. The resulting systems are said to be rad(iation)-hardened, rad-hard, or (within context) hardened.\n\n\nMajor radiation damage sources[edit]\n\nTypical sources of exposure of electronics to ionizing radiation are the Van Allen radiation belts for satellites, nuclear reactors in power plants for sensors and control circuits, particle accelerators for control electronics particularly particle detector devices, residual radiation from isotopes in chip packaging materials, cosmic radiation for spacecraft and high-altitude aircraft, and nuclear explosions for potentially all military and civilian electronics.\n\n\n\tCosmic rays come from all directions and consist of approximately 85% protons, 14% alpha particles, and 1% heavy ions, together with x-ray and gamma-ray radiation. Most effects are caused by particles with energies between 0.1 and 20 GeV. The atmosphere filters most of these, so they are primarily a concern for spacecraft and high-altitude aircraft, but can also affect ordinary computers on the surface.[2]\n\tSolar particle events come from the direction of the sun and consist of a large flux of high-energy (several GeV) protons and heavy ions, again accompanied by x-ray radiation.\n\tVan Allen radiation belts contain electrons (up to about 10 MeV) and protons (up to 100s MeV) trapped in the geomagnetic field. The particle flux in the regions farther from the Earth can vary wildly depending on the actual conditions of the Sun and the magnetosphere. Due to their position they pose a concern for satellites.\n\tSecondary particles result from interaction of other kinds of radiation with structures around the electronic devices.\n\tNuclear reactors produce gamma radiation and neutron radiation which can affect sensor and control circuits in nuclear power plants.\n\tParticle accelerators produce high energy protons and electrons, and the secondary particles produced by their interactions produce significant radiation damage on sensitive control and particle detector components, of the order of magnitude of 10 MRad[Si]/year for systems such as the Large Hadron Collider.\n\tNuclear explosions produce a short and extremely intense surge through a wide spectrum of electromagnetic radiation, an electromagnetic pulse (EMP), neutron radiation, and a flux of both primary and secondary charged particles. In case of a nuclear war they pose a potential concern for all civilian and military electronics.\n\tChip packaging materials were an insidious source of radiation that was found to be causing soft errors in new DRAM chips in the 1970s. Traces of radioactive elements in the packaging of the chips were producing alpha particles, which were then occasionally discharging some of the capacitors used to store the DRAM data bits. These effects have been reduced today by using purer packaging materials, and employing error-correcting codes to detect and often correct DRAM errors.\n\n\nRadiation effects on electronics[edit]\n\nFundamental mechanisms[edit]\n\nTwo fundamental damage mechanisms take place:\n\n\nLattice displacement[edit]\n\nLattice displacement is caused by neutrons, protons, alpha particles, heavy ions, and very high energy gamma photons. They change the arrangement of the atoms in the crystal lattice, creating lasting damage, and increasing the number of recombination centers, depleting the minority carriers and worsening the analog properties of the affected semiconductor junctions. Counterintuitively, higher doses over short time cause partial annealing (\"healing\") of the damaged lattice, leading to a lower degree of damage than with the same doses delivered in low intensity over a long time (LDR or Low Dose Rate). This type of problem is particularly significant in bipolar transistors, which are dependent on minority carriers in their base regions; increased losses caused by recombination cause loss of the transistor gain (see neutron effects). Components certified as ELDRS (Enhanced Low Dose Rate Sensitive) free, do not show damages with fluxes below 0.01 rad(Si)/s = 36 rad(Si)/h.\n\n\nIonization effects[edit]\n\nIonization effects are caused by charged particles, including the ones with energy too low to cause lattice effects. The ionization effects are usually transient, creating glitches and soft errors, but can lead to destruction of the device if they trigger other damage mechanisms (e.g. a latchup). Photocurrent caused by ultraviolet and x-ray radiation may belong to this category as well. Gradual accumulation of holes in the oxide layer in MOSFET transistors leads to worsening of their performance, up to device failure when the dose is high enough (see total ionizing dose effects).\n\nThe effects can vary wildly depending on all the parameters – type of radiation, total dose and radiation flux, combination of types of radiation, and even the kind of device load (operating frequency, operating voltage, actual state of the transistor during the instant it is struck by the particle) – which makes thorough testing difficult, time consuming, and requiring many test samples.\n\n\nResultant effects[edit]\n\nThe \"end-user\" effects can be characterized in several groups,\n\nA neutron interacting with the semiconductor lattice will displace its atoms. This leads to an increase in the count of recombination centers and deep-level defects, reducing the lifetime of minority carriers, thus affecting bipolar devices more than CMOS ones. Bipolar devices on silicon tend to show changes in electrical parameters at levels of 1010 to 1011 neutrons/cm², CMOS devices aren't affected until 1015 neutrons/cm². The sensitivity of the devices may increase together with increasing level of integration and decreasing size of individual structures. There is also a risk of induced radioactivity caused by neutron activation, which is a major source of noise in high energy astrophysics instruments. Induced radiation, together with residual radiation from impurities in used materials, can cause all sorts of single-event problems during the device's lifetime. GaAs LEDs, common in optocouplers, are very sensitive to neutrons. The lattice damage influences the frequency of crystal oscillators. Kinetic energy effects (namely lattice displacement) of charged particles belong here too.\n\n\nTotal ionizing dose effects[edit]\n\nThe cumulative damage of the semiconductor lattice (lattice displacement damage) caused by ionizing radiation over the exposition time. It is measured in rads and causes slow gradual degradation of the device's performance. A total dose greater than 5000 rads delivered to silicon-based devices in seconds to minutes will cause long-term degradation. In CMOS devices, the radiation creates electron–hole pairs in the gate insulation layers, which cause photocurrents during their recombination, and the holes trapped in the lattice defects in the insulator create a persistent gate biasing and influence the transistors' threshold voltage, making the N-type MOSFET transistors easier and the P-type ones more difficult to switch on. The accumulated charge can be high enough to keep the transistors permanently open (or closed), leading to device failure. Some self-healing takes place over time, but this effect is not too significant. This effect is the same as hot carrier degradation in high-integration high-speed electronics. Crystal oscillators are somewhat sensitive to radiation doses, which alter their frequency. The sensitivity can be greatly reduced by using swept quartz. Natural quartz crystals are especially sensitive. Radiation performance curves for TID testing may be generated for all resultant effects testing procedures. These curves show performance trends throughout the TID test process and are included in the radiation test report.\n\n\nTransient dose effects[edit]\n\nThe short-time high-intensity pulse of radiation, typically occurring during a nuclear explosion. The high radiation flux creates photocurrents in the entire body of the semiconductor, causing transistors to randomly open, changing logical states of flip-flops and memory cells. Permanent damage may occur if the duration of the pulse is too long, or if the pulse causes junction damage or a latchup. Latchups are commonly caused by the x-rays and gamma radiation flash of a nuclear explosion. Crystal oscillators may stop oscillating for the duration of the flash due to prompt photoconductivity induced in quartz.\n\n\nSystems-generated EMP effects[edit]\n\nSGEMP are caused by the radiation flash traveling through the equipment and causing local ionization and electric currents in the material of the chips, circuit boards, electrical cables and cases.\n\n\nDigital damage: SEE[edit]\n\nSingle-event effects (SEE) have been studied extensively since the 1970s. [3]  When a high-energy particle travels through a semiconductor, it leaves an ionized track behind. This ionization may cause a highly localized effect similar to the transient dose one - a benign glitch in output, a less benign bit flip in memory or a register or, especially in high-power transistors, a destructive latchup and burnout. Single event effects have importance for electronics in satellites, aircraft, and other civilian and military aerospace applications. Sometimes, in circuits not involving latches, it is helpful to introduce RC time constant circuits that slow down the circuit's reaction time beyond the duration of an SEE.\n\n\nSingle-event transient[edit]\n\nSET happens when the charge collected from an ionization event discharges in the form of a spurious signal traveling through the circuit. This is de facto the effect of an electrostatic discharge. Soft error, reversible.\n\n\nSingle-event upset[edit]\n\nSingle-event upsets (SEU) or transient radiation effects in electronics are state changes of memory or register bits caused by a single ion interacting with the chip. They do not cause lasting damage to the device, but may cause lasting problems to a system which cannot recover from such an error. Soft error, reversible. In very sensitive devices, a single ion can cause a multiple-bit upset (MBU) in several adjacent memory cells. SEUs can become Single-event functional interrupts (SEFI) when they upset control circuits, such as state machines, placing the device into an undefined state, a test mode, or a halt, which would then need a reset or a power cycle to recover.\n\n\nSingle-event latchup[edit]\n\nSEL can occur in any chip with a parasitic PNPN structure. A heavy ion or a high-energy proton passing through one of the two inner-transistor junctions can turn on the thyristor-like structure, which then stays \"shorted\" (an effect known as latchup) until the device is power-cycled. As the effect can happen between the power source and substrate, destructively high current can be involved and the part may fail. Hard error, irreversible. Bulk CMOS devices are most susceptible.\n\n\nSingle-event snapback[edit]\n\nSingle-event snapback is similar to SEL but not requiring the PNPN structure, can be induced in N-channel MOS transistors switching large currents, when an ion hits near the drain junction and causes avalanche multiplication of the charge carriers. The transistor then opens and stays opened. Hard error, irreversible.\n\n\nSingle-event induced burnout[edit]\n\nSEB may occur in power MOSFETs when the substrate right under the source region gets forward-biased and the drain-source voltage is higher than the breakdown voltage of the parasitic structures. The resulting high current and local overheating then may destroy the device. Hard error, irreversible.\n\n\nSingle-event gate rupture[edit]\n\nSEGR was observed in power MOSFETs when a heavy ion hits the gate region while a high voltage is applied to the gate. A local breakdown then happens in the insulating layer of silicon dioxide, causing local overheat and destruction (looking like a microscopic explosion) of the gate region. It can occur even in EEPROM cells during write or erase, when the cells are subjected to a comparatively high voltage. Hard error, irreversible.\n\n\nSEE testing[edit]\n\nWhile proton beams are widely used for SEE testing due to availability, at lower energies proton irradiation can often underestimate SEE susceptibility. Furthermore, proton beams expose devices to risk of total ionizing dose (TID) failure which can cloud proton testing results or result in pre-mature device failure. White neutron beams—ostensibly the most representative SEE test method—are usually derived from solid target-based sources, resulting in flux non-uniformity and small beam areas. White neutron beams also have some measure of uncertainty in their energy spectrum, often with high thermal neutron content.\n\nThe disadvantages of both proton and spallation neutron sources can be avoided by using mono-energetic 14 MeV neutrons for SEE testing. A potential concern is that mono-energetic neutron-induced single event effects will not accurately represent the real-world effects of broad-spectrum atmospheric neutrons. However, recent studies have indicated that, to the contrary, mono-energetic neutrons—particularly 14 MeV neutrons—can be used to quite accurately understand SEE cross-sections in modern microelectronics.\n\nA particular study of interest, performed in 2010 by Normand and Dominik,[4] powerfully demonstrates the effectiveness of 14 MeV neutrons.\n\n\nRadiation-hardening techniques[edit]\n\n  \nRadiation hardened die of the 1886VE10 microcontroller prior to metalization etching\n\n\n\n  \nRadiation hardened die of the 1886VE10 microcontroller after a metalization etching process has been used\n\n\n\nPhysical[edit]\n\nHardened chips are often manufactured on insulating substrates instead of the usual semiconductor wafers. Silicon on insulator (SOI) and sapphire (SOS) are commonly used. While normal commercial-grade chips can withstand between 50 and 100 gray (5 and 10 krad), space-grade SOI and SOS chips can survive doses many orders of magnitude greater. At one time many 4000 series chips were available in radiation-hardened versions (RadHard).[5]\n\nBipolar integrated circuits generally have higher radiation tolerance than CMOS circuits. The low-power Schottky (LS) 5400 series can withstand 1000 krad, and many ECL devices can withstand 10 000 krad.[5]\n\nMagnetoresistive RAM, or MRAM, is considered a likely candidate to provide radiation hardened, rewritable, non-volatile conductor memory. Physical principles and early tests suggest that MRAM is not susceptible to ionization-induced data loss.\n\nShielding the package against radioactivity, to reduce exposure of the bare device.\n\nCapacitor-based DRAM is often replaced by more rugged (but larger, and more expensive) SRAM.\n\nChoice of substrate with wide band gap, which gives it higher tolerance to deep-level defects; e.g. silicon carbide or gallium nitride.\n\nShielding the chips themselves by use of depleted boron (consisting only of isotope boron-11) in the borophosphosilicate glass passivation layer protecting the chips, as boron-10 readily captures neutrons and undergoes alpha decay (see soft error).\n\n\nLogical[edit]\n\nError correcting memory uses additional parity bits to check for and possibly correct corrupted data. Since radiation's effects damage the memory content even when the system is not accessing the RAM, a \"scrubber\" circuit must continuously sweep the RAM; reading out the data, checking the parity for data errors, then writing back any corrections to the RAM.\n\nRedundant elements can be used at the system level. Three separate microprocessor boards may independently compute an answer to a calculation and compare their answers. Any system that produces a minority result will recalculate. Logic may be added such that if repeated errors occur from the same system, that board is shut down.\n\nRedundant elements may be used at the circuit level.[6] A single bit may be replaced with three bits and separate \"voting logic\" for each bit to continuously determine its result. This increases area of a chip design by a factor of 5, so must be reserved for smaller designs. But it has the secondary advantage of also being \"fail-safe\" in real time. In the event of a single-bit failure (which may be unrelated to radiation), the voting logic will continue to produce the correct result without resorting to a watchdog timer. System level voting between three separate processor systems will generally need to use some circuit-level voting logic to perform the votes between the three processor systems. \n\nHardened latches may be used.[7]\n\nA watchdog timer will perform a hard reset of a system unless some sequence is performed that generally indicates the system is alive, such as a write operation from an onboard processor. During normal operation, software schedules a write to the watchdog timer at regular intervals to prevent the timer from running out. If radiation causes the processor to operate incorrectly, it is unlikely the software will work correctly enough to clear the watchdog timer. The watchdog eventually times out and forces a hard reset to the system. This is considered a last resort to other methods of radiation hardening.\n\n\nMilitary and space industry applications[edit]\n\nRadiation-hardened and radiation tolerant components are often used in military and aerospace applications, including point-of-Load (POL) applications, satellite system power supplies, step down switching regulators, microprocessors, FPGAs[8], FPGA power sources, and high efficiency, low voltage subsystem power supplies.\n\n\nNuclear hardness for telecommunication[edit]\n\nIn telecommunication, the term nuclear hardness has the following meanings:\n1) an expression of the extent to which the performance of a system, facility, or device is expected to degrade in a given nuclear environment, 2) the physical attributes of a system or electronic component that will allow survival in an environment that includes nuclear radiation and electromagnetic pulses (EMP).\n\n\nNotes[edit]\n\n\tNuclear hardness may be expressed in terms of either susceptibility or vulnerability.\n\tThe extent of expected performance degradation (e.g., outage time, data lost, and equipment damage) must be defined or specified. The environment (e.g., radiation levels, overpressure, peak velocities, energy absorbed, and electrical stress) must be defined or specified.\n\tThe physical attributes of a system or component that will allow a defined degree of survivability in a given environment created by a nuclear weapon.\n\tNuclear hardness is determined for specified or actual quantified environmental conditions and physical parameters, such as peak radiation levels, overpressure, velocities, energy absorbed, and electrical stress. It is achieved through design specifications and it is verified by test and analysis techniques.\n\n\nExamples of rad-hard computers[edit]\n\n\tThe System/4 Pi, made by IBM and used on board the Space Shuttle (AP-101 variant), is based on the System/360 architecture.\n\tThe RCA1802 8-bit CPU, introduced in 1976, was the first serially-produced radiation-hardened microprocessor.\n\tThe Proton 100k SBC by Space Micro Inc., introduced in 2003, uses an updated voting scheme called TTMR which mitigates SEU in a single processor.\n\tThe Proton200k SBC by Space Micro Inc, introduced in 2004, mitigates SEU with its patented time triple modular redundancy (TTMR) technology, and single event function interrupts (SEFI) with H-Core technology. The processor is the high speed Texas Instruments 320C6Xx series digital signal processor. The Proton200k operates at 4000 MIPS while mitigate SEU.\n\tThe RH32 is produced by Honeywell Aerospace.\n\n\n\tPowerPC based:\n\tThe RAD6000 single board computer (SBC), produced by BAE Systems, includes a rad-hard POWER1 CPU.\n\tThe RHPPC is produced by Honeywell Aerospace. Based on hardened PowerPC 603e.\n\tThe SP0 and SP0-S are produced by Aitech Defense Systems is a 3U cPCI SBC which utilizes the SOI PowerQUICC-III MPC8548E, PowerPC e500 based, capable of processing speeds ranging from 833 MHz to 1.18 GHz. [1]\n\tThe Proton400k SBC by Space Micro Inc., a Freescale P2020 cpu based on PowerPC e500.\n\tThe BRE440 by Broad Reach Engineering. IBM PPC440 core based system-on-a-chip, 266 MIPS, PCI, 2x Ethernet, 2x UARTS, DMA controller, L1/L2 cache Broad Reach Engineering Website\n\tThe RAD750 SBC, also produced by BAE Systems, and based on the PowerPC 750 processor, is the successor to the RAD6000.\n\tThe SCS750 built by Maxwell Technologies, which votes three PowerPC 750 cores against each other to mitigate radiation effects.\n\tThe Boeing Company, through its Satellite Development Center, produces a radiation hardened space computer variant based on the PowerPC 750.\n\tThe RAD5500 processor, is the successor to the RAD750 based on the PowerPC e5500.\n\n\n\n\n\tSPARC based:\n\tThe ERC32 and LEON are radiation hardened processors designed by Gaisler Research and the European Space Agency. They are described in synthesizable VHDL available under the GNU Lesser General Public License and GNU General Public License respectively.\n\tThe Gen 6 single board computer (SBC), produced by Cobham Semiconductor Solutions (formerly Aeroflex Microelectronics Solutions), enabled for the LEON microprocessor.[9]\n\n\n\n\n\tMIPS based:\n\tThe Mongoose-V used by NASA is a 32-bit microprocessor for spacecraft onboard computer applications (i. e. New Horizons).\n\tThe KOMDIV-32 is a 32-bit microprocessor, compatible with MIPS R3000, developed by NIISI, manufactured by Kurchatov Institute, Russia.\n\n\n\n\n\tMIL-STD-1750A based:\n\tThe RH1750 manufactured by GEC-Plessey.\n\n\n\n\n\tm68k based:\n\tThe Coldfire M5208 used by General Dynamics is a low power (1.5 W) radiation hardened alternative.\n\n\n\n\n\tARM based:\n\tThe Vorago VA10820, a 32-bit ARMv6-M Cortex-M0.[10]\n\n\n\n\n\n\n\n\nSee also: Comparison of embedded computer systems on board the Mars rovers\n\nSee also[edit]\n\n\n\tElectronics portal\n\n\n\n\tCommunications survivability\n\tInstitute for Space and Defense Electronics, Vanderbilt University\n\tMars Reconnaissance Orbiter\n\tMESSENGER Mercury probe\n\tMars rovers\n\tTEMPEST\n\tJuno Radiation Vault\n\n\nReferences[edit]\n\n\n\t^ Messenger, George C. \"Radiation hardening\". AccessScience. doi:10.1036/1097-8542.566850.\n\n\t^ \"Cosmic particles are changing elections and causing planes to fall through the sky, scientists warn\". The Independent. 2017-02-17. Retrieved 2019-08-04.\n\n\n\t^ G.C. Messenger, Milton Ash, Single Event Phenomena, Springer Science & Business Media, 2013, \nISBN 1461560438, pages xii-xiii \n\n\t^ Normand, Eugene; Dominik, Laura (20–23 July 2010). Cross Comparison Guide for Results of Neutron SEE Testing of Microelectronics Applicable to Avionics. 2010 IEEE Radiation Effects Data Workshop. doi:10.1109/REDW.2010.5619496.\n\n\n\t^ a b Leppälä, Kari; Verkasalo, Raimo (17–23 September 1989). Protection of Instrument Control Computers against Soft and Hard Errors and Cosmic Ray Effects. International Seminar on Space Scientific Engineering. CiteSeerX 10.1.1.48.1291.\n\n\n\t^ Platteter, Dale G. (October 1980). Protection of LSI Microprocessors using Triple Modular Redundancy. International IEEE Symposium on Fault Tolerant Computing.\n\n\n\t^ Krishnamohan, Srivathsan; Mahapatra, Nihar R. (2005). Analysis and design of soft-error hardened latches. Proceedings of the 15th ACM Great Lakes symposium on VLSI. doi:10.1145/1057661.1057740.\n\n\n\t^ Mil & Aero Staff (2016-06-03). \"FPGA development devices for radiation-hardened space applications introduced by Microsemi\". Military & Aerospace Electronics. Retrieved 2018-11-02.\n\n\n\t^ \"Single Board Computer (SBC) Family\". Cobham. Archived from the original on 2019-04-08. Retrieved 2018-11-02.\n\n\n\t^ \"VA10820 - Radiation Hardened ARM Cortex-M0 MCU\". Vorago Technologies. Archived from the original on 2019-02-14. Retrieved 2018-11-02.\n\n\n\n\n\nBooks and Reports[edit]\n\n\tCalligaro, Christiano; Gatti, Umberto (2018). Rad-hard Semiconductor Memories. River Publishers Series in Electronic Materials and Devices. River Publishers. ISBN 978-8770220200.\n\n\tHolmes-Siedle, Andrew; Adams, Len (2002). Handbook of Radiation Effects (Second ed.). Oxford University Press. ISBN 0-19-850733-X.\n\n\tLeón-Florian, E.; Schönbacher, H.; Tavlet, M. (1993). Data compilation of dosimetry methods and radiation sources for material testing (Report). CERN Technical Inspection and Safety Commission. CERN-TIS-CFM-IR-93-03.\n\n\tMa, Tso-Ping; Dressendorfer, Paul V. (1989). Ionizing Radiation Effects in MOS Devices and Circuits. New York: John Wiley & Sons. ISBN 0-471-84893-X.\n\n\tMessenger, George C.; Ash, Milton S. (1992). The Effects of Radiation on Electronic Systems (Second ed.). New York: Van Nostrand Reinhold. ISBN 0-442-23952-1.\n\n\tOldham, Timothy R. (2000). Ionizing Radiation Effects in MOS Oxides. International Series on Advances in Solid State Electronics and Technology. World Scientific. doi:10.1142/3655. ISBN 978-981-02-3326-6.\n\n\tPlatteter, Dale G. (2006). Archive of Radiation Effects Short Course Notebooks (1980–2006). IEEE. ISBN 1-4244-0304-9.\n\n\tSchrimpf, Ronald D.; Fleetwood, Daniel M. (July 2004). Radiation Effects and Soft Errors in Integrated Circuits and Electronic Devices. Selected Topics in Electronics and Systems. 34. World Scientific. doi:10.1142/5607. ISBN 978-981-238-940-4.\n\n\tSchroder, Dieter K. (1990). Semiconductor Material and Device Characterization. New York: John Wiley & Sons. ISBN 0-471-51104-8.\n\n\tSchulman, James Herbert; Compton, Walter Dale (1962). Color Centers in Solids. International Series of Monographs on Solid State Physics. 2. Pergamon Press.\n\n\tHolmes-Siedle, Andrew; van Lint, Victor A. J. (2000). \"Radiation Effects in Electronic Materials and Devices\".  In Meyers, Robert A. (ed.). Encyclopedia of Physical Science and Technology. 13 (Third ed.). New York: Academic Press. ISBN 0-12-227423-7.\n\n\tvan Lint, Victor A. J.; Flanagan, Terry M.; Leadon, Roland Eugene; Naber, James Allen; Rogers, Vern C. (1980). Mechanisms of Radiation Effects in Electronic Materials. 1. New York: John Wiley & Sons. Bibcode:1980STIA...8113073V. ISBN 0-471-04106-8.\n\n\tWatkins, George D. (1986). \"The Lattice Vacancy in Silicon\".  In Pantelides, Sokrates T. (ed.). Deep Centers in Semiconductors: A State-of-the-Art Approach (Second ed.). New York: Gordon and Breach. ISBN 2-88124-109-3.\n\n\tWatts, Stephen J. (1997). \"Overview of radiation damage in silicon detectors — Models and defect engineering\". Nuclear Instruments and Methods in Physics Research Section A. 386 (1): 149–155. doi:10.1016/S0168-9002(96)01110-2.\n\n\tZiegler, James F.; Biersack, Jochen P.; Littmark, Uffe (1985). The Stopping and Range of Ions in Solids. 1. New York: Pergamon Press. ISBN 0-08-021603-X.\n\n\n\nExternal links[edit]\n\n\tFederal Standard 1037C (link)\n\t(I)ntegrated Approach with COTS Creates Rad-Tolerant (SBC) for Space – By Chad Thibodeau, Maxwell Technologies; COTS Journal, Dec 2003\n\tSandia Labs to develop (...) radiation-hardened Pentium (...) for space and defense needs – Sandia press release, 8 Dec 1998\n(also includes a general \"backgrounder\" section on Sandia's manufacturing processes for radiation-hardening of microelectronics)\n\tRadiation effects on quartz crystals\n\tVanderbilt University Institute for Space and Defense Electronics\n\n\n\t\tv\n\tt\n\te\n\n\nRadiation (physics and health)\n\n\tMain articles\t\n\tNon-ionizing radiation\t\n\tAcoustic radiation force\n\tInfrared\n\tLight\n\tStarlight\n\tSunlight\n\tMicrowave\n\tRadio waves\n\tUltraviolet\n\n\n\n\n\tIonizing radiation\t\n\tRadioactive decay\n\tCluster decay\n\tBackground radiation\n\tAlpha particle\n\tBeta particle\n\tGamma ray\n\tCosmic ray\n\tNeutron radiation\n\tNuclear fission\n\tNuclear fusion\n\tNuclear reactors\n\tNuclear weapons\n\tParticle accelerators\n\tRadioactive materials\n\tX-ray\n\n\n\n\n\t\n\tEarth's energy budget\n\tElectromagnetic radiation\n\tSynchrotron radiation\n\tThermal radiation\n\tBlack-body radiation\n\tParticle radiation\n\tGravitational Radiation\n\tCosmic background radiation\n\tCherenkov radiation\n\tAskaryan radiation\n\tBremsstrahlung\n\tUnruh radiation\n\tDark radiation\n\n\n\n\n\n\n\n\tRadiation \nand health\t\n\tRadiation syndrome\n\tacute\n\tchronic\n\n\n\tHealth physics\n\tDosimetry\n\tElectromagnetic radiation and health\n\tLaser safety\n\tLasers and aviation safety\n\tMedical radiography\n\tMobile phone radiation and health\n\tRadiation protection\n\tRadiation therapy\n\tRadioactivity in the life sciences\n\tRadioactive contamination\n\tRadiobiology\n\tBiological dose units and quantities\n\tWireless electronic devices and health\n\tRadiation Heat-transfer\n\n\n\n\n\tRelated articles\t\n\tHalf-life\n\tNuclear physics\n\tRadioactive source\n\tRadiation hardening\n\tList of civilian radiation accidents\n\t1996 Costa Rica accident\n\t1987 Goiânia accident\n\t1984 Moroccan accident\n\t1990 Zaragoza accident\n\n\n\n\n\tSee also: the categories Radiation effects, Radioactivity, Radiobiology, and Radiation protection.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Radiation_hardening&oldid=917431031\"\n\n\t\t\n\t\tCategories: \tMilitary communications\n\tIntegrated circuits\n\tAvionics computers\n\tElectronics manufacturing\n\tSpaceflight\n\tRadiation effects\n\tSemiconductor device defects\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tEspañol\n\tFrançais\n\tNorsk\n\tРусский\n\tSimple English\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 23 September 2019, at 20:07 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "26", "dc:title": "Radiation hardening - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-radiation_hardening", "title": "Radiation hardening - Wikipedia"}}