{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRadiation pressure - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tRadiation pressure\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nForce on a reflector results from reflecting the photon flux\n\n\n\nRadiation pressure is the pressure exerted upon any surface due to the exchange of momentum between the object and the electromagnetic field. This includes the momentum of light or electromagnetic radiation of any wavelength which is absorbed, reflected, or otherwise emitted (e.g. black-body radiation) by matter on any scale (from macroscopic objects to dust particles to gas molecules).[1][2][3]\n\nThe forces generated by radiation pressure are generally too small to be noticed under everyday circumstances; however, they are important in some physical processes. This particularly includes objects in outer space where it is usually the main force acting on objects besides gravity, and where the net effect of a tiny force may have a large cumulative effect over long periods of time. For example, had the effects of the sun's radiation pressure on the spacecraft of the Viking program been ignored, the spacecraft would have missed Mars orbit by about 15,000 km (9,300 mi).[4] Radiation pressure from starlight is crucial in a number of astrophysical processes as well. The significance of radiation pressure increases rapidly at extremely high temperatures, and can sometimes dwarf the usual gas pressure, for instance in stellar interiors and thermonuclear weapons.\n\nThe radiation pressure of sunlight on earth is equivalent to that exerted by about a thousandth of a gram on an area of 1 square metre (measured in units of force: approx. 10 μN/m2).[not verified in body]\n\nRadiation pressure can equally well be accounted for by considering the momentum of a classical electromagnetic field or in terms of the momenta of photons, particles of light. The interaction of electromagnetic waves or photons with matter may involve an exchange of momentum. Due to the law of conservation of momentum, any change in the total momentum of the waves or photons must involve an equal and opposite change in the momentum of the matter it interacted with (Newton's third law of motion), as is illustrated in the accompanying figure for the case of light being perfectly reflected by a surface. This transfer of momentum is the general explanation for what we term radiation pressure.\n\n\nContents\n\n\n\t1 Discovery\n\t2 Theory\n\t2.1 Radiation pressure from momentum of an electromagnetic wave\n\t2.2 Radiation pressure from reflection\n\t2.3 Radiation pressure by emission\n\t2.4 Radiation pressure in terms of photons\n\t2.5 Compression in a uniform radiation field\n\n\n\n\t3 Solar radiation pressure\n\t3.1 Pressures of absorption and reflection\n\t3.2 Radiation pressure perturbations\n\t3.3 Solar sails\n\n\n\n\t4 Cosmic effects of radiation pressure\n\t4.1 The early universe\n\t4.2 Galaxy formation and evolution\n\t4.3 Clouds of dust and gases\n\t4.4 Clusters of stars\n\t4.5 Star formation\n\t4.6 Stellar planetary systems\n\t4.7 Stellar interiors\n\t4.8 Comets\n\n\n\n\t5 Laser applications of radiation pressure\n\t5.1 Optical tweezers\n\t5.2 Other examples\n\n\n\n\t6 See also\n\t7 References\n\t8 Further reading\n\n\n\n\n\nDiscovery[edit]\n\nJohannes Kepler put forward the concept of radiation pressure back in 1619 to explain the observation that a tail of a comet always points away from the Sun.[5]\n\nThe assertion that light, as electromagnetic radiation, has the property of momentum and thus exerts a pressure upon any surface it is exposed to was published by James Clerk Maxwell in 1862, and proven experimentally by Russian physicist Pyotr Lebedev in 1900[6] and by Ernest Fox Nichols and Gordon Ferrie Hull in 1901.[7] The pressure is very feeble, but can be detected by allowing the radiation to fall upon a delicately poised vane of reflective metal in a Nichols radiometer (this should not be confused with the Crookes radiometer, whose characteristic motion is not caused by radiation pressure but by impacting gas molecules).\n\n\nTheory[edit]\n\nSee also: Electromagnetic radiation and Speed of light\n\nRadiation pressure can be viewed as a consequence of the conservation of momentum given the momentum attributed to electromagnetic radiation. That momentum can be equally well calculated on the basis of electromagnetic theory or from the combined momenta of a stream of photons, giving identical results as is shown below.\n\n\nRadiation pressure from momentum of an electromagnetic wave[edit]\n\nMain article: Poynting vector\n\nAccording to Maxwell's theory of electromagnetism, an electromagnetic wave carries momentum, which will be transferred to an opaque surface it strikes.\n\nThe energy flux (irradiance) of a plane wave is calculated using the Poynting vector \n  \n    \n      \n        \n          S\n        \n        =\n        \n          E\n        \n        ×\n        \n          H\n        \n      \n    \n    {\\displaystyle \\mathbf {S} =\\mathbf {E} \\times \\mathbf {H} }\n  \n, whose magnitude we denote by S. S divided by the speed of light is the density of the linear momentum per unit area (pressure) of the electromagnetic field.  So, dimensionally, the Poynting vector is S=(power/area)=(rate of doing work/area)=(ΔF/Δt)Δx/area, which is the speed of light, c=Δx/Δt, times pressure, ΔF/area.  That pressure is experienced as radiation pressure on the surface:\n\n\n\t\n  \n    \n      \n        \n          P\n          \n            incident\n          \n        \n        =\n        \n          \n            \n              ⟨\n              S\n              ⟩\n            \n            c\n          \n        \n        =\n        \n          \n            \n              I\n              \n                f\n              \n            \n            c\n          \n        \n      \n    \n    {\\displaystyle P_{\\text{incident}}={\\frac {\\langle S\\rangle }{c}}={\\frac {I_{f}}{c}}}\n  \n\n\n\nwhere \n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n  \n is pressure (usually in Pascals), \n  \n    \n      \n        \n          I\n          \n            f\n          \n        \n      \n    \n    {\\displaystyle I_{f}}\n  \n is the incident irradiance (usually in W/m2) and \n  \n    \n      \n        c\n      \n    \n    {\\displaystyle c}\n  \n is the speed of light in vacuum.\n\nIf the surface is planar at an angle α to the incident wave, the intensity across the surface will be geometrically reduced by the cosine of that angle and the component of the radiation force against the surface will also be reduced by the cosine of α, resulting in a pressure:\n\n\n\t\n  \n    \n      \n        \n          P\n          \n            incident\n          \n        \n        =\n        \n          \n            \n              I\n              \n                f\n              \n            \n            c\n          \n        \n        \n          cos\n          \n            2\n          \n        \n        ⁡\n        α\n      \n    \n    {\\displaystyle P_{\\text{incident}}={\\frac {I_{f}}{c}}\\cos ^{2}\\alpha }\n  \n\n\n\nThe momentum from the incident wave is in the same direction of that wave.  But only the component of that momentum normal to the surface contributes to the pressure on the surface, as given above.  The component of that force tangent to the surface is not called pressure.[8]\n\n\nRadiation pressure from reflection[edit]\n\nThe above treatment for an incident wave accounts for the radiation pressure experienced by a black (totally absorbing) body. If the wave is specularly reflected, then the recoil due to the reflected wave will further contribute to the radiation pressure. In the case of a perfect reflector, this pressure will be identical to the pressure caused by the incident wave:\n\n\n\t\n  \n    \n      \n        \n          P\n          \n            emitted\n          \n        \n        =\n        \n          \n            \n              I\n              \n                f\n              \n            \n            c\n          \n        \n      \n    \n    {\\displaystyle P_{\\text{emitted}}={\\frac {I_{f}}{c}}}\n  \n\n\n\nthus doubling the net radiation pressure on the surface:\n\n\n\t\n  \n    \n      \n        \n          P\n          \n            net\n          \n        \n        =\n        \n          P\n          \n            incident\n          \n        \n        +\n        \n          P\n          \n            emitted\n          \n        \n        =\n        2\n        \n          \n            \n              I\n              \n                f\n              \n            \n            c\n          \n        \n      \n    \n    {\\displaystyle P_{\\text{net}}=P_{\\text{incident}}+P_{\\text{emitted}}=2{\\frac {I_{f}}{c}}}\n  \n\n\n\nFor a partially reflective surface, the second term must be multiplied by the reflectivity (also known as reflection coefficient of intensity), so that the increase is less than double. For a diffusely reflective surface, the details of the reflection and geometry must be taken into account, again resulting in an increased net radiation pressure of less than double.\n\n\nRadiation pressure by emission[edit]\n\nJust as a wave reflected from a body contributes to the net radiation pressure experienced, a body that emits radiation of its own (rather than reflected) obtains a radiation pressure again given by the irradiance of that emission in the direction normal to the surface Ie:\n\n\n\t\n  \n    \n      \n        \n          P\n          \n            emitted\n          \n        \n        =\n        \n          \n            \n              I\n              \n                e\n              \n            \n            c\n          \n        \n      \n    \n    {\\displaystyle P_{\\text{emitted}}={\\frac {I_{e}}{c}}}\n  \n\n\n\nThe emission can be from black-body radiation or any other radiative mechanism. Since all materials emit black-body radiation (unless they are totally reflective or at absolute zero), this source for radiation pressure is ubiquitous but usually very tiny. However, because black-body radiation increases rapidly with temperature (according to the fourth power of temperature as given by the Stefan–Boltzmann law), radiation pressure due to the temperature of a very hot object (or due to incoming black-body radiation from similarly hot surroundings) can become very significant. This becomes important in stellar interiors which are at millions of degrees.\n\n\nRadiation pressure in terms of photons[edit]\n\nSee also: Photons and Momentum\n\nElectromagnetic radiation can be viewed in terms of particles rather than waves; these particles are known as photons. Photons do not have a rest-mass; however, photons are never at rest (they move at the speed of light) and acquire a momentum nonetheless which is given by:\n\n\n\t\n  \n    \n      \n        p\n        =\n        \n          \n            \n              h\n              λ\n            \n          \n        \n        =\n        \n          \n            \n              E\n              \n                p\n              \n            \n            c\n          \n        \n        ,\n      \n    \n    {\\displaystyle p={\\dfrac {h}{\\lambda }}={\\frac {E_{p}}{c}},}\n  \n\n\n\nwhere p is momentum, h is Planck's constant, λ is wavelength, and c is speed of light in vacuum. And Ep is the energy of a single photon given by: \n\n\n\t\n  \n    \n      \n        \n          E\n          \n            p\n          \n        \n        =\n        h\n        ν\n        =\n        \n          \n            \n              h\n              c\n            \n            λ\n          \n        \n      \n    \n    {\\displaystyle E_{p}=h\\nu ={\\frac {hc}{\\lambda }}}\n  \n\n\n\nThe radiation pressure again can be seen as the transfer of each photon's momentum to the opaque surface, plus the momentum due to a (possible) recoil photon for a (partially) reflecting surface. Since an incident wave of irradiance If over an area A has a power of  IfA, this implies a flux of If/Ep photons per second per unit area striking the surface. Combining this with the above expression for the momentum of a single photon, results in the same relationships between irradiance and radiation pressure described above using classical electromagnetics. And again, reflected or otherwise emitted photons will contribute to the net radiation pressure identically.\n\n\nCompression in a uniform radiation field[edit]\n\nIn general, the pressure of electromagnetic waves can be obtained from the vanishing of the trace of the electromagnetic stress tensor: Since this trace equals 3P – u, we get\n\n\n\t\n  \n    \n      \n        P\n        =\n        \n          \n            u\n            3\n          \n        \n      \n    \n    {\\displaystyle P={\\frac {u}{3}}}\n  \n\n\n\nwhere u is the radiation density per unit volume.\n\nThis can also be shown in the specific case of the pressure exerted on surfaces of a body in thermal equilibrium with its surroundings, at a temperature T: The body will be surrounded by a uniform radiation field described by the Planck black-body radiation law, and will experience a compressive pressure due to that impinging radiation, its reflection, and its own black body emission. From that it can be shown that the resulting pressure is equal to one third of the total radiant energy per unit volume in the surrounding space.[9][10][11][12]\n\nBy using Stefan–Boltzmann law, this can be expressed as\n\n\n\t\n  \n    \n      \n        \n          P\n          \n            compress\n          \n        \n        =\n        \n          \n            u\n            3\n          \n        \n        =\n        \n          \n            \n              4\n              σ\n            \n            \n              3\n              c\n            \n          \n        \n        \n          T\n          \n            4\n          \n        \n      \n    \n    {\\displaystyle P_{\\text{compress}}={\\frac {u}{3}}={\\frac {4\\sigma }{3c}}T^{4}}\n  \n\n\n\nwhere \n  \n    \n      \n        σ\n      \n    \n    {\\displaystyle \\sigma }\n  \n is the Stefan–Boltzmann constant.\n\n\nSolar radiation pressure[edit]\n\nSolar radiation pressure is due to the sun's radiation at closer distances, thus especially within the Solar System.  While it acts on all objects, its net effect is generally greater on smaller bodies since they have a larger ratio of surface area to mass.  All spacecraft experience such a pressure except when they are behind the shadow of a larger orbiting body.\n\nSolar radiation pressure on objects near the earth may be calculated using the sun's irradiance at 1 AU, known as the solar constant or GSC, whose value is set at 1361 W/m2 as of 2011.[13]\n\nAll stars have a spectral energy distribution that depends on their surface temperature.  The distribution is approximately that of black-body radiation.  This distribution must be taken into account when calculating the radiation pressure or identifying reflector materials for optimizing a solar sail for instance.\n\n\nPressures of absorption and reflection[edit]\n\nSolar radiation pressure at the earth's distance from the sun, may be calculated by dividing the solar constant GSC (above) by the speed of light c.  For an absorbing sheet facing the sun, this is simply:[14]\n\n\n\t\n  \n    \n      \n        P\n        =\n        \n          \n            \n              G\n              \n                SC\n              \n            \n            c\n          \n        \n        ≈\n        4.5\n        ⋅\n        \n          10\n          \n            −\n            6\n          \n        \n        \n          \n            Pa\n          \n        \n        =\n        4.5\n        μ\n        \n          \n            Pa\n          \n        \n      \n    \n    {\\displaystyle P={\\frac {G_{\\text{SC}}}{c}}\\approx 4.5\\cdot 10^{-6}{\\textsf {Pa}}=4.5\\mu {\\textsf {Pa}}}\n  \n\n\n\nThis result is in the S.I. unit Pascals, equivalent to N/m2 (newtons per square meter). For a sheet at an angle α to the sun, the effective area A of a sheet is reduced by a geometrical factor resulting in a force in the direction of the sunlight of:\n\n\n\t\n  \n    \n      \n        F\n        =\n        \n          \n            \n              G\n              \n                SC\n              \n            \n            c\n          \n        \n        (\n        A\n        cos\n        ⁡\n        α\n        )\n      \n    \n    {\\displaystyle F={\\frac {G_{\\text{SC}}}{c}}(A\\cos \\alpha )}\n  \n\n\n\nTo find the component of this force normal to the surface, another cosine factor must be applied resulting in a pressure P on the surface of:\n\n\n\t\n  \n    \n      \n        P\n        =\n        \n          \n            F\n            A\n          \n        \n        =\n        \n          \n            \n              G\n              \n                SC\n              \n            \n            c\n          \n        \n        \n          cos\n          \n            2\n          \n        \n        ⁡\n        α\n      \n    \n    {\\displaystyle P={\\frac {F}{A}}={\\frac {G_{\\text{SC}}}{c}}\\cos ^{2}\\alpha }\n  \n\n\n\nNote, however, that in order to account for the net effect of solar radiation on a spacecraft for instance, one would need to consider the total force (in the direction away from the sun) given by the preceding equation, rather than just the component normal to the surface that we identify as \"pressure\".\n\nThe solar constant is defined for the sun's radiation at the distance to the earth, also known as one astronomical unit (AU). Consequently, at a distance of R astronomical units (R thus being dimensionless), applying the inverse-square law, we would find:\n\n\n\t\n  \n    \n      \n        P\n        =\n        \n          \n            \n              G\n              \n                SC\n              \n            \n            \n              c\n              \n                R\n                \n                  2\n                \n              \n            \n          \n        \n        \n          cos\n          \n            2\n          \n        \n        ⁡\n        α\n      \n    \n    {\\displaystyle P={\\frac {G_{\\text{SC}}}{cR^{2}}}\\cos ^{2}\\alpha }\n  \n\n\n\nFinally, considering not an absorbing but a perfectly reflecting surface, the pressure is doubled due to the reflected wave, resulting in:\n\n\n\t\n  \n    \n      \n        P\n        =\n        2\n        \n          \n            \n              G\n              \n                SC\n              \n            \n            \n              c\n              \n                R\n                \n                  2\n                \n              \n            \n          \n        \n        \n          cos\n          \n            2\n          \n        \n        ⁡\n        α\n      \n    \n    {\\displaystyle P=2{\\frac {G_{\\text{SC}}}{cR^{2}}}\\cos ^{2}\\alpha }\n  \n\n\n\nNote that unlike the case of an absorbing material, the resulting force on a reflecting body is given exactly by this pressure acting normal to the surface, with the tangential forces from the incident and reflecting waves canceling each other. In practice, materials are neither totally reflecting nor totally absorbing, so the resulting force will be a weighted average of the forces calculated using these formulae.\n\n\n\tSolar radiation pressure on perfect reflector at normal incidence (α=0)\n\tDistance from sun\tRadiation pressure in μPa (μN/m2)[citation needed]\n\n\t0.20 AU\n\t227\n\n\t0.39 AU (Mercury)\n\t60.6\n\n\t0.72 AU (Venus)\n\t17.4\n\n\t1.00 AU (Earth)\n\t9.08\n\n\t1.52 AU (Mars)\n\t3.91\n\n\t3.00 AU (Typical asteroid)\n\t1.01\n\n\t5.20 AU (Jupiter)\n\t0.34\n\n\n\n\n\nRadiation pressure perturbations[edit]\n\nSee also: Yarkovsky effect, YORP effect, and Poynting–Robertson effect\n\nSolar radiation pressure is a source of orbital perturbations.  It significantly affects the orbits and trajectories of small bodies including all spacecraft.\n\nSolar radiation pressure affects bodies throughout much of the Solar System.  Small bodies are more affected than large ones because of their lower mass relative to their surface area.  Spacecraft are affected along with natural bodies (comets, asteroids, dust grains, gas molecules).\n\nThe radiation pressure results in forces and torques on the bodies that can change their translational and rotational motions.  Translational changes affect the orbits of the bodies.  Rotational rates may increase or decrease.  Loosely aggregated bodies may break apart under high rotation rates.  Dust grains can either leave the Solar System or spiral into the Sun.[citation needed]\n\nA whole body is typically composed of numerous surfaces that have different orientations on the body.  The facets may be flat or curved.  They will have different areas.  They may have optical properties differing from other aspects.\n\nAt any particular time, some facets will be exposed to the Sun and some will be in shadow.  Each surface exposed to the Sun will be reflecting, absorbing, and emitting radiation.  Facets in shadow will be emitting radiation.  The summation of pressures across all of the facets will define the net force and torque on the body.  These can be calculated using the equations in the preceding sections.[8][14]\n\nThe Yarkovsky effect affects the translation of a small body.  It results from a face leaving solar exposure being at a higher temperature than a face approaching solar exposure.  The radiation emitted from the warmer face will be more intense than that of the opposite face, resulting in a net force on the body that will affect its motion.[citation needed]\n\nThe YORP effect is a collection of effects expanding upon the earlier concept of the Yarkovsky effect, but of a similar nature.  It affects the spin properties of bodies.[citation needed]\n\nThe Poynting–Robertson effect applies to grain-size particles.  From the perspective of a grain of dust circling the Sun, the Sun's radiation appears to be coming from a slightly forward direction (aberration of light). Therefore, the absorption of this radiation leads to a force with a component against the direction of movement. (The angle of aberration is tiny since the radiation is moving at the speed of light while the dust grain is moving many orders of magnitude slower than that.)  The result is a gradual spiral of dust grains into the Sun.  Over long periods of time, this effect cleans out much of the dust in the Solar System.\n\nWhile rather small in comparison to other forces, the radiation pressure force is inexorable.  Over long periods of time, the net effect of the force is substantial.  Such feeble pressures can produce marked effects upon minute particles like gas ions and electrons, and are essential in the theory of electron emission from the Sun, of cometary material, and so on.\n\nBecause the ratio of surface area to volume (and thus mass) increases with decreasing particle size, dusty (micrometre-size) particles are susceptible to radiation pressure even in the outer solar system.  For example, the evolution of the outer rings of Saturn is significantly influenced by radiation pressure.\n\nAs a consequence of light pressure, Einstein[15] in 1909 predicted the existence of \"radiation friction\" which would oppose the movement of matter. He wrote, \"radiation will exert pressure on both sides of the plate. The forces of pressure exerted on the two sides are equal if the plate is at rest. However, if it is in motion, more radiation will be reflected on the surface that is ahead during the motion (front surface) than on the back surface. The backward acting force of pressure exerted on the front surface is thus larger than the force of pressure acting on the back. Hence, as the resultant of the two forces, there remains a force that counteracts the motion of the plate and that increases with the velocity of the plate. We will call this resultant 'radiation friction' in brief.\"\n\n\nSolar sails[edit]\n\nMain article: Solar sail\n\nSolar sailing, an experimental method of spacecraft propulsion, uses radiation pressure from the Sun as a motive force. The idea of interplanetary travel by light was mentioned by Jules Verne in From the Earth to the Moon.\n\nA sail reflects about 90% of the incident radiation.  The 10% that is absorbed is radiated away from both surfaces, with the proportion emitted from the unlit surface depending on the thermal conductivity of the sail.  A sail has curvature, surface irregularities, and other minor factors that affect its performance.\n\nThe Japan Aerospace Exploration Agency (JAXA) has successfully unfurled a solar sail in space which has already succeeded in propelling its payload with the IKAROS project.\n\n\nCosmic effects of radiation pressure[edit]\n\nRadiation pressure has had a major effect on the development of the cosmos, from the birth of the universe to ongoing formation of stars and shaping of clouds of dust and gasses on a wide range of scales.[16]\n\n\nThe early universe[edit]\n\nThe photon epoch is a phase when the energy of the universe was dominated by photons, between 10 seconds and 380,000 years after the Big Bang.[17]\n\n\nGalaxy formation and evolution[edit]\n\nThe process of galaxy formation and evolution began early in the history of the cosmos. Observations of the early universe strongly suggest that objects grew from bottom-up (i.e., smaller objects merging to form larger ones). As stars are thereby formed and become sources of electromagnetic radiation, radiation pressure from the stars becomes a factor in the dynamics of remaining circumstellar material.[18]\n\n\nClouds of dust and gases[edit]\n\n  \nThe Pillars of Creation clouds within the Eagle Nebula shaped by radiation pressure and stellar winds.\n\n\n\nThe gravitational compression of clouds of dust and gases is strongly influenced by radiation pressure, especially when the condensations lead to star births.  The larger young stars forming within the compressed clouds emit intense levels of radiation that shift the clouds, causing either dispersion or condensations in nearby regions, which influences birth rates in those nearby regions.\n\n\nClusters of stars[edit]\n\nStars predominantly form in regions of large clouds of dust and gases, giving rise to star clusters.  Radiation pressure from the member stars eventually disperses the clouds, which can have a profound effect on the evolution of the cluster.\n\nMany open clusters are inherently unstable, with a small enough mass that the escape velocity of the system is lower than the average velocity of the constituent stars. These clusters will rapidly disperse within a few million years. In many cases, the stripping away of the gas from which the cluster formed by the radiation pressure of the hot young stars reduces the cluster mass enough to allow rapid dispersal.\n\n\nStar formation[edit]\n\nStar formation is the process by which dense regions within molecular clouds in interstellar space collapse to form stars. As a branch of astronomy, star formation includes the study of the interstellar medium and giant molecular clouds (GMC) as precursors to the star formation process, and the study of protostars and young stellar objects as its immediate products.  Star formation theory, as well as accounting for the formation of a single star, must also account for the statistics of binary stars and the initial mass function.\n\n\nStellar planetary systems[edit]\n\n  \nA protoplanetary disk with a cleared central region (artist's conception).\n\n\n\nPlanetary systems are generally believed to form as part of the same process that results in star formation. A protoplanetary disk forms by gravitational collapse of a molecular cloud, called a solar nebula,  and then evolves into a planetary system by collisions and gravitational capture. Radiation pressure can clear a region in the immediate vicinity of the star. As the formation process continues, radiation pressure continues to play a role in affecting the distribution of matter.  In particular, dust and grains can spiral into the star or escape the stellar system under the action of radiation pressure.\n\n\nStellar interiors[edit]\n\nIn stellar interiors the temperatures are very high. Stellar models predict a temperature of 15 MK in the center of the Sun, and at the cores of supergiant stars the temperature may exceed 1 GK. As the radiation pressure scales as the fourth power of the temperature, it becomes important at these high temperatures. In the Sun, radiation pressure is still quite small when compared to the gas pressure. In the heaviest non-degenerate stars, radiation pressure is the dominant pressure component.[19]\n\n\nComets[edit]\n\n  \nComet Hale–Bopp (C/1995 O1). Radiation pressure and solar wind effects on the dust and gas tails are clearly seen.\n\n\n\nSolar radiation pressure strongly affects comet tails.  Solar heating causes gases to be released from the comet nucleus, which also carry away dust grains.  Radiation pressure and solar wind then drive the dust and gases away from the Sun's direction.  The gases form a generally straight tail, while slower moving dust particles create a broader, curving tail.\n\n\nLaser applications of radiation pressure[edit]\n\nOptical tweezers[edit]\n\nLasers can be used as a source of monochromatic light with wavelength \n  \n    \n      \n        λ\n      \n    \n    {\\displaystyle \\lambda }\n  \n. With a set of lenses, one can focus the laser beam to a point that is \n  \n    \n      \n        λ\n      \n    \n    {\\displaystyle \\lambda }\n  \n in diameter (or \n  \n    \n      \n        r\n        =\n        \n          \n            λ\n            2\n          \n        \n      \n    \n    {\\displaystyle r={\\frac {\\lambda }{2}}}\n  \n).\n\nThe radiation pressure of a 30 mW laser of 1064 nm can therefore be computed as follows:\n\n\n  \n    \n      \n        \n          A\n          \n            r\n            e\n            a\n          \n        \n        =\n        π\n        \n          \n            (\n            \n              \n                λ\n                2\n              \n            \n            )\n          \n          \n            2\n          \n        \n        ≈\n        \n          10\n          \n            −\n            12\n          \n        \n        \n          \n             m\n          \n          \n            2\n          \n        \n      \n    \n    {\\displaystyle A_{rea}=\\pi \\left({\\frac {\\lambda }{2}}\\right)^{2}\\approx 10^{-12}{\\text{ m}}^{2}}\n  \n\n\n\n  \n    \n      \n        \n          F\n          \n            o\n            r\n            c\n            e\n          \n        \n        =\n        \n          \n            \n              P\n              \n                o\n                w\n                e\n                r\n              \n            \n            c\n          \n        \n        =\n        \n          \n            \n              30\n              \n                 mW\n              \n            \n            \n              299792458\n              \n                 m/s\n              \n            \n          \n        \n        ≈\n        \n          10\n          \n            −\n            10\n          \n        \n        \n           N\n        \n      \n    \n    {\\displaystyle F_{orce}={\\frac {P_{ower}}{c}}={\\frac {30{\\text{ mW}}}{299792458{\\text{ m/s}}}}\\approx 10^{-10}{\\text{ N}}}\n  \n\n\n\n  \n    \n      \n        \n          P\n          \n            r\n            e\n            s\n            s\n            u\n            r\n            e\n          \n        \n        =\n        \n          \n            \n              F\n              \n                o\n                r\n                c\n                e\n              \n            \n            \n              A\n              \n                r\n                e\n                a\n              \n            \n          \n        \n        ≈\n        \n          \n            \n              \n                10\n                \n                  −\n                  10\n                \n              \n              \n                 N\n              \n            \n            \n              \n                10\n                \n                  −\n                  12\n                \n              \n              \n                \n                   m\n                \n                \n                  2\n                \n              \n            \n          \n        \n        =\n        100\n        \n           Pascal\n        \n      \n    \n    {\\displaystyle P_{ressure}={\\frac {F_{orce}}{A_{rea}}}\\approx {\\frac {10^{-10}{\\text{ N}}}{10^{-12}{\\text{ m}}^{2}}}=100{\\text{ Pascal}}}\n  \n\n\nThis is used in optical tweezers.\n\n\nOther examples[edit]\n\nLaser cooling is applied to cooling materials very close to absolute zero.  Atoms traveling towards a laser light source perceive a doppler effect tuned to the absorption frequency of the target element. The radiation pressure on the atom slows movement in a particular direction until the Doppler effect moves out of the frequency range of the element, causing an overall cooling effect.\n\nLarge lasers operating in space have been suggested as a means of propelling sail craft in beam-powered propulsion.\n\nThe reflection of a laser pulse from the surface of an elastic solid gives rise to various types of elastic waves that propagate inside the solid. The weakest waves are generally those that are generated by the radiation pressure acting during the reflection of the light. Recently, such light-pressure-induced elastic waves were observed inside an ultrahigh-reflectivity dielectric mirror.[20] These waves are the most basic fingerprint of a light-solid matter interaction on the macroscopic scale.[21]\n\n\nSee also[edit]\n\n\n\tPhysics portal\n\tAstronomy portal\n\tSpace portal\n\tStar portal\n\n\n\n\n\tAbsorption (electromagnetic radiation)\n\tPhoton\n\tPoynting vector\n\tPoynting–Robertson effect\n\tSolar constant\n\tSolar sail\n\tSunlight\n\tWave–particle duality\n\tYarkovsky effect\n\tYarkovsky–O'Keefe–Radzievskii–Paddack effect\n\n\n\n\nReferences[edit]\n\n\n\t^ Stellar Atmospheres, D. Mihalas (1978), Second edition, W H Freeman & Co\n\n\t^ Eddington, A. S., & Eddington, A. S. (1988). The internal constitution of the stars. Cambridge University Press.\n\n\t^ Chandrasekhar, S. (2013). Radiative transfer. Courier Corporation.\n\n\t^ Eugene Hecht, \"Optics\", 4th edition (p. 57)\n\n\t^ Johannes Kepler (1619). De Cometis Libelli Tres.\n\n\t^ P. Lebedev, 1901, \"Untersuchungen über die Druckkräfte des Lichtes\", Annalen der Physik, 1901\n\n\t^ Nichols, E. F & Hull, G. F. (1903) The Pressure due to Radiation, The Astrophysical Journal,Vol.17 No.5, p.315-351\n\n\t^ a b \nWright, Jerome L. (1992), Space Sailing, Gordon and Breach Science Publishers\n\n\n\t^ Shankar R., Principles of Quantum Mechanics, 2nd edition.\n\n\t^ Carroll, Bradley W.  & Dale A. Ostlie, An Introduction to Modern Astrophysics, 2nd edition.\n\n\t^ Jackson, John David, (1999) Classical Electrodynamics.\n\n\t^ Kardar, Mehran. \"Statistical Physics of Particles\".\n\n\t^ Kopp, G.; Lean, J. L. (2011). \"A new, lower value of total solar irradiance: Evidence and climate significance\". Geophysical Research Letters. 38: n/a. doi:10.1029/2010GL045777.\n\n\n\t^ a b Georgevic, R. M. (1973) \"The Solar Radiation Pressure Forces and Torques Model\", The Journal of the Astronautical Sciences, Vol. 27, No. 1, Jan–Feb. First known publication describing how solar radiation pressure creates forces and torques that affect spacecraft.\n\n\t^ Einstein, A. (1909). On the development of our views concerning the nature and constitution of radiation. Translated in: The Collected Papers of Albert Einstein, vol. 2 (Princeton University Press, Princeton, 1989). Princeton, New Jersey: Princeton University Press. p. 391.\n\n\n\t^ Karel Velan, A. (1992), \"The Birth of the First Generation of Stars\", The Multi-Universe Cosmos, Springer US, pp. 267–278, doi:10.1007/978-1-4684-6030-8_22, ISBN 9781468460322\n\n\n\t^ The early universe. Unruh, W. G., Semenoff, G. W., North Atlantic Treaty Organization. Scientific Affairs Division. Dordrecht: D. Reidel. 1988. ISBN 9027726191. OCLC 16684785.CS1 maint: others (link)\n\n\n\t^ Longair, Malcolm S., 1941- (2008). Galaxy formation. Springer. ISBN 9783540734772. OCLC 212409895.CS1 maint: multiple names: authors list (link)\n\n\n\t^ Dale A. Ostlie and Bradley W. Carroll, An Introduction to Modern Astrophysics (2nd edition), page 341, Pearson, San Francisco, 2007\n\n\t^ Požar, T.; Možina, J. (2013). \"Measurement of Elastic Waves Induced by the Reflection of Light\". Physical Review Letters. 111 (18): 185501. doi:10.1103/Physrevlett.111.185501. PMID 24237537.\n\n\n\t^ Požar, T.; Laloš, J.; Babnik, A.; Petkovšek, R.; Bethune-Waddell, M.; Chau, K. J.; Lukasievicz, G. V. B.; Astrath, N. G. C. (2018). \"Isolated detection of elastic waves driven by the momentum of light\". Nature Communications. 9 (1): 3340. doi:10.1038/s41467-018-05706-3. PMC 6105914. PMID 30131489.\n\n\n\n\n\n\nFurther reading[edit]\n\n\tDemir, Dilek,\"A table-top demonstration of radiation pressure\",2011, Diplomathesis, E-Theses univie (http://othes.univie.ac.at/16381/)\n\tR. Shankar, \"Principles of Quantum Mechanics\", 2nd edition. [1]\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Radiation_pressure&oldid=915955926\"\n\n\t\t\n\t\tCategories: \tCelestial mechanics\n\tRadiation effects\n\tRadiation\n\n\nHidden categories: \tCS1 maint: others\n\tCS1 maint: multiple names: authors list\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from September 2019\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tБеларуская\n\tCatalà\n\tDeutsch\n\tEspañol\n\tEsperanto\n\tفارسی\n\tFrançais\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tItaliano\n\tעברית\n\tMagyar\n\tМакедонски\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tPolski\n\tPortuguês\n\tРусский\n\tSimple English\n\tSlovenščina\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 16 September 2019, at 05:42 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Radiation pressure - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Sail-Force1.gif", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-radiation_pressure", "title": "Radiation pressure - Wikipedia"}}