{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRadiation protection - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tRadiation protection\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Radiation shield)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tProtection of man and environment against the harmful effects of ionizing and non-ionizing radiation\n\nRadiation protection, also known as radiological protection, is defined by the International Atomic Energy Agency (IAEA) as \"The protection of people from harmful effects of exposure to ionizing radiation, and the means for achieving this\".[1] Exposure can be from a source of radiation external to the human body or due to internal irradiation caused by the ingestion of radioactive contamination.\n\nIonizing radiation is widely used in industry and medicine, and can present a significant health hazard by causing microscopic damage to living tissue. There are two main categories of ionizing radiation health effects. At high exposures, it can cause \"tissue\" effects, also called \"deterministic\" effects due the certainty of them happening, conventionally indicated by the unit gray and  resulting in acute radiation syndrome. For low level exposures there can be statistically elevated risks of radiation-induced cancer, called \"stochastic effects\" due to the uncertainty of them happening, conventionally indicated by the unit sievert.\n\nFundamental to radiation protection is the avoidance or reduction of dose using the simple protective measures of time, distance and shielding. The duration of exposure should be limited to that necessary, the distance from the source of radiation should be maximised, and the source shielded wherever possible. To measure personal dose uptake in occupational or emergency exposure, for external radiation personal dosimeters are used, and for internal dose to due to ingestion of radioactive contamination, bioassay techniques are applied. \n\nFor radiation protection and dosimetry assessment the International Commission on Radiation Protection (ICRP) and International Commission on Radiation Units and Measurements (ICRU) publish recommendations and data which is used to calculate the biological effects on the human body of certain levels of radiation, and thereby advise acceptable dose uptake limits.\n\n\nContents\n\n\n\t1 Principles\n\t1.1 Exposure situations\n\t1.2 Regulation of dose uptake\n\t1.3 Factors in external dose uptake\n\t1.4 Internal dose uptake\n\t1.5 Recommended limits on dose uptake\n\t1.6 ALARP & ALARA\n\n\n\n\t2 Personal radiation dosimeters\n\t3 Radiation shielding\n\t3.1 Particle radiation\n\t3.2 Electromagnetic radiation\n\n\n\n\t4 Personal Protective Equipment (PPE) - Radiation\n\t4.1 Internal Contamination Protective Equipment\n\t4.2 External Contamination Protective Equipment\n\t4.3 External penetrating radiation\n\n\n\n\t5 Radiation protection instruments\n\t5.1 Installed instruments\n\t5.2 Portable instruments\n\t5.3 Instrument types\n\n\n\n\t6 Radiation related quantities\n\t7 Spacecraft radiation challenges\n\t8 Early radiation dangers\n\t9 See also\n\t10 Notes\n\t11 References\n\t12 External links\n\n\n\n\n\nPrinciples[edit]\n\n  \nInternational policy relationships in radiological protection\n\n\n\n  \nExternal dose quantities used in radiation protection and dosimetry - based on ICRU report 57\n\n\n\n  \nGraphic showing relationships between radioactivity and detected ionizing radiation\n\n\n\nThe ICRP recommends, develops and maintains the International System of Radiological Protection, based on evaluation of the large body of scientific studies available to equate risk to received dose levels. The system's health objectives are \"to manage and control exposures to ionising radiation so that deterministic effects are prevented, and the risks of stochastic effects are reduced to the extent reasonably achievable\".[2]\n\nThe ICRP's recommendations flow down to national and regional regulators, which have the opportunity to incorporate them into their own law; this process is shown in the accompanying block diagram. In most countries a national regulatory authority works towards ensuring a secure radiation environment in society by setting dose limitation requirements that are generally based on the recommendations of the ICRP.\n\n\nExposure situations[edit]\n\nThe ICRP recognises planned, emergency, and existing exposure situations, as described below;[3]\n\n\n\tPlanned exposure – defined as \"...where radiological protection can be planned in advance, before exposures occur, and where the magnitude and extent of the exposures can be reasonably predicted.\"[4] These are such as in occupational exposure situations, where it is necessary for personnel to work in a known radiation environment.\n\tEmergency exposure – defined as \"...unexpected situations that may require urgent protective actions\".[5] This would be such as an emergency nuclear event.\n\tExisting exposure – defined as \"...being those that already exist when a decision on control has to be taken\".[6] These can be such as from naturally occurring radioactive materials which exist in the environment.\n\n\nRegulation of dose uptake[edit]\n\nThe ICRP uses the following overall principles for all controllable exposure situations.[7] \n\n\n\tJustification: No unnecessary use of radiation is permitted, which means that the advantages must outweigh the disadvantages.\n\tLimitation: Each individual must be protected against risks that are too great, through the application of individual radiation dose limits.\n\tOptimization: This process is intended for application to those situations that have been deemed to be justified. It means \"the likelihood of incurring exposures, the number of people exposed, and the magnitude of their individual doses\" should all be kept as Low As Reasonably Achievable (known as ALARA or ALARP).  It takes into account economic and societal factors.\n\n\nFactors in external dose uptake[edit]\n\nMain article: sievert\n\nThere are three factors that control the amount, or dose, of radiation received from a source.  Radiation exposure can be managed by a combination of these factors:\n\n\n\tTime: Reducing the time of an exposure reduces the effective dose proportionally.  An example of reducing radiation doses by reducing the time of exposures might be improving operator training to reduce the time they take to handle a radioactive source.\n\tDistance: Increasing distance reduces dose due to the inverse square law.  Distance can be as simple as handling a source with forceps rather than fingers.\n\tShielding: Sources of radiation can be shielded with solid or liquid material, which absorbs the energy of the radiation.  The term 'biological shield' is used for absorbing material placed around a nuclear reactor, or other source of radiation, to reduce the radiation to a level safe for humans.[8]\n\n\nInternal dose uptake[edit]\n\nMain article: committed dose\n\n  \nLarge scale glovebox in the nuclear industry used to contain airborne radioactive particles.\n\n\n\nInternal dose, due to the inhalation or ingestion of radioactive substances, can result in stochastic or deterministic effects, depending on the amount of radioactive material ingested and other biokinetic factors.\n\nThe risk from a low level internal source is represented by the dose quantity committed dose, which has the same risk as the same amount of external effective dose.\n\nThe intake of radioactive material can occur through four pathways:\n\n\n\tinhalation of airborne contaminants such as radon gas and radioactive particles\n\tingestion of radioactive contamination in food or liquids\n\tabsorption of vapours such as tritium oxide through the skin\n\tinjection of medical radioisotopes such as technetium-99m\n\n\nThe occupational hazards from airborne radioactive particles in nuclear and radio-chemical applications are greatly reduced by the extensive use of gloveboxes to contain such material. To protect against breathing in radioactive particles in ambient air, respirators with particulate filters are worn.\n\nTo monitor the concentration of radioactive particles in ambient air, radioactive particulate monitoring instruments measure the concentration or presence of airborne materials.\n\nFor ingested radioactive materials in food and drink, specialist laboratory radiometric assay methods are used to measure the concentration of such materials.\n\n\nRecommended limits on dose uptake[edit]\n\n  \nUSA Dept of Energy 2010 dose chart in sieverts for a variety of situations and applications.\n\n\n  \nVarious doses of radiation in sieverts, ranging from trivial to lethal.\n\n\n\nThe ICRP recommends a number of limits for dose uptake in table 8 of ICRP report 103. These limits are \"situational\", for planned, emergency and existing situations. Within these situations, limits are given for certain exposed groups;[9]\n\n\n\tPlanned exposure – limits given for occupational, medical and public exposure. The occupational exposure limit of effective dose is 20 mSv per year, averaged over defined periods of 5 years, with no single year exceeding 50 mSv. The public exposure limit is 1 mSv in a year.[10]\n\tEmergency exposure – limits given for occupational and public exposure\n\tExisting exposure – reference levels for all persons exposed\n\n\nFurther detail of some of the limits can be found on the ICRPedia page.[11]\n\nThe public information dose chart of the USA Department of Energy, shown here on the right, applies to USA regulation, which is based on ICRP recommendations. Note that examples in lines 1 to 4 have a scale of dose rate (radiation per unit time), whilst 5 and 6 have a scale of total accumulated dose.\n\n\nALARP & ALARA[edit]\n\nMain article: ALARA\n\nALARP is an acronym for an important principle in exposure to radiation and other occupational health risks and in the UK stands for \"As Low As Reasonably Practicable\".[12] The aim is to minimize the risk of radioactive exposure or other hazard while keeping in mind that some exposure may be acceptable in order to further the task at hand. The equivalent term ALARA, \"As Low As Reasonably Achievable\", is more commonly used outside the UK.\n\nThis compromise is well illustrated in radiology. The application of radiation can aid the patient by providing doctors and other health care professionals with a medical diagnosis, but the exposure of the patient should be reasonably low enough to keep the statistical probability of cancers or sarcomas (stochastic effects) below an acceptable level, and to eliminate deterministic effects (e.g. skin reddening or cataracts). An acceptable level of incidence of stochastic effects is considered to be equal for a worker to the risk in other radiation work generally considered to be safe.\n\nThis policy is based on the principle that any amount of radiation exposure, no matter how small, can increase the chance of negative biological effects such as cancer.  It is also based on the principle that the probability of the occurrence of negative effects of radiation exposure increases with cumulative lifetime dose. These ideas are combined to form the linear no-threshold model which says that there is not a threshold at which there is an increase in the rate of occurrence of stochastic effects with increasing dose. At the same time, radiology and other practices that involve use of ionizing radiation bring benefits, so reducing radiation exposure can reduce the efficacy of a medical practice. The economic cost, for example of adding a barrier against radiation, must also be considered when applying the ALARP principle. Computed Tomography, better known as C.T. Scans or CAT Scans have made an enormous contribution to medicine, however not without some risk. They use ionizing radiation which can cause cancer, especially in children.[13] When caregivers follow proper indications for their use and child safe techniques rather than adult techniques, downstream cancer can be prevented.[13][14]\n\n\nPersonal radiation dosimeters[edit]\n\nMain article: Dosimeter\n\nThe radiation dosimeter is an important personal dose measuring instrument. It is worn by the person being monitored and is used to estimate the external radiation dose deposited in the individual wearing the device.  They are used for Gamma, X-ray, beta and other strongly penetrating radiation, but not for weakly penetrating radiation such as alpha particles. Traditionally film badges were used for long term monitoring, and quartz fibre dosimeters for short term monitoring. However, these are mostly superseded by such as thermoluminescent dosimetry (TLD) badges and electronic dosimeters. Electronic dosimeters can give an alarm warning if a preset dose threshold has been reached, enabling safer working in potentially higher radiation levels, where the received dose must be continually monitored.\n\nWorkers exposed to radiation, such as radiographers, nuclear power plant workers, doctors using radiotherapy, those in laboratories using radionuclides, and HAZMAT teams are required to wear dosimeters so a record of occupational exposure can be made. Such devices are generally termed \"legal dosimeters\" if they have been approved for use in recording personnel dose for regulatory purposes.\n\nDosimeters can be worn to obtain a whole body dose and there are also specialist types that can be worn on the fingers or clipped to headgear, to measure the localised body irradiation for specific activities.\n\nCommon types of wearable dosimeters for ionizing radiation include:[15][16]\n\n\n\tFilm badge dosimeter\n\tQuartz fiber dosimeter\n\tElectronic personal dosimeter\n\tThermoluminescent dosimeter\n\n\nRadiation shielding[edit]\n\n  \nDiagram showing various forms of ionizing radiation, and the sort of material that is used to stop or reduce that type.\n\n\n\n  \nThe total absorption coefficient of lead (atomic number 82) for gamma rays, plotted versus gamma energy, and the contributions by the three effects. Here, the photoelectric effect dominates at low energy. Above 5 MeV, pair production starts to dominate.\n\n\n\n  \nA lead castle built to shield a radioactive sample in a lab, being a form of lead shielding.\n\n\n\nAlmost any material can act as a shield from gamma or x-rays if used in sufficient amounts. Different types of ionizing radiation interact in different ways with shielding material. The effectiveness of shielding is dependent on the Stopping power of radiation particles, which varies with the type and energy of radiation and the shielding material used. Different shielding techniques are therefore used dependent on the application and the type and energy of the radiation.\n\nShielding reduces the intensity of radiation depending on the thickness. This is an exponential relationship with gradually diminishing effect as equal slices of shielding material are added. A quantity known as the halving-thicknesses is used to calculate this. For example, a practical shield in a fallout shelter with ten halving-thicknesses of packed dirt, which is roughly 115 cm (3 ft 9 in) reduces gamma rays to 1/1024 of their original intensity (i.e. 1/210).\n\nThe effectiveness of a shielding material in general increases with its atomic number, called Z, except for neutron shielding which is more readily shielded by the likes of neutron absorbers and moderators such as compounds of boron e.g. boric acid, cadmium, carbon and hydrogen respectively.\n\n\nGraded-Z shielding is a laminate of several materials with different Z values (atomic numbers) designed to protect against ionizing radiation. Compared to single-material shielding, the same mass of graded-Z shielding has been shown to reduce electron penetration over 60%.[17] It is commonly used in satellite-based particle detectors, offering several benefits:\n\n\n\tprotection from radiation damage\n\treduction of background noise for detectors\n\tlower mass compared to single-material shielding\n\n\nDesigns vary, but typically involve a gradient from high-Z (usually tantalum) through successively lower-Z elements such as tin, steel, and copper, usually ending with aluminium. Sometimes even lighter materials such as polypropylene or boron carbide are used.\n[18][19]\n\nIn a typical graded-Z shield, the high-Z layer effectively scatters protons and electrons. It also absorbs gamma rays, which produces X-ray fluorescence. Each subsequent layer absorbs the X-ray fluorescence of the previous material, eventually reducing the energy to a suitable level. Each decrease in energy produces bremsstrahlung and Auger electrons, which are below the detector's energy threshold. Some designs also include an outer layer of aluminium, which may simply be the skin of the satellite.\nThe effectiveness of a material as a biological shield is related to its cross-section for scattering and absorption, and to a first approximation is proportional to the total mass of material per unit area interposed along the line of sight between the radiation source and the region to be protected. Hence, shielding strength or \"thickness\" is conventionally measured in units of g/cm2. The radiation that manages to get through falls exponentially with the thickness of the shield. In x-ray facilities, walls surrounding the room with the x-ray generator may contain lead shielding such as lead sheets, or the plaster may contain barium sulfate. Operators view the target through a leaded glass screen, or if they must remain in the same room as the target, wear lead aprons.\n\n\nParticle radiation[edit]\n\nParticle radiation consists of a stream of charged or neutral particles, both charged ions and subatomic elementary particles. This includes solar wind, cosmic radiation, and neutron flux in nuclear reactors.\n\n\n\tAlpha particles (helium nuclei) are the least penetrating.  Even very energetic alpha particles can be stopped by a single sheet of paper.\n\tBeta particles (electrons) are more penetrating, but still can be absorbed by a few millimeters of aluminum. However, in cases where high energy beta particles are emitted shielding must be accomplished with low atomic weight materials, e.g. plastic, wood, water, or acrylic glass (Plexiglas, Lucite).[20]  This is to reduce generation of Bremsstrahlung X-rays.  In the case of beta+ radiation (positrons), the gamma radiation from the electron-positron annihilation reaction poses additional concern.\n\tNeutron radiation is not as readily absorbed as charged particle radiation, which makes this type highly penetrating. Neutrons are absorbed by nuclei of atoms in a nuclear reaction. This most often creates a secondary radiation hazard, as the absorbing nuclei transmute to the next-heavier isotope, many of which are unstable.\n\tCosmic radiation is not a common concern on Earth, as the Earth's atmosphere absorbs it and the magnetosphere acts as a shield, but it poses a significant problem for satellites and astronauts, especially while passing through the Van Allen Belt or while completely outside the protective regions of the Earth's magnetosphere.  Frequent fliers may be at a slightly higher risk because of the decreased absorption from thinner atmosphere. Cosmic radiation is extremely high energy, and is very penetrating.\n\n\nElectromagnetic radiation[edit]\n\nElectromagnetic radiation consists of emissions of electromagnetic waves, the properties of which depend on the wavelength.\n\n\n\tX-ray and gamma radiation are best absorbed by atoms with heavy nuclei; the heavier the nucleus, the better the absorption. In some special applications, depleted uranium or thorium[21] are used, but lead is much more common; several centimeters are often required. Barium sulfate is used in some applications too. However, when cost is important, almost any material can be used, but it must be far thicker. Most nuclear reactors use thick concrete shields to create a bioshield with a thin water cooled layer of lead on the inside to protect the porous concrete from the coolant inside.  The concrete is also made with heavy aggregates, such as Baryte or MagnaDense (Magnetite), to aid in the shielding properties of the concrete. Gamma rays are better absorbed by materials with high atomic numbers and high density, although neither effect is important compared to the total mass per area in the path of the gamma ray.\n\tUltraviolet (UV) radiation is ionizing in its shortest wavelengths but it is not penetrating, so it can be shielded by thin opaque layers such as sunscreen, clothing, and protective eyewear.  Protection from UV is simpler than for the other forms of radiation above, so it is often considered separately.\n\n\nIn some cases, improper shielding can actually make the situation worse, when the radiation interacts with the shielding material and creates secondary radiation that absorbs in the organisms more readily. For example, although high atomic number materials are very effective in shielding photons, using them to shield beta particles may cause higher radiation exposure due to the production of bremsstrahlung x-rays, and hence low atomic number materials are recommended. Also, using material with a high neutron activation cross section to shield neutrons will result in the shielding material itself becoming radioactive and hence more dangerous than if it were not present.\n\n\nPersonal Protective Equipment (PPE) - Radiation[edit]\n\nPersonal Protection Equipment (PPE) includes all clothing and accessories which can be worn to prevent severe illness and injury as a result of exposure to radioactive material. Because radiation can affect humans through internal and external contamination, various protection strategies have been developed to protect humans from the harmful effects of radiation exposure from a spectrum of sources.[22] A few of these strategies developed to shield from internal, external, and high energy radiation are outlined below.\n\n\nInternal Contamination Protective Equipment[edit]\n\nInternal contamination protection equipment protects against the inhalation and ingestion of radioactive material. Internal deposition of radioactive material result in direct exposure of radiation to organs and tissues inside the body. The respiratory protective equipment described below are designed to minimize the possibility of such material being inhaled or ingested as emergency workers are exposed to potentially radioactive environments.\n\nReusable Air Purifying Respirators (APR)\n\n\n\tElastic face piece worn over the mouth and nose\n\tContains filters, cartridges, and canisters to provide increased protection and better filtration\n\n\nPowered Air-Purifying Respirator (PAPR)\n\n\n\tBattery powered blower forces contamination through air purifying filters\n\tPurified air delivered under positive pressure to face piece\n\n\nSupplied-Air Respirator (SAR)\n\n\n\tCompressed air delivered from a stationary source to the face piece\n\n\nAuxiliary Escape Respirator\n\n\n\tProtects wearer from breathing harmful gases, vapors, fumes, and dust\n\tCan be designed as an air-purifying escape respirator (APER) or a self-contained breathing apparatus (SCBA) type respirator\n\tSCBA type escape respirators have an attached source of breathing air and a hood that provides a barrier against contaminated outside air\n\n\nSelf Contained Breathing Apparatus (SCBA)\n\n\n\tProvides very pure, dry compressed air to full facepiece mask via a hose\n\tAir is exhaled to environment\n\tWorn when entering environments immediately dangerous to life and health (IDLH) or when information is inadequate to rule out IDLH atmosphere\n\n\nExternal Contamination Protective Equipment[edit]\n\nExternal contamination protection equipment provides a barrier to shield radioactive material from being deposited externally on the body or clothes. The dermal protective equipment described below acts as a barrier to block radioactive material from physically touching the skin, but does not protect against externally penetrating high energy radiation.\n\nChemical- Resistant Inner Suit\n\n\n\tPorous overall suit - Dermal protection from aerosols, dry particles, and non hazardous liquids.\n\tNon-porous overall suit to provide dermal protection from:\n\tDry powders and solids\n\tBlood-borne pathogens and bio-hazards\n\tChemical splashes and inorganic acid/base aerosols\n\tMild liquid chemical splashes from toxics and corrosives\n\tToxic industrial chemicals and materials\n\n\n\n\nLevel C Equivalent: Bunker Gear\n\n\n\tFire fighter protective clothing\n\tFlame/water resistant\n\tHelmet, gloves, foot gear, and hood\n\n\nLevel B Equivalent - Non-gas-tight Encapsulating Suit\n\n\n\tDesigned for environments which are immediately health risks but contain no substances which can be absorbed by skin\n\n\nLevel A Equivalent - Totally Encapsulating Chemical - and Vapor Protective Suit\n\n\n\tDesigned for environments which are immediate health risks and contain substances which can be absorbed by skin\n\n\nExternal penetrating radiation[edit]\n\nThere are many solutions to shielding against low energy radiation exposure like low energy X-rays. Lead shielding wear such as lead aprons can protect patients and clinicians from the potentially harmful radiation effects of day to day medical examinations. It is quite feasible to protect large surface areas of the body from radiation in the lower energy spectrum because very little shielding material is required to provide the necessary protection.\n\nPersonal shielding against more energetic radiation such as gamma radiation is very difficult to achieve as the large mass of shielding material required to properly protect the entire body would make functional movement nearly impossible. For this, partial body shielding of radio-sensitive internal organs is the most viable protection strategy.\n\nThe immediate danger of intense exposure to high energy gamma radiation is Acute Radiation Syndrome (ARS), a result of irreversible bone marrow damage. The concept of selective shielding is based in the regenerative potential of the hematopoietic stem cells found in bone marrow. The regenerative quality of stem cells make it only necessary to protect enough bone marrow to repopulate the body with unaffected stem cells after the exposure: a similar concept which is applied in hematopoietic stem cell transplantation (HSCT) which is a common treatment for patients suffering from leukemia. This scientific advancement allows for the development of a new class of relatively light weight protective equipment which shields high concentrations of bone marrow to defer the hematopoietic sub-syndrome of Acute Radiation Syndrome to much higher dosages.\n\nOne technique is to apply selective shielding to protect the high concentration of bone marrow stored in the hips and other radio-sensitive organs in the abdominal area. This allows first responders a safe way to perform necessary missions in radioactive environments.[23]\n\n\nRadiation protection instruments[edit]\n\nPractical radiation measurement using calibrated radiation protection instruments is essential in evaluating the effectiveness of protection measures, and in assessing the radiation dose likely to be received by individuals. The measuring instruments for radiation protection are both \"installed\" (in a fixed position) and portable (hand-held or transportable).\n\n\nInstalled instruments[edit]\n\nInstalled instruments are fixed in positions which are known to be important in assessing the general radiation hazard in an area. Examples are installed \"area\" radiation monitors, Gamma interlock monitors, personnel exit monitors, and airborne particulate monitors.\n\nThe area radiation monitor will measure the ambient radiation, usually X-Ray, Gamma or neutrons; these are radiations which can have significant radiation levels over a range in excess of tens of metres from their source, and thereby cover a wide area.\n\nGamma radiation \"interlock monitors\" are used in applications to prevent inadvertent exposure of workers to an excess dose by preventing personnel access to an area when a high radiation level is present. These interlock the process access directly.\n\nAirborne contamination monitors measure the concentration of radioactive particles in the ambient air to guard against radioactive particles being ingested, or deposited in the lungs of personnel. These instruments will normally give a local alarm, but are often connected to an integrated safety system so that areas of plant can be evacuated and personnel are prevented from entering an air of high airborne contamination.\n\nPersonnel exit monitors (PEM) are used to monitor workers who are exiting a \"contamination controlled\" or potentially contaminated area. These can be in the form of hand monitors, clothing frisk probes, or whole body monitors. These monitor the surface of the workers body and clothing to check if any radioactive contamination has been deposited. These generally measure alpha or beta or gamma, or combinations of these.\n\nThe UK National Physical Laboratory publishes a good practice guide through its Ionising Radiation Metrology Forum concerning the provision of such equipment and the methodology of calculating the alarm levels to be used.[24]\n\n\nPortable instruments[edit]\n\n  \nHand-held ion chamber survey meter in use for surface dose rate on one of three radioisotope thermoelectric generators (RTGs) for the Cassini spacecraft.\n\n\n\nMain article: survey meter\n\nPortable instruments are hand-held or transportable.\nThe hand-held instrument is generally used as a survey meter to check an object or person in detail, or assess an area where no installed instrumentation exists. They can also be used for personnel exit monitoring or personnel contamination checks in the field. These generally measure alpha, beta or gamma, or combinations of these.\n\nTransportable instruments are generally instruments that would have been permanently installed, but are temporarily placed in an area to provide continuous monitoring where it is likely there will be a hazard. Such instruments are often installed on trolleys to allow easy deployment, and are associated with temporary operational situations.\n\nIn the United Kingdom the HSE has issued a user guidance note on selecting the correct radiation measurement instrument for the application concerned.[25] This covers all radiation instrument technologies, and is a useful comparative guide.\n\n\nInstrument types[edit]\n\nA number of commonly used detection instrument types are listed below, and are used for both fixed and survey monitoring.\n\n\n\tionization chambers\n\tproportional counters\n\tGeiger counters\n\tSemiconductor detectors\n\tScintillation detectors\n\tAirborne particulate radioactivity monitoring\n\n\nThe links should be followed for a fuller description of each.\n\n\nRadiation related quantities[edit]\n\nThe following table shows the main radiation related quantities and units.\n\n\nIonising radiation related quantities view ‧ talk ‧ edit\n\tQuantity\tUnit\tSymbol\tDerivation\tYear\tSI equivalence\n\n\tActivity (A)\n\tbecquerel\n\tBq\n\ts−1\n\t1974\n\tSI unit\n\n\tcurie\n\tCi\n\t3.7 × 1010 s−1\n\t1953\n\t3.7×1010 Bq\n\n\trutherford\n\tRd\n\t106 s−1\n\t1946\n\t1,000,000 Bq\n\n\tExposure (X)\n\tcoulomb per kilogram\n\tC/kg\n\tC⋅kg−1 of air\n\t1974\n\tSI unit\n\n\tröntgen\n\tR\n\tesu / 0.001293 g of air\n\t1928\n\t2.58 × 10−4 C/kg\n\n\tAbsorbed dose (D)\n\tgray\n\tGy\n\tJ⋅kg−1\n\t1974\n\tSI unit\n\n\terg per gram\n\terg/g\n\terg⋅g−1\n\t1950\n\t1.0 × 10−4 Gy\n\n\trad\n\trad\n\t100 erg⋅g−1\n\t1953\n\t0.010 Gy\n\n\tDose equivalent (H)\n\tsievert\n\tSv\n\tJ⋅kg−1 × WR\n\t1977\n\tSI unit\n\n\tröntgen equivalent man\n\trem\n\t100 erg⋅g−1\n\t1971\n\t0.010 Sv\n\n\n\nSpacecraft radiation challenges[edit]\n\nSpacecraft, both robotic and crewed, must cope with the high radiation environment of outerspace. Radiation emitted by the Sun and other galactic sources, and trapped in radiation \"belts\" is more dangerous and hundreds of times more intense than radiation sources such as medical X-rays or normal cosmic radiation usually experienced on Earth.[26] When the intensely ionizing particles found in space strike human tissue, it can result in cell damage and may eventually lead to cancer.\n\nThe usual method for radiation protection is material shielding by spacecraft and equipment structures (usually aluminium), possibly augmented by polyethylene in human spaceflight where the main concern is high energy protons and cosmic ray ions. On unmanned spacecraft in high electron dose environments such as Jupiter missions, or medium Earth orbit (MEO), additional shielding with materials of a high atomic number can be effective. On long duration manned missions, advantage can be taken of the good shielding characteristics of liquid hydrogen fuel and water.\n\nThe NASA Space Radiation Laboratory makes use of a particle accelerator that produces beams of protons or heavy ions. These ions are typical of those accelerated in cosmic sources and by the Sun. The beams of ions move through a 100-meter (328-foot) transport tunnel to the 37-square-meter (400-square-foot) shielded target hall. There, they hit the target, which may be a biological sample or shielding material.[26] In a 2002 NASA study, it was determined that materials that have high hydrogen contents, such as polyethylene, can reduce primary and secondary radiation to a greater extent than metals, such as aluminum.[27] The problem with this \"passive shielding\" method is that radiation interactions in the material generate secondary radiation.\n\nActive Shielding, that is, using magnets, high voltages, or artificial magnetospheres to slow down or deflect radiation, has been considered to potentially combat radiation in a feasible way. So far, the cost of equipment, power and weight of active shielding equipment outweigh their benefits. For example, active radiation equipment would need a habitable volume size to house it, and magnetic and electrostatic configurations often are not homogenous in intensity, allowing high-energy particles to penetrate the magnetic and electric fields from low-intensity parts, like cusps in dipolar magnetic field of Earth. As of 2012, NASA is undergoing research in superconducting magnetic architecture for potential active shielding applications.[28]\n\n\nEarly radiation dangers[edit]\n\n  \nUsing early Crookes tube X-Ray apparatus in 1896. One man is viewing his hand with a fluoroscope to optimise tube emissions, the other has his head close to the tube. No precautions  are being taken.\n\n\n\n  \nMonument to the X-ray and Radium Martyrs of All Nations erected 1936 at St. Georg hospital in Hamburg, commemorating 359 early radiology workers.\n\n\n\nThe dangers of radioactivity and radiation were not immediately recognized. The discovery of x‑rays in 1895 led to widespread experimentation by scientists, physicians, and inventors. Many people began recounting stories of burns, hair loss and worse in technical journals as early as 1896. In February of that year, Professor Daniel and Dr. Dudley of Vanderbilt University performed an experiment involving x-raying Dudley's head that resulted in his hair loss. A report by Dr. H.D. Hawks, a graduate of Columbia College, of his suffering severe hand and chest burns in an x-ray demonstration, was the first of many other reports in Electrical Review.[29]\n\nMany experimenters including Elihu Thomson at Thomas Edison's lab, William J. Morton, and Nikola Tesla also reported burns. Elihu Thomson deliberately exposed a finger to an x-ray tube over a period of time and suffered pain, swelling, and blistering.[30] Other effects, including ultraviolet rays and ozone were sometimes blamed for the damage.[31] Many physicists claimed that there were no effects from x-ray exposure at all.[30]\n\nAs early as 1902 William Herbert Rollins wrote almost despairingly that his warnings about the dangers involved in careless use of x-rays was not being heeded, either by industry or by his colleagues. By this time Rollins had proved that x-rays could kill experimental animals, could cause a pregnant guinea pig to abort, and that they could kill a fetus.[32] He also stressed that \"animals vary in susceptibility to the external action of X-light\" and warned that these differences be considered when patients were treated by means of x-rays.\n\nBefore the biological effects of radiation were known, many physicists and corporations began marketing radioactive substances as patent medicine in the form of glow-in-the-dark pigments. Examples were radium enema treatments, and radium-containing waters to be drunk as tonics. Marie Curie protested against this sort of treatment, warning that the effects of radiation on the human body were not well understood. Curie later died from aplastic anaemia, likely caused by exposure to ionizing radiation. By the 1930s, after a number of cases of bone necrosis and death of radium treatment enthusiasts, radium-containing medicinal products had been largely removed from the market (radioactive quackery).\n\n\nSee also[edit]\n\n\tCBLB502, 'Protectan', a radioprotectant drug under development for its ability to protect cells during radiotherapy.\n\tEx-Rad, a United States Department of Defense radioprotectant drug under development.\n\tHealth physics\n\tHealth threat from cosmic rays\n\tInternational Radiation Protection Association – (IRPA). The International body concerned with promoting the science and practice of radiation protection.\n\tJuno Radiation Vault\n\tNon-ionizing radiation\n\tNuclear safety\n\tPotassium iodide\n\tRadiation monitoring\n\tRadiation Protection Convention, 1960\n\tRadiation protection reports of the European Union\n\tRadiobiology\n\tRadiological protection of patients\n\tRadioresistance\n\tSociety for Radiological Protection – The principal UK body concerned with promoting the science and practice of radiation protection. It is the UK national affiliated body to IRPA\n\n\nNotes[edit]\n\n\n\t^ IAEA Safety Glossary - draft 2016 revision.\n\n\t^ ICRP. Report 103. pp. para 29.\n\n\t^ ICRP. \"Report 103\": Section 6. Cite journal requires |journal= (help)\n\n\n\t^ ICRP. \"Report 103\": para 253. Cite journal requires |journal= (help)\n\n\n\t^ ICRP. \"Report 103\": para 274. Cite journal requires |journal= (help)\n\n\n\t^ ICRP. \"Report 103\": para 284. Cite journal requires |journal= (help)\n\n\n\t^ ICRP. \"Report 103\": Introduction. Cite journal requires |journal= (help)\n\n\n\t^ \"Biological shield\". United States Nuclear Regulatory Commission. Retrieved 13 August 2010.\n\n\n\t^ ICRP. \"Report 103\": Table 8, section 6.5. Cite journal requires |journal= (help)\n\n\n\t^ ICRP, International Commission on Radiological Protection. \"Dose limits\". ICRPedia. ICRP. Retrieved 2 November 2017.\n\n\n\t^ ICRPedia on-line. \"ICRP\". Retrieved 28 July 2017.\n\n\n\t^ This is the wording used by the national regulatory authority that coined the term, in turn derived from its enabling legislation: Health and Safety at Work etc. Act 1974: \"Risk management: ALARP at a glance\". London: Health and Safety Executive. Retrieved 13 February 2011. 'ALARP' is short for 'as low as reasonably practicable'\n\n\n\t^ a b Swensen, Stephen J.; Duncan, James R.; Gibson, Rosemary; Muething, Stephen E.; LeBuhn, Rebecca; Rexford, Jean; Wagner, Carol; Smith, Stephen R.; DeMers, Becky (2014). \"An Appeal for Safe and Appropriate Imaging of Children\". Journal of Patient Safety. 10 (3): 121–124. doi:10.1097/pts.0000000000000116.\n\n\n\t^ \"Image Gently\". www.imagegently.org. Alliance for Radiation Safety in Pediatric Imaging (the Image Gently Alliance). Retrieved 2016-02-08.\n\n\n\t^ Advances in kilovoltage x-ray beam dosimetry by Hill et al in http://iopscience.iop.org/0031-9155/59/6/R183/article\n\n\t^ Seco, Joao; Clasie, Ben; Partridge, Mike (Oct 2014). \"Review on the characteristics of radiation detectors for dosimetry and imaging\". Physics in Medicine and Biology. 59 (20): R303–R347. Bibcode:2014PMB....59R.303S. doi:10.1088/0031-9155/59/20/R303. PMID 25229250.\n\n\n\t^ Fan, W.C.;  et al. (1996). \"Shielding considerations for satellite microelectronics\". IEEE Transactions on Nuclear Science. 43 (6): 2790–2796. Bibcode:1996ITNS...43.2790F. doi:10.1109/23.556868.\n\n\n\t^ Smith, D.M.;  et al. (2002). \"The RHESSI Spectrometer\". Solar Physics. 210 (1): 33–60. Bibcode:2002SoPh..210...33S. doi:10.1023/A:1022400716414.\n\n\n\t^ Pia, Maria Grazia;  et al. (2009). \"PIXE Simulation with Geant4\". IEEE Transactions on Nuclear Science. 56 (6): 3614–3649. Bibcode:2009ITNS...56.3614P. doi:10.1109/TNS.2009.2033993.\n\n\n\t^ http://www.oseh.umich.edu/TrainP32.pdf\n\n\t^ Historical Use of Thorium at Hanford Archived 2013-05-12 at the Wayback Machine\n\n\t^ \"Personal Protective Equipment (PPE) in a Radiation Emergency - Radiation Emergency Medical Management\". www.remm.nlm.gov. Retrieved 2018-06-21.\n\n\n\t^ {{cite web|url=https://www.oecd-nea.org/rp/docs/2014/crpph-r2014-5.pdf%7Ctitle=Occupational Radiation Protection in Severe Accident Management|website=The Organisation for Economic Co-operation and Development (OECD) and the [[Nuclear Energy Agency|Nuclear Energy Agency (NEA)}}\n\n\t^ Operational Monitoring Good Practice Guide \"The Selection of Alarm Levels for Personnel Exit Monitors\" Dec 2009 - National Physical Laboratory, Teddington UK [1]\n\n\t^ [2] Selection, use and maintenance of portable monitoring instruments. UK HSE\n\n\t^ a b \"Behind the scenes - NASA's Space Radiation Laboratory\". NASA. 2003. Retrieved 2012-07-25.\n\n\n\t^ \"Understanding Space Radiation\" (PDF). Lyndon B. Johnson Space Center. NASA. October 2002. Retrieved 2012-07-25. FS-2002-10-080-JSC\n\n\n\t^ \"Radiation Protection and Architecture Utilizing High Temperature Superconducting Magnets\". NASA Johnson Space Center. Shayne Westover. 2012. Retrieved 2014-04-28.\n\n\n\t^ Sansare, K.; Khanna, V.; Karjodkar, F. (2011). \"Early victims of X-rays: a tribute and current perception\". Dentomaxillofacial Radiology. 40 (2): 123–125. doi:10.1259/dmfr/73488299. ISSN 0250-832X. PMC 3520298. PMID 21239576.\n\n\n\t^ a b Ronald L. Kathern and Paul L. Ziemer, he First Fifty Years of Radiation Protection, physics.isu.edu\n\n\t^ Hrabak, M.; Padovan, R. S.; Kralik, M.; Ozretic, D.; Potocki, K. (July 2008). \"Nikola Tesla and the Discovery of X-rays\". RadioGraphics. 28 (4): 1189–92. doi:10.1148/rg.284075206. PMID 18635636.\n\n\n\t^ Geoff Meggitt (2008), Taming the Rays - A history of Radiation and Protection., Lulu.com, ISBN 978-1-4092-4667-1\n\n\n\n\n\n\nReferences[edit]\n\n\tHarvard University Radiation Protection Office Providing radiation guidance to Harvard University and affiliated institutions.\n\tJournal of Solid State Phenomena Tara Ahmadi, Use of Semi-Dipole Magnetic Field for Spacecraft Radiation Protection.\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Radiation protection.\n\n\n\t[3] - \"The confusing world of radiation dosimetry\" - M.A. Boyd, U.S. Environmental Protection Agency. An account of chronological differences between USA and ICRP dosimetry systems.\n\t\"Halving-thickness for various materials\". The Compass DeRose Guide to Emergency Preparedness - Hardened Shelters.\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nRadiation protection\n\n\tMain articles\t\n\tBackground radiation\n\tDosimetry\n\tHealth physics\n\tIonizing radiation\n\tInternal dosimetry\n\tRadioactive contamination\n\tRadioactive sources\n\tRadiobiology\n\n\n\n\n\tMeasurement \nquantities & units\t\n\tAbsorbed dose\n\tBecquerel\n\tCommitted dose\n\tComputed tomography dose index\n\tCounts per minute\n\tEffective dose\n\tEquivalent dose\n\tGray\n\tMean glandular dose\n\tMonitor unit\n\tRad\n\tRoentgen\n\tRem\n\tSievert\n\n\n\n\n\tInstruments and \nmeasurement techniques\t\n\tAirborne radioactive particulate monitoring\n\tDosimeter\n\tGeiger counter\n\tIon chamber\n\tScintillation counter\n\tProportional counter\n\n\n\tRadiation monitoring\n\tSemiconductor detector\n\tSurvey meter\n\tWhole-body counting\n\n\n\n\n\tProtection techniques\t\n\tLead shielding\n\tGlovebox\n\tPotassium iodide\n\tRadon mitigation\n\tRespirators\n\n\n\n\n\tOrganisations\t\n\tEuratom\n\tHPS (USA)\n\tIAEA\n\tICRU\n\tICRP\n\tIRPA\n\tSRP (UK)\n\tUNSCEAR\n\n\n\n\n\tRegulation\t\n\tIRR (UK)\n\tNRC (USA)\n\tONR (UK)\n\tRadiation Protection Convention, 1960\n\n\n\n\n\tRadiation effects\t\n\tAcute radiation syndrome\n\tRadiation-induced cancer\n\n\n\n\n\tSee also: the categories Medical physics, Radiation effects, Radioactivity, Radiobiology, and Radiation protection.\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nRadiation poisoning\n\n\tGeneral\t\n\tAcute\n\tChronic\n\tAccidents\n\tExperiments\n\tBiological timeline\n\n\n\n\n\tConditions\t\n\tRadiation burn\n\tRadiation-induced cancer\n\tRadiation-induced cognitive decline\n\tRadiation-induced lung injury\n\n\n\n\n\tTreatments\t\n\tDose fractionation\n\tRadioresistance\n\tRadiation protection\n\tRadiation dose reconstruction\n\n\n\n\n\n\n\n\tNuclear technology portal\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Radiation_protection&oldid=916235358#Radiation_Shielding\"\n\n\t\t\n\t\tCategories: \tNuclear physics\n\tRadiobiology\n\tRadiation health effects\n\tRadiation protection\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tWebarchive template wayback links\n\tArticles with short description\n\tArticles prone to spam from November 2012\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tБългарски\n\tDeutsch\n\tEesti\n\tEspañol\n\tEsperanto\n\tFrançais\n\tGaeilge\n\tहिन्दी\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tNederlands\n\tPolski\n\tRomână\n\tРусский\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tTürkçe\n\tУкраїнська\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 17 September 2019, at 20:00 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "7", "dc:title": "Radiation protection - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-radiation_shield", "title": "Radiation protection - Wikipedia"}}