{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReaction wheel - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tReaction wheel\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nA small reaction wheel viewed in profile\n\n\n\n  \nA momentum/reaction wheel comprising part of a high-accuracy Conical Earth Sensor to maintain a satellite's precise attitude\n\n\n\nA reaction wheel (RW) is a type of flywheel used primarily by spacecraft for three axis attitude control, which does not require rockets or external applicators of torque. They provide a high pointing accuracy,[1]:362 and are particularly useful when the spacecraft must be rotated by very small amounts, such as keeping a telescope pointed at a star.\n\nA reaction wheel is sometimes operated as (and referred to as) a momentum wheel, by operating it at a constant (or near-constant) rotation speed, in order to imbue a satellite with a large amount of stored angular momentum. Doing so alters the spacecraft's rotational dynamics so that disturbance torques perpendicular to one axis of the satellite (the axis parallel to the wheel's spin axis) do not result directly in spacecraft angular motion about the same axis as the disturbance torque; instead, they result in (generally smaller) angular motion (precession) of that spacecraft axis about a perpendicular axis. This has the effect of tending to stabilize that spacecraft axis to point in a nearly-fixed direction,[1]:362 allowing for a less-complicated attitude control system. Satellites using this \"momentum-bias\" stabilization approach include SCISAT-1; by orienting the momentum wheel's axis to be parallel to the orbit-normal vector, this satellite is in a \"pitch momentum bias\" configuration.\n\nA control moment gyroscope (CMG) is a related but different type of attitude actuator, generally consisting of a momentum wheel mounted in a one-axis or two-axis gimbal.[1]:362 When mounted to a rigid spacecraft, applying a constant torque to the wheel using one of the gimbal motors causes the spacecraft to develop a constant angular velocity about a perpendicular axis, thus allowing control of the spacecraft's pointing direction. CMGs are generally able to produce larger sustained torques than RWs with less motor heating, and are preferentially used in larger and/or more-agile spacecraft, including Skylab, Mir, and the International Space Station.\n\n\nContents\n\n\n\t1 Theory\n\t2 Implementation\n\t3 Spacecrafts using Reaction wheel\n\t3.1 Beresheet\n\t3.2 LightSail 2\n\n\n\n\t4 Failures and mission impact\n\t4.1 Hubble\n\t4.2 Hayabusa\n\t4.3 Kepler\n\t4.4 Dawn\n\n\n\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nTheory[edit]\n\nReaction wheels are used to control the attitude of a satellite without the use of thrusters, which reduces the mass fraction needed for fuel. \n\nThey work by equipping the spacecraft with an electric motor attached to a flywheel which, when its rotation speed is changed, causes the spacecraft to begin to counter-rotate proportionately through conservation of angular momentum.[2] Reaction wheels can rotate a spacecraft only around its center of mass (see torque); they are not capable of moving the spacecraft from one place to another (see translational force).\n\n\nImplementation[edit]\n\nFor three axis control, reaction wheels must be mounted along at least three directions, with extra wheels providing additional redundancy to the attitude control system. A redundant mounting configuration could consist of four wheels along tetrahedral axes,[3] or a spare wheel carried in addition to a three axis configuration.[1]:369 Changes in speed (in either direction) are controlled electronically by computer. The strength of the materials used in a reaction wheel determine the speed at which the wheel would come apart, and therefore how much angular momentum it can store.\n\nSince the reaction wheel is a small fraction of the spacecraft's total mass, easily controlled, temporary changes in its speed result in small changes in angle. The wheels therefore permit very precise changes in a spacecraft's attitude. For this reason, reaction wheels are often used to aim spacecraft carrying cameras or telescopes.\n\nOver time, reaction wheels may build up enough stored momentum to exceed the maximum speed of the wheel, called saturation, which will need to be cancelled. Designers therefore supplement reaction wheel systems with other attitude control mechanisms. In the presence of a magnetic field (as in low Earth orbit), a spacecraft can employ magnetorquers (better known as torque rods) to transfer angular momentum to the Earth through its planetary magnetic field.[1]:368 In the absence of a magnetic field, the most efficient practice is to use either high-efficiency attitude jets such as ion thrusters, or small, lightweight solar sails placed in locations away from the spacecraft's center of mass, such as on solar cell arrays or projecting masts.\n\n\nSpacecrafts using Reaction wheel[edit]\n\nBeresheet [edit]\n\nBeresheet was launched on a Falcon 9 rocket on 22 February 2019 1:45 UTC [4], with the goal of landing on the moon. Beresheet uses the Low-energy transfer technique in order to save fuel. Since its fourth maneuver [5] in its elliptical orbit, in order to prevent shakes due to the liquid fuel that went small, there was a need to use a reaction wheel.\n\n\nLightSail 2[edit]\n\nLightSail 2 was launched on 25 June 2019, focused around the concept of a Solar sail. LightSail 2 uses a reaction wheel system to change orientation by very small amounts, allowing it to receive different amounts of momentum from the light across the sail, resulting in a higher altitude. \n[6]\n\n\nFailures and mission impact[edit]\n\nThe failure of one or more reaction wheels can cause a spacecraft to lose its ability to maintain attitude (orientation) and thus potentially cause a mission failure. Recent studies[7] conclude that these failures can be correlated with space weather effects.\n\n\nHubble[edit]\n\nTwo servicing missions to the Hubble Space Telescope have replaced a reaction wheel. In February 1997, the Second Servicing Mission (STS-82) replaced one[8] after 'electrical anomalies', rather than any mechanical problem.[9] Study of the returned mechanism provided a rare opportunity to study equipment that had undergone long-term service (7 years) in space, particularly for the effects of vacuum on lubricants. The lubricating compound was found to be in 'excellent condition'.[9] In 2002, Servicing Mission 3B (STS-109), astronauts from the shuttle Columbia replaced another reaction wheel.[8] Neither of these wheels had failed and Hubble was designed with four redundant wheels, and maintained pointing ability so long as three were functional.[10]\n\n\nHayabusa[edit]\n\nIn 2004, during the mission of the Hayabusa spacecraft, an X-axis reaction wheel failed. The Y-axis wheel failed in 2005, causing the craft to rely on chemical thrusters to maintain attitude control.[11]\n\n\nKepler[edit]\n\nFrom July 2012 to May 11, 2013, two out of the four reaction wheels in the Kepler telescope failed. This loss severely hampered Kepler's ability to maintain a sufficiently precise orientation to continue its original mission.[12] On August 15, 2013, engineers concluded that Kepler's reaction wheels cannot be recovered and that planet searching using the transit method (measuring changes in star brightness caused by orbiting planets) could not continue.[13][14][15][16] Although the failed reaction wheels still function, they are experiencing friction exceeding acceptable levels, and consequently hindering the ability of the telescope to properly orient itself. The Kepler telescope was returned to its \"point rest state\", a stable configuration that uses small amounts of thruster fuel to compensate for the failed reaction wheels, while the Kepler team considered alternative uses for Kepler that do not require the extreme accuracy in its orientation as needed by the original mission.[17] On May 16, 2014, NASA extended the Kepler mission to a new mission named K2, which uses Kepler differently, but allows it to continue searching for exoplanets.[18] On October 30, 2018, NASA announced the end of the Kepler mission after it was determined that the fuel supply had been exhausted.[19]\n\n\nDawn[edit]\n\nDawn had excess friction in one reaction wheel in June 2010, and it was originally scheduled to depart Vesta and begin its two and a half year journey to Ceres on August 26, 2012.[20] However, a problem with another of the spacecraft's reaction wheels forced Dawn to briefly delay its departure from Vesta's gravity until September 5, 2012, and it planned to use thruster jets instead of the reaction wheels during the three-year journey  to Ceres.[20] The loss of the reaction wheels limited the camera observations on the approach to Ceres.\n\n\nSee also[edit]\n\n\tReaction control system\n\tSpacecraft propulsion\n\tROSAT, a satellite lost when limitations in its control envelope were exceeded\n\tUTC Aerospace Systems, the owner of Ithaco Space Systems, Inc., which built the ill-fated reaction wheels for (among others) the Kepler, Dawn and Hayabusa spacecraft\n\n\nReferences[edit]\n\n\n\t^ a b c d e Wiley J Larson and James R Wertz. Space Mission Analysis and Design (3 ed.). Microcosm Press. ISBN 1-881883-10-8.\n\n\t^ \"Reaction/Momentum Wheel\". NASA. Retrieved 15 June 2018.\n\n\n\t^ \"Attitude Control\". Universität Stuttgart Institut für Raumfahrtsysteme. Retrieved 12 August 2016.\n\n\n\t^ \"israels-moon-mission-launched-successfully\".\n\n\n\t^ \"spaceil-conducts-another-successful-maneuver\".\n\n\n\t^ \"crowdfunded-spacecraft-lightsail-2-prepares-to-go-sailing-on-sunlight\".\n\n\n\t^ W. Bialke, E. Hansell \"A Newly Discovered Branch of the Fault Tree Explaining Systemic Reaction Wheel Failures And Anomalies\", 2017 \n\n\t^ a b \"Team Hubble: Servicing Missions -- Servicing Mission 3B\". Astronauts replaced one of the four Reaction Wheel Assemblies that make up Hubble's Pointing Control System.\n\n\n\t^ a b Carré, D. J.; Bertrand, P. A. (1999). \"Analysis of Hubble Space Telescope Reaction Wheel Lubricant\". Journal of Spacecraft and Rockets. 36 (1): 109–113. Bibcode:1999JSpRo..36..109C. doi:10.2514/2.3422.\n\n\n\t^ \"Gyroscopes\". ESA. Retrieved 8 April 2016.\n\n\n\t^ \"Hayabusa\". NASA. Archived from the original on June 1, 2013. Retrieved May 15, 2013.\n\n\n\t^ Mike Wall (May 15, 2013). \"Planet-Hunting Kepler Spacecraft Suffers Major Failure, NASA Says\". Space.com. Retrieved May 15, 2013.\n\n\n\t^ \"NASA Ends Attempts to Fully Recover Kepler Spacecraft, Potential New Missions Considered\". August 15, 2013. Retrieved August 15, 2013.\n\n\n\t^ Overbye, Dennis (August 15, 2013). \"NASA's Kepler Mended, but May Never Fully Recover\". New York Times. Retrieved August 15, 2013.\n\n\n\t^ Wall, Mike (August 15, 2013). \"Planet-Hunting Days of NASA's Kepler Spacecraft Likely Over\". Space.com. Retrieved August 15, 2013.\n\n\n\t^ \"Kepler: NASA retires prolific telescope from planet-hunting duties\".\n\n\n\t^ Hunter, Roger. \"Kepler Mission Manager Update: Pointing Test Results\". NASA.gov. NASA. Retrieved 24 September 2013.\n\n\n\t^ Sobeck, Charlie (May 16, 2014).  Johnson, Michele (ed.). \"Kepler Mission Manager Update: K2 Has Been Approved!\". nasa.gov. NASA Official: Brian Dunbar; Image credit(s): NASA Ames/W. Stenzel. NASA. Archived from the original on May 17, 2014. Retrieved May 17, 2014.\n\n\n\t^ Chou, Felicia (2018-10-30). \"NASA Retires Kepler Space Telescope, Passes Planet-Hunting Torch\". NASA. Retrieved 2018-11-16.\n\n\n\t^ a b Cook, Jia-Rui C. (August 18, 2012). \"Dawn Engineers Assess Reaction Wheel\". NASA / Jet Propulsion Laboratory. Archived from the original on March 15, 2015. Retrieved January 22, 2015.\n\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Reaction wheels.\n\n\n\tSinclair, Doug; Grant, C. Cordell; Zee, Robert E. (2007). \"Enabling Reaction Wheel Technology for High Performance Nanosatellite Attitude Control\" (PDF).\n\n\t\"Reaction Wheel at Wolfram Research\". June 2008.\n\n\tMarkley, F. Landis; Reid G. Reynolds; Frank X. Liu; Kenneth L. Lebsock (2009). \"Maximum Torque and Momentum Envelopes for Reaction Wheel Arrays\" (PDF).\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Reaction_wheel&oldid=917631275\"\n\n\t\t\n\t\tCategories: \tSpacecraft attitude control\n\tSpacecraft propulsion\n\tGyroscopes\n\n\nHidden categories: \tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCatalà\n\tDeutsch\n\tEspañol\n\tFrançais\n\tBahasa Indonesia\n\tItaliano\n\t日本語\n\tPolski\n\tTiếng Việt\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 24 September 2019, at 18:32 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "12", "dc:title": "Reaction wheel - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/6/63/Reaction_wheel02.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-reaction_wheel", "title": "Reaction wheel - Wikipedia"}}