{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReflector (antenna) - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tReflector (antenna)\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\t\n\tThis article has multiple issues. Please help improve it or discuss these issues on the talk page. (Learn how and when to remove these template messages)\n\n      \t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Reflector\" antenna – news · newspapers · books · scholar · JSTOR  (April 2014) (Learn how and when to remove this template message)\n\n\n\n\t\n\tThis article may be confusing or unclear to readers. Please help us clarify the article. There might be a discussion about this on the talk page.  (October 2008) (Learn how and when to remove this template message)\n\n\n\n    \n\n\n (Learn how and when to remove this template message)\n\n\n\n  \nParabolic reflector as part of a Satellite dish\n\n\n\nAn antenna reflector is a device that reflects electromagnetic waves.  Antenna reflectors can exist as a standalone device for redirecting radio frequency (RF) energy, or can be integrated as part of an antenna assembly.\n\n\nContents\n\n\n\t1 Standalone reflectors\n\t2 Integrated reflectors\n\t3 Design criteria\n\t4 Measurements\n\t5 See also\n\t6 References\n\n\n\n\n\nStandalone reflectors[edit]\n\n  \nTypes of parabolic antennas\n\n\n\n  \nCorner reflector part of a UHF television antenna\n\n\n\nThe function of a standalone reflector is to redirect electro-magnetic (EM) energy, generally in the radio wavelength range of the electromagnetic spectrum.\n\nCommon standalone reflector types are\n\n\n\tcorner reflector, which reflects the incoming signal back to the direction from which it came, commonly used in radar.\n\tflat reflector, which reflects the signal such as a mirror and is often used as a passive repeater.\n\n\nIntegrated reflectors[edit]\n\nWhen integrated into an antenna assembly, the reflector serves to modify the radiation pattern of the antenna, increasing gain in a given direction.\n\nCommon integrated reflector types are\n\n\n\tparabolic reflector, which focuses a beam signal into one point or directs a radiating signal into a beam.[1]\n\ta passive element slightly longer than and located behind a radiating dipole element that absorbs and re-radiates the signal in a directional way as in a Yagi antenna array.\n\ta flat reflector such as used in a Short backfire antenna or Sector antenna.\n\ta corner reflector used in UHF television antennas.\n\ta cylindrical reflector as used in Cantenna.\n\n\nDesign criteria[edit]\n\nParameters that can directly influence the performance of an antenna with integrated reflector:\n\n\n\tDimensions of the reflector (Big ugly dish versus small dish)\n\tSpillover (part of the feed antenna radiation misses the reflector)\n\tAperture blockage (also known as feed blockage: part of the feed energy is reflected back into the feed antenna and does not contribute to the main beam)\n\tIllumination taper (feed illumination reduced at the edges of the reflector)\n\tReflector surface deviation\n\tDefocusing\n\tCross polarization\n\tFeed losses\n\tAntenna feed mismatch\n\tNon-uniform amplitude/phase distributions\n\n\nThe antenna efficiency is measured in terms of its effectiveness ratio.\n\nAny gain-degrading factors which raise side lobes have a two-fold effect, in that they contribute to system noise temperature in addition to reducing gain.  Aperture blockage and deviation of reflector surface (from the designed \"ideal\") are two important cases.  Aperture blockage is normally due to shadowing by feed, subreflector and/or support members.  Deviations in reflector surfaces cause non-uniform aperture distributions, resulting in reduced gains.\n\nThe standard symmetrical, parabolic, Cassegrain reflector system is very popular in practice because it allows minimum feeder length to the terminal equipment.  The major disadvantage of this configuration is blockage by the hyperbolic sub-reflector and its supporting struts (usually 3–4 are used).  The blockage becomes very significant when the size of the parabolic reflector is small compared to the diameter of the sub-reflector.\nTo avoid blockage from the sub-reflector asymmetric designs such as the open Cassegrain can be employed.  Note however that the asymmetry can have deleterious effects on some aspects of the antenna's performance - for example, inferior side-lobe levels, beam squint, poor cross-polar response, etc.\n\nTo avoid spillover from the effects of over-illumination of the main reflector surface and diffraction, a microwave absorber is sometimes employed.  This lossy material helps prevent excessive side-lobe levels radiating from edge effects and over-illumination.  Note that in the case of a front-fed Cassegrain the feed horn and feeder (usually waveguide) need to be covered with an edge absorber in addition to the circumference of the main paraboloid.\n\n\nMeasurements[edit]\n\nMeasurements are made on reflector antennas to establish important performance indicators such as the gain and sidelobe levels.  For this purpose the measurements must be made at a distance at which the beam is fully formed.  A distance of four Rayleigh distances is commonly adopted as the minimum distance at which measurements can be made, unless specialized techniques are used (see Antenna measurement).\n\n\nSee also[edit]\n\n\tLens antenna\n\tRadio astronomy\n\n\nReferences[edit]\n\n\n\t^ J. J. Condon and S. M. Ransom. \"Reflector Antennas\". Essential Radio Astronomy. National Radio Astronomy Observatory.CS1 maint: uses authors parameter (link)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Reflector_(antenna)&oldid=844659298\"\n\n\t\t\n\t\tCategories: \tRadio frequency antenna types\n\tSatellite broadcasting\n\n\nHidden categories: \tCS1 maint: uses authors parameter\n\tArticles needing additional references from April 2014\n\tAll articles needing additional references\n\tWikipedia articles needing clarification from October 2008\n\tAll Wikipedia articles needing clarification\n\tArticles with multiple maintenance issues\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tEspañol\n\tPortuguês\n\tРусский\n\tShqip\n\tУкраїнська\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 6 June 2018, at 08:25 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "Reflector (antenna) - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Satellite_dish_1_C-Band.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-reflector_-antenna", "title": "Reflector (antenna) - Wikipedia"}}