{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSatellite navigation - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tSatellite navigation\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tAny system that uses satellite radio signals to provide autonomous geo-spatial positioning\n\n  \nGPSTest showing the available GNSS in 2019. Since the 2010s, satellite navigation is widely available on civilian devices.\n\n\n\nA satellite navigation or satnav system is a system that uses satellites to provide autonomous geo-spatial positioning. It allows small electronic receivers to determine their location (longitude, latitude, and altitude/elevation) to high precision (within a few centimeters to metres) using time signals transmitted along a line of sight by radio from satellites. The system can be used for providing position, navigation or for tracking the position of something fitted with a receiver (satellite tracking). The signals also allow the electronic receiver to calculate the current local time to high precision, which allows time synchronisation. Satnav systems operate independently of any telephonic or internet reception, though these technologies can enhance the usefulness of the positioning information generated.\n\nA satellite navigation system with global coverage may be termed a global navigation satellite system (GNSS). As of October 2018[update], the United States' Global Positioning System (GPS) and Russia's GLONASS are fully operational GNSSs, with China's BeiDou Navigation Satellite System (BDS) and the European Union's Galileo scheduled to be fully operational by 2020.[1][2] Japan's Quasi-Zenith Satellite System (QZSS) is a GPS satellite-based augmentation system to enhance GPS's accuracy, with satellite navigation independent of GPS scheduled for 2023.[3] India already has functioning Indian Regional Navigation Satellite System (IRNSS) with an operational name of NAVIC, it is an autonomous regional satellite navigation system that provides accurate real-time positioning and timing services.[4]\n\nGlobal coverage for each system is generally achieved by a satellite constellation of 18–30 medium Earth orbit (MEO) satellites spread between several orbital planes. The actual systems vary, but use orbital inclinations of >50° and orbital periods of roughly twelve hours (at an altitude of about 20,000 kilometres or 12,000 miles).\n\n\nContents\n\n\n\t1 Classification\n\t2 History and theory\n\t3 Applications\n\t4 Global navigation satellite systems\n\t4.1 GPS\n\t4.2 GLONASS\n\t4.3 Galileo\n\t4.4 BeiDou\n\n\n\n\t5 Regional navigation satellite systems\n\t5.1 NAVIC\n\t5.2 QZSS\n\n\n\n\t6 Comparison of systems\n\t7 Augmentation\n\t7.1 DORIS\n\n\n\n\t8 Low Earth orbit satellite phone networks\n\t9 Positioning calculation\n\t10 See also\n\t11 Notes\n\t12 References\n\t13 Further reading\n\t14 External links\n\t14.1 Information on specific GNSS systems\n\t14.2 Organizations related to GNSS\n\t14.3 Supportive or illustrative sites\n\n\n\n\n\n\n\n\nClassification[edit]\n\nGNSS systems that provide enhanced accuracy and integrity monitoring usable for civil navigation are classified as follows:[5]\n\n\n\tGNSS-1 is the first generation system and is the combination of existing satellite navigation systems (GPS and GLONASS), with Satellite Based Augmentation Systems (SBAS) or Ground Based Augmentation Systems (GBAS).[5] In the United States, the satellite based component is the Wide Area Augmentation System (WAAS), in Europe it is the European Geostationary Navigation Overlay Service (EGNOS), and in Japan it is the Multi-Functional Satellite Augmentation System (MSAS). Ground based augmentation is provided by systems like the Local Area Augmentation System (LAAS).[5]\n\tGNSS-2 is the second generation of systems that independently provides a full civilian satellite navigation system, exemplified by the European Galileo positioning system.[5] These systems will provide the accuracy and integrity monitoring necessary for civil navigation; including aircraft. Initially, this system consisted of only Upper L Band frequency sets (L1 for GPS, E1 for Galileo, G1 for GLONASS). In recent years, GNSS systems have begun activating Lower L-Band frequency sets (L2 and L5 for GPS, E5a and E5b for Galileo, G3 for GLONASS) for civilian use; they feature higher aggregate accuracy and fewer problems with signal reflection.[6][7] As of late 2018, a few consumer grade GNSS devices are being sold that leverage both, and are typically called \"Dual band GNSS\" or \"Dual band GPS\" devices.\n\n\nBy their roles in the navigation system, systems can be classified as:\n\n\n\tCore Satellite navigation systems, currently GPS (United States), GLONASS (Russian Federation), Galileo (European Union) and Beidou (China).\n\tGlobal Satellite Based Augmentation Systems (SBAS) such as Omnistar and StarFire.\n\tRegional SBAS including WAAS (US), EGNOS (EU), MSAS (Japan) and GAGAN (India).\n\tRegional Satellite Navigation Systems such as India's NAVIC, and Japan's QZSS.\n\tContinental scale Ground Based Augmentation Systems (GBAS) for example the Australian GRAS and the joint US Coast Guard, Canadian Coast Guard, US Army Corps of Engineers and US Department of Transportation National Differential GPS (DGPS) service.\n\tRegional scale GBAS such as CORS networks.\n\tLocal GBAS typified by a single GPS reference station operating Real Time Kinematic (RTK) corrections.\n\n\nAs many of the global GNSS systems (and augmentation systems) use similar frequencies and signals around L1, many \"Multi-GNSS\" receivers capable of using multiple systems have been produced. While some systems strive to interoperate with GPS as well as possible by providing the same clock, others do not.[8]\n\n\nHistory and theory[edit]\n\n  \n\n\n\n\nGround based radio navigation has long been practiced.  The DECCA, LORAN, GEE and Omega systems used terrestrial longwave radio transmitters which broadcast a radio pulse from a known \"master\" location, followed by a pulse repeated from a number of \"slave\" stations.  The delay between the reception of the master signal and the slave signals allowed the receiver to deduce the distance to each of the slaves, providing a fix.\n\nThe first satellite navigation system was Transit, a system deployed by the US military in the 1960s. Transit's operation was based on the Doppler effect: the satellites travelled on well-known paths and broadcast their signals on a well-known radio frequency.  The received frequency will differ slightly from the broadcast frequency because of the movement of the satellite with respect to the receiver. By monitoring this frequency shift over a short time interval, the receiver can determine its location to one side or the other of the satellite, and several such measurements combined with a precise knowledge of the satellite's orbit can fix a particular position. Satellite orbital position errors are induced by variations in the gravity field and radar refraction, among others. These were resolved by a team led by Harold L Jury of Pan Am Aerospace Division in Florida from 1970-1973. Using real-time data assimilation and recursive estimation, the systematic and residual errors were narrowed down to a manageable level to permit accurate navigation.[9]\n\nPart of an orbiting satellite's broadcast included its precise orbital data. In order to ensure accuracy, the US Naval Observatory (USNO) continuously observed the precise orbits of these satellites. As a satellite's orbit deviated, the USNO would send the updated information to the satellite. Subsequent broadcasts from an updated satellite would contain its most recent ephemeris.\n\nModern systems are more direct. The satellite broadcasts a signal that contains orbital data (from which the position of the satellite can be calculated) and the precise time the signal was transmitted. Orbital data include a rough almanac for all satellites to aid in finding them, and a precise ephemeris for this satellite. The orbital ephemeris is transmitted in a data message that is superimposed on a code that serves as a timing reference. The satellite uses an atomic clock to maintain synchronization of all the satellites in the constellation. The receiver compares the time of broadcast encoded in the transmission of three (at sea level) or four different satellites, thereby measuring the time-of-flight to each satellite. Several such measurements can be made at the same time to different satellites, allowing a continual fix to be generated in real time using an adapted version of trilateration: see GNSS positioning calculation for details.\n\nEach distance measurement, regardless of the system being used, places the receiver on a spherical shell at the measured distance from the broadcaster. By taking several such measurements and then looking for a point where they meet, a fix is generated. However, in the case of fast-moving receivers, the position of the signal moves as signals are received from several satellites. In addition, the radio signals slow slightly as they pass through the ionosphere, and this slowing varies with the receiver's angle to the satellite, because that changes the distance through the ionosphere. The basic computation thus attempts to find the shortest directed line tangent to four oblate spherical shells centred on four satellites. Satellite navigation receivers reduce errors by using combinations of signals from multiple satellites and multiple correlators, and then using techniques such as Kalman filtering to combine the noisy, partial, and constantly changing data into a single estimate for position, time, and velocity.\n\n\nApplications[edit]\n\n  \nAutomotive navigation system\n\n\n\nMain article: GNSS applications\n\nFurther information: Automotive navigation system\n\nThe original motivation for satellite navigation was for military applications. Satellite navigation allows precision in the delivery of weapons to targets, greatly increasing their lethality whilst reducing inadvertent casualties from mis-directed weapons. (See Guided bomb). Satellite navigation also allows forces to be directed and to locate themselves more easily, reducing the fog of war.\n\nThe ability to supply satellite navigation signals is also the ability to deny their availability. The operator of a satellite navigation system potentially has the ability to degrade or eliminate satellite navigation services over any territory it desires.\n\n\nGlobal navigation satellite systems[edit]\n\n  \nComparison of geostationary, GPS, GLONASS, Galileo, Compass (MEO), International Space Station, Hubble Space Telescope, Iridium constellation and graveyard orbits, with the Van Allen radiation belts and the Earth to scale.[a] The Moon's orbit is around 9 as large as geostationary orbit.[b] (In the SVG file, hover over an orbit or its label to highlight it; click to load its article.)\n\n\n\n  \nLaunched GNSS satellites 1978 to 2014\n\n\n\nGPS[edit]\n\nMain article: Global Positioning System\n\nThe United States' Global Positioning System (GPS) consists of up to 32 medium Earth orbit satellites in six different orbital planes, with the exact number of satellites varying as older satellites are retired and replaced. Operational since 1978 and globally available since 1994, GPS is the world's most utilized satellite navigation system.\n\n\nGLONASS[edit]\n\nMain article: GLONASS\n\nThe formerly Soviet, and now Russian, Global'naya Navigatsionnaya Sputnikovaya Sistema, (GLObal NAvigation Satellite System or GLONASS), is a space-based satellite navigation system that provides a civilian radionavigation-satellite service and is also used by the Russian Aerospace Defence Forces. GLONASS has full global coverage with 24 satellites.\n\n\nGalileo[edit]\n\nMain article: Galileo (satellite navigation)\n\nThe European Union and European Space Agency agreed in March 2002 to introduce their own alternative to GPS, called the Galileo positioning system. Galileo became operational on 15 December 2016 (global Early Operational Capability (EOC)) [10]  At an estimated cost of €3 billion,[11] the system of 30 MEO satellites was originally scheduled to be operational in 2010. The original year to become operational was 2014.[12] The first experimental satellite was launched on 28 December 2005.[13] Galileo is expected to be compatible with the modernized GPS system. The receivers will be able to combine the signals from both Galileo and GPS satellites to greatly increase the accuracy. Galileo is expected to be in full service in 2020 and at a substantially higher cost.[2]\nThe main modulation used in Galileo Open Service signal is the Composite Binary Offset Carrier (CBOC) modulation.\n\n\nBeiDou[edit]\n\nMain article: BeiDou Navigation Satellite System\n\nBeidou started as the now-decommissioned Beidou-1, an Asia-Pacific local network on the geostationary orbits. China has indicated their plan to complete the entire second generation Beidou Navigation Satellite System (BDS or BeiDou-2, formerly known as COMPASS), by expanding current regional (Asia-Pacific) service into global coverage by 2020.[1] This BeiDou-3 system is proposed to consist of 30 MEO satellites and five geostationary satellites (IGSO). A 16-satellite regional version (covering Asia and Pacific area) was completed by December 2012. Global service was completed by December 2018.[14]\n\n\nRegional navigation satellite systems[edit]\n\nNAVIC[edit]\n\nMain article: NAVIC\n\nThe NAVIC or NAVigation with Indian Constellation is an autonomous regional satellite navigation system developed by Indian Space Research Organisation (ISRO) which would be under the total control of Indian government. The government approved the project in May 2006, with the intention of the system completed and implemented on 28 April 2016. It will consist of a constellation of 7 navigational satellites.[15] 3 of the satellites will be placed in the Geostationary orbit (GEO) and the remaining 4 in the Geosynchronous orbit(GSO) to have a larger signal footprint and lower number of satellites to map the region. It is intended to provide an all-weather absolute position accuracy of better than 7.6 meters throughout India and within a region extending approximately 1,500 km around it.[16] A goal of complete Indian control has been stated, with the space segment, ground segment and user receivers all being built in India.[17] All seven satellites, IRNSS-1A, IRNSS-1B, IRNSS-1C, IRNSS-1D, IRNSS-1E, IRNSS-1F, and IRNSS-1G, of the proposed constellation were precisely launched on 1 July 2013, 4 April 2014, 16 October 2014, 28 March 2015, 20 January 2016, 10 March 2016 and 28 April 2016 respectively from Satish Dhawan Space Centre.[18][19] \n\nIt covers India and a region extending 1,500 km (930 mi) around it, with plans for further extension. An Extended Service Area lies between the primary service area and a rectangle area enclosed by the 30th parallel south to the 50th parallel north and the 30th meridian east to the 130th meridian east, 1,500–6,000 km beyond borders.[20] The system at present consists of a constellation of seven satellites,[21][22] with two additional satellites on ground as stand-by.[23]\n\nThe constellation was in orbit as of 2018, and the system was operational from early 2018[24][25] after a system check.[26] NAVIC provides two levels of service, the \"standard positioning service\", which will be open for civilian use, and a \"restricted service\" (an encrypted one) for authorized users (including military). \n\nThere are plans to expand NavIC system by increasing constellation size from 7 to 11.[27]\n\n\nQZSS[edit]\n\nMain article: Quasi-Zenith Satellite System\n\nThe Quasi-Zenith Satellite System (QZSS) is a four-satellite regional time transfer system and enhancement for GPS covering Japan and the Asia-Oceania regions. QZSS services were available on a trial basis as of January 12, 2018, and were launched in November 2018. The first satellite was launched in September 2010.[28] An independent satellite navigation system (from GPS) with 7 satellites is planned for 2023.[29]\n\n\nComparison of systems[edit]\n\n\tSystem\n\tBeiDou\n\tGalileo\n\tGLONASS\n\tGPS\n\tNAVIC\n\tQZSS\n\n\tOwner\n\tChina\n\tEuropean Union\n\tRussia\n\tUnited States\n\tIndia\n\tJapan\n\n\tCoverage\n\tGlobal\n\tGlobal by 2020\n\tGlobal\n\tGlobal\n\tRegional\n\tRegional\n\n\tCoding\n\tCDMA\n\tCDMA\n\tFDMA & CDMA\n\tCDMA\n\tCDMA\n\tCDMA\n\n\tAltitude\n\t21,150 km (13,140 mi) (MEO)\n\t23,222 km (14,429 mi)\n\t19,130 km (11,890 mi)\n\t20,180 km (12,540 mi)\n\t36,000 km (22,000 mi)\n\t32,600 km (20,300 mi) –\n39,000 km (24,000 mi)[30]\n\n\tPeriod\n\t12.63 h (12 h 38 min) (MEO)\n\t14.08 h (14 h  5 min)\n\t11.26 h (11 h 16 min)\n\t11.97 h (11 h 58 min)\n\t23.93 h (23 h 56 min)\n\t23.93 h (23 h 56 min)\n\n\tRev./S. day\n\t17/9 (1.888...)\n\t17/10 (1.7)\n\t17/8 (2.125)\n\t2\n\t1\n\t1\n\n\tSatellites\n\t23 in orbit (Oct 2018)\n35 by 2020\n\t26 in orbit\n22 operational\n6 to be launched[31]\n\t24 by design\n24 operational\n1 commissioning\n1 in flight tests[32]\n\t31,[33]\n24 by design\n\t3 GEO,\n 5 GSO MEO\n\t4 in orbit (Oct 2017)\n7 in the future\n\n\tFrequency\n\t1.561098 GHz (B1)\n1.589742 GHz (B1-2)\n1.20714 GHz (B2)\n1.26852 GHz (B3)\n\t1.559–1.592 GHz (E1)\n1.164–1.215 GHz (E5a/b)\n1.260–1.300 GHz (E6)\n\n\n\t1.593–1.610 GHz (G1)\n1.237–1.254 GHz (G2)\n1.189–1.214 GHz (G3)\n\n\n\t1.563–1.587 GHz (L1)\n1.215–1.2396 GHz (L2)\n1.164–1.189 GHz (L5)\n\n\n\t1176.45 MHz(L5)\n2492.028 MHz (S)\n\t?\n\n\tStatus\n\tBasic nav. service by 2018 end\nto be completed by H1 2020[31]\n\tOperating since 2016\n2020 completion[31]\n\tOperational\n\tOperational\n\t7 operational\n\tOperational since\nNovember 2018\n\n\tPrecision\n\t10m (Public)\n0.1m (Encrypted)\n\t1m (Public)\n0.01m (Encrypted)\n\t4.5m – 7.4m\n\t5m (no DGPS or WAAS)\n\t10m (Public)\n0.1m (Encrypted)\n\t1m (Public)\n0.1m (Encrypted)\n\n\tSystem\n\tBeiDou\n\tGalileo\n\tGLONASS\n\tGPS\n\tNAVIC\n\tQZSS\n\n\n\nSources:[7]\n\nUsing multiple GNSS systems for user positioning increases the number of visible satellites, improves precise point positioning (PPP) and shortens the average convergence time.[34]\n\n\nAugmentation[edit]\n\nGNSS augmentation is a method of improving a navigation system's attributes, such as accuracy, reliability, and availability, through the integration of external information into the calculation process, for example, the Wide Area Augmentation System, the European Geostationary Navigation Overlay Service, the Multi-functional Satellite Augmentation System, Differential GPS, GPS-aided GEO augmented navigation (GAGAN) and inertial navigation systems.\n\n\nDORIS[edit]\n\nMain article: DORIS (geodesy)\n\nDoppler Orbitography and Radio-positioning Integrated by Satellite (DORIS) is a French precision navigation system. Unlike other GNSS systems, it is based on static emitting stations around the world, the receivers being on satellites, in order to precisely determine their orbital position. The system may be used also for mobile receivers on land with more limited usage and coverage. Used with traditional GNSS systems, it pushes the accuracy of positions to centimetric precision (and to millimetric precision for altimetric application and also allows monitoring very tiny seasonal changes of Earth rotation and deformations), in order to build a much more precise geodesic reference system.[35]\n\n\nLow Earth orbit satellite phone networks[edit]\n\nThe two current operational low Earth orbit satellite phone networks are able to track transceiver units with accuracy of a few kilometers using doppler shift calculations from the satellite. The coordinates are sent back to the transceiver unit where they can be read using AT commands or a graphical user interface.[36][37] This can also be used by the gateway to enforce restrictions on geographically bound calling plans.\n\n\nPositioning calculation[edit]\n\nMain article: GNSS positioning calculation\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\n\tAcronyms and abbreviations in avionics\n\tGeoinformatics\n\tGNSS reflectometry\n\tGPS spoofing\n\tGPS-aided geo-augmented navigation\n\tList of emerging technologies\n\tPseudolite\n\tReceiver Autonomous Integrity Monitoring\n\tSoftware GNSS Receiver\n\tSpace Integrated GPS/INS (SIGI)\n\n\n\n\nNotes[edit]\n\n\n\t^ Orbital periods and speeds are calculated using the relations 4π2R3 = T2GM and V2R = GM, where R = radius of orbit in metres, T = orbital period in seconds, V = orbital speed in m/s, G = gravitational constant ≈ 6.673×10−11 Nm2/kg2, M = mass of Earth ≈ 5.98×1024 kg.\n\n\t^ Approximately 8.6 times (in radius and length) when the moon is nearest (363 104 km ÷ 42 164 km) to 9.6 times when the moon is farthest (405 696 km ÷ 42 164 km).\n\n\n\n\n\nReferences[edit]\n\n\n\t^ a b \"Beidou satellite navigation system to cover whole world in 2020\". Eng.chinamil.com.cn. Retrieved 2011-12-30.\n\n\t^ a b \"Galileo goes live!\". europa.eu. 2016-12-14.\n\n\n\t^ Kriening, Torsten (23 January 2019). \"Japan Prepares for GPS Failure with Quasi-Zenith Satellites\". SpaceWatch.Global. Retrieved 10 August 2019.\n\n\n\t^ \"IRNSS-1G exemplifies 'Make in India', says PM\". The Statesman. 28 April 2016. Archived from the original on 23 September 2016. Retrieved 28 April 2016.\n\n\n\t^ a b c d \"A Beginner's Guide to GNSS in Europe\" (PDF). IFATCA. Archived from the original (PDF) on 27 June 2017. Retrieved 20 May 2015.\n\n\n\t^ \"Galileo General Introduction - Navipedia\". gssc.esa.int. Retrieved 2018-11-17.\n\n\n\t^ a b \"GNSS signal - Navipedia\". gssc.esa.int. Retrieved 2018-11-17.\n\n\n\t^ Nicolini, Luca; Caporali, Alessandro (9 January 2018). \"Investigation on Reference Frames and Time Systems in Multi-GNSS\". Remote Sensing. 10 (2): 80. doi:10.3390/rs10010080.\n\n\n\t^ Jury, H, 1973, Application of the Kalman Filter to Real-time Navigation using Synchronous Satellites, Proceedings of the 10th International Symposium on Space Technology and Science, Tokyo, 945-952.\n\n\t^ \"Galileo goes live!\". europa.eu. 14 December 2016.\n\n\n\t^ \"Boost to Galileo sat-nav system\". BBC News. 25 August 2006. Retrieved 2008-06-10.\n\n\n\t^ \"Commission awards major contracts to make Galileo operational early 2014\". 2010-01-07. Retrieved 2010-04-19.\n\n\n\t^ \"GIOVE-A launch News\". 2005-12-28. Retrieved 2015-01-16.\n\n\n\t^ \"The BDS-3 Preliminary System Is Completed to Provide Global Services\". news.dwnews.com. Retrieved 2018-12-27.\n\n\n\t^ \"India to develop its own version of GPS\". Rediff.com. Retrieved 2011-12-30.\n\n\n\t^ S. Anandan (2010-04-10). \"Launch of first satellite for Indian Regional Navigation Satellite system next year\". Beta.thehindu.com. Retrieved 2011-12-30.\n\n\n\t^ \"India to build a constellation of 7 navigation satellites by 2012\". Livemint.com. 2007-09-05. Retrieved 2011-12-30.\n\n\n\t^ The first satellite IRNSS-1A of the proposed constellation, developed at a cost of 16 billion (US$280 million),[3] was[4] launched on 1 July 2013 from Satish Dhawan Space Centre\n\n\t^ \"ISRO: All 7 IRNSS Satellites in Orbit by March\". gpsworld.com. 2015-10-08. Retrieved 2015-11-12.\n\n\n\t^ \"IRNSS Programme - ISRO\". www.isro.gov.in. Retrieved 2018-07-14.\n\n\n\t^ \"Orbit height and info\". Archived from the original on 30 December 2015.\n\n\n\t^ \"IRNSS details\". Archived from the original on 10 March 2016.\n\n\n\t^ \"Isro to launch 5th navigation satellite on Jan 20, first in 2016\".\n\n\n\t^ http://www.ibtimes.co.in/indias-own-gps-irnss-navic-made-by-isro-go-live-early-2018-728409\n\n\t^ \"Isro's PSLV-C32 places India's sixth navigation satellite IRNSS-1F in orbit\". Times of India.\n\n\n\t^ \"ISRO puts seventh and final IRNSS navigation satellite into orbit\". Times of India.\n\n\n\t^ IANS (2017-06-10). \"Navigation satellite clocks ticking; system to be expanded: ISRO\". The Economic Times. Retrieved 2018-01-24.\n\n\n\t^ \"JAXA Quasi-Zenith Satellite System\". JAXA. Archived from the original on 2009-03-14. Retrieved 2009-02-22.\n\n\n\t^ \"Japan mulls seven-satellite QZSS system as a GPS backup\". SpaceNews.com. 15 May 2017. Retrieved 10 August 2019.\n\n\n\t^ NASASpaceflight.com, Japan’s H-2A conducts QZSS-4 launch, William Graham, 9 October 2017\n\n\t^ a b c Irene Klotz, Tony Osborne and Bradley Perrett (Sep 12, 2018). \"The Rise Of New Navigation Satellites\". Aviation Week & Space Technology.CS1 maint: uses authors parameter (link)\n\n\n\t^ \"Information and Analysis Center for Positioning, Navigation and Timing\".\n\n\n\t^ \"GPS Space Segment\". Retrieved 2015-07-24.\n\n\n\t^ the latest performance of Galileo-only PPP and the contribution of Galileo to Multi-GNSS PPP|date=2019-05-01|authors= engyu Xiaa, Shirong Yea, Pengfei Xiaa, Lewen Zhaoa, Nana Jiangc, Dezhong Chena,Guangbao Hu|work= Advances in Space Research, Volume 63, Issue 9, 1 May 2019, Pages 2784-2795\n\n\t^ \"DORIS information page\". Jason.oceanobs.com. Retrieved 2011-12-30.\n\n\n\t^ \"Globalstar GSP-1700 manual\" (PDF). Retrieved 2011-12-30.\n\n\n\t^ [1] Archived November 9, 2005, at the Wayback Machine\n\n\n\n\n\nFurther reading[edit]\n\n\tOffice for Outer Space Affairs of the United Nations (2010), Report on Current and Planned Global and Regional Navigation Satellite Systems and Satellite-based Augmentation Systems. [2]\n\n\nExternal links[edit]\n\nInformation on specific GNSS systems[edit]\n\n\tESA information on EGNOS\n\tInformation on the Beidou system\n\tGlobal Navigation Satellite System Fundamentals\n\n\nOrganizations related to GNSS[edit]\n\n\tUnited Nations International Committee on Global Navigation Satellite Systems (ICG)\n\tInstitute of Navigation (ION) GNSS Meetings\n\tThe International GNSS Service (IGS)\n\tInternational Global Navigation Satellite Systems Society Inc (IGNSS)\n\tInternational Earth Rotation and Reference Systems Service (IERS) International GNSS Service (IGS)\n\tUS National Executive Committee for Space-Based Positioning, Navigation, and Timing\n\tUS National Geodetic Survey Orbits for the Global Positioning System satellites in the Global Navigation Satellite System\n\tUNAVCO GNSS Modernization\n\tAsia-Pacific Economic Cooperation (APEC) GNSS Implementation Team\n\n\nSupportive or illustrative sites[edit]\n\n\tGPS and GLONASS Simulation (Java applet) Simulation and graphical depiction of the motion of space vehicles, including DOP computation.\n\tGPS, GNSS, Geodesy and Navigation Concepts in depth\n\n\n\t\tv\n\tt\n\te\n\n\nTime signal stations\n\n\tLongwave\t\n\tBPC\n\tBPL\n\tBSF\n\tDCF77\n\tJJY\n\tRBU\n\tRJH (Beta)\n\tRNS (CHAYKA)\n\tRTZ\n\tMSF\n\tTDF\n\tWWVB\n\n\n\n\n\tShortwave\t\n\tBPM\n\tCHU\n\tEBC\n\tHD2IOA\n\tHLA\n\tJN53DV\n\tLOL\n\tRWM\n\tWWV\n\tWWVH (Hawaii, USA)\n\tYVTO\n\n\n\n\n\tVHF/FM/UHF\t\n\tRDS CT\n\n\n\n\n\tSatellite\t\n\tGPS\n\tBeiDou\n\tGalileo\n\tGLONASS\n\tIRNSS\n\tQZSS\n\n\n\n\n\tDefunct\t\n\tATA\n\tBSF (Shortwave)\n\tHBG\n\tNAA\n\tWWVL\n\tOMA\n\tOLB5\n\tVNG\n\tY3S\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSatellite navigation systems\n\n\tOperational\t\n\tBeiDou\n\tDORIS\n\tGalileo\n\tGLONASS\n\tGPS / NavStar\n\tIRNSS / NAVIC\n\n\n\n\n\tHistorical\t\n\tBDS / BeiDou-1\n\tTransit\n\tTimation\n\tTsiklon\n\n\n\n\n\tGNSS augmentation\t\n\tEGNOS\n\tGAGAN\n\tGPS·C (retired)\n\tJPALS\n\tLAAS\n\tMSAS\n\tNTRIP\n\tQZSS / Michibiki\n\tStarFire\n\tWAAS\n\n\n\n\n\tRelated topics\t\n\tGNSS reflectometry\n\tKalman filter\n\tWavelet\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpaceflight\n\n\tGeneral\t\n\tAstrodynamics\n\tHistory\n\tTimeline\n\tSpace Race\n\tAsian Space Race\n\tRecords\n\tAccidents and incidents\n\n\n\tSpace policy\n\tAustralia\n\tChina\n\tEuropean Union\n\tIndia\n\tJapan\n\tRussia\n\tSoviet Union\n\tUnited States\n\n\n\tSpace law\n\tOuter Space Treaty\n\tRescue Agreement\n\tSpace Liability Convention\n\tRegistration Convention\n\tMoon Treaty\n\n\n\tPrivate spaceflight\n\n\n\n\t\n\n\tApplications\t\n\tAstronomy\n\tEarth observation\n\tArchaeology\n\tImagery and mapping\n\tReconnaissance\n\tWeather and environment monitoring\n\n\n\tSatellite communications\n\tInternet\n\tRadio\n\tTelephone\n\tTelevision\n\n\n\tSatellite navigation\n\tCommercial use of space\n\tSpace launch market competition\n\tMilitarisation of space\n\tSpace architecture\n\tSpace exploration\n\tSpace research\n\tSpace technology\n\tSpace weather\n\n\n\n\n\tHuman spaceflight\t\n\tGeneral\t\n\tAstronaut\n\tcommercial\n\n\n\tLife support system\n\tAnimals in space\n\tBioastronautics\n\tSpace suit\n\n\n\tExtravehicular activity\n\tWeightlessness\n\tSpace toilet\n\tSpace tourism\n\tSpace colonization\n\n\n\n\n\tPrograms\t\n\tVostok\n\tMercury\n\tVoskhod\n\tGemini\n\tSoyuz\n\tApollo\n\tSkylab\n\tApollo–Soyuz\n\n\n\tSpace Shuttle\n\tMir\n\tShuttle–Mir\n\n\n\tInternational Space Station\n\tShenzhou\n\tTiangong\n\n\n\n\n\tHealth issues\t\n\tEffect of spaceflight on the human body\n\tSpace adaptation syndrome\n\n\n\tHealth threat from cosmic rays\n\tSpace psychology\n\tPsychological and sociological effects\n\n\n\tSpace and survival\n\tSpace medicine\n\tSpace nursing\n\n\n\n\n\n\n\n\tSpacecraft\t\n\tLaunch vehicle\n\tRocket\n\tSpaceplane\n\tRobotic spacecraft\n\tSatellite\n\tSpace probe\n\tLander\n\tRover\n\tSelf-replicating spacecraft\n\tSpace telescope\n\n\n\tSpacecraft propulsion\n\tRocket engine\n\tElectric propulsion\n\tSolar sail\n\tGravity assist\n\n\n\n\n\n\n\tDestinations\t\n\tSub-orbital\n\tOrbital\n\tGeocentric\n\tGeosynchronous\n\n\n\tInterplanetary\n\tInterstellar\n\tIntergalactic\n\n\n\n\n\tSpace launch\t\n\tDirect ascent\n\tEscape velocity\n\tExpendable and reusable launch systems\n\tLaunch pad\n\tNon-rocket spacelaunch\n\tSpaceport\n\n\n\n\n\tGround segment\t\n\tFlight controller\n\tGround station\n\tPass\n\tMission control center\n\n\n\n\n\tSpace agencies\t\n\t CoNAE\n\t ASA\n\t AEB\n\t CSA\n\t CNSA\n\t ESA\n\t CNES\n\t DLR\n\t ISRO\n\t LAPAN\n\t ISA\n\t ISA\n\t ASI\n\t AEM\n\t JAXA\n\t NADA\n\t KARI\n\t SUPARCO\n\t Roscosmos\n\t SNSA\n\t SSAU\n\t UKSA\n\t NASA\n\n\n\n\n\t\n\t  Category\n\t  Portal\n\t  WikiProject\n\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4202846-2\n\tLCCN: sh85008239\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Satellite_navigation&oldid=917673579\"\n\n\t\t\n\t\tCategories: \tAmerican inventions\n\tAircraft instruments\n\tAvionics\n\tGeodesy\n\tMaritime communication\n\tNavigation\n\tSatellite navigation systems\n\n\nHidden categories: \tCS1 maint: uses authors parameter\n\tWebarchive template wayback links\n\tArticles with short description\n\tArticles containing potentially dated statements from October 2018\n\tAll articles containing potentially dated statements\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tAsturianu\n\tবাংলা\n\tБългарски\n\tBrezhoneg\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tEspañol\n\tEsperanto\n\tEstremeñu\n\tفارسی\n\tFrançais\n\tGaeilge\n\t한국어\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tҚазақша\n\tКыргызча\n\tLatviešu\n\tLingála\n\tമലയാളം\n\tNederlands\n\t日本語\n\tNorsk\n\tOccitan\n\tOʻzbekcha/ўзбекча\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSimple English\n\tSlovenčina\n\tСрпски / srpski\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 24 September 2019, at 22:34 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "7", "dc:title": "Satellite navigation - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/GPSTest_GNSS_2019_Android.png/1200px-GPSTest_GNSS_2019_Android.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-satellite_navigation", "title": "Satellite navigation - Wikipedia"}}