{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommunications satellite - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tCommunications satellite\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Satellite communication)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nAn Advanced Extremely High Frequency communications orion satellite centre relays secure communications for the United States  and other allied countries.\n\n\n\nA communications satellite is an artificial satellite that relays and amplifies radio telecommunications signals via a transponder; it creates a communication channel between a source transmitter and a receiver at different locations on Earth. Communications satellites are used for television, telephone, radio, internet, and military applications. There are 2,134 communications satellites in Earth's orbit, used by both private and government organizations.[1]  Many are in geostationary orbit 22,236 miles (35,785 km) above the equator, so that the satellite appears stationary at the same point in the sky, so the satellite dish antennas of ground stations can be aimed permanently at that spot and do not have to move to track it.\n\nThe high frequency radio waves used for telecommunications links travel by line of sight and so are obstructed by the curve of the Earth.  The purpose of communications satellites is to relay the signal around the curve of the Earth allowing communication between widely separated geographical points.[2]  Communications satellites use a wide range of radio and microwave frequencies. To avoid signal interference, international organizations have regulations for which frequency ranges or \"bands\" certain organizations are allowed to use. This allocation of bands minimizes the risk of signal interference.[3]\n\n\nContents\n\n\n\t1 History\n\t2 Satellite orbits\n\t2.1 Low Earth orbit (LEO)\n\t2.2 Satellite constellation\n\t2.3 Medium Earth orbit (MEO)\n\t2.3.1 Example\n\n\n\n\t2.4 Geostationary orbit (GEO)\n\t2.4.1 Examples\n\n\n\n\t2.5 Molniya orbit\n\t2.6 Polar orbit\n\n\n\n\t3 Structure\n\t4 Frequency Allocation for satellite systems\n\t5 Applications\n\t5.1 Telephone\n\t5.2 Television\n\t5.3 Radio broadcasting\n\t5.4 Amateur radio\n\t5.5 Internet access\n\t5.6 Military\n\n\n\n\t6 See also\n\t7 References\n\t7.1 Notes\n\t7.2 Citations\n\n\n\n\t8 External links\n\n\n\n\n\nHistory[edit]\n\nThe concept of the geostationary communications satellite was first proposed by Arthur C. Clarke, along with Vahid K. Sanadi building on work by Konstantin Tsiolkovsky.  In October 1945, Clarke published an article titled \"Extraterrestrial Relays\" in the British magazine Wireless World.[4] The article described the fundamentals behind the deployment of artificial satellites in geostationary orbits for the purpose of relaying radio signals. Thus, Arthur C. Clarke is often quoted as being the inventor of the communications satellite and the term 'Clarke Belt' employed as a description of the orbit.[5]\n\nDecades later a project named Communication Moon Relay was a telecommunication project carried out by the United States Navy. Its objective was to develop a secure and reliable method of wireless communication by using the Moon as a passive reflector and a natural communications satellite.\n\nThe first artificial Earth satellite was Sputnik 1. Put into orbit by the Soviet Union on October 4, 1957, it was equipped with an on-board radio-transmitter that worked on two frequencies: 20.005 and 40.002  MHz. Sputnik 1 was launched as a major step in the exploration of space and rocket development. However, it was not placed in orbit for the purpose of sending data from one point on earth to another.\n\nThe first satellite to relay communications was Pioneer 1, an intended lunar probe. Though the spacecraft only made it about halfway to the moon, it flew high enough to carry out the proof of concept relay of telemetry across the world, first from Cape Canaveral to Manchester, England; then from Hawaii to Cape Canaveral; and finally, across the world from Hawaii to Manchester.[6]\n\nThe first satellite purpose-built to relay communications was NASA's Project SCORE in 1958, which used a tape recorder to store and forward voice messages. It was used to send a Christmas greeting to the world from U.S. President Dwight D. Eisenhower.[7] Courier 1B, built by Philco, launched in 1960, was the world's first active repeater satellite.\n\nThe first artificial satellite used solely to further advances in global communications was a balloon named Echo 1.[8] Echo 1 was the world's first artificial communications satellite capable of relaying signals to other points on Earth. It soared 1,600 kilometres (1,000 mi) above the planet after its Aug. 12, 1960 launch, yet relied on humanity's oldest flight technology — ballooning. Launched by NASA, Echo 1 was a 30-metre (100 ft) aluminized PET film balloon that served as a passive reflector for radio communications. The world's first inflatable satellite — or \"satelloon\", as they were informally known — helped lay the foundation of today's satellite communications. The idea behind a communications satellite is simple: Send data up into space and beam it back down to another spot on the globe. Echo 1 accomplished this by essentially serving as an enormous mirror, 10 stories tall, that could be used to reflect communications signals.\n\nThere are two major classes of communications satellites, passive and active. Passive satellites only reflect the signal coming from the source, toward the direction of the receiver. With passive satellites, the reflected signal is not amplified at the satellite, and only a very small amount of the transmitted energy actually reaches the receiver.  Since the satellite is so far above Earth, the radio signal is attenuated due to free-space path loss, so the signal received on Earth is very, very weak. Active satellites, on the other hand, amplify the received signal before retransmitting it to the receiver on the ground.[3] Passive satellites were the first communications satellites, but are little used now.\nTelstar was the second active, direct relay communications satellite. Belonging to AT&T as part of a multi-national agreement between AT&T, Bell Telephone Laboratories, NASA, the British General Post Office, and the French National PTT (Post Office) to develop satellite communications, it was launched by NASA from Cape Canaveral on July 10, 1962, in the first privately sponsored space launch. Relay 1 was launched on December 13, 1962, and it became the first satellite to transmit across the Pacific Ocean on November 22, 1963.[9]\n\nAn immediate antecedent of the geostationary satellites was the Hughes Aircraft Company's Syncom 2, launched on July 26, 1963. Syncom 2 was the first communications satellite in a geosynchronous orbit. It revolved around the earth once per day at constant speed, but because it still had north-south motion, special equipment was needed to track it. Its successor, Syncom 3 was the first geostationary communications satellite. Syncom 3 obtained a geosynchronous orbit, without a north-south motion, making it appear from the ground as a stationary object in the sky.\n\nBeginning with the Viking program,[a] all Mars landers, aside from Mars Pathfinder, have used orbiting spacecraft as communications satellites for relaying their data to Earth. The landers use UHF transmitters to send their data to the orbiters, which then relay the data to Earth using either X band or Ka band frequencies. These higher frequencies, along with more powerful transmitters and larger antennas, permit the orbiters to send the data much faster than the landers could manage transmitting directly to Earth, which conserves valuable time on the receiving antennas.[10]\n\n\nSatellite orbits[edit]\n\nCommunications satellites usually have one of three primary types of orbit, while other orbital classifications are used to further specify orbital details.\n\n\n\tGeostationary satellites have a geostationary orbit (GEO), which is 22,236 miles (35,785 km) from Earth's surface. This orbit has the special characteristic that the apparent position of the satellite in the sky when viewed by a ground observer does not change, the satellite appears to \"stand still\" in the sky.  This is because the satellite's orbital period is the same as the rotation rate of the Earth.  The advantage of this orbit is that ground antennas do not have to track the satellite across the sky, they can be fixed to point at the location in the sky the satellite appears.\n\tMedium Earth orbit (MEO) satellites are closer to Earth. Orbital altitudes range from 2,000 to 36,000 kilometres (1,200 to 22,400 mi) above Earth.\n\tThe region below medium orbits is referred to as low Earth orbit (LEO), and is about 160 to 2,000 kilometres (99 to 1,243 mi) above Earth.\n\n\nAs satellites in MEO and LEO orbit the Earth faster, they do not remain visible in the sky to a fixed point on Earth continually like a geostationary satellite, but appear to a ground observer to cross the sky and \"set\" when they go behind the Earth. Therefore, to provide continuous communications capability with these lower orbits requires a larger number of satellites, so one will always be in the sky for transmission of communication signals.  However, due to their relatively small distance to the Earth their signals are stronger.[clarification needed]\n\n\nLow Earth orbit (LEO)[edit]\n\nMain article: Low Earth orbit\n\n  \nLow Earth orbit in Cyan\n\n\n\nA low Earth orbit (LEO) typically is a circular orbit about 160 to 2,000 kilometres (99 to 1,243 mi) above the earth's surface and, correspondingly, a period (time to revolve around the earth) of about 90 minutes.[11]\n\nBecause of their low altitude, these satellites are only visible from within a radius of roughly 1,000 kilometres (620 mi) from the sub-satellite point. In addition, satellites in low earth orbit change their position relative to the ground position quickly. So even for local applications, many satellites are needed if the mission requires uninterrupted connectivity.\n\nLow-Earth-orbiting satellites are less expensive to launch into orbit than geostationary satellites and, due to proximity to the ground, do not require as high signal strength (Recall that signal strength falls off as the square of the distance from the source, so the effect is dramatic). Thus there is a trade off between the number of satellites and their cost.\n\nIn addition, there are important differences in the onboard and ground equipment needed to support the two types of missions.\n\n\nSatellite constellation[edit]\n\nMain article: Satellite constellation\n\nA group of satellites working in concert is known as a satellite constellation. Two such constellations, intended to provide satellite phone services, primarily to remote areas, are the Iridium and Globalstar systems. The Iridium system has 66 satellites.\n\nIt is also possible to offer discontinuous coverage using a low-Earth-orbit satellite capable of storing data received while passing over one part of Earth and transmitting it later while passing over another part.  This will be the case with the CASCADE system of Canada's CASSIOPE communications satellite. Another system using this store and forward method is Orbcomm.\n\n\nMedium Earth orbit (MEO)[edit]\n\nMain article: Medium Earth orbit\n\nA MEO is a satellite in orbit somewhere between 2,000 and 35,786 kilometres (1,243 and 22,236 mi) above the earth's surface.  MEO satellites are similar to LEO satellites in functionality. MEO satellites are visible for much longer periods of time than LEO satellites, usually between 2 and 8 hours. MEO satellites have a larger coverage area than LEO satellites. A MEO satellite's longer duration of visibility and wider footprint means fewer satellites are needed in a MEO network than a LEO network. One disadvantage is that a MEO satellite's distance gives it a longer time delay and weaker signal than a LEO satellite, although these limitations are not as severe as those of a GEO satellite.\n\nLike LEOs, these satellites do not maintain a stationary distance from the earth.  This is in contrast to the geostationary orbit, where satellites are always 35,786 kilometres (22,236 mi) from the earth.\n\nTypically the orbit of a medium earth orbit satellite is about 16,000 kilometres (10,000 mi) above earth. In various patterns, these satellites make the trip around earth in anywhere from 2 to 8 hours.\n\n\nExample[edit]\n\nIn 1962, the first communications satellite, Telstar, was launched. It was a medium earth orbit satellite designed to help facilitate high-speed telephone signals. Although it was the first practical way to transmit signals over the horizon, its major drawback was soon realized. Because its orbital period of about 2.5 hours did not match the Earth's rotational period of 24 hours, continuous coverage was impossible. It was apparent that multiple MEOs needed to be used in order to provide continuous coverage.\n\n\nGeostationary orbit (GEO)[edit]\n\nMain article: Geostationary orbit\n\n  \nGeostationary orbit\n\n\n\nTo an observer on Earth, a satellite in a geostationary orbit appears motionless, in a fixed position in the sky.  This is because it revolves around the Earth at Earth's own angular velocity (one revolution per sidereal day, in an equatorial orbit).\n\nA geostationary orbit is useful for communications because ground antennas can be aimed at the satellite without their having to track the satellite's motion. This is relatively inexpensive.\n\nIn applications that require many ground antennas, such as DirecTV distribution, the savings in ground equipment can more than outweigh the cost and complexity of placing a satellite into orbit.\n\n\nExamples[edit]\n\n\tThe first geostationary satellite was Syncom 3, launched on August 19, 1964, and used for communication across the Pacific starting with television coverage of the 1964 Summer Olympics. Shortly after Syncom 3, Intelsat I, aka Early Bird, was launched on April 6, 1965, and placed in orbit at 28° west longitude. It was the first geostationary satellite for telecommunications over the Atlantic Ocean.\n\tOn November 9, 1966, Canada's first geostationary satellite serving the continent, Anik A1, was launched by Telesat Canada, with the United States following suit with the launch of Westar 1 by Western Union on April 13, 1967.\n\tOn May 30, 1977, the first geostationary communications satellite in the world to be three-axis stabilized was launched: the experimental satellite ATS-6 built for NASA.\n\tAfter the launches of the Telstar through Westar 1 satellites, RCA Americom (later GE Americom, now SES) launched Satcom 1 in 1975.  It was Satcom 1 that was instrumental in helping early cable TV channels such as WTBS (now TBS), HBO, CBN (now Freeform) and The Weather Channel become successful, because these channels distributed their programming to all of the local cable TV headends using the satellite.  Additionally, it was the first satellite used by broadcast television networks in the United States, like ABC, NBC, and CBS, to distribute programming to their local affiliate stations.  Satcom 1 was widely used because it had twice the communications capacity of the competing Westar 1 in America (24 transponders as opposed to the 12 of Westar 1), resulting in lower transponder-usage costs. Satellites in later decades tended to have even higher transponder numbers.\n\n\nBy 2000, Hughes Space and Communications (now Boeing Satellite Development Center) had built nearly 40 percent of the more than one hundred satellites in service worldwide. Other major satellite manufacturers include Space Systems/Loral, Orbital Sciences Corporation with the Star Bus series, Indian Space Research Organisation, Lockheed Martin (owns the former RCA Astro Electronics/GE Astro Space business), Northrop Grumman, Alcatel Space, now Thales Alenia Space, with the Spacebus series, and Astrium.\n\n\nMolniya orbit[edit]\n\nMain article: Molniya orbit\n\nGeostationary satellites must operate above the equator and therefore appear lower on the horizon as the receiver gets farther from the equator. This will cause problems for extreme northerly latitudes, affecting connectivity and causing multipath interference (caused by signals reflecting off the ground and into the ground antenna).\n\nThus, for areas close to the North (and South) Pole, a geostationary satellite may appear below the horizon. Therefore, Molniya orbit satellites have been launched, mainly in Russia, to alleviate this problem.\n\nMolniya orbits can be an appealing alternative in such cases. The Molniya orbit is highly inclined, guaranteeing good elevation over selected positions during the northern portion of the orbit. (Elevation is the extent of the satellite's position above the horizon. Thus, a satellite at the horizon has zero elevation and a satellite directly overhead has elevation of 90 degrees.)\n\nThe Molniya orbit is designed so that the satellite spends the great majority of its time over the far northern latitudes, during which its ground footprint moves only slightly. Its period is one half day, so that the satellite is available for operation over the targeted region for six to nine hours every second revolution. In this way a constellation of three Molniya satellites (plus in-orbit spares) can provide uninterrupted coverage.\n\nThe first satellite of the Molniya series was launched on April 23, 1965 and was used for experimental transmission of TV signals from a Moscow uplink station to downlink stations located in Siberia and the Russian Far East, in Norilsk, Khabarovsk, Magadan and Vladivostok. In November 1967 Soviet engineers created a unique system of national TV network of satellite television, called Orbita, that was based on Molniya satellites.\n\n\nPolar orbit[edit]\n\nMain article: Polar orbit\n\nIn the United States, the National Polar-orbiting Operational Environmental Satellite System (NPOESS) was established in 1994 to consolidate the polar satellite operations of\nNASA (National Aeronautics and Space Administration) \nNOAA (National Oceanic and Atmospheric Administration). NPOESS manages a number of satellites for various purposes; for example, METSAT for meteorological satellite, EUMETSAT for the European branch of the program, and METOP for meteorological operations.\n\nThese orbits are sun synchronous, meaning that they cross the equator at the same local time each day. For example, the satellites in the NPOESS (civilian) orbit will cross the equator, going from south to north, at times 1:30 P.M., 5:30 P.M., and 9:30 P.M.\n\n\nStructure[edit]\n\nCommunications Satellites are usually composed of the following subsystems:\n\n\n\tCommunication Payload, normally composed of transponders, antennas, and switching systems\n\tEngines used to bring the satellite to its desired orbit\n\tA station keeping tracking and stabilization subsystem used to keep the satellite in the right orbit, with its antennas pointed in the right direction, and its power system pointed towards the sun\n\tPower subsystem, used to power the Satellite systems, normally composed of solar cells, and batteries that maintain power during solar eclipse\n\tCommand and Control subsystem, which maintains communications with ground control stations. The ground control Earth stations monitor the satellite performance and control its functionality during various phases of its life-cycle.\n\n\nThe bandwidth available from a satellite depends upon the number of transponders provided by the satellite. Each service (TV, Voice, Internet, radio) requires a different amount of bandwidth for transmission. This is typically known as link budgeting and a network simulator can be used to arrive at the exact value.\n\n\nFrequency Allocation for satellite systems[edit]\n\nAllocating frequencies to satellite services is a complicated process which requires international coordination and planning. This is carried out under the auspices of the International Telecommunication Union (ITU).\nTo facilitate frequency planning, the world is divided into three regions:\nRegion 1: Europe, Africa, what was formerly the Soviet Union, and Mongolia\nRegion 2: North and South America and Greenland\nRegion 3: Asia (excluding region 1 areas), Australia, and the southwest Pacific\n\nWithin these regions, frequency bands are allocated to various satellite services, although a given service may be allocated different frequency bands in different regions. Some of the services provided by satellites are:\n\n\n\tFixed satellite service (FSS)\n\tBroadcasting satellite service (BSS)\n\tMobile-satellite service\n\tRadionavigation-satellite service\n\tMeteorological-satellite service\n\n\nApplications[edit]\n\nTelephone[edit]\n\nMain article: Satellite phone\n\n  \nAn Iridium satellite\n\n\n\nThe first and historically most important application for communication satellites was in intercontinental long distance telephony. The fixed Public Switched Telephone Network relays telephone calls from land line telephones to an earth station, where they are then transmitted to a geostationary satellite.  The downlink follows an analogous path.  Improvements in submarine communications cables through the use of fiber-optics caused some decline in the use of satellites for fixed telephony in the late 20th century.\n\nSatellite communications are still used in many applications today. Remote islands such as Ascension Island, Saint Helena, Diego Garcia, and Easter Island, where no submarine cables are in service, need satellite telephones. There are also regions of some continents and countries where landline telecommunications are rare to nonexistent, for example large regions of South America, Africa, Canada, China, Russia, and Australia. Satellite communications also provide connection to the edges of Antarctica and Greenland. Other land use for satellite phones are rigs at sea, a back up for hospitals, military, and recreation. Ships at sea, as well as planes, often use satellite phones.[12]\n\nSatellite phone systems can be accomplished by a number of means. On a large scale, often there will be a local telephone system in an isolated area with a link to the telephone system in a main land area. There are also services that will patch a radio signal to a telephone system. In this example, almost any type of satellite can be used. Satellite phones connect directly to a constellation of either geostationary or low-Earth-orbit satellites. Calls are then forwarded to a satellite teleport connected to the Public Switched Telephone Network .\n\n\nTelevision[edit]\n\nMain article: Satellite television\n\nAs television became the main market, its demand for simultaneous delivery of relatively few signals of large bandwidth to many receivers being a more precise match for the capabilities of geosynchronous comsats.  Two satellite types are used for North American television and radio: Direct broadcast satellite (DBS), and Fixed Service Satellite (FSS).\n\nThe definitions of FSS and DBS satellites outside of North America, especially in Europe, are a bit more ambiguous. Most satellites used for direct-to-home television in Europe have the same high power output as DBS-class satellites in North America, but use the same linear polarization as FSS-class satellites. Examples of these are the Astra, Eutelsat, and Hotbird spacecraft in orbit over the European continent. Because of this, the terms FSS and DBS are more so used throughout the North American continent, and are uncommon in Europe.\n\nFixed Service Satellites use the C band, and the lower portions of the Ku band. They are normally used for broadcast feeds to and from television networks and local affiliate stations (such as program feeds for network and syndicated programming, live shots, and backhauls), as well as being used for distance learning by schools and universities, business television (BTV), Videoconferencing, and general commercial telecommunications. FSS satellites are also used to distribute national cable channels to cable television headends.\n\nFree-to-air satellite TV channels are also usually distributed on FSS satellites in the Ku band. The Intelsat Americas 5, Galaxy 10R and AMC 3 satellites over North America provide a quite large amount of FTA channels on their Ku band transponders.\n\nThe American Dish Network DBS service has also recently used FSS technology as well for their programming packages requiring their SuperDish antenna, due to Dish Network needing more capacity to carry local television stations per the FCC's \"must-carry\" regulations, and for more bandwidth to carry HDTV channels.\n\nA direct broadcast satellite is a communications satellite that transmits to small DBS satellite dishes (usually 18 to 24 inches or 45 to 60 cm in diameter). Direct broadcast satellites generally operate in the upper portion of the microwave Ku band. DBS technology is used for DTH-oriented (Direct-To-Home) satellite TV services, such as DirecTV and DISH Network in the United States, Bell TV and Shaw Direct in Canada, Freesat and Sky in the UK, Ireland, and New Zealand and DSTV in South Africa.\n\nOperating at lower frequency and lower power than DBS, FSS satellites require a much larger dish for reception (3 to 8 feet (1 to 2.5 m) in diameter for Ku band, and 12 feet (3.6 m) or larger for C band).  They use linear polarization for each of the transponders' RF input and output (as opposed to circular polarization used by DBS satellites), but this is a minor technical difference that users do not notice. FSS satellite technology was also originally used for DTH satellite TV from the late 1970s to the early 1990s in the United States in the form of TVRO (TeleVision Receive Only) receivers and dishes. It was also used in its Ku band form for the now-defunct Primestar satellite TV service.\n\nSome satellites have been launched that have transponders in the Ka band, such as DirecTV's SPACEWAY-1 satellite, and Anik F2. NASA and ISRO[13][14] have also launched experimental satellites carrying Ka band beacons recently.[15]\n\nSome manufacturers have also introduced special antennas for mobile reception of DBS television. Using Global Positioning System (GPS) technology as a reference, these antennas automatically re-aim to the satellite no matter where or how the vehicle (on which the antenna is mounted) is situated.  These mobile satellite antennas are popular with some recreational vehicle owners.  Such mobile DBS antennas are also used by JetBlue Airways for DirecTV (supplied by LiveTV, a subsidiary of JetBlue), which passengers can view on-board on LCD screens mounted in the seats.\n\n\nRadio broadcasting[edit]\n\nMain article: Satellite radio\n\nSatellite radio offers audio broadcast services in some countries, notably the United States. Mobile services allow listeners to roam a continent, listening to the same audio programming anywhere.\n\nA satellite radio or subscription radio (SR) is a digital radio signal that is broadcast by a communications satellite, which covers a much wider geographical range than terrestrial radio signals.\n\nSatellite radio offers a meaningful alternative to ground-based radio services in some countries, notably the United States. Mobile services, such as SiriusXM, and Worldspace, allow listeners to roam across an entire continent, listening to the same audio programming anywhere they go. Other services, such as Music Choice or Muzak's satellite-delivered content, require a fixed-location receiver and a dish antenna. In all cases, the antenna must have a clear view to the satellites. In areas where tall buildings, bridges, or even parking garages obscure the signal, repeaters can be placed to make the signal available to listeners.\n\nInitially available for broadcast to stationary TV receivers, by 2004 popular mobile direct broadcast applications made their appearance with the arrival of two satellite radio systems in the United States: Sirius and XM Satellite Radio Holdings. Later they merged to become the conglomerate SiriusXM.\n\nRadio services are usually provided by commercial ventures and are subscription-based. The various services are proprietary signals, requiring specialized hardware for decoding and playback. Providers usually carry a variety of news, weather, sports, and music channels, with the music channels generally being commercial-free.\n\nIn areas with a relatively high population density, it is easier and less expensive to reach the bulk of the population with terrestrial broadcasts. Thus in the UK and some other countries, the contemporary evolution of radio services is focused on Digital Audio Broadcasting (DAB) services or HD Radio, rather than satellite radio.\n\n\nAmateur radio[edit]\n\nMain article: Amateur radio satellite\n\nAmateur radio operators have access to amateur satellites, which have been designed specifically to carry amateur radio traffic. Most such satellites operate as spaceborne repeaters, and are generally accessed by amateurs equipped with UHF or VHF radio equipment and highly directional antennas such as Yagis or dish antennas. Due to launch costs, most current amateur satellites are launched into fairly low Earth orbits, and are designed to deal with only a limited number of brief contacts at any given time. Some satellites also provide data-forwarding services using the X.25 or similar protocols.\n\n\nInternet access[edit]\n\nMain article: Satellite Internet access\n\nAfter the 1990s, satellite communication technology has been used as a means to connect to the Internet via broadband data connections. This can be very useful for users who are located in remote areas, and cannot access a broadband connection, or require high availability of services.\n\n\nMilitary[edit]\n\nCommunications satellites are used for military communications applications, such as Global Command and Control Systems. Examples of military systems that use communication satellites are the MILSTAR, the DSCS, and the FLTSATCOM of the United States, NATO satellites, United Kingdom satellites (for instance Skynet), and satellites of the former Soviet Union. India has launched its first Military Communication satellite GSAT-7, its transponders operate in UHF, F, C and Ku band bands.[16] Typically military satellites operate in the UHF, SHF (also known as X-band) or EHF (also known as Ka band) frequency bands.\n\n\nFurther information: X Band Satellite Communication\n\nSee also[edit]\n\n\tCommercialization of space\n\tSpace pollution\n\tList of communication satellite companies\n\tList of communications satellite firsts\n\tNewSpace\n\tReconnaissance satellite\n\tSatcom On The Move\n\tSatellite space segment\n\tHistory of telecommunication\n\n\nReferences[edit]\n\nNotes[edit]\n\n\n\t^ The last Viking lander reverted to Earth-direct communications after both orbiters expired.\n\n\n\n\n\nCitations[edit]\n\n\n\t^ Labrador, Virgil (2015-02-19). \"satellite communication\". Britannica.com. Retrieved 2016-02-10.\n\n\t^ \"Satellites - Communication Satellites\". Satellites.spacesim.org. Retrieved 2016-02-10.\n\n\n\t^ a b \"Military Satellite Communications Fundamentals | The Aerospace Corporation\". Aerospace. 2010-04-01. Archived from the original on 2015-09-05. Retrieved 2016-02-10.\n\n\n\t^ Extraterrestrial Relays\n\n\t^ \"Arthur C. Clarke, inventor of satellite, visionary in technology, dead at 90\". Engadget.com. 2008-03-18. Retrieved 2016-02-10.\n\n\n\t^ Marcus, Gideon. \"\"Pioneering Space II\"\" (PDF).\n\n\n\t^ Martin, Donald; Anderson, Paul; Bartamian, Lucy (March 16, 2007). \"Communications Satellites\" (5th ed.). AIAA. ISBN 978-1884989193.\n\n\n\t^ ECHO 1 space.com\n\n\t^ \"Significant Achievements in Space Communications and Navigation, 1958-1964\" (PDF). NASA-SP-93. NASA. 1966. pp. 30–32. Retrieved 2009-10-31.\n\n\n\t^ \"Talking to Martians: Communications with Mars Curiosity Rover\". Steven Gordon's Home Page. Retrieved 17 March 2017.\n\n\n\t^ \"IADC Space Debris Mitigation Guidelines\" (PDF). INTER-AGENCY SPACE DEBRIS COORDINATION COMMITTEE: Issued by Steering Group and Working Group 4. September 2007. Region A, Low Earth Orbit (or LEO) Region – spherical region that extends from the Earth's surface up to an altitude (Z) of 2,000 km\n\n\n\t^ Connected | Maritime Archived 2013-08-15 at the Wayback Machine. Iridium. Retrieved on 2013-09-19.\n\n\t^ \"GSAT-14\". ISRO. Archived from the original on 8 January 2014. Retrieved 16 January 2014.\n\n\n\t^ \"Indian GSLV successfully lofts GSAT-14 satellite\". NASA Space Flight. 4 January 2014. Retrieved 16 January 2014.\n\n\n\t^ \"DIRECTV's Spaceway F1 Satellite Launches New Era in High-Definition Programming; Next Generation Satellite Will Initiate Historic Expansion of DIRECTV\". SpaceRef. Retrieved 2012-05-11.\n\n\n\t^ India's first 'military' satellite GSAT-7 put into earth's orbit. NDTV.com (2013-09-04). Retrieved on 2013-09-18.\n\n\n\n\nExternal links[edit]\n\n\tSatellite Industry Association\n\tEuropean Satellite Operators Association\n\tSatellite Glossary\n\tSatMagazine\n\tSatNews\n\tThe future of communication satellite business\n\tCommunications satellites short history by David J. Whalen\n\tBeyond The Ionosphere: Fifty Years of Satellite Communication (NASA SP-4217, 1997)\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSatellite communications\n\n\tMain articles\t\n\tSatellite television\n\tSatellite radio\n\tRelay satellite\n\tTransponder\n\tSatellite Internet access\n\tAmateur satellite\n\tGround station\n\tHigh-throughput satellite\n\n\n\n\n\tHardware\t\n\tSatellite data unit\n\tSatellite dish\n\tSatellite modem\n\tSatellite phone\n\tSpacebus\n\tVery-small-aperture terminal\n\n\n\n\n\tSatellite radio / TV\t\n\tDVB-SH\n\tS-DMB\n\tDVB-RCS\n\tDVB-S2\n\tDigital audio radio service\n\n\n\n\n\tBroadcast companies\t\n\tAfriStar\n\tAstra Digital Radio\n\tDirecTV\n\tDish Network\n\tSirius XM Holdings\n\tSirius Satellite Radio\n\n\n\tSky Television plc\n\tViasat [Nordics]\n\t1worldspace\n\n\n\n\n\tRelay satellite companies\t\n\tEchoStar\n\tEutelsat\n\tGlobalstar\n\tHughes\n\tInmarsat\n\tIntelsat\n\tIridium\n\tSED Systems\n\tSES\n\tTelesat\n\tTooway\n\tViasat, Inc. [United States]\n\n\n\n\n\tSatellite manufacturers\t\n\tAirbus\n\tBoeing\n\tINVAP\n\tLockheed Martin\n\tNorthrop Grumman\n\tSSL\n\tThales Alenia Space\n\n\n\n\n\tTrade organizations\t\n\tConsultative Committee for Space Data Systems\n\tETSI Satellite Digital Radio\n\n\n\n\n\tLists\t\n\tList of communications satellite firsts\n\tList of communication satellite companies\n\n\n\n\n\t\n\t Communications satellites\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nTelephony\n\n\tTypes\t\n\tLandline\n\tMobile phone\n\tSatellite phone\n\tPhotophone\n\n\n\n\n\tConnectivity\t\n\tCable protection system\n\tCommunications satellites\n\tFibre-optical\n\tFree-space optical\n\tISDN\n\tMobile phone signal\n\tPOTS\n\tPSTN\n\tSubmarine cables\n\tVoIP\n\n\n\n\n\tCalls\t\n\tMissed call\n\tMisdialed call\n\tNuisance call\n\tPhone tag\n\n\n\n\n\tApplications\t\n\tFax transmission\n\tTelephone calls\n\tTelephone newspapers\n\tThéâtrophone\n\tVideo calls\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nTelecommunications\n\n\tHistory\t\n\tBeacon\n\tBroadcasting\n\tCable protection system\n\tCable TV\n\tCommunications satellite\n\tComputer network\n\tDrums\n\tElectrical telegraph\n\tFax\n\tHeliographs\n\tHydraulic telegraph\n\tInternet\n\tMass media\n\tMobile phone\n\tOptical telecommunication\n\tOptical telegraphy\n\tPager\n\tPhotophone\n\tPrepaid mobile phone\n\tRadio\n\tRadiotelephone\n\tSatellite communications\n\tSemaphore\n\tSmartphone\n\tSmoke signals\n\tTelecommunications history\n\tTelautograph\n\tTelegraphy\n\tTeleprinter (teletype)\n\tTelephone\n\tThe Telephone Cases\n\tTelevision\n\tUndersea telegraph line\n\tVideoconferencing\n\tVideophone\n\tVideotelephony\n\tWhistled language\n\n\n\n\t\n\n\tPioneers\t\n\tEdwin Howard Armstrong\n\tJohn Logie Baird\n\tPaul Baran\n\tAlexander Graham Bell\n\tTim Berners-Lee\n\tJagadish Chandra Bose\n\tVint Cerf\n\tClaude Chappe\n\tDonald Davies\n\tLee de Forest\n\tPhilo Farnsworth\n\tReginald Fessenden\n\tElisha Gray\n\tErna Schneider Hoover\n\tCharles K. Kao\n\tHedy Lamarr\n\tInnocenzo Manzetti\n\tGuglielmo Marconi\n\tAntonio Meucci\n\tRadia Perlman\n\tAlexander Stepanovich Popov\n\tJohann Philipp Reis\n\tHenry Sutton\n\tNikola Tesla\n\tCamille Tissot\n\tAlfred Vail\n\tCharles Wheatstone\n\tVladimir K. Zworykin\n\n\n\n\n\tTransmission\nmedia\t\n\tCoaxial cable\n\tFiber-optic communication\n\tOptical fiber\n\n\n\tFree-space optical communication\n\tMolecular communication\n\tRadio waves\n\tTransmission line\n\n\n\n\n\tNetwork topology\nand switching\t\n\tLinks\n\tNodes\n\tTerminal node\n\tNetwork switching (circuit\n\tpacket)\n\tTelephone exchange\n\n\n\n\n\tMultiplexing\t\n\tSpace-division\n\tFrequency-division\n\tTime-division\n\tPolarization-division\n\tOrbital angular-momentum\n\tCode-division\n\n\n\n\n\tNetworks\t\n\tARPANET\n\tBITNET\n\tCellular network\n\tComputer\n\tCYCLADES\n\tEthernet\n\tFidoNet\n\tInternet\n\tInternet2\n\tISDN\n\tLAN\n\tMobile\n\tNGN\n\tNPL network\n\tPublic Switched Telephone\n\tRadio\n\tTelecommunications equipment\n\tTelevision\n\tTelex\n\tWAN\n\tWireless network\n\tWorld Wide Web\n\n\n\n\n\t\n\t Category\n\t Outline\n\t Portal\n\t Commons\n\n\n\n\n\n\n\n\tAuthority control \t\n\tLCCN: sh85008244\n\tNDL: 00573540\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Communications_satellite&oldid=917820479\"\n\n\t\t\n\t\tCategories: \tCommunications satellites\n\tSatellite broadcasting\n\tSatellites by type\n\tTelecommunications-related introductions in 1962\n\n\nHidden categories: \tWebarchive template wayback links\n\tWikipedia articles needing clarification from January 2016\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tAsturianu\n\tবাংলা\n\tБеларуская\n\tБългарски\n\tCatalà\n\tČeština\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tفارسی\n\tFrançais\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tMagyar\n\tമലയാളം\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tPolski\n\tPortuguês\n\tРусский\n\tShqip\n\tSimple English\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tతెలుగు\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\tWinaray\n\t吴语\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 25 September 2019, at 17:02 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "11", "dc:title": "Communications satellite - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/1/18/AEHF_1.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-satellite_communication", "title": "Communications satellite - Wikipedia"}}