{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSolar power - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\n\n\tSolar power\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about generation of electricity using solar energy. For other uses of solar energy, see Solar energy.\n\nNot to be confused with Solar luminosity.\n\n\n\n\n\t\n\tThis article needs to be updated. Please update this article to reflect recent events or newly available information.  (February 2019)\n\n\n\n\nA solar photovoltaic system array on a rooftop in Hong Kong\n\n\n\nThe first three concentrated solar power (CSP) units of Spain's Solnova Solar Power Station in the foreground, with the PS10 and PS20 solar power towers in the background\n\n\n\nThis solar resource map provides a summary of the estimated solar energy available for power generation and other energy applications. It represents the average daily/yearly sum of electricity production from a 1 kW-peak grid-connected solar PV power plant covering the period from 1994/1999/2007 (depending on the geographical region) to 2015. Source: Global Solar Atlas\n\n\n\n\n\n\tPart of a series about\n\tSustainable energy\n\t\n\t\nOverview\n\t\n\tSustainable energy\n\tCarbon-neutral fuel\n\tFossil fuel phase-out\n\n\n\t\nEnergy conservation\n\t\n\tCogeneration\n\tEfficient energy use\n\tEnergy storage\n\tGreen building\n\tHeat pump\n\tLow-carbon power\n\tMicrogeneration\n\tPassive solar building design\n\n\n\t\nRenewable energy\n\t\n\tBiofuel\n\tGeothermal\n\tHydroelectricity\n\tSolar\n\tTidal\n\tWave\n\tWind\n\n\n\t\nSustainable transport\n\t\n\tElectric vehicle\n\tGreen vehicle\n\tPlug-in hybrid\n\n\n\t\n\n\t Renewable energy portal\n\t Environment portal\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nSolar power is the conversion of energy from sunlight into electricity, either directly using photovoltaics (PV), indirectly using concentrated solar power, or a combination. Concentrated solar power systems use lenses or mirrors and tracking systems to focus a large area of sunlight into a small beam. Photovoltaic cells convert light into an electric current using the photovoltaic effect.[1]\n\nPhotovoltaics were initially solely used as a source of electricity for small and medium-sized applications, from the calculator powered by a single solar cell to remote homes powered by an off-grid rooftop PV system. Commercial concentrated solar power plants were first developed in the 1980s. The 392 MW Ivanpah installation is the largest concentrating solar power plant in the world, located in the Mojave Desert of California.\n\nAs the cost of solar electricity has fallen, the number of grid-connected solar PV systems has grown into the millions and utility-scale photovoltaic power stations with hundreds of megawatts are being built. Solar PV is rapidly becoming an inexpensive, low-carbon technology to harness renewable energy from the Sun. The current largest photovoltaic power station in the world is the 850 MW Longyangxia Dam Solar Park, in Qinghai, China.\n\nThe International Energy Agency projected in 2014 that under its \"high renewables\" scenario, by 2050, solar photovoltaics and concentrated solar power would contribute about 16 and 11 percent, respectively, of the worldwide electricity consumption, and solar would be the world's largest source of electricity. Most solar installations would be in China and India.[2] In 2017, solar power provided 1.7% of total worldwide electricity production, growing at 35% per annum.[3] As of 2018, the unsubsidised levelised cost of electricity for utility scale solar power is around $43/MWh.[4]\n\n\nContents\n\n\n\t1 Mainstream technologies\n\t1.1 Photovoltaics\n\t1.2 Concentrated solar power\n\t1.3 Hybrid systems\n\n\n\n\t2 Development and deployment\n\t2.1 Early days\n\t2.2 Mid-1990s to early 2010s\n\t2.3 Current status\n\t2.4 Forecasts\n\t2.5 Photovoltaic power stations\n\t2.6 Concentrating solar power stations\n\n\n\n\t3 Economics\n\t3.1 Cost\n\t3.1.1 Levelized cost of electricity\n\t3.1.2 Current installation prices\n\n\n\n\t3.2 Grid parity\n\t3.3 Productivity by location\n\t3.4 Self consumption\n\t3.5 Energy pricing and incentives\n\t3.5.1 Rebates\n\t3.5.2 Net metering\n\t3.5.3 Feed-in tariffs (FIT)\n\t3.5.4 Solar Renewable Energy Credits (SRECs)\n\n\n\n\n\n\n\t4 Grid integration\n\t5 Environmental impacts\n\t5.1 Greenhouse gases\n\t5.2 Energy payback\n\t5.3 Water use\n\t5.4 Other issues\n\n\n\n\t6 Emerging technologies\n\t6.1 Concentrator photovoltaics\n\t6.2 Floatovoltaics\n\n\n\n\t7 See also\n\t8 References\n\t9 Sources\n\t10 Further reading\n\n\n\n\n\n\nMainstream technologies\n\nMany industrialized nations have installed significant solar power capacity into their grids to supplement or provide an alternative to conventional energy sources while an increasing number of less developed nations have turned to solar to reduce dependence on expensive imported fuels (see solar power by country). Long distance transmission allows remote renewable energy resources to displace fossil fuel consumption. Solar power plants use one of two technologies:\n\n\n\tPhotovoltaic (PV) systems use solar panels, either on rooftops or in ground-mounted solar farms, converting sunlight directly into electric power.\n\tConcentrated solar power (CSP, also known as \"concentrated solar thermal\") plants use solar thermal energy to make steam, that is thereafter converted into electricity by a turbine.\n\n\nPhotovoltaics\n\nMain article: Photovoltaics\n\n  \nSchematics of a grid-connected residential PV power system[5]\n\n\n\nA solar cell, or photovoltaic cell (PV), is a device that converts light into electric current using the photovoltaic effect. The first solar cell was constructed by Charles Fritts in the 1880s.[6] The German industrialist Ernst Werner von Siemens was among those who recognized the importance of this discovery.[7] In 1931, the German engineer Bruno Lange developed a photo cell using silver selenide in place of copper oxide,[8] although the prototype selenium cells converted less than 1% of incident light into electricity. Following the work of Russell Ohl in the 1940s, researchers Gerald Pearson, Calvin Fuller and Daryl Chapin created the silicon solar cell in 1954.[9] These early solar cells cost US$286/watt and reached efficiencies of 4.5–6%.[10]\n\nThe array of a photovoltaic power system, or PV system, produces direct current (DC) power which fluctuates with the sunlight's intensity. \nFor practical use this usually requires conversion to certain desired voltages or alternating current (AC), through the use of inverters.[5] \nMultiple solar cells are connected inside modules. \nModules are wired together to form arrays, then tied to an inverter, which produces power at the desired voltage, and for AC, the desired frequency/phase.[5]\n\nMany residential PV systems are connected to the grid wherever available, especially in developed countries with large markets.[11] \nIn these grid-connected PV systems, use of energy storage is optional. \nIn certain applications such as satellites, lighthouses, or in developing countries, batteries or additional power generators are often added as back-ups. Such stand-alone power systems permit operations at night and at other times of limited sunlight.\n\n\nConcentrated solar power\n\nMain article: Concentrated solar power\n\n  \nA parabolic collector concentrates sunlight onto a tube in its focal point.\n\n\n\nConcentrated solar power (CSP), also called \"concentrated solar thermal\", uses lenses or mirrors and tracking systems to concentrate sunlight, then use the resulting heat to generate electricity from conventional steam-driven turbines.\n\nA wide range of concentrating technologies exists: among the best known are the parabolic trough, the compact linear Fresnel reflector, the Stirling dish and the solar power tower. Various techniques are used to track the sun and focus light. In all of these systems a working fluid is heated by the concentrated sunlight, and is then used for power generation or energy storage.[12] Thermal storage efficiently allows up to 24-hour electricity generation.[13]\n\nA parabolic trough consists of a linear parabolic reflector that concentrates light onto a receiver positioned along the reflector's focal line. The receiver is a tube positioned along the focal points of the linear parabolic mirror and is filled with a working fluid. The reflector is made to follow the sun during daylight hours by tracking along a single axis. Parabolic trough systems provide the best land-use factor of any solar technology.[14] The SEGS plants in California and Acciona's Nevada Solar One near Boulder City, Nevada are representatives of this technology.[15][16]\n\nCompact Linear Fresnel Reflectors are CSP-plants which use many thin mirror strips instead of parabolic mirrors to concentrate sunlight onto two tubes with working fluid. This has the advantage that flat mirrors can be used which are much cheaper than parabolic mirrors, and that more reflectors can be placed in the same amount of space, allowing more of the available sunlight to be used. Concentrating linear fresnel reflectors can be used in either large or more compact plants.[17][18]\n\nThe Stirling solar dish combines a parabolic concentrating dish with a Stirling engine which normally drives an electric generator. The advantages of Stirling solar over photovoltaic cells are higher efficiency of converting sunlight into electricity and longer lifetime.\nParabolic dish systems give the highest efficiency among CSP technologies.[19] \nThe 50 kW Big Dish in Canberra, Australia is an example of this technology.[15]\n\nA solar power tower uses an array of tracking reflectors (heliostats) to concentrate light on a central receiver atop a tower. Power towers can achieve higher (thermal-to-electricity conversion) efficiency than linear tracking CSP schemes and better energy storage capability than dish stirling technologies.[15] The PS10 Solar Power Plant and PS20 solar power plant are examples of this technology.\n\n\nHybrid systems\n\nA hybrid system combines (C)PV and CSP with one another or with other forms of generation such as diesel, wind and biogas. The combined form of generation may enable the system to modulate power output as a function of demand or at least reduce the fluctuating nature of solar power and the consumption of non renewable fuel. Hybrid systems are most often found on islands.\n\n\n\tCPV/CSP system\n\tA novel solar CPV/CSP hybrid system has been proposed, combining concentrator photovoltaics with the non-PV technology of concentrated solar power, or also known as concentrated solar thermal.[20]\n\tISCC system\n\tThe Hassi R'Mel power station in Algeria, is an example of combining CSP with a gas turbine, where a 25-megawatt CSP-parabolic trough array supplements a much larger 130 MW combined cycle gas turbine plant. Another example is the Yazd power station in Iran.\n\tPVT system\n\tHybrid PV/T, also known as photovoltaic thermal hybrid solar collectors convert solar radiation into thermal and electrical energy. Such a system combines a solar (PV) module with a solar thermal collector in a complementary way.\n\tCPVT system\n\tA concentrated photovoltaic thermal hybrid (CPVT) system is similar to a PVT system. It uses concentrated photovoltaics (CPV) instead of conventional PV technology, and combines it with a solar thermal collector.\n\tPV diesel system\n\tIt combines a photovoltaic system with a diesel generator.[21] Combinations with other renewables are possible and include wind turbines.[22]\n\tPV-thermoelectric system\n\tThermoelectric, or \"thermovoltaic\" devices convert a temperature difference between dissimilar materials into an electric current. Solar cells use only the high frequency part of the radiation, while the low frequency heat energy is wasted. Several patents about the use of thermoelectric devices in tandem with solar cells have been filed.[23]\n\n\nThe idea is to increase the efficiency of the combined solar/thermoelectric system to convert the solar radiation into useful electricity.\n\n\nDevelopment and deployment\n\nSee also: Growth of photovoltaics, Timeline of solar cells, Solar power by country, and Concentrated solar power § Deployment around the world\n\nDeployment of Solar Power\n\nCapacity in MW by Technology\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n100,000\n\n\n\n200,000\n\n\n\n300,000\n\n\n\n400,000\n\n\n\n\n\n\n2007\n\n\n\n2010\n\n\n\n2013\n\n\n\n2016\n\n\n\n\n\n\n\n\n\n\nWorldwide deployment of solar power by technology since 2006[24]\n     Solar PV   \n     CSP - Solar thermal\n\n\n\n\n\n\n\n\n\n\tSolar Electricity Generation\n\n\tYear\tEnergy (TWh)\t% of Total\n\n\t2004\t2.6\t0.01%\n\n\t2005\t3.7\t0.02%\n\n\t2006\t5.0\t0.03%\n\n\t2007\t6.8\t0.03%\n\n\t2008\t11.4\t0.06%\n\n\t2009\t19.3\t0.10%\n\n\t2010\t31.4\t0.15%\n\n\t2011\t60.6\t0.27%\n\n\t2012\t96.7\t0.43%\n\n\t2013\t134.5\t0.58%\n\n\t2014\t185.9\t0.79%\n\n\t2015\t253.0\t1.05%\n\n\t2016\t328.2\t1.31%\n\n\t2017\t442.6\t1.73%\n\n\tSources:[25][26][27][28]\n\n\n\n\nEarly days\n\nThe early development of solar technologies starting in the 1860s was driven by an expectation that coal would soon become scarce. Charles Fritts installed the world's first rooftop photovoltaic solar array, using 1%-efficient selenium cells, on a New York City roof in 1884.[29] However, development of solar technologies stagnated in the early 20th century in the face of the increasing availability, economy, and utility of coal and petroleum.[30] In 1974 it was estimated that only six private homes in all of North America were entirely heated or cooled by functional solar power systems.[31] The 1973 oil embargo and 1979 energy crisis caused a reorganization of energy policies around the world and brought renewed attention to developing solar technologies.[32][33] Deployment strategies focused on incentive programs such as the Federal Photovoltaic Utilization Program in the US and the Sunshine Program in Japan. Other efforts included the formation of research facilities in the United States (SERI, now NREL), Japan (NEDO), and Germany (Fraunhofer–ISE).[34] \nBetween 1970 and 1983 installations of photovoltaic systems grew rapidly, but falling oil prices in the early 1980s moderated the growth of photovoltaics from 1984 to 1996.\n\n\nMid-1990s to early 2010s\n\nIn the mid-1990s development of both, residential and commercial rooftop solar as well as utility-scale photovoltaic power stations began to accelerate again due to supply issues with oil and natural gas, global warming concerns, and the improving economic position of PV relative to other energy technologies.[35] In the early 2000s, the adoption of feed-in tariffs—a policy mechanism, that gives renewables priority on the grid and defines a fixed price for the generated electricity—led to a high level of investment security and to a soaring number of PV deployments in Europe.\n\n\nCurrent status\n\nFor several years, worldwide growth of solar PV was driven by European deployment, but has since shifted to Asia, especially China and Japan, and to a growing number of countries and regions all over the world, including, but not limited to, Australia, Canada, Chile, India, Israel, Mexico, South Africa, South Korea, Thailand, and the United States.\n\nWorldwide growth of photovoltaics has averaged 40% per year from 2000 to 2013[36] and total installed capacity reached 303 GW at the end of 2016 with China having the most cumulative installations (78 GW)[37] and Honduras having the highest theoretical percentage of annual electricity usage which could be generated by solar PV (12.5%).[37][36] The largest manufacturers are located in China.[38][39]\n\nConcentrated solar power (CSP) also started to grow rapidly, increasing its capacity nearly tenfold from 2004 to 2013, albeit from a lower level and involving fewer countries than solar PV.[40]:51 \nAs of the end of 2013, worldwide cumulative CSP-capacity reached 3,425 MW.\n\n\nForecasts\n\nIn 2010, the International Energy Agency predicted that global solar PV capacity could reach 3,000 GW or 11% of projected global electricity generation by 2050—enough to generate 4,500 TWh of electricity.[41] \nFour years later, in 2014, the agency projected that, under its \"high renewables\" scenario, solar power could supply 27% of global electricity generation by 2050 (16% from PV and 11% from CSP).[2]\n\n\nPhotovoltaic power stations\n\nMain articles: Photovoltaic power station and List of photovoltaic power stations\n\nThe Desert Sunlight Solar Farm is a 550 MW power plant in Riverside County, California, that uses thin-film CdTe-modules made by First Solar.[42] As of November 2014, the 550 megawatt Topaz Solar Farm was the largest photovoltaic power plant in the world. This was surpassed by the 579 MW Solar Star complex. The current largest photovoltaic power station in the world is Longyangxia Dam Solar Park, in Gonghe County, Qinghai, China.\n\n\nLargest PV power stations as of August 2018\n\tName\n\tCountry\n\tLocation\n\tCapacity\nMWp\n\tGeneration\nGWh p.a.\n\tSize\nkm²\n\tYear\n\tRef\n\n\tTengger Desert Solar Park\n\t China\n\t37°33′00″N 105°03′14″E﻿ / ﻿37.55000°N 105.05389°E﻿ / 37.55000; 105.05389﻿ (Tengger Desert Solar Park)\n\t1,547\n\t\n\t43\n\t2016\n\t[43][44]\n\n\tKurnool Ultra Mega Solar Park\t India\t15°40′53″N 78°17′01″E﻿ / ﻿15.681522°N 78.283749°E﻿ / 15.681522; 78.283749﻿ (Kurnool Solar Park)\t1,000\t\t24\t2017\n\t[45]\n\n\tDatong Solar Power Top Runner Base\n\t China\n\t40°04′25″N 113°08′12″E﻿ / ﻿40.07361°N 113.13667°E﻿ / 40.07361; 113.13667﻿ (Datong Solar Power Top Runner Project), 40°00′19″N 112°57′20″E﻿ / ﻿40.00528°N 112.95556°E﻿ / 40.00528; 112.95556﻿ (Datong Solar Power Top Runner Project)\n\t1,000\n\t\n\t\n\t2016\n\t[46][47][48]\n\n\tLongyangxia Dam Solar Park\t China\t36°10′54″N 100°34′41″E﻿ / ﻿36.18167°N 100.57806°E﻿ / 36.18167; 100.57806﻿ (Longyangxia Dam Solar Park)\t850\t\n\t23\n\t2015\n\t[49][50][51][52][53]\n\n\tRewa Ultra Mega Solar\t India\t24°32′N 81°17′E﻿ / ﻿24.53°N 81.29°E﻿ / 24.53; 81.29﻿ (Rewa Ultra Mega Solar)\n\t750\t\t\t2018\t[54]\n\n\tBhadla Solar Park\t India\t27°32′22.81″N 71°54′54.91″E﻿ / ﻿27.5396694°N 71.9152528°E﻿ / 27.5396694; 71.9152528﻿ (Bhadla Solar Park)\n\t746\t\t40\t2017\n\t[55]\n\n\tKamuthi Solar Power Project\t India\t9°21′16″N 78°23′4″E﻿ / ﻿9.35444°N 78.38444°E﻿ / 9.35444; 78.38444﻿ (Kamuthi Solar Power Project)\t648\t\n\t10.1\n\t2016\n\t[56][57]\n\n\tPavagada Solar Park\t India\t14°05′49″N 77°16′13″E﻿ / ﻿14.09694°N 77.27028°E﻿ / 14.09694; 77.27028﻿ (Pavagada Solar Park)\t600\t\t53\t2017\n\t[58][59]\n\n\tSolar Star (I and II)\t United States\t34°49′50″N 118°23′53″W﻿ / ﻿34.83056°N 118.39806°W﻿ / 34.83056; -118.39806﻿ (Solar Star)\t579\t1,664\n\t13\n\t2015\n\t[60][61]\n\n\tTopaz Solar Farm\t United States\t35°23′N 120°4′W﻿ / ﻿35.383°N 120.067°W﻿ / 35.383; -120.067﻿ (Topaz Solar Farm)\t550\t1,301\n\t24.6[62]\n\t2014\n\t[63][64][65]\n\n\n\nConcentrating solar power stations\n\nMain article: List of solar thermal power stations\n\n  \nIvanpah Solar Electric Generating System with all three towers under load during February 2014, with the Clark Mountain Range seen in the distance\n\n\n\n  \nPart of the 354 MW Solar Energy Generating Systems (SEGS) parabolic trough solar complex in northern San Bernardino County, California\n\n\n\nCommercial concentrating solar power (CSP) plants, also called \"solar thermal power stations\", were first developed in the 1980s. The 377 MW Ivanpah Solar Power Facility, located in California's Mojave Desert, is the world's largest solar thermal power plant project. Other large CSP plants include the Solnova Solar Power Station (150 MW), the Andasol solar power station (150 MW), and Extresol Solar Power Station (150 MW), all in Spain. The principal advantage of CSP is the ability to efficiently add thermal storage, allowing the dispatching of electricity over up to a 24-hour period. Since peak electricity demand typically occurs at about 5 pm, many CSP power plants use 3 to 5 hours of thermal storage.[66]\n\n\nLargest operational solar thermal power stations\n\tName\n\tCapacity\n(MW)\n\tLocation\n\tNotes\n\n\tIvanpah Solar Power Facility\t392\tMojave Desert, California, USA\tOperational since February 2014. Located southwest of Las Vegas.\n\n\tSolar Energy Generating Systems\t354\tMojave Desert, California, USA\tCommissioned between 1984 and 1991. Collection of 9 units.\n\n\tMojave Solar Project\t280\tBarstow, California, USA\tCompleted December 2014\n\n\tSolana Generating Station\t280\tGila Bend, Arizona, USA\tCompleted October 2013\nIncludes a 6h thermal energy storage\n\n\tGenesis Solar Energy Project\t250\tBlythe, California, USA\tCompleted April 2014\n\n\tSolaben Solar Power Station[67]\t200\tLogrosán, Spain\tCompleted 2012–2013[68]\n\n\tNoor I\t160\tMorocco\tCompleted 2016\n\n\tSolnova Solar Power Station\t150\tSeville, Spain\tCompleted in 2010\n\n\tAndasol solar power station\t150\tGranada, Spain\tCompleted 2011. Includes a 7.5h thermal energy storage.\n\n\tExtresol Solar Power Station\t150\tTorre de Miguel Sesmero, Spain\tCompleted 2010–2012\nExtresol 3 includes a 7.5h thermal energy storage\n\n\tFor a more detailed, sourced and complete list, see: List of solar thermal power stations#Operational or corresponding article.\n\n\n\nEconomics\n\nCost\n\n\n\nSwanson's law – the PV learning curve\n\n\n\nSolar PV – LCOE for Europe until 2020 (in euro-cts. per kWh)[69]\n\n\n\nEconomic photovoltaic capacity vs installation cost in the United States with and without the federal Investment Tax Credit (ITC)\n\n\n\n\n\nThe typical cost factors for solar power include the costs of the modules, the frame to hold them, wiring, inverters, labour cost, any land that might be required, the grid connection, maintenance and the solar insolation that location will receive. Adjusting for inflation, it cost $96 per watt for a solar module in the mid-1970s. Process improvements and a very large boost in production have brought that figure down to 68 cents per watt in February 2016, according to data from Bloomberg New Energy Finance.[70] Palo Alto California signed a wholesale purchase agreement in 2016 that secured solar power for 3.7 cents per kilowatt-hour. And in sunny Dubai large-scale solar generated electricity sold in 2016 for just 2.99 cents per kilowatt-hour – \"competitive with any form of fossil-based electricity — and cheaper than most.\"[71]\n\nPhotovoltaic systems use no fuel, and modules typically last 25 to 40 years. Thus, capital costs make up most of the cost of solar power. Operations and maintenance costs for new utility-scale solar plants in the US are estimated to be 9 percent of the cost of photovoltaic electricity, and 17 percent of the cost of solar thermal electricity.[72] Governments have created various financial incentives to encourage the use of solar power, such as feed-in tariff programs. Also, Renewable portfolio standards impose a government mandate  that utilities generate or acquire a certain percentage of renewable power regardless of increased energy procurement costs. In most states, RPS goals can be achieved by any combination of solar, wind, biomass, landfill gas, ocean, geothermal, municipal solid waste, hydroelectric, hydrogen, or fuel cell technologies.[73]\n\n\nLevelized cost of electricity\n\nThe PV industry has adopted levelized cost of electricity (LCOE) as the unit of cost. The electrical energy generated is sold in units of kilowatt-hours (kWh). As a rule of thumb, and depending on the local insolation, 1 watt-peak of installed solar PV capacity generates about 1 to 2 kWh of electricity per year. This corresponds to a capacity factor of around 10–20%. The product of the local cost of electricity and the insolation determines the break even point for solar power. The International Conference on Solar Photovoltaic Investments, organized by EPIA, has estimated that PV systems will pay back their investors in 8 to 12 years.[74] As a result, since 2006 it has been economical for investors to install photovoltaics for free in return for a long term power purchase agreement. Fifty percent of commercial systems in the United States were installed in this manner in 2007 and over 90% by 2009.[75]\n\nShi Zhengrong has said that, as of 2012, unsubsidised solar power is already competitive with fossil fuels in India, Hawaii, Italy and Spain. He said \"We are at a tipping point. No longer are renewable power sources like solar and wind a luxury of the rich. They are now starting to compete in the real world without subsidies\". \"Solar power will be able to compete without subsidies against conventional power sources in half the world by 2015\".[76]\n\n\nCurrent installation prices\n\nUtility-scale PV system prices\n\tCountry\n\tCost ($/W)\n\tYear and references\n\n\tAustralia\n\t2.0\n\t2013[2]:15\n\n\tChina\n\t1.4\n\t2013[2]:15\n\n\tFrance\n\t2.2\n\t2013[2]:15\n\n\tGermany\n\t1.4\n\t2013[2]:15\n\n\tItaly\n\t1.5\n\t2013[2]:15\n\n\tJapan\n\t2.9\n\t2013[2]:15\n\n\tUnited Kingdom\n\t1.9\n\t2013[2]:15\n\n\tUnited States\n\t1.25\n\tJune 2016[77]\n\n\n\nIn its 2014 edition of the Technology Roadmap: Solar Photovoltaic Energy report, the International Energy Agency (IEA) published prices for residential, commercial and utility-scale PV systems for eight major markets as of 2013 (see table below).[2] However, DOE's SunShot Initiative has reported much lower U.S. installation prices. In 2014, prices continued to decline. The SunShot Initiative modeled U.S. system prices to be in the range of $1.80 to $3.29 per watt.[78] Other sources identify similar price ranges of $1.70 to $3.50 for the different market segments in the U.S.,[79] and in the highly penetrated German market, prices for residential and small commercial rooftop systems of up to 100 kW declined to $1.36 per watt (€1.24/W) by the end of 2014.[80] In 2015, Deutsche Bank estimated costs for small residential rooftop systems in the U.S. around $2.90 per watt. Costs for utility-scale systems in China and India were estimated as low as $1.00 per watt.[81]\n\n\nGrid parity\n\nMain article: Grid parity\n\nGrid parity, the point at which the cost of photovoltaic electricity is equal to or cheaper than the price of grid power, is more easily achieved in areas with abundant sun and high costs for electricity such as in California and Japan.[82] In 2008, the levelized cost of electricity for solar PV was $0.25/kWh or less in most of the OECD countries. By late 2011, the fully loaded cost was predicted to fall below $0.15/kWh for most of the OECD and to reach $0.10/kWh in sunnier regions. These cost levels are driving three emerging trends: vertical integration of the supply chain, origination of power purchase agreements (PPAs) by solar power companies, and unexpected risk for traditional power generation companies, grid operators and wind turbine manufacturers.[83][dead link]\n\nGrid parity was first reached in Spain in 2013,[84] Hawaii and other islands that otherwise use fossil fuel (diesel fuel) to produce electricity, and most of the US is expected to reach grid parity by 2015.[85][failed verification][86]\n\nIn 2007, General Electric's Chief Engineer predicted grid parity without subsidies in sunny parts of the United States by around 2015; other companies predicted an earlier date:[87] the cost of solar power will be below grid parity for more than half of residential customers and 10% of commercial customers in the OECD, as long as grid electricity prices do not decrease through 2010.[83]\n\n\nProductivity by location\n\nSee also: Solar irradiance\n\nThe productivity of solar power in a region depends on solar irradiance, which varies through the day and is influenced by latitude and climate.\n\nThe locations with highest annual solar irradiance lie in the arid tropics and subtropics. Deserts lying in low latitudes usually have few clouds, and can receive sunshine for more than ten hours a day.[88][89] These hot deserts form the Global Sun Belt circling the world. This belt consists of extensive swathes of land in Northern Africa, Southern Africa, Southwest Asia, Middle East, and Australia, as well as the much smaller deserts of North and South America.[90] Africa's eastern Sahara Desert, also known as the Libyan Desert, has been observed to be the sunniest place on Earth according to NASA.[91][92]\n\nDifferent measurements of solar irradiance (direct normal irradiance, global horizontal irradiance) are mapped below :\n\n\n\t\n\t\t\t\n\n\n\t\t\t\nNorth America\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nSouth America\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nEurope\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nAfrica and Middle East\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nSouth and South-East Asia\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nAustralia\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nWorld\n\n\n\t\t\t\n\n\t\t\n\n\n\nSelf consumption\n\nIn cases of self consumption of the solar energy, the payback time is calculated based on how much electricity is not purchased from the grid. For example, in Germany, with electricity prices of 0.25 €/kWh and insolation of 900 kWh/kW, one kWp will save €225 per year, and with an installation cost of 1700 €/KWp the system cost will be returned in less than seven years.[93] However, in many cases, the patterns of generation and consumption do not coincide, and some or all of the energy is fed back into the grid. The electricity is sold, and at other times when energy is taken from the grid, electricity is bought. The relative costs and prices obtained affect the economics. In many markets, the price paid for sold PV electricity is significantly lower than the price of bought electricity, which incentivizes self consumption.[94] Moreover, separate self consumption incentives have been used in e.g. Germany and Italy.[94] Grid interaction regulation has also included limitations of grid feed-in in some regions in Germany with high amounts of installed PV capacity.[94][95] By increasing self consumption, the grid feed-in can be limited without curtailment, which wastes electricity.[96]\n\nA good match between generation and consumption is key for high self consumption, and should be considered when deciding where to install solar power and how to dimension the installation. The match can be improved with batteries or controllable electricity consumption.[96] However, batteries are expensive and profitability may require provision of other services from them besides self consumption increase.[97] Hot water storage tanks with electric heating with heat pumps or resistance heaters can provide low-cost storage for self consumption of solar power.[96] Shiftable loads, such as dishwashers, tumble dryers and washing machines, can provide controllable consumption with only a limited effect on the users, but their effect on self consumption of solar power may be limited.[96]\n\n\nEnergy pricing and incentives\n\nMain article: PV financial incentives\n\nThe political purpose of incentive policies for PV is to facilitate an initial small-scale deployment to begin to grow the industry, even where the cost of PV is significantly above grid parity, to allow the industry to achieve the economies of scale necessary to reach grid parity. The policies are implemented to promote national energy independence, high tech job creation and reduction of CO2 emissions. Three incentive mechanisms are often used in combination as investment subsidies: the authorities refund part of the cost of installation of the system, the electricity utility buys PV electricity from the producer under a multiyear contract at a guaranteed rate, and Solar Renewable Energy Certificates (SRECs)\n\n\nRebates\n\nWith investment subsidies, the financial burden falls upon the taxpayer, while with feed-in tariffs the extra cost is distributed across the utilities' customer bases. While the investment subsidy may be simpler to administer, the main argument in favour of feed-in tariffs is the encouragement of quality. Investment subsidies are paid out as a function of the nameplate capacity of the installed system and are independent of its actual power yield over time, thus rewarding the overstatement of power and tolerating poor durability and maintenance. Some electric companies offer rebates to their customers, such as Austin Energy in Texas, which offers $2.50/watt installed up to $15,000.[98]\n\n\nNet metering\n\n  \nNet metering, unlike a feed-in tariff, requires only one meter, but it must be bi-directional.\n\n\n\nIn net metering the price of the electricity produced is the same as the price supplied to the consumer, and the consumer is billed on the difference between production and consumption. Net metering can usually be done with no changes to standard electricity meters, which accurately measure power in both directions and automatically report the difference, and because it allows homeowners and businesses to generate electricity at a different time from consumption, effectively using the grid as a giant storage battery. With net metering, deficits are billed each month while surpluses are rolled over to the following month. Best practices call for perpetual roll over of kWh credits.[99] Excess credits upon termination of service are either lost, or paid for at a rate ranging from wholesale to retail rate or above, as can be excess annual credits. In New Jersey, annual excess credits are paid at the wholesale rate, as are left over credits when a customer terminates service.[100]\n\n\nFeed-in tariffs (FIT)\n\n\t\n\tThis section needs to be updated. Please update this article to reflect recent events or newly available information.  (August 2018)\n\n\n\nWith feed-in tariffs, the financial burden falls upon the consumer. They reward the number of kilowatt-hours produced over a long period of time, but because the rate is set by the authorities, it may result in perceived overpayment. The price paid per kilowatt-hour under a feed-in tariff exceeds the price of grid electricity. Net metering refers to the case where the price paid by the utility is the same as the price charged.\n\nThe complexity of approvals in California, Spain and Italy has prevented comparable growth to Germany even though the return on investment is better.[citation needed] In some countries, additional incentives are offered for building-integrated photovoltaics (BIPV) compared to stand alone PV.\n\n\n\tFrance + EUR 0.16 /kWh (compared to semi-integrated) or + EUR 0.27/kWh (compared to stand alone)\n\tItaly + EUR 0.04–0.09 kWh\n\tGermany + EUR 0.05/kWh (facades only)\n\n\nSolar Renewable Energy Credits (SRECs)\n\nAlternatively, Solar Renewable Energy Certificates (SRECs) allow for a market mechanism to set the price of the solar generated electricity subsity. In this mechanism, a renewable energy production or consumption target is set, and the utility (more technically the Load Serving Entity) is obliged to purchase renewable energy or face a fine (Alternative Compliance Payment or ACP). The producer is credited for an SREC for every 1,000 kWh of electricity produced. If the utility buys this SREC and retires it, they avoid paying the ACP. In principle this system delivers the cheapest renewable energy, since the all solar facilities are eligible and can be installed in the most economic locations. Uncertainties about the future value of SRECs have led to long-term SREC contract markets to give clarity to their prices and allow solar developers to pre-sell and hedge their credits.\n\nFinancial incentives for photovoltaics differ across countries, including Australia, China,[101] Germany,[102] Israel,[103] Japan, and the United States and even across states within the US.\n\nThe Japanese government through its Ministry of International Trade and Industry ran a successful programme of subsidies from 1994 to 2003. By the end of 2004, Japan led the world in installed PV capacity with over 1.1 GW.[104]\n\nIn 2004, the German government introduced the first large-scale feed-in tariff system, under the German Renewable Energy Act, which resulted in explosive growth of PV installations in Germany. At the outset the FIT was over 3x the retail price or 8x the industrial price. The principle behind the German system is a 20-year flat rate contract. The value of new contracts is programmed to decrease each year, in order to encourage the industry to pass on lower costs to the end users. The programme has been more successful than expected with over 1GW installed in 2006, and political pressure is mounting to decrease the tariff to lessen the future burden on consumers.\n\nSubsequently, Spain, Italy, Greece—that enjoyed an early success with domestic solar-thermal installations for hot water needs—and France introduced feed-in tariffs. None have replicated the programmed decrease of FIT in new contracts though, making the German incentive relatively less and less attractive compared to other countries. The French and Greek FIT offer a high premium (EUR 0.55/kWh) for building integrated systems. California, Greece, France and Italy have 30–50% more insolation than Germany making them financially more attractive. The Greek domestic \"solar roof\" programme (adopted in June 2009 for installations up to 10 kW) has internal rates of return of 10–15% at current commercial installation costs, which, furthermore, is tax free.\n\nIn 2006 California approved the 'California Solar Initiative', offering a choice of investment subsidies or FIT for small and medium systems and a FIT for large systems. The small-system FIT of $0.39 per kWh (far less than EU countries) expires in just 5 years, and the alternate \"EPBB\" residential investment incentive is modest, averaging perhaps 20% of cost. All California incentives are scheduled to decrease in the future depending as a function of the amount of PV capacity installed.\n\nAt the end of 2006, the Ontario Power Authority (OPA, Canada) began its Standard Offer Program, a precursor to the Green Energy Act, and the first in North America for distributed renewable projects of less than 10 MW. The feed-in tariff guaranteed a fixed price of $0.42 CDN per kWh over a period of twenty years. Unlike net metering, all the electricity produced was sold to the OPA at the given rate.\n\n\nGrid integration\n\nMain articles: Energy storage and Grid energy storage\n\n  \nConstruction of the Salt Tanks which provide efficient thermal energy storage[105] so that output can be provided after sunset, and output can be scheduled to meet demand requirements.[106] The 280 MW Solana Generating Station is designed to provide six hours of energy storage. This allows the plant to generate about 38% of its rated capacity over the course of a year.[107]\n\n\n\n\n\nThermal energy storage. The Andasol CSP plant uses tanks of molten salt to store solar energy.\n\n\n\nPumped-storage hydroelectricity (PSH). This facility in Geesthacht, Germany, also includes a solar array.\n\n\n\n\n\nThe overwhelming majority of electricity produced worldwide is used immediately, since storage is usually more expensive and because traditional generators can adapt to demand. Both solar power and wind power are variable renewable energy, meaning that all available output must be taken whenever it is available by moving through transmission lines to where it can be used now. Since solar energy is not available at night, storing its energy is potentially an important issue particularly in off-grid and for future 100% renewable energy scenarios to have continuous electricity availability.[108]\n\nSolar electricity is inherently variable and predictable by time of day, location, and seasons. In addition solar is intermittent due to day/night cycles and unpredictable weather. How much of a special challenge solar power is in any given electric utility varies significantly. In a summer peak utility, solar is well matched to daytime cooling demands. In winter peak utilities, solar displaces other forms of generation, reducing their capacity factors.\n\nIn an electricity system without grid energy storage, generation from stored fuels (coal, biomass, natural gas, nuclear) must go up and down in reaction to the rise and fall of solar electricity (see load following power plant). While hydroelectric and natural gas plants can quickly respond to changes in load, coal, biomass and nuclear plants usually take considerable time to respond to load and can only be scheduled to follow the predictable variation. Depending on local circumstances, beyond about 20–40% of total generation, grid-connected intermittent sources like solar tend to require investment in some combination of grid interconnections, energy storage or demand side management. Integrating large amounts of solar power with existing generation equipment has caused issues in some cases. For example, in Germany, California and Hawaii, electricity prices have been known to go negative when solar is generating a lot of power, displacing existing baseload generation contracts.[109][110]\n\nConventional hydroelectricity works very well in conjunction with solar power; water can be held back or released from a reservoir as required. Where a suitable river is not available, pumped-storage hydroelectricity uses solar power to pump water to a high reservoir on sunny days, then the energy is recovered at night and in bad weather by releasing water via a hydroelectric plant to a low reservoir where the cycle can begin again.[111] \nThis cycle can lose 20% of the energy to round trip inefficiencies, this plus the construction costs add to the expense of implementing high levels of solar power.\n\nConcentrated solar power plants may use thermal storage to store solar energy, such as in high-temperature molten salts. These salts are an effective storage medium because they are low-cost, have a high specific heat capacity, and can deliver heat at temperatures compatible with conventional power systems. This method of energy storage is used, for example, by the Solar Two power station, allowing it to store 1.44 TJ in its 68 m³ storage tank, enough to provide full output for close to 39 hours, with an efficiency of about 99%.[112]\n\nIn stand alone PV systems batteries are traditionally used to store excess electricity. With grid-connected photovoltaic power system, excess electricity can be sent to the electrical grid. Net metering and feed-in tariff programs give these systems a credit for the electricity they produce. This credit offsets electricity provided from the grid when the system cannot meet demand, effectively trading with the grid instead of storing excess electricity. Credits are normally rolled over from month to month and any remaining surplus settled annually.[113] \nWhen wind and solar are a small fraction of the grid power, other generation techniques can adjust their output appropriately, but as these forms of variable power grow, additional balance on the grid is needed. As prices are rapidly declining, PV systems increasingly use rechargeable batteries to store a surplus to be later used at night. Batteries used for grid-storage stabilize the electrical grid by leveling out peak loads usually for several minutes, and in rare cases for hours. In the future, less expensive batteries could play an important role on the electrical grid, as they can charge during periods when generation exceeds demand and feed their stored energy into the grid when demand is higher than generation.\n\nAlthough not permitted under the US National Electric Code, it is technically possible to have a “plug and play” PV microinverter. A recent review article found that careful system design would enable such systems to meet all technical, though not all safety requirements.[114] There are several companies selling plug and play solar systems available on the web, but there is a concern that if people install their own it will reduce the enormous employment advantage solar has over fossil fuels.[115]\n\nCommon battery technologies used in today's home PV systems include, the valve regulated lead-acid battery– a modified version of the conventional lead–acid battery, nickel–cadmium and lithium-ion batteries. Lead-acid batteries are currently the predominant technology used in small-scale, residential PV systems, due to their high reliability, low self discharge and investment and maintenance costs, despite shorter lifetime and lower energy density. Lithium-ion batteries have the potential to replace lead-acid batteries in the near future, as they are being intensively developed and lower prices are expected due to economies of scale provided by large production facilities such as the Gigafactory 1. In addition, the Li-ion batteries of plug-in electric cars may serve as a future storage devices in a vehicle-to-grid system. Since most vehicles are parked an average of 95% of the time, their batteries could be used to let electricity flow from the car to the power lines and back. Other rechargeable batteries used for distributed PV systems include, sodium–sulfur and vanadium redox batteries, two prominent types of a molten salt and a flow battery, respectively.[116][117][118]\n\nThe combination of wind and solar PV has the advantage that the two sources complement each other because the peak operating times for each system occur at different times of the day and year. The power generation of such solar hybrid power systems is therefore more constant and fluctuates less than each of the two component subsystems.[22] Solar power is seasonal, particularly in northern/southern climates, away from the equator, suggesting a need for long term seasonal storage in a medium such as hydrogen or pumped hydroelectric.[119] The Institute for Solar Energy Supply Technology of the University of Kassel pilot-tested a combined power plant linking solar, wind, biogas and pumped-storage hydroelectricity to provide load-following power from renewable sources.[120]\n\nResearch is also undertaken in this field of artificial photosynthesis. It involves the use of nanotechnology to store solar electromagnetic energy in chemical bonds, by splitting water to produce hydrogen fuel or then combining with carbon dioxide to make biopolymers such as methanol. Many large national and regional research projects on artificial photosynthesis are now trying to develop techniques integrating improved light capture, quantum coherence methods of electron transfer and cheap catalytic materials that operate under a variety of atmospheric conditions.[121] Senior researchers in the field have made the public policy case for a Global Project on Artificial Photosynthesis to address critical energy security and environmental sustainability issues.[122]\n\n\nEnvironmental impacts\n\n  \nPart of the Senftenberg Solarpark, a solar photovoltaic power plant located on former open-pit mining areas close to the city of Senftenberg, in Eastern Germany. The 78 MW Phase 1 of the plant was completed within three months.\n\n\n\nUnlike fossil fuel based technologies, solar power does not lead to any harmful emissions during operation, but the production of the panels leads to some amount of pollution.\n\n\nGreenhouse gases\n\nThe life-cycle greenhouse-gas emissions of solar power are in the range of 22 to 46 gram (g) per kilowatt-hour (kWh) depending on if solar thermal or solar PV is being analyzed, respectively. With this potentially being decreased to 15 g/kWh in the future.[123] For comparison (of weighted averages), a combined cycle gas-fired power plant emits some 400–599 g/kWh,[124] an oil-fired power plant 893 g/kWh,[124] a coal-fired power plant 915–994 g/kWh[125] or with carbon capture and storage some 200 g/kWh, and a geothermal high-temp. power plant 91–122 g/kWh.[124] \nThe life cycle emission intensity of hydro, wind and nuclear power are lower than solar's as of 2011 as published by the IPCC, and discussed in the article Life-cycle greenhouse-gas emissions of energy sources. Similar to all energy sources were their total life cycle emissions primarily lay in the construction and transportation phase, the switch to low carbon power in the manufacturing and transportation of solar devices would further reduce carbon emissions. BP Solar owns two factories built by Solarex (one in Maryland, the other in Virginia) in which all of the energy used to manufacture solar panels is produced by solar panels. A 1-kilowatt system eliminates the burning of approximately 170 pounds of coal, 300 pounds of carbon dioxide from being released into the atmosphere, and saves up to 105 gallons of water consumption monthly.[126]\n\nThe US National Renewable Energy Laboratory (NREL), in harmonizing the disparate estimates of life-cycle GHG emissions for solar PV, found that the most critical parameter was the solar insolation of the site: GHG emissions factors for PV solar are inversely proportional to insolation.[127] For a site with insolation of 1700 kWh/m2/year, typical of southern Europe, NREL researchers estimated GHG emissions of 45 gCO\n2e/kWh. Using the same assumptions, at Phoenix, USA, with insolation of 2400 kWh/m2/year, the GHG emissions factor would be reduced to 32 g of CO2e/kWh.[128]\n\nThe New Zealand Parliamentary Commissioner for the Environment found that the solar PV would have little impact on the country's greenhouse gas emissions. The country already generates 80 percent of its electricity from renewable resources (primarily hydroelectricity and geothermal) and national electricity usage peaks on winter evenings whereas solar generation peaks on summer afternoons, meaning a large uptake of solar PV would end up displacing other renewable generators before fossil-fueled power plants.[129]\n\n\nEnergy payback\n\nThe energy payback time (EPBT) of a power generating system is the time required to generate as much energy as is consumed during production and lifetime operation of the system. Due to improving production technologies the payback time has been decreasing constantly since the introduction of PV systems in the energy market.[130] \nIn 2000 the energy payback time of PV systems was estimated as 8 to 11 years[131] and in 2006 this was estimated to be 1.5 to 3.5 years for crystalline silicon PV systems[123] and 1–1.5 years for thin film technologies (S. Europe).[123] These figures fell to 0.75–3.5 years in 2013, with an average of about 2 years for crystalline silicon PV and CIS systems.[132]\n\nAnother economic measure, closely related to the energy payback time, is the energy returned on energy invested (EROEI) or energy return on investment (EROI),[133] which is the ratio of electricity generated divided by the energy required to build and maintain the equipment. (This is not the same as the economic return on investment (ROI), which varies according to local energy prices, subsidies available and metering techniques.) With expected lifetimes of 30 years,[134] the EROEI of PV systems are in the range of 10 to 30, thus generating enough energy over their lifetimes to reproduce themselves many times (6–31 reproductions) depending on what type of material, balance of system (BOS), and the geographic location of the system.[135]\n\n\nWater use\n\nSolar power includes plants with among the lowest water consumption per unit of electricity (photovoltaic), and also power plants with among the highest water consumption (concentrating solar power with wet-cooling systems).\n\nPhotovoltaic power plants use very little water for operations. Life-cycle water consumption for utility-scale operations is estimated to be 12 gallons per megawatt-hour for flat-panel PV solar. Only wind power, which consumes essentially no water during operations, has a lower water consumption intensity.[136]\n\nConcentrating solar power plants with wet-cooling systems, on the other hand, have the highest water-consumption intensities of any conventional type of electric power plant; only fossil-fuel plants with carbon-capture and storage may have higher water intensities.[137] A 2013 study comparing various sources of electricity found that the median water consumption during operations of concentrating solar power plants with wet cooling was 810 ga/MWhr for power tower plants and 890 gal/MWhr for trough plants. This was higher than the operational water consumption (with cooling towers) for nuclear (720 gal/MWhr), coal (530 gal/MWhr), or natural gas (210).[136] A 2011 study by the National Renewable Energy Laboratory came to similar conclusions: for power plants with cooling towers, water consumption during operations was 865 gal/MWhr for CSP trough, 786 gal/MWhr for CSP tower, 687 gal/MWhr for coal, 672 gal/MWhr for nuclear, and 198 gal/MWhr for natural gas.[138] The Solar Energy Industries Association noted that the Nevada Solar One trough CSP plant consumes 850 gal/MWhr.[139] The issue of water consumption is heightened because CSP plants are often located in arid environments where water is scarce.\n\nIn 2007, the US Congress directed the Department of Energy to report on ways to reduce water consumption by CSP. The subsequent report noted that dry cooling technology was available that, although more expensive to build and operate, could reduce water consumption by CSP by 91 to 95 percent. A hybrid wet/dry cooling system could reduce water consumption by 32 to 58 percent.[140] A 2015 report by NREL noted that of the 24 operating CSP power plants in the US, 4 used dry cooling systems. The four dry-cooled systems were the three power plants at the Ivanpah Solar Power Facility near Barstow, California, and the Genesis Solar Energy Project in Riverside County, California. Of 15 CSP projects under construction or development in the US as of March 2015, 6 were wet systems, 7 were dry systems, 1 hybrid, and 1 unspecified.\n\nAlthough many older thermoelectric power plants with once-through cooling or cooling ponds use more water than CSP, meaning that more water passes through their systems, most of the cooling water returns to the water body available for other uses, and they consume less water by evaporation. For instance, the median coal power plant in the US with once-through cooling uses 36,350 gal/MWhr, but only 250 gal/MWhr (less than one percent) is lost through evaporation.[141] Since the 1970s, the majority of US power plants have used recirculating systems such as cooling towers rather than once-through systems.[142]\n\n\nOther issues\n\nOne issue that has often raised concerns is the use of cadmium (Cd), a toxic heavy metal that has the tendency to accumulate in ecological food chains. It is used as semiconductor component in CdTe solar cells and as a buffer layer for certain CIGS cells in the form of cadmium sulfide.[143] \nThe amount of cadmium used in thin-film solar cells is relatively small (5–10 g/m²) and with proper recycling and emission control techniques in place the cadmium emissions from module production can be almost zero. Current PV technologies lead to cadmium emissions of 0.3–0.9 microgram/kWh over the whole life-cycle.[123] Most of these emissions arise through the use of coal power for the manufacturing of the modules, and coal and lignite combustion leads to much higher emissions of cadmium. Life-cycle cadmium emissions from coal is 3.1 microgram/kWh, lignite 6.2, and natural gas 0.2 microgram/kWh.\n\nIn a life-cycle analysis it has been noted, that if electricity produced by photovoltaic panels were used to manufacture the modules instead of electricity from burning coal, cadmium emissions from coal power usage in the manufacturing process could be entirely eliminated.[144]\n\nIn the case of crystalline silicon modules, the solder material, that joins together the copper strings of the cells, contains about 36 percent of lead (Pb). Moreover, the paste used for screen printing front and back contacts contains traces of Pb and sometimes Cd as well. It is estimated that about 1,000 metric tonnes of Pb have been used for 100 gigawatts of c-Si solar modules. However, there is no fundamental need for lead in the solder alloy.[143]\n\nSome media sources have reported that concentrated solar power plants have injured or killed large numbers of birds due to intense heat from the concentrated sunrays.[145][146] This adverse effect does not apply to PV solar power plants, and some of the claims may have been overstated or exaggerated.[147]\n\nA 2014-published life-cycle analysis of land use for various sources of electricity concluded that the large-scale implementation of solar and wind potentially reduces pollution-related\nenvironmental impacts. The study found that the land-use footprint, given in square meter-years per megawatt-hour (m2a/MWh), was lowest for wind, natural gas and rooftop PV, with 0.26, 0.49 and 0.59, respectively, and followed by utility-scale solar PV with 7.9. For CSP, the footprint was 9 and 14, using parabolic troughs and solar towers, respectively. The largest footprint had coal-fired power plants with 18 m2a/MWh.[148]\n\n\nEmerging technologies\n\nConcentrator photovoltaics\n\n  \nCPV modules on dual axis solar trackers in Golmud, China\n\n\n\nConcentrator photovoltaics (CPV) systems employ sunlight concentrated onto photovoltaic surfaces for the purpose of electrical power production. Contrary to conventional photovoltaic systems, it uses lenses and curved mirrors to focus sunlight onto small, but highly efficient, multi-junction solar cells. Solar concentrators of all varieties may be used, and these are often mounted on a solar tracker in order to keep the focal point upon the cell as the sun moves across the sky.[149] Luminescent solar concentrators (when combined with a PV-solar cell) can also be regarded as a CPV system. Concentrated photovoltaics are useful as they can improve efficiency of PV-solar panels drastically.[150]\n\nIn addition, most solar panels on spacecraft are also made of high efficient multi-junction photovoltaic cells to derive electricity from sunlight when operating in the inner Solar System.\n\n\nFloatovoltaics\n\nFloatovoltaics are an emerging form of PV systems that float on the surface of irrigation canals, water reservoirs, quarry lakes, and tailing ponds. Several systems exist in France, India, Japan, Korea, the United Kingdom and the United States.[151][152][153][154] These systems reduce the need of valuable land area, save drinking water that would otherwise be lost through evaporation, and show a higher efficiency of solar energy conversion, as the panels are kept at a cooler temperature than they would be on land.[155] Although not floating, other dual-use facilities with solar power include fisheries.[156]\n\n\nSee also\n\n\t\tWikimedia Commons has media related to Solar power.\n\n\n\n\tEnergy portal\n\tEnvironment portal\n\n\n\n\n\t100% renewable energy\n\tCost of electricity by source\n\tList of cities by sunshine duration\n\tList of energy storage projects\n\tList of renewable energy organizations\n\tList of solar energy topics\n\tList of photovoltaic power stations\n\tList of solar thermal power stations\n\tRenewable energy\n\tRenewable energy by country\n\tRenewable energy commercialization\n\tSolar energy\n\tSolar lamp\n\tSolar vehicle\n\tSustainable energy\n\tThin-film cell\n\tTimeline of solar cells\n\n\n\n\n\n\nReferences\n\n\n\t^ \"Energy Sources: Solar\". Department of Energy. Archived from the original on 14 April 2011. Retrieved 19 April 2011.\n\n\t^ a b c d e f g h i j \nhttp://www.iea.org (2014). \"Technology Roadmap: Solar Photovoltaic Energy\" (PDF). IEA. Archived (PDF) from the original on 7 October 2014. Retrieved 7 October 2014.\n\n\n\t^ BP Global: Solar energy\n\n\t^ https://www.lazard.com/perspective/levelized-cost-of-energy-and-levelized-cost-of-storage-2018/\n\n\t^ a b c Solar Cells and their Applications Second Edition, Lewis Fraas, Larry Partain, Wiley, 2010, \nISBN 978-0-470-44633-1, Section10.2.\n\n\t^ Perlin (1999), p. 147\n\n\t^ Perlin (1999), pp. 18–20\n\n\t^ Corporation, Bonnier (June 1931). \"Magic Plates, Tap Sun For Power\". Popular Science. Retrieved 19 April 2011.\n\n\n\t^ Perlin (1999), p. 29\n\n\t^ Perlin (1999), p. 29–30, 38\n\n\t^ \"Trends in Photovoltaic Applications Survey report of selected IEA countries between 1992 and 2009, IEA-PVPS\". Archived from the original on 25 May 2017. Retrieved 8 November 2011.\n\n\n\t^ Martin and Goswami (2005), p. 45\n\n\t^ Stephen Lacey. \"Spanish CSP Plant with Storage Produces Electricity for 24 Hours Straight\". Archived from the original on 12 October 2012.\n\n\n\t^ \"Concentrated Solar Thermal Power – Now\" (PDF). Archived (PDF) from the original on 10 September 2008. Retrieved 19 August 2008.\n\n\n\t^ a b c \"Concentrating Solar Power in 2001 – An IEA/SolarPACES Summary of Present Status and Future Prospects\" (PDF). International Energy Agency – SolarPACES. Archived from the original (PDF) on 10 September 2008. Retrieved 2 July 2008.\n\n\n\t^ \"UNLV Solar Site\". University of Las Vegas. Archived from the original on 3 September 2006. Retrieved 2 July 2008.\n\n\n\t^ \"Compact CLFR\". Physics.usyd.edu.au. 12 June 2002. Archived from the original on 12 April 2011. Retrieved 19 April 2011.\n\n\n\t^ \"Ausra compact CLFR introducing cost-saving solar rotation features\" (PDF). Archived from the original (PDF) on 21 July 2011. Retrieved 19 April 2011.\n\n\n\t^ \"An Assessment of Solar Energy Conversion Technologies and Research Opportunities\" (PDF). Stanford University – Global Climate Change & Energy Project. Archived (PDF) from the original on 9 May 2008. Retrieved 2 July 2008.\n\n\n\t^ Phys.org A novel solar CPV/CSP hybrid system proposed Archived 22 August 2015 at the Wayback Machine, 11 February 2015\n\n\t^ Amanda Cain (22 January 2014). \"What Is a Photovoltaic Diesel Hybrid System?\". RenewableEnergyWorld.com.\n\n\n\t^ a b \"Hybrid Wind and Solar Electric Systems\". United States Department of Energy. 2 July 2012. Archived from the original on 26 May 2015.\n\n\n\t^ Kraemer, D; Hu, L; Muto, A; Chen, X; Chen, G; Chiesa, M (2008), \"Photovoltaic-thermoelectric hybrid systems: A general optimization methodology\", Applied Physics Letters, 92 (24): 243503, Bibcode:2008ApPhL..92x3503K, doi:10.1063/1.2947591\n\n\n\t^ Find data and sources in articles Growth of photovoltaics and Concentrated solar power#Deployment around the world\n\n\t^ \"BP Statistical Review of World Energy June 2015, Renewables section\" (PDF). BP. June 2015. Archived (PDF) from the original on 7 July 2015. Retrieved 7 July 2015.\n\n\n\t^ \"BP Statistical Review of World Energy June 2015, Electricity section\" (PDF). BP. June 2015. Archived from the original (PDF) on 4 July 2015. Retrieved 7 July 2015.\n\n\n\t^ \"BP Statistical Review of World Energy 2016 - data workbook\". BP. June 2016. Archived from the original on 2 December 2016. Retrieved 11 June 2016.\n\n\n\t^ https://www.bp.com/content/dam/bp/en/corporate/pdf/energy-economics/statistical-review/bp-stats-review-2018-renewable-energy.pdf BP Global, solar energy: Renewable Energy 2017 in review\n\n\t^ \"Photovoltaic Dreaming 1875--1905: First Attempts At Commercializing PV - CleanTechnica\". cleantechnica.com. Archived from the original on 25 May 2017. Retrieved 30 April 2018.\n\n\n\t^ Butti and Perlin (1981), p. 63, 77, 101\n\n\t^ \"The Solar Energy Book-Once More.\" Mother Earth News 31:16–17, Jan. 1975\n\n\t^ Butti and Perlin (1981), p. 249\n\n\t^ Yergin (1991), pp. 634, 653–673\n\n\t^ \"Chronicle of Fraunhofer-Gesellschaft\". Fraunhofer-Gesellschaft. Archived from the original on 12 December 2007. Retrieved 4 November 2007.\n\n\n\t^ Solar: photovoltaic: Lighting Up The World retrieved 19 May 2009 Archived 13 August 2010 at the Wayback Machine\n\n\t^ a b \"Photovoltaics: Overview of installed PV in 2013\". Renewables International. 14 January 2014. Archived from the original on 30 March 2014. Retrieved 23 June 2014.\n\n\n\t^ a b \"2016 Snapshot of Global Photovoltaic Markets\" (PDF). International Energy Agency. 2017. Archived (PDF) from the original on 27 August 2017.\n\n\n\t^ Colville, Finlay (30 January 2017). \"Top-10 solar cell producers in 2016\". PV-Tech. Archived from the original on 2 February 2017.\n\n\n\t^ Ball, Jeffrey;  et al. (21 March 2017). \"The New Solar System - Executive Summary\" (PDF). Stanford University Law School, Steyer-Taylor Center for Energy Policy and Finance. Archived (PDF) from the original on 20 April 2017. Retrieved 27 June 2017.\n\n\n\t^ \nREN21 (2014). \"Renewables 2014: Global Status Report\" (PDF). Archived (PDF) from the original on 15 September 2014.\n\n\n\t^ \"Solar photovoltaic roadmap\" (PDF). International Energy Agency. 2010. Archived (PDF) from the original on 24 September 2015. Retrieved 18 August 2014.\n\n\n\t^ \"DOE Closes on Four Major Solar Projects\". Renewable Energy World. 30 September 2011. Archived from the original on 11 November 2011.\n\n\n\t^ \"10 really cool Solar Power installations in (and above) the world\". Retrieved 30 January 2018.\n\n\n\t^ \"宁夏在腾格里沙漠南缘建成全国最大沙漠光伏集成区 - 今日热点 - 中国储能网\". www.escn.com.cn. Retrieved 20 May 2017.\n\n\n\t^ \"The World's Largest Solar Park - Kurnool, India\". Retrieved 1 November 2017.\n\n\n\t^ \"大同光伏领跑者验收：月均发电量超过1亿度 - OFweek太阳能光伏网\". solar.ofweek.com. Retrieved 20 May 2017.\n\n\n\t^ \"看山西大同示范基地如何领跑全国光伏行业 - 光伏电站 - 中国储能网\". www.escn.com.cn. Retrieved 20 May 2017.\n\n\n\t^ \"China's Top Runner Program Improves Mono-si Products' Market Share to 25%_EnergyTrend PV\". pv.energytrend.com. Retrieved 20 May 2017.\n\n\n\t^ Denis Lenardic. Large-scale photovoltaic power plants ranking 1 - 50 PVresources.com, 2011.\n\n\t^ 李洋. \"World's largest solar-hydro power station getting connected to the grid\".\n\n\n\t^ Author. \"KW50 - CPI completes massive hybrid solar PV/hydro plant in Western China - SolarServer\".\n\n\n\t^ Jun, Zhang (May 2015). \"Joint Development Mode of Hydropower and New Energy\" (PDF). Upstream Huanghe Hydropower Development Co., Ltd. Retrieved 22 March 2016.\n\n\n\t^ \"Global hydropower market shows promise for future\". ESI-Africa.com. 10 March 2016. Retrieved 22 March 2016.\n\n\n\t^ 750MW Madhya Pradesh solar plant starts operations, to serve Delhi Metro, The New Indian Express, 6 July 2018\n\n\t^ \"Country's Biggest Solar Park In Rajasthan, At The Heart Of India's Clean Energy Push\". NDTV.com. Retrieved 6 June 2017.\n\n\n\t^ http://m.thehindubusinessline.com/companies/adani-dedicates-to-nation-worlds-largest-solar-power-plant-in-tn/article9131623.ece\n\n\t^ \"Adani Group launches world's largest solar power plant in Tamil Nadu - Times of India\". Retrieved 21 September 2016.\n\n\n\t^ \"600 MW of Solar Projects Synchronized to the Grid at Karnataka's Pavagada Park\". Retrieved 18 February 2018.\n\n\n\t^ Reporter, Staff (2 March 2018). \"Pavagada solar park inaugurated\". The Hindu. Retrieved 2 March 2018.\n\n\n\t^ Solar Star Project, Japan DG Demand Drive SunPower's Q3, Forbes, 10/31/2014\n\n\t^ \"Solar\".\n\n\n\t^ \"Earth Observatory image, using EO-1 ALI data\". 5 March 2015.\n\n\n\t^ Steve Leone (7 December 2011). \"Billionaire Buffett Bets on Solar Energy\". Renewable Energy World.\n\n\n\t^ \"California Valley's Topaz Solar Farm now producing electricity\". sanluisobispo.\n\n\n\t^ Energy Information Administration. \"Topaz Solar Farm, Monthly\". Electricity Data Browser. Retrieved 9 October 2013.\n\n\n\t^ What is peak demand? Archived 11 August 2012 at the Wayback Machine, Energex.com.au website.\n\n\t^ \"Abengoa Solar begins construction on Extremadura's second solar concentrating solar power plant\". abengoasolar.com. Archived from the original on 4 December 2009. Retrieved 30 April 2018.\n\n\n\t^ \"Abengoa closes financing and begin operation of Solaben 1 & 6 CSP plants in Spain\". CSP-World. Archived from the original on 16 October 2013.\n\n\n\t^ \n\"Solar Photovoltaics Competing in the Energy Sector—On the road to competitiveness\" (PDF). European Photovoltaic Industry Association. September 2011. p. 18. Archived from the original (PDF) on 26 February 2013.\n\n\n\t^ \"Musk vs. Buffett: The Billionaire Battle to Own the Sun\". Bloomberg.com. Archived from the original on 16 February 2017.\n\n\n\t^ Jabusch, Garvin. \"These 4 solar-power stocks will leave fossil fuels in the dust\". marketwatch.com. Archived from the original on 19 August 2017. Retrieved 30 April 2018.\n\n\n\t^ US EIA, Levelized Cost and Levelized Avoided Cost of New Generation Resources in the Annual Energy Outlook 2014 Archived 27 October 2015 at the Wayback Machine, 17 April 2014.\n\n\t^ Robert Glennon and Andrew M. Reeves, Solar Energy's Cloudy Future, 1 Ariz. J. Evtl. L. & Pol'y, 91, 106 (2010) available at \"Archived copy\" (PDF). Archived from the original (PDF) on 11 August 2011. Retrieved 11 August 2011.CS1 maint: archived copy as title (link)\n\n\n\t^ \"3rd International Conference on Solar Photovoltaic Investments\". Pvinvestmentconference.org. Archived from the original on 3 May 2009. Retrieved 19 April 2011.\n\n\n\t^ \"Solar Power Services: How PPAs are Changing the PV Value Chain\". 11 February 2008. Archived from the original on 10 May 2009. Retrieved 21 May 2009.\n\n\n\t^ Mark Clifford (8 February 2012). \"China's visible solar power success\". MarketWatch. Archived from the original on 1 August 2013.\n\n\n\t^ https://renewablesnow.com/news/us-utility-scale-solar-prices-to-fall-below-usd-1-watt-in-2020-527135/\n\n\t^ \"Photovoltaic System Pricing Trends – Historical, Recent, and Near-Term Projections, 2014 Edition\" (PDF). NREL. 22 September 2014. p. 4. Archived (PDF) from the original on 26 February 2015.\n\n\n\t^ GreenTechMedia.com Solar PV Pricing Continues to Fall During a Record-Breaking 2014 Archived 25 May 2017 at the Wayback Machine, 13 March 2015\n\n\t^ \"Photovoltaik-Preisindex\" [Solar PV price index]. PhotovoltaikGuide. Archived from the original on 10 July 2017. Retrieved 30 March 2015. Turnkey net-prices for a solar PV system of up to 100 kWp amounted to Euro 1,240 per kWp.\n\n\n\t^ \"Crossing the Chasm\" (PDF). Deutsche Bank Markets Research. 27 February 2015. p. 9. Archived (PDF) from the original on 30 March 2015.\n\n\n\t^ Going for grid parity Archived 8 June 2011 at the Wayback Machine 2005 article\n\n\t^ a b The True Cost of Solar Power retrieved 22 October 2008 Archived 8 September 2008 at the Wayback Machine\n\n\t^ Kelly-Detwiler, Peter. \"Solar Grid Parity Comes to Spain\". Forbes. Archived from the original on 2 January 2013.\n\n\n\t^ \"Gaining on the grid\". BP. Archived from the original on 8 June 2011.\n\n\n\t^ \"The Path to Grid Parity\". BP. Archived from the original on 29 October 2013.\n[failed verification]\n\n\t^ Reuters Editorial (19 October 2007). \"Solar power edges towards boom time\". Reuters. Archived from the original on 22 July 2009.\n\n\n\t^ \"Archived copy\". Archived from the original on 22 August 2017. Retrieved 22 August 2017.CS1 maint: archived copy as title (link)\n\n\n\t^ \"Archived copy\". Archived from the original on 23 September 2015. Retrieved 6 September 2015.CS1 maint: archived copy as title (link)\n\n\n\t^ \"Archived copy\". Archived from the original on 26 August 2017. Retrieved 22 August 2017.CS1 maint: archived copy as title (link)\n\n\n\t^ \"The cloudiest place\". www.acgeospatial.co.uk. Archived from the original on 22 August 2017. Retrieved 30 April 2018.\n\n\n\t^ Lipponen, Antti (7 January 2017). \"The sunniest place on Earth in 2016\". medium.com. Archived from the original on 22 August 2017. Retrieved 30 April 2018.\n\n\n\t^ \"Money saved by producing electricity from PV and Years for payback\". Archived from the original on 28 December 2014.\n\n\n\t^ a b c Trends in Photovoltaic Applications 2014 (PDF) (Report). IEA-PVPS. 2014. Archived (PDF) from the original on 25 May 2017.\n\n\n\t^ Stetz, T; Marten, F; Braun, M (2013). \"Improved Low Voltage Grid-Integration of Photovoltaic Systems in Germany\". IEEE Transactions on Sustainable Energy. 4 (2): 534–542. Bibcode:2013ITSE....4..534S. doi:10.1109/TSTE.2012.2198925.\n\n\n\t^ a b c d Salpakari, Jyri; Lund, Peter (2016). \"Optimal and rule-based control strategies for energy flexibility in buildings with PV\". Applied Energy. 161: 425–436. doi:10.1016/j.apenergy.2015.10.036.\n\n\n\t^ Fiztgerald, Garrett; Mandel, James; Morris, Jesse; Touati, Hervé (2015). The Economics of Battery Energy Storage (PDF) (Report). Rocky Mountain Institute. Archived from the original (PDF) on 30 November 2016.\n\n\n\t^ Solar Rebate Program Archived 25 July 2012 at the Wayback Machine\n\n\t^ Net Metering Archived 21 October 2012 at the Wayback Machine\n\n\t^ \"Net Metering and Interconnection - NJ OCE Web Site\". Archived from the original on 12 May 2012.\n\n\n\t^ China Racing Ahead of America in the Drive to Go Solar. Archived 6 July 2013 at the Wayback Machine\n\n\t^ \"Power & Energy Technology - IHS Technology\". Archived from the original on 2 January 2010.\n\n\n\t^ Approved — Feed-in tariff in Israel Archived 3 June 2009 at the Wayback Machine.\n\n\t^ [1]\n\n\t^ Wright, matthew; Hearps, Patrick; et al. Australian Sustainable Energy: Zero Carbon Australia Stationary Energy Plan Archived 24 November 2015 at the Wayback Machine, Energy Research Institute, University of Melbourne, October 2010, p. 33. Retrieved from BeyondZeroEmissions.org website.\n\n\t^ Innovation in Concentrating Thermal Solar Power (CSP) Archived 24 September 2015 at the Wayback Machine, RenewableEnergyFocus.com website.\n\n\t^ Ray Stern (10 October 2013). \"Solana: 10 Facts You Didn't Know About the Concentrated Solar Power Plant Near Gila Bend\". Phoenix New Times. Archived from the original on 11 October 2013.\n\n\n\t^ Carr (1976), p. 85\n\n\t^ \"California produced so much solar power, electricity prices just turned negative\". independent.co.uk. 11 April 2017. Archived from the original on 11 December 2017. Retrieved 30 April 2018.\n\n\n\t^ Fares, Robert. \"3 Reasons Hawaii Put the Brakes on Solar--and Why the Same Won't Happen in Your State\". scientificamerican.com. Archived from the original on 20 September 2016. Retrieved 30 April 2018.\n\n\n\t^ \"Pumped Hydro Storage\". Electricity Storage Association. Archived from the original on 21 June 2008. Retrieved 31 July 2008.\n\n\n\t^ \"Advantages of Using Molten Salt\". Sandia National Laboratory. Archived from the original on 5 June 2011. Retrieved 29 September 2007.\n\n\n\t^ \"PV Systems and Net Metering\". Department of Energy. Archived from the original on 4 July 2008. Retrieved 31 July 2008.\n\n\n\t^ Aishwarya S. Mundada, Yuenyong Nilsiam, Joshua M. Pearce. A review of technical requirements for plug-and-play solar photovoltaic micro-inverter systems in the United States Archived 30 April 2018 at the Wayback Machine. Solar Energy 135, (2016), pp. 455–470. doi: 10.1016/j.solener.2016.06.002\n\n\t^ Platzer, M.D., 2012. US solar photovoltaic manufacturing: Industry trends, global competition, federal support. Washington, DC: Congressional Research service.\n\n\t^ Joern Hoppmann; Jonas Volland; Tobias S. Schmidt; Volker H. Hoffmann (July 2014). \"The Economic Viability of Battery Storage for Residential Solar Photovoltaic Systems - A Review and a Simulation Model\". ETH Zürich, Harvard University. Archived from the original on 3 April 2015.\n\n\n\t^ FORBES, Justin Gerdes, Solar Energy Storage About To Take Off In Germany and California Archived 29 July 2017 at the Wayback Machine, 18 July 2013\n\n\t^ \"Tesla launches Powerwall home battery with aim to revolutionize energy consumption\". Associated Press. 1 May 2015. Archived from the original on 7 June 2015.\n\n\n\t^ \"Seasonal Energy Storage in a Renewable Energy System\" (PDF). semanticscholar.org. Archived (PDF) from the original on 25 May 2017. Retrieved 30 April 2018.\n\n\n\t^ \"The Combined Power Plant: the first stage in providing 100% power from renewable energy\". SolarServer. January 2008. Archived from the original on 14 October 2008. Retrieved 10 October 2008.\n\n\n\t^ Collings AF, Critchley C. Artificial Photosynthesis. From Basic Biology to Industrial Application. Wiley-VCH. Weinheim (2005) p. x \nISBN 3-527-31090-8 doi:10.1002/3527606742.\n\n\t^ Faunce, T. A.; Lubitz, W.; Rutherford, A. W. (Bill); MacFarlane, D.; Moore, G. F.; Yang, P.; Nocera, D. G; Moore, Tom A; Gregory, Duncan H; Fukuzumi, Shunichi; Yoon, Kyung B.; Armstrong, F. A.; Wasielewski, M. R.; Styring, S. (2013), \"Energy and environment policy case for a global project on artificial photosynthesis\", Energy & Environmental Science, 6 (3): 695–698, doi:10.1039/C3EE00063J\n\n\n\t^ a b c d Alsema, E.A.; Wild – Scholten, M.J. de; Fthenakis, V.M. Environmental impacts of PV electricity generation – a critical comparison of energy supply options Archived 6 March 2012 at the Wayback Machine ECN, September 2006; 7p. Presented at the 21st European Photovoltaic Solar Energy Conference and Exhibition, Dresden, Germany, 4–8 September 2006.\n\n\t^ a b c Fridleifsson, Ingvar B.; Bertani, Ruggero; Huenges, Ernst; Lund, John W.; Ragnarsson, Arni; Rybach, Ladislaus (11 February 2008).  O. Hohmeyer and T. Trittin (ed.). \"The possible role and contribution of geothermal energy to the mitigation of climate change\" (PDF). Luebeck, Germany: 59–80. Archived from the original (PDF) on 22 July 2011. Retrieved 6 April 2009. Cite journal requires |journal= (help)\n\n\n\t^ Lund, John W. (June 2007). \"Characteristics, Development and utilization of geothermal resources\" (PDF). Geo-Heat Centre Quarterly Bulletin. 28 (2). Klamath Falls, Oregon: Oregon Institute of Technology. pp. 1–9. ISSN 0276-1084. Archived (PDF) from the original on 17 June 2010. Retrieved 16 April 2009.\n\n\n\t^ \"Portable Solar Panels\". Portable Solar Panels for Sale. Archived from the original on 26 July 2012.\n\n\n\t^ NREL, Life Cycle Greenhouse Gas Emissions from Electricity Generation Archived 28 March 2015 at the Wayback Machine, NREL/FS-6A20-57187, Jan 2013.\n\n\t^ David D. Hsu and others, Life Cycle Greenhouse Gas Emissions of Crystalline Silicon Photovoltaic Electricity Generation: Systematic Review and Harmonization Archived 4 March 2016 at the Wayback Machine, 2011.\n\n\t^ \"Electric cars not solar panels, says Environment Commissioner\". Parliamentary Commissioner for the Environment. 22 March 2016. Archived from the original on 3 April 2016. Retrieved 23 March 2016.\n\n\n\t^ \"Photovoltaics Report\" (PDF). Fraunhofer ISE. 28 July 2014. pp. 28–32. Archived (PDF) from the original on 9 August 2014. Retrieved 31 August 2014.\n\n\n\t^ Andrew Blakers and Klaus Weber, \"The Energy Intensity of Photovoltaic Systems\" Archived 17 July 2012 at the Wayback Machine, Centre for Sustainable Energy Systems, Australian National University, 2000.\n\n\t^ Jinqing Peng, Lin Lu, Hongxing Yang, Review on lifecycle assessment of energy payback and greenhouse gas emission of solar photovoltaic systems. In: Renewable and Sustainable Energy Reviews 19, (2013), 255–274, Fig. 5, doi:10.1016/j.rser.2012.11.035.\n\n\t^ C. Reich-Weiser, D. Dornfeld, and S. Horne. Environmental assessment and metrics for solar: Case study of solfocus solar concentrator systems Archived 6 April 2013 at the Wayback Machine. UC Berkeley: Laboratory for Manufacturing and Sustainability, 8 May 2008.\n\n\t^ Service Lifetime Prediction for Encapsulated Photovoltaic Cells/Minimodules Archived 4 March 2016 at the Wayback Machine, A.W. Czanderna and G.J. Jorgensen, National Renewable Energy Laboratory, Golden, CO.\n\n\t^ Joshua Pearce and Andrew Lau, \"Net Energy Analysis For Sustainable Energy Production From Silicon Based Solar Cells\" Archived 15 September 2011 at Wikiwix, Proceedings of American Society of Mechanical Engineers Solar 2002: Sunrise on the Reliable Energy Economy, editor R. Campbell-Howe, 2002.\n\n\t^ a b Meldrum, J.; Nettles-Anderson, S.; Heath, G.; MacKnick, J. (March 2013). \"Life cycle water use for electricity generation: A review and harmonization of literature estimates\". Environmental Research Letters. 8 (1): 015031. Bibcode:2013ERL.....8a5031M. doi:10.1088/1748-9326/8/1/015031.\n\n\n\t^ Nathan Bracken and others, Concentrating Solar Power and Water Issues in the U.S. Southwest, National Renewable Energy Laboratory, Technical Report NREL/TP-6A50-61376, March 2015, p.10.\n\n\t^ John Macknick and others, A Review of Operational Water Consumption and Withdrawal Factors for Electricity Generating Technologies Archived 6 April 2015 at the Wayback Machine, National Renewable Energy Laboratory, Technical Report NREL/TP-6A20-50900.\n\n\t^ Utility-Scale Solar Power: Responsible Water Resource Management, Solar Energy Industries Association, 18 March 2010.\n\n\t^ Concentrating Solar Power Commercial Application Study Archived 26 December 2017 at the Wayback Machine, US Department of Energy, 20 Feb. 2008.\n\n\t^ John Macknick and others, A Review of Operational Water Consumption and Withdrawal Factors for Electricity Generating Technologies Archived 9 August 2017 at the Wayback Machine, NREL, Technical Report NREL/TP-6A20-50900.\n\n\t^ Many newer power plants have cooling systems that Reuse Water Archived 26 December 2017 at the Wayback Machine, US EIA, 11 Feb. 2014.\n\n\t^ a b Werner, Jürgen H. (2 November 2011). \"Toxic Substances In Photovoltaic Modules\" (PDF). postfreemarket.net. Institute of Photovoltaics, University of Stuttgart, Germany - The 21st International Photovoltaic Science and Engineering Conference 2011 Fukuoka, Japan. p. 2. Archived from the original (PDF) on 21 December 2014. Retrieved 23 September 2014.\n\n\n\t^ \"CdTe PV: Real and Perceived EHS Risks\" (PDF). bnl.gov. Archived (PDF) from the original on 27 June 2017. Retrieved 30 April 2018.\n\n\n\t^ \"Solar plant's downside? Birds igniting in midair\". CBS News. 18 August 2014. Archived from the original on 19 August 2014.\n\n\n\t^ \"California's new solar power plant is actually a death ray that's incinerating birds mid-flight\". ExtremeTech.com. 20 August 2014. Archived from the original on 19 October 2014.\n\n\n\t^ Jake Richardson (22 August 2014). \"Bird Deaths From Solar Plant Exaggerated By Some Media Sources\". Cleantechnica.com.\n\n\n\t^ Hertwich and others, \"Integrated life-cycle assessment of electricity-supply scenarios confirms global environmental benefit of low-carbon technologies\" Archived 23 November 2015 at the Wayback Machine, Proceedings of the National Academy of Sciences, 19 May 2015, v.112 n.20.\n\n\t^ MSU-CSET Participation Archive with notation in the Murray Ledger & Times\n\n\t^ Layton, Julia (5 November 2008). \"What is a luminescent solar concentrator?\". Science.howstuffworks.com. Archived from the original on 10 March 2010. Retrieved 19 April 2011.\n\n\n\t^ \"Kyocera, partners announce construction of the world's largest floating solar PV Plant in Hyogo prefecture, Japan\". SolarServer.com. 4 September 2014. Archived from the original on 24 September 2015.\n\n\n\t^ \"Running Out of Precious Land? Floating Solar PV Systems May Be a Solution\". EnergyWorld.com. 7 November 2013. Archived from the original on 26 December 2014.\n\n\n\t^ \"Vikram Solar commissions India's first floating PV plant\". SolarServer.com. 13 January 2015. Archived from the original on 2 March 2015.\n\n\n\t^ \"Sunflower Floating Solar Power Plant In Korea\". CleanTechnica. 21 December 2014. Archived from the original on 15 May 2016.\n\n\n\t^ \"Napa Winery Pioneers Solar Floatovoltaics\". Forbes. 18 April 2012. Archived from the original on 1 January 2012. Retrieved 31 May 2013.\n\n\n\t^ \"A look at a Chinese fishery with a giant integrated solar array – feeding a world hungry for clean energy\". Electrek. 29 January 2017. Archived from the original on 29 January 2017. Retrieved 29 January 2017.\n\n\n\n\n\nSources\n\n\n\tButti, Ken; Perlin, John (1981). A Golden Thread (2500 Years of Solar Architecture and Technology). Van Nostrand Reinhold. ISBN 978-0-442-24005-9.\n\n\tCarr, Donald E. (1976). Energy & the Earth Machine. W. W. Norton & Company. ISBN 978-0-393-06407-0.\n\n\tHalacy, Daniel (1973). The Coming Age of Solar Energy. Harper and Row. ISBN 978-0-380-00233-7.\n\n\tMartin, Christopher L.; Goswami, D. Yogi (2005). Solar Energy Pocket Reference. International Solar Energy Society. ISBN 978-0-9771282-0-4.\n\n\tMills, David (2004). \"Advances in solar thermal electricity technology\". Solar Energy. 76 (1–3): 19–31. Bibcode:2004SoEn...76...19M. doi:10.1016/S0038-092X(03)00102-6.\n\n\tPerlin, John (1999). From Space to Earth (The Story of Solar Electricity). Harvard University Press. ISBN 978-0-674-01013-0.\n\n\tTritt, T.; Böttner, H.; Chen, L. (2008). \"Thermoelectrics: Direct Solar Thermal Energy Conversion\". MRS Bulletin. 33 (4): 355–372. doi:10.1557/mrs2008.73.\n\n\tYergin, Daniel (1991). The Prize: The Epic Quest for Oil, Money, and Power. Simon & Schuster. p. 885. ISBN 978-0-671-79932-8.\n\n\n\n\n\nFurther reading\n\n Media related to Solar power at Wikimedia Commons\n\n\n\tSivaram, Varun (2018). Taming the Sun: Innovation to Harness Solar Energy and Power the Planet. Cambridge, MA: MIT Press. ISBN 978-0-262-03768-6.\n\n\n\n\t\tv\n\tt\n\te\n\n\nSolar energy\n\n\t\n\tOutline\n\tTimeline\n\tIndex\n\n\n\n\n\tConcepts\t\n\tThe Sun\n\tSolar irradiance\n\tActive and passive solar energy\n\n\n\n\n\tSolar power\t\n\tThermal\t\n\tPassive solar building design\n\tSolar water heating\n\tSolar chimney\n\tSolar air conditioning\n\tThermal mass\n\tSolar pond\n\n\n\n\n\tPhotovoltaics\nand related topics\t\n\tPhotovoltaic effect\n\tSolar cell\n\tPolymer solar cell\n\tNanocrystal solar cell\n\tPhotovoltaic module (solar panel)\n\tPhotovoltaic array (and systems)\n\tPhotovoltaic power station\n\tFloating solar\n\n\n\n\n\tConcentrated\t\n\tHeliostat\n\tSolar tracker\n\tParabolic trough\n\tSolar power tower\n\n\n\n\n\tExperimental\nand proposed\t\n\tSolar updraft tower\n\tSolar-pumped laser\n\tThermoelectric generator\n\tSolar chemical and artificial photosynthesis\n\tSpace-based solar power\n\tSolar sail\n\tMagnetic sail\n\tSolar thermal rocket\n\n\n\n\n\tBy country\t\n\tAustralia\n\tAustria\n\tAlbania\n\tBelgium\n\tBrazil\n\tCanada\n\tChina\n\tCzech\n\tDenmark\n\tGeorgia\n\tGermany\n\tGreece\n\tIndia\n\tIsrael\n\tItaly\n\tJapan\n\tLithuania\n\tMexico\n\tMorocco\n\tMyanmar\n\tNetherlands\n\tNew Zealand\n\tPakistan\n\tPortugal\n\tRomania\n\tSaudi Arabia\n\tSomalia\n\tSouth Africa\n\tSpain\n\tThailand\n\tTurkey\n\tUkraine\n\tUnited Kingdom\n\tUnited States\n\tYemen\n\n\n\n\n\n\n\n\tDistribution\nand uses\t\n\tStorage\t\n\tThermal mass\n\tThermal energy storage\n\tPhase change material\n\tGrid energy storage\n\n\n\n\n\tAdoption\t\n\tFeed-in tariff\n\tNet metering\n\tFinancial incentives for photovoltaics\n\tCosts\n\n\n\n\n\tApplications\t\n\tSolar water heating\n\tSolar vehicle\n\tElectric aircraft\n\tElectric boat\n\tSolar balloon\n\n\n\n\n\n\n\n\tOther applications\t\n\tAgriculture\nand horticulture\t\n\tGreenhouse\n\tPolytunnel\n\tRow cover\n\tSolar-powered pump\n\n\n\n\n\tBuilding\tPassive solar building design\n\tBuilding-integrated photovoltaics\n\tUrban heat island\n\n\n\n\tLighting\t\n\tHybrid solar lighting\n\tSolar lamp\n\tSolar Tuki\n\tLight tube\n\tDaylighting\n\n\n\n\tProcess heat\t\n\tSolar pond\n\tSolar furnace\n\tSalt evaporation pond\n\n\n\n\n\tCooking\t\n\tSolar cooker\n\n\n\n\n\tDisinfection\t\n\tSolar water disinfection\n\tSoil solarization\n\n\n\n\n\tDesalination\t\n\tSolar still\n\tDesalination\n\n\n\n\n\tWater heating\t\n\tSolar water heating\n\tSolar combisystem\n\tZero carbon solar controller\n\n\n\n\n\n\n\n\tSee also\t\n\tPhotovoltaics topics\n\tSolar power by country\n\tRenewable energy sources\n\n\n\n\n\t\n\tCategory\n\t Commons\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSolar power by country\n\n\tOverview\t\n\tGrowth of photovoltaics\n\tList of photovoltaics companies\n\tList of countries by photovoltaics production\n\n\n\n\n\tAfrica\t\n\tAlgeria\n\tMorocco\n\tSomalia\n\tSouth Africa\n\n\n\n\n\tAsia\t\n\tChina\n\tGeorgia\n\tIndia\n\tIsrael\n\tJapan\n\tMyanmar\n\tPakistan\n\tSaudi Arabia\n\tSouth Korea\n\tTaiwan\n\tThailand\n\tUAE\n\tYemen\n\n\n\n\n\tEurope\t\n\tAlbania\n\tAustria\n\tBelgium\n\tBelarus\n\tBulgaria\n\tCyprus\n\tCzech\n\tDenmark\n\tFinland\n\tFrance\n\tGermany\n\tGreece\n\tItaly\n\tLithuania\n\tNetherlands\n\tPoland\n\tPortugal\n\tRomania\n\tSpain\n\tSwitzerland\n\tTurkey\n\tUkraine\n\tUnited Kingdom\n\n\n\n\n\tNorth America\t\n\tCanada\n\tJamaica\n\tMexico\n\tUnited States\n\n\n\n\n\tOceania\t\n\tAustralia\n\tNew Zealand\n\n\n\n\n\tSouth America\t\n\tBrazil\n\tChile\n\n\n\n\n\t\n\tPortals: Energy\n\tRenewable energy\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nPhotovoltaics\n\n\tConcepts\t\n\tTechnology\t\n\tPhotovoltaics\n\tPhotoelectric effect\n\tSolar insolation\n\tSolar constant\n\tSolar cell efficiency\n\tQuantum efficiency\n\n\n\tNominal power (Watt-peak)\n\tThin-film solar cell\n\tMulti-junction solar cell\n\tThird-generation photovoltaic cell\n\tSolar cell research\n\tThermophotovoltaic\n\tThermodynamic efficiency limit\n\tSun-free photovoltaics\n\tPolarizing organic photovoltaics\n\n\n\n\n\tMaterials\t\n\tList of semiconductor materials\n\tCrystalline silicon (c-Si)\n\tPolycrystalline silicon (multi-Si)\n\tMonocrystalline silicon (mono-Si)\n\tCadmium telluride\n\tCopper indium gallium selenide\n\tAmorphous silicon (a-Si)\n\n\n\n\n\tHistory\t\n\tGrowth of photovoltaics\n\tTimeline of solar cells\n\n\n\n\n\n\n\t\n\n\tPhotovoltaic system\t\n\tSolar cells\t\n\tNanocrystal solar cell\n\tOrganic solar cell\n\tQuantum dot solar cell\n\tHybrid solar cell\n\tPlasmonic solar cell\n\tCarbon nanotubes in photovoltaics\n\tDye-sensitized solar cell\n\tCadmium telluride photovoltaics\n\tCopper indium gallium selenide solar cells\n\tPrinted solar panel\n\tPerovskite solar cell\n\n\n\n\n\tSystem components\t\n\tSolar panel\n\tBalance of system\n\tSolar charge controller\n\tSolar inverter\n\tSolar micro-inverter\n\tSolar cable\n\tPhotovoltaic mounting system\n\tMaximum power point tracker\n\tSolar tracker\n\tSolar shingles\n\tSolar mirror\n\tSynchronverter\n\n\n\n\n\tSystem concepts\t\n\tPerturb and observe method\n\tIncremental conductance method\n\tConstant voltage method\n\tFill factor\n\tConcentrated photovoltaics\n\tPhotovoltaic thermal hybrid solar collector\n\tSpace-based solar power\n\n\n\n\n\n\n\n\tApplications\t\n\tAppliances\t\n\tSolar-powered refrigerator\n\tSolar air conditioning\n\tSolar lamp\n\tSolar charger\n\tSolar backpack\n\tSolar tree\n\tSolar-powered pump\n\tSolar-powered watch\n\tSolar Tuki\n\tPhotovoltaic keyboard\n\tSolar road stud\n\tSolar cell phone charger\n\tSolar notebook\n\tSolar-powered calculator\n\tSolar-powered fountain\n\tSolar-powered radio\n\tSolar-powered flashlight\n\tSolar-powered fan\n\tSolar street light\n\tSolar traffic light\n\n\n\n\n\tLand transport\t\n\tSolar vehicle\n\tSolar car\n\tSolar roadway\n\tSolar golf cart\n\tThe Quiet Achiever\n\tSunmobile\n\n\n\n\n\tAir transport\t\n\tElectric aircraft\n\tMauro Solar Riser\n\tSolar panels on spacecraft\n\tSolar-Powered Aircraft Developments Solar One\n\tGossamer Penguin\n\tQinetiq Zephyr\n\tSolar Challenger\n\n\n\n\n\tWater transport\t\n\tSolar boat\n\n\n\n\n\tSolar vehicle racing\t\n\tSolar car racing\n\tList of solar car teams\n\tSolar challenges\n\tWorld Solar Challenge\n\tAmerican Solar Challenge\n\tFormula Sun Grand Prix\n\tSolar Cup\n\tFrisian Solar Challenge\n\tSolar Splash\n\tSouth African Solar Challenge\n\tTour de Sol\n\tHunt-Winston School Solar Car Challenge\n\tVictorian Model Solar Vehicle Challenge\n\n\n\n\n\n\n\n\tGeneration systems\t\n\tPV power station\t\n\tGrid-connected photovoltaic power system\n\tList of photovoltaic power stations\n\n\n\n\n\tIndividual projects\t\n\tAlamosa photovoltaic power plant\n\tBeneixama photovoltaic power plant\n\tBlythe Photovoltaic Power Plant\n\tCopper Mountain Solar Facility\n\tDarro Solar Park\n\tErlasee Solar Park\n\tGolmud Solar Park\n\tGottelborn Solar Park\n\tGuadarranque solar power plant\n\tKöthen Solar Park\n\tMoura Photovoltaic Power Station\n\tOlmedilla Photovoltaic Park\n\tPocking Solar Park\n\tPuertollano Photovoltaic Park\n\tTopaz Solar Farm\n\tWyandot Solar Facility\n\n\n\n\n\tBuilding-mounted\t\n\tRooftop photovoltaic power station\n\tBuilding-integrated photovoltaics\n\tSolar Ark\n\tStrasskirchen Solar Park\n\n\n\n\n\tBy country\t\n\tAustralia\n\tBelgium\n\tBulgaria\n\tCanada\n\tChile\n\tChina\n\tCzech Republic\n\tFrance\n\tGermany\n\tGreece\n\tIndia\n\tItaly\n\tJapan\n\tNetherlands\n\tRomania\n\tSouth Africa\n\tSpain\n\tSwitzerland\n\tThailand\n\tUnited Kingdom\n\tUSA\n\n\n\n\n\n\n\n\tPV companies\t\n\tBy country\t\n\tList of countries by photovoltaics production\n\n\n\n\n\tIndividual producers\t\n\tFirst Solar\n\tHanwha Q CELLS\n\tJA Solar\n\tMotech Solar\n\tREC\n\tSharp\n\tSolar Frontier\n\tSolyndra\n\tSungen Solar\n\tSunpower\n\tSuntech\n\tTrina Solar\n\tYingli Solar\n\n\n\n\n\n\n\n\t\n\t Category\n\t Commons\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nElectricity delivery\n\n\tConcepts\t\n\tAvailability factor\n\tAutomatic Generation Control\n\tBackfeeding\n\tBase load\n\tCapacity factor\n\tDemand factor\n\tDroop speed control\n\tEconomic dispatch\n\tElectric power\n\tDemand management\n\tEROEI\n\tFault\n\tHome energy storage\n\tGrid storage\n\tGrid code\n\tIntermittency\n\tLoad factor\n\tLoad following\n\tMerit order\n\tNameplate capacity\n\tPeak demand\n\tPower quality\n\tPower-flow study\n\tRepowering\n\tUtility frequency\n\tVariability\n\n\n\n\n\tSources\t\n\tNonrenewable\t\n\tCoal\n\tFossil fuel power station\n\tNatural gas\n\tPetroleum\n\tNuclear\n\tOil shale\n\n\n\n\n\tRenewable\t\n\tBiomass\n\tBiofuel\n\tGeothermal\n\tHydro\n\tMarine\n\tCurrent\n\tOsmotic\n\tThermal\n\tTidal\n\tWave\n\n\n\tSolar\n\tWind\n\n\n\n\n\n\n\n\tGeneration\t\n\tAC power\n\tCogeneration\n\tCombined cycle\n\tCooling tower\n\tInduction generator\n\tMicro CHP\n\tMicrogeneration\n\tRankine cycle\n\tThree-phase electric power\n\tVirtual power plant\n\n\n\n\n\tTransmission\nand distribution\n\t\n\tDemand response\n\tDistributed generation\n\tDynamic demand\n\tElectric power distribution\n\tElectrical busbar system\n\tElectric power system\n\tElectric power transmission\n\tElectrical grid\n\tElectrical interconnector\n\tHigh-voltage direct current\n\tHigh-voltage shore connection\n\tLoad management\n\tMains electricity by country\n\tPower line\n\tPower station\n\tPower storage\n\tPumped hydro\n\tSmart grid\n\tSubstation\n\tSuper grid\n\tTransformer\n\tTransmission system operator (TSO)\n\tTransmission tower\n\tUtility pole\n\n\n\n\n\tFailure modes\t\n\tBlackout (Rolling blackout)\n\tBrownout\n\tBlack start\n\tCascading failure\n\n\n\n\n\tProtective\ndevices\n\t\n\tArc-fault circuit interrupter\n\tEarth leakage circuit breaker\n\tResidual-current device (GFI)\n\tPower-system protection\n\tProtective relay\n\tDigital protective relay\n\tSulfur hexafluoride circuit breaker\n\n\n\n\n\tEconomics\nand policies\n\t\n\tCarbon offset\n\tCost of electricity by source\n\tEcotax\n\tEnergy subsidies\n\tFeed-in tariff\n\tFossil-fuel phase-out\n\tNet metering\n\tPigovian tax\n\tRenewable Energy Certificates\n\tRenewable energy payments\n\tRenewable energy policy\n\tSpark/Dark/Quark/Bark spread\n\n\n\n\n\tStatistics and Production\t\n\tList of electricity sectors\n\tElectric energy consumption\n\n\n\n\n\t\n\tCategories\n\tElectric power distribution\n\tElectricity economics\n\tPower station technology\n\tPortals\n\tEnergy\n\tRenewable energy\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nRenewable energy by country\n\n\tAfrica\t\n\tEthiopia\n\tKenya\n\tMorocco\n\tSeychelles\n\tSouth Africa\n\n\n\n\n\tAsia\t\n\tAfghanistan\n\tArmenia\n\tBangladesh\n\tBhutan\n\tChina\n\tIndia\n\tKazakhstan\n\tNepal\n\tPakistan\n\tPalestine\n\tPhilippines\n\tTaiwan\n\tThailand\n\tVietnam\n\n\n\n\n\tEurope\t\n\tEuropean Union\t\n\tAustria\n\tCzech Republic\n\tCyprus\n\tDenmark\n\tFinland\n\tFrance\n\tGermany\n\tGreece\n\tHungary\n\tIreland\n\tItaly\n\tLithuania\n\tLuxembourg\n\tMalta\n\tNetherlands\n\tPoland\n\tPortugal\n\tSpain\n\tSweden\n\tUnited Kingdom\n\n\n\n\n\tOther\t\n\tAlbania\n\tBelarus\n\tIceland\n\tNorway\n\tRussia\n\tSwitzerland\n\tTurkey\n\tUkraine\n\n\n\n\n\n\n\n\tNorth America\t\n\tCanada\n\tCosta Rica\n\tHonduras\n\tMexico\n\tUnited States\n\n\n\n\n\tOceania\t\n\tAustralia\n\tNew Zealand\n\tTuvalu\n\n\n\n\n\tSouth America\t\n\tArgentina\n\tBrazil\n\tChile\n\tColombia\n\n\n\n\n\t\n\tCategory\n\tPortals:\n\t Energy\n\t Renewable energy\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Solar_power&oldid=918451892\"\n\n\t\t\n\t\tCategories: \tEnergy conversion\n\tAlternative energy\n\tSolar power\n\tSun\n\tRenewable energy\n\n\nHidden categories: \tWebarchive template wayback links\n\tCS1 maint: archived copy as title\n\tAll articles with failed verification\n\tArticles with failed verification from June 2015\n\tCS1 errors: missing periodical\n\tWebarchive template other archives\n\tWikipedia indefinitely move-protected pages\n\tUse dmy dates from January 2017\n\tWikipedia articles in need of updating from February 2019\n\tAll Wikipedia articles in need of updating\n\tAll articles with dead external links\n\tArticles with dead external links from June 2015\n\tWikipedia articles in need of updating from August 2018\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from June 2015\n\tCommons category link is on Wikidata\n\tCommons category link is on Wikidata using P373\n\tCommons category link is defined as the pagename\n\tGood articles\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tView source\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tঅসমীয়া\n\tAzərbaycanca\n\tবাংলা\n\tЧӑвашла\n\tDansk\n\tDeutsch\n\tEesti\n\tفارسی\n\tGaeilge\n\tગુજરાતી\n\tहिन्दी\n\tIdo\n\tBahasa Indonesia\n\tҚазақша\n\tLatina\n\tNederlands\n\tNorsk\n\tРусский\n\tShqip\n\tසිංහල\n\tSlovenščina\n\tکوردی\n\tSvenska\n\tதமிழ்\n\tతెలుగు\n\tไทย\n\tᏣᎳᎩ\n\tУкраїнська\n\tTiếng Việt\n\tWinaray\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 28 September 2019, at 18:50 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "43", "dc:title": "Solar power - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Electrical_and_Mechanical_Services_Department_Headquarters_Photovoltaics.jpg/1200px-Electrical_and_Mechanical_Services_Department_Headquarters_Photovoltaics.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-solar_power", "title": "Solar power - Wikipedia"}}