{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSolar wind - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tSolar wind\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about the stellar wind from the Sun. For other uses, see Solar wind (disambiguation).\n\n  \nUlysses' observations of solar wind speed as a function of helio latitude during solar minimum. Slow wind (≈400 km/s) is confined to the equatorial regions, while fast wind (≈750 km/s) is seen over the poles.[1] Red/blue colors show inward/outward polarities of the heliospheric magnetic field.\n\n\n\n  \nAn illustration of the structure of the Sun \tGranules\n\tSunspot\n\tPhotosphere\n\tChromosphere\n\tConvection zone\n\tRadiation zone\n\tTachocline\n\tSolar core\n\tCorona\n\tFlare\n\tProminence\n\tSolar wind\n\n\n\n\n\n\n\nThe solar wind is a stream of charged particles released from the upper atmosphere of the Sun, called the corona. This plasma mostly consists of electrons, protons and alpha particles with kinetic energy between 0.5 and 10 keV. Embedded within the solar-wind plasma is the interplanetary magnetic field.[2] The solar wind varies in density, temperature and speed over time and over solar latitude and longitude. Its particles can escape the Sun's gravity because of their high energy resulting from the high temperature of the corona, which in turn is a result of the coronal magnetic field.\n\nAt a distance of more than a few solar radii from the Sun, the solar wind reaches speeds of 250 to 750 kilometers per second and is supersonic,[3] meaning it moves faster than the speed of the fast magnetosonic wave.[citation needed] The flow of the solar wind is no longer supersonic at the termination shock. The Voyager 2 spacecraft crossed the shock more than five times between 30 August and 10 December 2007.[4] Voyager 2 crossed the shock about a billion kilometers closer to the Sun than the 13.5-billion-kilometer distance where Voyager 1 came upon the termination shock.[5][6] The spacecraft moved outward through the termination shock into the heliosheath and onward toward the interstellar medium. Other related phenomena include the aurora (northern and southern lights), the plasma tails of comets that always point away from the Sun, and geomagnetic storms that can change the direction of magnetic field lines.\n\n\nContents\n\n\n\t1 History\n\t2 Acceleration\n\t3 Properties and structure\n\t3.1 Fast and slow solar wind\n\t3.2 Pressure\n\t3.3 Coronal mass ejection\n\n\n\n\t4 Solar System effects\n\t4.1 Magnetospheres\n\t4.2 Atmospheres\n\t4.3 Moons and planetary surfaces\n\n\n\n\t5 Outer limits\n\t6 Notable events\n\t7 See also\n\t8 References\n\t9 Further reading\n\t10 External links\n\n\n\n\n\nHistory[edit]\n\nThe existence of particles flowing outward from the Sun to the Earth was first suggested by British astronomer Richard C. Carrington. In 1859, Carrington and Richard Hodgson independently made the first observation of what would later be called a solar flare. This is a sudden, localised increase in brightness on the solar disc, which is now known[7] to often occur in conjunction with an episodic ejection of material and magnetic flux from the Sun's atmosphere, known as a coronal mass ejection. On the following day, a geomagnetic storm was observed, and Carrington suspected that there might be a connection, which is now attributed to the arrival of the coronal mass ejection in near-Earth space and its subsequent interaction with the Earth's magnetosphere. George FitzGerald later suggested that matter was being regularly accelerated away from the Sun and was reaching the Earth after several days.[8]\n\n\n  \nLaboratory simulation of the magnetosphere's influence on the solar wind; these auroral-like Birkeland currents were created in a terrella, a magnetised anode globe in an evacuated chamber.\n\n\n\nIn 1910 British astrophysicist Arthur Eddington essentially suggested the existence of the solar wind, without naming it, in a footnote to an article on Comet Morehouse.[9] The idea never fully caught on even though Eddington had also made a similar suggestion at a Royal Institution address the previous year. In the latter case, he postulated that the ejected material consisted of electrons while in his study of Comet Morehouse he supposed them to be ions.[9]\n\nThe first person to suggest that the ejected material consisted of both ions and electrons was Kristian Birkeland.[10] His geomagnetic surveys showed that auroral activity was nearly uninterrupted. As these displays and other geomagnetic activity were being produced by particles from the Sun, he concluded that the Earth was being continually bombarded by \"rays of electric corpuscles emitted by the Sun\".[8] In 1916, Birkeland proposed that, \"From a physical point of view it is most probable that solar rays are neither exclusively negative nor positive rays, but of both kinds\". In other words, the solar wind consists of both negative electrons and positive ions.[11] Three years later in 1919, Frederick Lindemann also suggested that particles of both polarities, protons as well as electrons, come from the Sun.[12]\n\nAround the 1930s, scientists had determined that the temperature of the solar corona must be a million degrees Celsius because of the way it stood out into space (as seen during total eclipses). Later spectroscopic work confirmed this extraordinary temperature. In the mid-1950s Sydney Chapman calculated the properties of a gas at such a temperature and determined it was such a superb conductor of heat that it must extend way out into space, beyond the orbit of Earth. Also in the 1950s, Ludwig Biermann became interested in the fact that no matter whether a comet is headed towards or away from the Sun, its tail always points away from the Sun. Biermann postulated that this happens because the Sun emits a steady stream of particles that pushes the comet's tail away.[13] Wilfried Schröder claimed that Paul Ahnert was the first to relate solar wind to comet tail direction based on observations of the comet Whipple-Fedke (1942g).[14]\n\nEugene Parker realised heat flowing from the Sun in Chapman's model and the comet tail blowing away from the Sun in Biermann's hypothesis had to be the result of the same phenomenon, which he termed the \"solar wind\".[15][16] In 1957, Parker showed,  even though the Sun's corona is strongly attracted by solar gravity, it is such a good heat conductor that it is still very hot at large distances. Since gravity weakens as distance from the Sun increases, the outer coronal atmosphere escapes supersonically into interstellar space. Furthermore, Parker was the first person to notice that the weakening effect of the gravity has the same effect on hydrodynamic flow as a de Laval nozzle: it incites a transition from subsonic to supersonic flow.[17]\n\nOpposition to Parker's hypothesis on the solar wind was strong. The paper he submitted to The Astrophysical Journal in 1958 was rejected by two reviewers. It was saved by the editor Subrahmanyan Chandrasekhar.\n\nIn January 1959, the Soviet spacecraft Luna 1 first directly observed the solar wind and measured its strength,[18][19][20] using hemispherical ion traps. The discovery, made by Konstantin Gringauz, was verified by Luna 2, Luna 3 and by the more distant measurements of Venera 1. Three years later a similar measurement was performed by Neugebauer and collaborators using the Mariner 2 spacecraft.[21]\n\nIn the late 1990s, the Ultraviolet Coronal Spectrometer (UVCS) instrument on board the SOHO spacecraft observed the acceleration region of the fast solar wind emanating from the poles of the Sun and found that the wind accelerates much faster than can be accounted for by thermodynamic expansion alone. Parker's model predicted that the wind should make the transition to supersonic flow at an altitude of about 4 solar radii from the photosphere (surface); but the transition (or \"sonic point\") now appears to be much lower, perhaps only 1 solar radius above the photosphere, suggesting that some additional mechanism accelerates the solar wind away from the Sun. The acceleration of the fast wind is still not understood and cannot be fully explained by Parker's theory. The gravitational and electromagnetic explanation for this acceleration is, however, detailed in an earlier paper by 1970 Nobel laureate for Physics, Hannes Alfvén.[22][23]\n\nThe first numerical simulation of the solar wind in the solar corona including closed and open field lines was performed by Pneuman and Kopp in 1971. The magnetohydrodynamics equations in steady state were solved iteratively starting with an initial dipolar configuration.[24]\n\nIn 1990, the Ulysses probe was launched to study the solar wind from high solar latitudes. All prior observations had been made at or near the Solar System's ecliptic plane.[25]\n\nIn 2006, the STEREO mission was launched to study coronal mass ejections and the solar corona using stereoscopy from two widely separated imaging systems.  Each STEREO spacecraft carried two heliospheric imagers:  highly sensitive wide-field cameras capable of imaging the solar wind itself, via Thomson scattering of sunlight off of free electrons.  Movies from STEREO revealed the solar wind near the ecliptic, as a large-scale turbulent flow.\n\n\n\nPlot showing a dramatic decrease in the rate of solar wind particle detection by Voyager 1\n\n\n\n\n\nThe Voyager 1 probe reached the end of the solar wind bubble in 2012. The detection of solar wind dropped of precipitously at that time, and Voyager 2 underwent a similar observation in 2018.\n\nIn 2018, NASA launched the Parker Solar Probe, named in honor of Eugene Parker, on a mission to study the structure and dynamics of the solar corona, in an attempt to understand the mechanisms that cause particles to be heated and accelerated as solar wind.  During its seven-year mission, the probe will make twenty-four orbits of the sun, passing further into the corona with each orbit's perihelion, ultimately passing within 0.04 astronomical units of the sun's surface.  It is the first NASA spacecraft named for a living person, and Parker himself, at age 91, was on hand to observe the launch.[26]\n\n\nAcceleration[edit]\n\nWhile early models of the solar wind relied primarily on thermal energy to accelerate the material, by the 1960s it was clear that thermal acceleration alone cannot account for the high speed of solar wind. An additional unknown acceleration mechanism is required and likely relates to magnetic fields in the solar atmosphere.\n\nThe Sun's corona, or extended outer layer, is a region of plasma that is heated to over a million kelvin. As a result of thermal collisions, the particles within the inner corona have a range and distribution of speeds described by a Maxwellian distribution. The mean velocity of these particles is about 145 km/s, which is well below the solar escape velocity of 618 km/s. However, a few of the particles achieve energies sufficient to reach the terminal velocity of 400 km/s, which allows them to feed the solar wind. At the same temperature, electrons, due to their much smaller mass, reach escape velocity and build up an electric field that further accelerates ions away from the Sun.[27]\n\nThe total number of particles carried away from the Sun by the solar wind is about 1.3×1036 per second.[28] Thus, the total mass loss each year is about (2–3)×10−14 solar masses,[29] or about 1.3–1.9 million tonnes per second. This is equivalent to losing a mass equal to the Earth every 150 million years.[30] However, only about 0.01% of the Sun's total mass has been lost through the solar wind.[31] Other stars have much stronger stellar winds that result in significantly higher mass loss rates.\n\n\nProperties and structure[edit]\n\n  \nThis is thought to show the solar wind of from the star L.L. Orionis generating a bow shock (the bright Arc)\n\n\n\nFast and slow solar wind[edit]\n\nThe solar wind is observed to exist in two fundamental states, termed the slow solar wind and the fast solar wind, though their differences extend well beyond their speeds. In near-Earth space, the slow solar wind is observed to have a velocity of 300–500 km/s, a temperature of ~105 K and a composition that is a close match to the corona. By contrast, the fast solar wind has a typical velocity of 750 km/s, a temperature of 8×105 K and it nearly matches the composition of the Sun's photosphere.[32] The slow solar wind is twice as dense and more variable in nature than the fast solar wind.[28][33]\n\nThe slow solar wind appears to originate from a region around the Sun's equatorial belt that is known as the \"streamer belt\", where coronal streamers are produced by magnetic flux open to the heliosphere draping over closed magnetic loops. The exact coronal structures involved in slow solar wind formation and the method by which the material is released is still under debate.[34][35][36] Observations of the Sun between 1996 and 2001 showed that emission of the slow solar wind occurred at latitudes up to 30–35° during the solar minimum (the period of lowest solar activity), then expanded toward the poles as the solar cycle approached maximum. At solar maximum, the poles were also emitting a slow solar wind.[1]\n\nThe fast solar wind originates from coronal holes,[37] which are funnel-like regions of open field lines in the Sun's magnetic field.[38] Such open lines are particularly prevalent around the Sun's magnetic poles. The plasma source is small magnetic fields created by convection cells in the solar atmosphere. These fields confine the plasma and transport it into the narrow necks of the coronal funnels, which are located only 20,000 kilometers above the photosphere. The plasma is released into the funnel when these magnetic field lines reconnect.[39]\n\n\nPressure[edit]\n\nThe wind exerts a pressure at 1 AU typically in the range of 1–6 nPa ((1–6)×10−9 N/m2), although it can readily vary outside that range.\n\nThe ram pressure is a function of wind speed and density. The formula is\n\n\n\t\n  \n    \n      \n        P\n        =\n        \n          m\n          \n            p\n          \n        \n        ⋅\n        n\n        ⋅\n        \n          V\n          \n            2\n          \n        \n        =\n        1.6726\n        ×\n        \n          10\n          \n            −\n            6\n          \n        \n        ⋅\n        n\n        ⋅\n        \n          V\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle P=m_{p}\\cdot n\\cdot V^{2}=1.6726\\times 10^{-6}\\cdot n\\cdot V^{2}}\n  \n\n\n\nwhere mp is the proton mass, pressure P is in nPa (nanopascals), n is the density in particles/cm3 and V is the speed in km/s of the solar wind.[40]\n\n\nCoronal mass ejection[edit]\n\nMain article: Coronal mass ejection\n\n  \nCME erupts from Earth's Sun\n\n\n\nBoth the fast and slow solar wind can be interrupted by large, fast-moving bursts of plasma called coronal mass ejections, or CMEs. CMEs are caused by release of magnetic energy at the Sun. CMEs are often called \"solar storms\" or \"space storms\" in the popular media. They are sometimes, but not always, associated with solar flares, which are another manifestation of magnetic energy release at the Sun. CMEs cause shock waves in the thin plasma of the heliosphere, launching electromagnetic waves and accelerating particles (mostly protons and electrons) to form showers of ionizing radiation that precede the CME.\n\nWhen a CME impacts the Earth's magnetosphere, it temporarily deforms the Earth's magnetic field, changing the direction of compass needles and inducing large electrical ground currents in Earth itself; this is called a geomagnetic storm and it is a global phenomenon. CME impacts can induce magnetic reconnection in Earth's magnetotail (the midnight side of the magnetosphere); this launches protons and electrons downward toward Earth's atmosphere, where they form the aurora.\n\nCMEs are not the only cause of space weather. Different patches on the Sun are known to give rise to slightly different speeds and densities of wind depending on local conditions. In isolation, each of these different wind streams would form a spiral with a slightly different angle, with fast-moving streams moving out more directly and slow-moving streams wrapping more around the Sun. Fast moving streams tend to overtake slower streams that originate westward of them on the Sun, forming turbulent co-rotating interaction regions that give rise to wave motions and accelerated particles, and that affect Earth's magnetosphere in the same way as, but more gently than, CMEs.\n\n\nSolar System effects[edit]\n\nMain article: Space weather\n\n  \nThe heliospheric current sheet results from the influence of the Sun's rotating magnetic field on the plasma in the solar wind\n\n\n\nOver the Sun's lifetime, the interaction of its surface layers with the escaping solar wind has significantly decreased its surface rotation rate.[41] The wind is considered responsible for comets' tails, along with the Sun's radiation.[42] The solar wind contributes to fluctuations in celestial radio waves observed on the Earth, through an effect called interplanetary scintillation.[43]\n\n\nMagnetospheres[edit]\n\nMain article: Magnetosphere\n\n  \nSchematic of Earth's magnetosphere. The solar wind flows from left to right.\n\n\n\nWhere the solar wind intersects with a planet that has a well-developed magnetic field (such as Earth, Jupiter or Saturn), the particles are deflected by the Lorentz force. This region, known as the magnetosphere, causes the particles to travel around the planet rather than bombarding the atmosphere or surface. The magnetosphere is roughly shaped like a hemisphere on the side facing the Sun, then is drawn out in a long wake on the opposite side. The boundary of this region is called the magnetopause, and some of the particles are able to penetrate the magnetosphere through this region by partial reconnection of the magnetic field lines.[27]\n\n\n  \nNoon meridian section of magnetosphere\n\n\n\nThe solar wind is responsible for the overall shape of Earth's magnetosphere. Fluctuations in its speed, density, direction, and entrained magnetic field strongly affect Earth's local space environment. For example, the levels of ionizing radiation and radio interference can vary by factors of hundreds to thousands; and the shape and location of the magnetopause and bow shock wave upstream of it can change by several Earth radii, exposing geosynchronous satellites to the direct solar wind. These phenomena are collectively called space weather.\n\nFrom the European Space Agency's Cluster mission, a new study has taken place that proposes that it is easier for the solar wind to infiltrate the magnetosphere than previously believed. A group of scientists directly observed the existence of certain waves in the solar wind that were not expected. A recent study shows that these waves enable incoming charged particles of solar wind to breach the magnetopause. This suggests that the magnetic bubble forms more as a filter than a continuous barrier. This latest discovery occurred through the distinctive arrangement of the four identical Cluster spacecraft, which fly in a controlled configuration through near-Earth space. As they sweep from the magnetosphere into interplanetary space and back again, the fleet provides exceptional three-dimensional insights on the phenomena that connect the sun to Earth.\n\nThe research characterised variances in formation of the interplanetary magnetic field (IMF) largely influenced by Kelvin–Helmholtz instability (which occur at the interface of two fluids) as a result of differences in thickness and numerous other characteristics of the boundary layer. Experts believe that this was the first occasion that the appearance of Kelvin-Helmholtz waves at the magnetopause had been displayed at high latitude dawnward orientation of the IMF. These waves are being seen in unforeseen places under solar wind conditions that were formerly believed to be undesired for their generation. These discoveries show how Earth's magnetosphere can be penetrated by solar particles under specific IMF circumstances. The findings are also relevant to studies of magnetospheric progressions around other planetary bodies. This study suggests that Kelvin-Helmholtz waves can be a somewhat common, and possibly constant, instrument for the entrance of solar wind into terrestrial magnetospheres under various IMF orientations.[44]\n\n\nAtmospheres[edit]\n\nThe solar wind affects other incoming cosmic rays interacting with planetary atmospheres. Moreover, planets with a weak or non-existent magnetosphere are subject to atmospheric stripping by the solar wind.\n\nVenus, the nearest and most similar planet to Earth, has 100 times denser atmosphere, with little or no geo-magnetic field. Space probes discovered a comet-like tail that extends to Earth's orbit.[45]\n\nEarth itself is largely protected from the solar wind by its magnetic field, which deflects most of the charged particles; however some of the charged particles are trapped in the Van Allen radiation belt. A smaller number of particles from the solar wind manage to travel, as though on an electromagnetic energy transmission line, to the Earth's upper atmosphere and ionosphere in the auroral zones. The only time the solar wind is observable on the Earth is when it is strong enough to produce phenomena such as the aurora and geomagnetic storms. Bright auroras strongly heat the ionosphere, causing its plasma to expand into the magnetosphere, increasing the size of the plasma geosphere and injecting atmospheric matter into the solar wind. Geomagnetic storms result when the pressure of plasmas contained inside the magnetosphere is sufficiently large to inflate and thereby distort the geomagnetic field.\n\nAlthough Mars is larger than Mercury and four times farther from the Sun, it is thought that the solar wind has stripped away up to a third of its original atmosphere, leaving a layer 1/100th as dense as the Earth's. It is believed the mechanism for this atmospheric stripping is gas caught in bubbles of magnetic field, which are ripped off by solar winds.[46] In 2015 the NASA Mars Atmosphere and Volatile Evolution (MAVEN) mission measured the rate of atmospheric stripping caused by the magnetic field carried by the solar wind as it flows past Mars, which generates an electric field, much as a turbine on Earth can be used to generate electricity. This electric field accelerates electrically charged gas atoms, called ions, in Mars' upper atmosphere and shoots them into space.[47] The MAVEN mission measured the rate of atmospheric stripping at about 100 grams (≈1/4 lb) per second.[48]\n\n\nMoons and planetary surfaces[edit]\n\n  \nApollo's SWC experiment\n\n\n\n  \nApollo's Solar Wind Composition Experiment on the Lunar surface\n\n\n\nMercury, the nearest planet to the Sun, bears the full brunt of the solar wind, and since its atmosphere is vestigial and transient, its surface is bathed in radiation.\n\nMercury has an intrinsic magnetic field, so under normal solar wind conditions, the solar wind cannot penetrate its magnetosphere and particles only reach the surface in the cusp regions. During coronal mass ejections, however, the magnetopause may get pressed into the surface of the planet, and under these conditions, the solar wind may interact freely with the planetary surface.\n\nThe Earth's Moon has no atmosphere or intrinsic magnetic field, and consequently its surface is bombarded with the full solar wind. The Project Apollo missions deployed passive aluminum collectors in an attempt to sample the solar wind, and lunar soil returned for study confirmed that the lunar regolith is enriched in atomic nuclei deposited from the solar wind. These elements may prove useful resources for lunar colonies.[49]\n\n\nOuter limits[edit]\n\nMain article: Heliosphere\n\n  \nA infographic featuring the outer regions of the Heliosphere based on results from the Voyager spacecraft\n\n\n\nThe solar wind \"blows a bubble\" in the interstellar medium (the rarefied hydrogen and helium gas that permeates the galaxy). The point where the solar wind's strength is no longer great enough to push back the interstellar medium is known as the heliopause and is often considered to be the outer border of the Solar System. The distance to the heliopause is not precisely known and probably depends on the current velocity of the solar wind and the local density of the interstellar medium, but it is far outside Pluto's orbit. Scientists hope to gain perspective on the heliopause from data acquired through the Interstellar Boundary Explorer (IBEX) mission, launched in October 2008.\n\nThe end of the heliosphere is noted as one of the ways defining the extent of the Solar System, along with the Kuiper Belt, and finally the radius at which of the Sun's gravitational influcence is matched by other stars.[50] The maximum extend of that Gravity has been estimated at between 50,000 AU to 2 light-years, compared to the edge of the heliopause (the outer edge of the heliosphere) which has been detected to end about 120 AU by the Voyager 1 spacecraft.[51][52]\n\n\nNotable events[edit]\n\n\tFrom May 10 to May 12, 1999, NASA's Advanced Composition Explorer (ACE) and WIND spacecraft observed a 98% decrease of solar wind density. This allowed energetic electrons from the Sun to flow to Earth in narrow beams known as \"strahl\", which caused a highly unusual \"polar rain\" event, in which a visible aurora appeared over the North Pole. In addition, Earth's magnetosphere increased to between 5 and 6 times its normal size.[53]\n\tOn 13 December 2010, Voyager 1 determined that the velocity of the solar wind, at its location 10.8 billion miles (17.4 billion kilometres) from Earth had slowed to zero. \"We have gotten to the point where the wind from the Sun, which until now has always had an outward motion, is no longer moving outward; it is only moving sideways so that it can end up going down the tail of the heliosphere, which is a comet-shaped-like object,\" said Voyager project scientist Edward Stone.[54][55]\n\n\nSee also[edit]\n\n\n\tSpace portal\n\tStar portal\n\n\n\n\n\tDeep Space Climate Observatory\n\tDyson–Harrop satellite\n\tElectric sail\n\tHeliospheric current sheet\n\tHelium focusing cone\n\tInterplanetary medium\n\tList of plasma physics articles\n\tMagnetic sail\n\tParker Solar Probe\n\tPlasmasphere\n\tSolar cycle\n\tSolar sail\n\tSolar Wind Composition Experiment\n\tSTEREO\n\tSunspot\n\n\n\n\nReferences[edit]\n\n\n\t^ a b McComas, D. J.; Elliott, H. A.; Schwadron, N. A.; Gosling, J. T.; Skoug, R. M.; Goldstein, B. E. (2003-05-15). \"The three-dimensional solar wind around solar maximum\". Geophysical Research Letters. 30 (10): 1517. Bibcode:2003GeoRL..30.1517M. doi:10.1029/2003GL017136. ISSN 1944-8007.\n\n\t^ Owens, Mathew J.; Forsyth, Robert J. (2013-11-28). \"The Heliospheric Magnetic Field\". Living Reviews in Solar Physics. 10 (1): 5. arXiv:1002.2934. Bibcode:2013LRSP...10....5O. doi:10.12942/lrsp-2013-5. ISSN 2367-3648.\n\n\n\t^ McGRAW-HILL ENCYCLOPEDIA OF Science & Technology, 8th ed., (c)1997, vol. 16, page 685\n\n\t^ \"NASA - Voyager 2 Proves Solar System Is Squashed\".\n\n\n\t^ \"Voyager 2 finds solar system's shape is 'dented'\". Reuters. 11 December 2016 – via Reuters.\n\n\n\t^ CNN, Kate Tobin. \"CNN.com - Spacecraft reaches edge of solar system - Nov. 5, 2003\".\n\n\n\t^ Cliver, Edward W.; Dietrich, William F. (2013-01-01). \"The 1859 space weather event revisited: limits of extreme activity\". Journal of Space Weather and Space Climate. 3: A31. Bibcode:2013JSWSC...3A..31C. doi:10.1051/swsc/2013053. ISSN 2115-7251.\n\n\n\t^ a b Meyer-Vernet, Nicole (2007). Basics of the Solar Winds. Cambridge University Press. ISBN 978-0-521-81420-1.\n\n\n\t^ a b Durham, Ian T. (2006). \"Rethinking the History of Solar Wind Studies: Eddington's Analysis of Comet Morehouse\". Notes and Records of the Royal Society. 60. pp. 261–270.\n\n\n\t^ Egeland, Alv; Burke, William J. (2005). Kristian Birkeland: The First Space Scientist. Springer, Dordrecht, The Netherlands. p. 80. ISBN 978-1-4020-3294-3.\n\n\n\t^ Kristian Birkeland, \"Are the Solar Corpuscular Rays that penetrate the Earth's Atmosphere Negative or Positive Rays?\" in Videnskapsselskapets Skrifter, I Mat - Naturv. Klasse No.1, Christiania, 1916.\n\n\t^ Philosophical Magazine, Series 6, Vol. 38, No. 228, December 1919, 674 (on the Solar Wind)\n\n\t^ Ludwig Biermann (1951). \"Kometenschweife und solare Korpuskularstrahlung\". Zeitschrift für Astrophysik. 29: 274. Bibcode:1951ZA.....29..274B.\n\n\n\t^ Schröder, Wilfried (2008). Who First Discovered the Solar Wind?. Germany: Darmstadt. OCLC 232645128.\n\n\n\t^ Christopher T. Russell. \"THE SOLAR WIND AND MAGNETOSPHERIC DYNAMICS\". Institute of Geophysics and Planetary Physics University of California, Los Angeles. Retrieved 2007-02-07.\n\n\n\t^ Roach, John (August 27, 2003). \"Astrophysicist Recognized for Discovery of Solar Wind\". National Geographic News. Retrieved 2006-06-13.\n\n\n\t^ Eugene Parker (1958). \"Dynamics of the Interplanetary Gas and Magnetic Fields\". The Astrophysical Journal. 128: 664. Bibcode:1958ApJ...128..664P. doi:10.1086/146579.\n\n\n\t^ [Brian Harvey, Russian planetary exploration: history, development, legacy, prospects. Springer, 2007, p.26. \nISBN 0-387-46343-7]\n\n\t^ David Darling, Internet Encyclopedia of Science.\n\n\t^ \"Luna 1\". NASA National Space Science Data Center. Retrieved 2007-08-04.\n\n\n\t^ M. Neugebauer & C. W. Snyder (1962). \"Solar Plasma Experiment\". Science. 138 (3545): 1095–1097. Bibcode:1962Sci...138.1095N. doi:10.1126/science.138.3545.1095-a. PMID 17772963.\n\n\n\t^ \"Remarks on the Rotation of a Magnetized Sphere with Application to Solar Radiation\" (PDF).\n\n\n\t^ Hannes Alfvén (1942). \"Remarks on the Rotation of a Magnetized Sphere with Application to Solar Radiation\". Arkiv för Matematik, Astronomi och Fysik. 28A (6): 1–9.\n\n\n\t^ G. W. Pneuman & R. A. Kopp (1971). \"Gas-magnetic field interactions in the solar corona\". Solar Physics. 18 (2): 258. Bibcode:1971SoPh...18..258P. doi:10.1007/BF00145940.\n\n\n\t^ \"Solar System Exploration: Missions: By Target: Mars: Present\". Solar System Exploration. Archived from the original on 2008-09-20.\n\n\n\t^ Chang, Kenneth (August 12, 2018). \"Parker Solar Probe Launches on NASA Voyage to 'Touch the Sun'\". The New York Times. Retrieved August 14, 2018.\n\n\n\t^ a b Encrenaz, Thérèse; Bibring, J.-P.; Blanc, M. (2003). The Solar System. Springer. ISBN 978-3-540-00241-3.\n\n\n\t^ a b Kallenrode, May-Britt (2004). Space Physics: An Introduction to Plasmas and. Springer. ISBN 978-3-540-20617-0.\n\n\n\t^ Carroll, Bradley W.; Ostlie, Dale A. (1995). An Introduction to Modern Astrophysics (revised 2nd ed.). Benjamin Cummings. p. 409. ISBN 978-0-201-54730-6.\n\n\n\t^ Schrijver, Carolus J.; Zwaan, Cornelis (2000). Solar and stellar magnetic activity. Cambridge University Press. ISBN 978-0-521-58286-5.\n\n\n\t^ Meyer-Vernet, Nicole (2007). Basics of the Solar Wind. Cambridge University Press. ISBN 978-0-521-81420-1.\n\n\n\t^ Geiss, J.; Gloeckler, G.; Steiger, R. Von (1995). \"Origin of the solar wind from composition data\". Space Science Reviews. 72 (1–2): 49–60. Bibcode:1995SSRv...72...49G. doi:10.1007/BF00768753. ISSN 0038-6308.\n\n\n\t^ Suess, Steve (June 3, 1999). \"Overview and Current Knowledge of the Solar Wind and the Corona\". The Solar Probe. NASA/Marshall Space Flight Center. Archived from the original on 2008-06-10. Retrieved 2008-05-07.\n\n\n\t^ Harra, Louise; Milligan, Ryan; Fleck, Bernhard (April 2, 2008). \"Hinode: source of the slow solar wind and superhot flares\". ESA. Retrieved 2008-05-07.\n\n\n\t^ Antiochos, S. K.; Mikić, Z.; Titov, V. S.; Lionello, R.; Linker, J. A. (2011-01-01). \"A Model for the Sources of the Slow Solar Wind\". The Astrophysical Journal. 731 (2): 112. arXiv:1102.3704. Bibcode:2011ApJ...731..112A. doi:10.1088/0004-637X/731/2/112. ISSN 0004-637X.\n\n\n\t^ Fisk, L. A. (2003-04-01). \"Acceleration of the solar wind as a result of the reconnection of open magnetic flux with coronal loops\" (PDF). Journal of Geophysical Research: Space Physics. 108 (A4): 1157. Bibcode:2003JGRA..108.1157F. doi:10.1029/2002JA009284. ISSN 2156-2202.\n\n\n\t^ Zirker, J. B. (1977), Coronal holes and high‐speed wind streams, Reviews of Geophysics, 15(3), 257–269\n\n\t^ Hassler, Donald M.; Dammasch, Ingolf E.; Lemaire, Philippe; Brekke, Pål; Curdt, Werner; Mason, Helen E.; Vial, Jean-Claude; Wilhelm, Klaus (1999). \"Solar Wind Outflow and the Chromospheric Magnetic Network\". Science. 283 (5403): 810–813. Bibcode:1999Sci...283..810H. doi:10.1126/science.283.5403.810. PMID 9933156.\n\n\n\t^ Marsch, Eckart; Tu, Chuanyi (April 22, 2005). \"Solar Wind Origin in Coronal Funnels\". ESA. Retrieved 2008-05-06.\n\n\n\t^ Dendy, Richard (1995). Plasma Physics: An Introductory Course. Cambridge University Press. p. 234. ISBN 9780521484527.\n\n\n\t^ Endal, A. S.; Sofia, S. (1981). \"Rotation in solar-type stars. I - Evolutionary models for the spin-down of the Sun\". Astrophysical Journal, Part 1. 243: 625–640. Bibcode:1981ApJ...243..625E. doi:10.1086/158628.\n\n\n\t^ Robin Kerrod (2000). Asteroids, Comets, and Meteors. Lerner Publications, Co.\n\n\n\t^ Jokipii, J.R. (1973). \"Turbulence and Scintillations in the Interplanetary Plasma\". Annual Review of Astronomy and Astrophysics. 11 (1): 1–28. Bibcode:1973ARA&A..11....1J. doi:10.1146/annurev.aa.11.090173.000245.\n\n\n\t^ NASA Study Using Cluster Reveals New Insights Into Solar Wind, NASA, Greenbelt, 2012, p.1\n\n\t^ Grünwaldt H;  et al. (1997). \"Venus tail ray observation near Earth\". Geophysical Research Letters. 24 (10): 163–1166. Bibcode:1997GeoRL..24.1163G. doi:10.1029/97GL01159.\n\n\n\t^ \"Solar wind ripping chunks off Mars -\". Archived from the original on 2016-03-04.\n\n\n\t^ NASA (2015-11-05). \"NASA Mission Reveals Speed of Solar Wind Stripping Martian Atmosphere\". Mars Atmosphere and Volatile Evolution (MAVEN) mission. Retrieved 2015-11-05.\n\n\n\t^ @MAVEN2Mars (5 November 2015). \"NASA MAVEN mission measures solar wind atmospheric stripping on Mars\" (Tweet) – via Twitter.\n    \n\n\t^ Starukhina, L. V. (2006). \"Polar regions of the moon as a potential repository of solar-wind-implanted gases\". Advances in Space Research. 37 (1): 50–58. Bibcode:2006AdSpR..37...50S. doi:10.1016/j.asr.2005.04.033.\n\n\n\t^ \"GMS: Where is the Edge of the Solar System?\". svs.gsfc.nasa.gov. Retrieved 2019-09-22.\n\n\n\t^ \"Voyager - Frequently Asked Questions\". voyager.jpl.nasa.gov. Retrieved 2019-09-22.\n\n\n\t^ \"Voyager - Frequently Asked Questions\". voyager.jpl.nasa.gov. Retrieved 2019-09-22.\n\n\n\t^ \"The Day the Solar Wind Disappeared\". NASA Science. 13 December 1999. Retrieved 5 October 2010.\n\n\n\t^ Amos, Jonathan (13 December 2010). \"Voyager Near Solar System Edge\". BBC News. BBC. Retrieved 14 December 2010.\n\n\n\t^ \"NASA Probe Sees Solar Wind Decline En Route To Interstellar Space\". NASA. 13 December 2010. Retrieved 14 December 2010.\n\n\n\n\n\nFurther reading[edit]\n\nFox, Karen C. (2012) \"NASA Study Using Cluster Reveals New Insights Into Solar Wind\" NASA.\n\nS.Cuperman and N. Metzler, Role of fluctuations in the interplanetary magnetic field on the heat conduction in the Solar Wind.J.Geophys. Res. 78 (16), 3167–3168, 1973.\n\nS. Cuperman and N. Metzler. Astrophys. J., 182 (3), 961–975, 1973.\n\nS. Cuperman and N. Metzler, Solution of 3-fluid model equations with anomalous transport coefficients for thequiet Solar Wind. Astrophys.J., 196 (1) 205–219, 1975\n\nS. Cuperman, N. Metzler and M. Spygelglass, Confirmation of known numerical solutions for the\nquiet Solar Wind equations. Astrophys. J., 198 (3), 755–759, 1975.\n\nS.Cuperman and N. Metzler, Relative magnitude of streaming velocities of alpha particles and protons at 1AU. Astrophys. and Space Sci. 45 (2) 411–417,1976.\n\nN. Metzler. A multi-fluid model for stellar winds.Proceedings of the L.D.de Feiter Memorial Symposium on the Study of Traveling Interplanetary Phenomena. \nAFGL-TR-77-0309, Air Force Systems Command, USAF, 1978.\n\nN. Metzler and M. Dryer, A self-consistent solution of the three-fluid model of the Solar Wind.\nAstrophys. J., 222 (2), 689–695, 1978.\n\nS. Cuperman and N. Metzler, Comments on Acceleration of Solar Wind He++3 effects of Resonant and nonresonant interactions with transverse waves. J. Geophys. Res. 84 (NA5), 2139–2140 (1979) \n\nN. Metzler, S. Cuperman, M. Dryer and P. Rosenau, A time-dependent two-fluid model with \nthermal conduction for Solar Wind. Astrophys. J., 231 (3) 960–976, 1979.\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Solar wind.\n\n\n\t\tWikisource has original text related to this article:\nSolar-wind interaction with planetary ionospheres\n\n\n\n\tReal-time plots of solar wind activity from the Advanced Composition Explorer\n\n\n\t\tv\n\tt\n\te\n\n\nThe Sun\n\n\tInternal structure\t\n\tCore\n\tRadiation zone\n\tTachocline\n\tConvection zone\n\n\n\n\t\n\n\n\tAtmosphere\t\n\tPhotosphere\t\n\tSupergranulation\n\tGranule\n\tFaculae\n\tSunspot\n\n\n\n\n\tChromosphere\t\n\tPlage\n\tSpicule\n\tMoreton wave\n\n\n\n\n\tCorona\t\n\tTransition region\n\tCoronal hole\n\tCoronal loop\n\tCoronal mass ejection\n\tProminence\n\tHelmet streamer\n\tSupra-arcade downflows\n\n\n\n\n\n\n\n\tVariation\t\n\tSolar cycle\n\tList of solar cycles\n\n\n\tSolar maximum\n\tSolar minimum\n\tWolf number\n\tSolar wind\n\tFlare\n\tHelioseismology\n\n\n\n\n\tHeliosphere\t\n\tCurrent sheet\n\tTermination shock\n\tHeliosheath\n\tHeliopause\n\tBow shock\n\n\n\n\n\tRelated\t\n\tHeliophysics\n\tSolar activity\n\tSolar astronomy\n\tSolar dynamo\n\tEclipse\n\tSolar energy\n\tSolar neutrino\n\tSolar observation\n\tSolar phenomena\n\tSolar physics\n\tSolar System\n\tSolar telescope\n\tSolar time\n\tSpace climate\n\tSpace weather\n\tStandard solar model\n\tStar\n\tSunlight radiation\n\n\n\n\n\t\n\tSpectral class: G-type main-sequence star\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nMagnetospherics\n\n\tSubmagnetosphere\t\n\tAtmospheric circulation\n\tAurora\n\tEarth's magnetic field\n\tGeosphere\n\tJet stream\n\tPolar wind\n\n\n\n\n\tEarth's magnetosphere\t\n\tBirkeland current\n\tBow shock\n\tIonosphere\n\tMagnetopause\n\tMagnetosheath\n\tMagnetosphere\n\tMagnetosphere chronology\n\tMagnetosphere particle motion\n\tPlasmasphere\n\tRing current\n\tVan Allen radiation belt\n\n\n\n\n\tSolar wind\t\n\tCoronal cloud\n\tCoronal mass ejection\n\tSolar flare\n\tGeomagnetic storm\n\tHeliosphere\n\tInterplanetary magnetic field\n\tHeliospheric current sheet\n\tHeliopause\n\tSolar particle event\n\tSpace climate\n\tSpace weather\n\n\n\n\n\tSatellites\t\n\tFull list\n\tArase (2016)\n\tCluster II\n\tDouble Star\n\tGeotail\n\tIMAGE\n\tMMS (2015)\n\tPolar\n\tTHEMIS\n\tVan Allen Probes\n\tWind\n\n\n\n\n\tResearch projects\t\n\tHAARP\n\tSHARE\n\tUnwin Radar\n\n\n\tSuperDARN\n\n\n\n\n\tOther magnetospheres\t\n\tHermian\n\tLunar\n\tJovian\n\tGanymedian\n\tSaturnian\n\tUranian\n\tNeptunian\n\n\n\n\n\tRelated topics\t\n\tFlux tube\n\tGas torus\n\tLunar swirls\n\tPlanetary rings\n\tJupiter\n\tSaturn\n\tUranus\n\tNeptune\n\n\n\n\n\n\n\n\n\n\tAuthority control \t\n\tBNF: cb119790203 (data)\n\tGND: 4135572-6\n\tLCCN: sh85124550\n\tNDL: 00572585\n\tSUDOC: 027833666\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Solar_wind&oldid=918714116\"\n\n\t\t\n\t\tCategories: \tSolar phenomena\n\tSpace plasmas\n\n\nHidden categories: \tAll articles with unsourced statements\n\tArticles with unsourced statements from September 2019\n\tCommons category link from Wikidata\n\tWikipedia articles with BNF identifiers\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NDL identifiers\n\tWikipedia articles with SUDOC identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBosanski\n\tBrezhoneg\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEmiliàn e rumagnòl\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tFrysk\n\tGaeilge\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tქართული\n\tҚазақша\n\tKiswahili\n\tKreyòl ayisyen\n\tКыргызча\n\tLatina\n\tLatviešu\n\tLietuvių\n\tMagyar\n\tമലയാളം\n\tBahasa Melayu\n\tМонгол\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tOʻzbekcha/ўзбекча\n\tپنجابی\n\tភាសាខ្មែរ\n\tPiemontèis\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tShqip\n\tSicilianu\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\tWinaray\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 30 September 2019, at 00:24 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "17", "dc:title": "Solar wind - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Solar_wind_Speed_interplanetary_magnetic_field.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-solar_wind", "title": "Solar wind - Wikipedia"}}