{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSpacecraft thermal control - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tSpacecraft thermal control\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Spacecraft thermal control\" – news · newspapers · books · scholar · JSTOR  (October 2015) (Learn how and when to remove this template message)\n\n\n\n  \nSunshade of MESSENGER, orbiter of planet Mercury\n\n\n\nIn spacecraft design, the function of the thermal control system (TCS) is to keep all the spacecraft's component systems within acceptable temperature ranges during all mission phases. It must cope with the external environment, which can vary in a wide range as the spacecraft is exposed to deep space or to solar or planetary flux, and with ejecting to space the internal heat generated by the operation of the spacecraft itself.\n\nThermal control is essential to guarantee the optimum performance and success of the mission because if a component is subjected to temperatures which are too high or too low, it could be damaged or its performance could be severely affected. Thermal control is also necessary to keep specific components (such as optical sensors, atomic clocks, etc.) within a specified temperature stability requirement, to ensure that they perform as efficiently as possible. \n\nThe thermal control subsystem can be composed both of passive and of active items and works in two ways:\n\n\n\tprotects the equipment from overheating, either by thermal insulation from external heat fluxes (such as the Sun or the planetary infrared and albedo flux), or by proper heat removal from internal sources (such as the heat emitted by the internal electronic equipment).\n\tprotects the equipment from temperatures that are too cold, by thermal insulation from external sinks, by enhanced heat absorption from external sources, or by heat release from internal sources.\n\n\nPassive Thermal Control System (PTCS) components include:\n\n\n\tMulti-layer insulation (MLI), which protects the spacecraft from excessive solar or planetary heating as well as from excessive cooling when exposed to deep space\n\tcoatings that change the thermo-optical properties of external surfaces\n\tthermal fillers to improve the thermal coupling at selected interfaces (for instance on the thermal path between an electronic unit and its radiator)\n\tthermal washers to reduce the thermal coupling at selected interfaces\n\tthermal doublers to spread on the radiator surface the heat dissipated by equipment\n\tmirrors (secondary surface mirrors, SSM, or optical solar reflectors, OSR) to improve the heat rejection capability of the external radiators and at the same time to reduce the absorption of external solar fluxes\n\tradioisotope heater units (RHU), used by some planetary and exploratory missions to produce heat for TCS purposes\n\n\nActive Thermal Control System (ATCS) components include:\n\n\n\tthermostatically controlled resistive electric heaters to keep the equipment temperature above its lower limit during the mission's cold phases\n\tfluid loops to transfer the heat emitted by equipment to the radiators. They can be:\n\tsingle-phase loops, controlled by a pump\n\ttwo-phase loops, composed of heat pipes (HP), loop heat pipes (LHP) or capillary pumped loops (CPL)\n\n\n\tlouvers (which change the heat rejection capability to space as a function of temperature)\n\tthermoelectric coolers\n\n\nContents\n\n\n\t1 Thermal Control Systems\n\t2 Environment\n\t3 Temperature Requirements\n\t4 Current Technologies\n\t4.1 Coating\n\t4.2 Multilayer Insulation (MLI)\n\t4.3 Louvers\n\t4.4 Heaters\n\t4.5 Radiators\n\t4.6 Heat pipes\n\n\n\n\t5 Future of Thermal Control Systems\n\t6 Events\n\t7 Sun shield\n\t8 See also\n\t9 Bibliography\n\t10 References\n\n\n\n\n\nThermal Control Systems[edit]\n\n  \nParker Solar Probe in thermal testing\n\n\n\n\tEnvironment interaction\n\tIncludes the interaction of the external surfaces of the spacecraft to the environment. Either the surfaces need to be protected from the environment or there has to be improved interaction. Two main goals of environment interaction are the reduction or increase of absorbed environmental fluxes and reduction or increase of heat losses to the environment.\n\n\n\tHeat collection\n\tIncludes the removal of dissipated heat from the equipment in which it is created to avoid unwanted increases in the spacecraft's temperature.\n\n\n\tHeat transport\n\tIs taking the heat from where it is created to a radiating device.\n\n\n\tHeat rejection\n\tThe heat collected and transported has to be rejected at an appropriate temperature to a heat sink, which is usually the surrounding space environment. The rejection temperature depends on the amount of heat involved, the temperature to be controlled and the temperature of the environment into which the device radiates the heat.\n\n\n\tHeat provision and storage.\n\tIs to maintain a desired temperature level where heat has to be provided and suitable heat storage capability has to be foreseen.\n\n\n\n\nEnvironment[edit]\n\nFor a spacecraft the main environmental interactions are the energy coming from the sun and the heat radiated to deep space. Other parameters also influence the thermal control system design such as the spacecraft's altitude, orbit, attitude stabilization, and spacecraft shape. Different types of orbit, such as low earth orbit and geostationary orbit, also affect the design of the thermal control system. \n\n\n\tLow Earth Orbit (LEO)\n\tThis orbit is frequently used by spacecraft that monitor or measure the characteristics of the Earth and its surrounding environment and by unmanned and manned space laboratories, such as EURECA and the International Space Station. The orbit's proximity to the Earth has a great influence on the thermal control system needs, with the Earth's infrared emission and albedo playing a very important role, as well as the relatively short orbital period, less than 2 hours, and long eclipse duration. Small instruments or spacecraft appendages such as solar panels that have low thermal inertia can be seriously affected by this continuously changing environment and may require very specific thermal design solutions.\n\n\n\tGeostationary orbit (GEO)\n\tIn this 24-hour orbit, the Earth's influence is almost negligible except for the shadowing during eclipses, which can vary in duration from zero at solstice to a maximum of 1.2 hours at equinox. Long eclipses influence the design of both the spacecraft's insulation and heating systems. The seasonal variations in the direction and intensity of the solar input have a great impact on the design, complicating the heat transport by the need to convey most of the dissipated heat to the radiator in shadow, and the heat-rejection systems via the increased radiator area needed. Almost all telecommunications and many meteorological satellites are in this type of orbit.\n\n\n\tHighly Eccentric Orbits (HEO)\n\tThese orbits can have a wide range of apogee and perigee altitudes, depending on the particular mission. Generally, they are used for astronomy observatories and the TCS design requirements depend on the spacecraft's orbital period, the number and duration of the eclipses, the relative attitude of Earth, Sun and spacecraft, the type of instruments onboard and their individual temperature requirements.\n\n\n\tDeep space and planetary exploration\n\tAn interplanetary trajectory exposes spacecrafts to a wide range of thermal environment more severe than those encountered around earth's orbits. Interplanetary mission includes many different sub-scenarios depending on the particular celestial body. In general, the common features are a long mission duration and the need to cope with extreme thermal conditions, such as cruises either close to or far away from the Sun (from 1 to 4–5 AU), low orbiting of very cold or very hot celestial bodies, descents through hostile atmospheres, and survival in the extreme (dusty, icy) environments on the surfaces of the bodies visited. The challenge for the TCS is to provide enough heat-rejection capability during the hot operating phases and yet still survive the cold inactive ones. The major problem is often the provision of the power required for that survival phase.\n\n\n\n\nTemperature Requirements[edit]\n\nThe temperature requirements of the instruments and equipment on board are the main factors in the design of the thermal control system. The goal of the TCS is to keep all the instruments working within their allowable temperature range. All of the electronic instruments on board the spacecraft, such as cameras, data collection devices, batteries, etc., have a fixed operating temperature range. Keeping these instruments in their optimal operational temperature range is crucial for every mission. Some examples of temperature ranges include\n\n\n\tBatteries, which have a very narrow operating range, typically between −5 and 20˚C\n\tPropulsion components, which have a typical range of 5 to 40˚C for safety reasons, however, a wider range is acceptable\n\tCameras, which have a range of −30 to 40˚C\n\tSolar arrays, which have a wide operating range of −150 to 100˚C\n\tInfrared spectrometers, which have a range of −40 to 60˚C\n\n\nCurrent Technologies[edit]\n\nCoating[edit]\n\nCoatings are the simplest and least expensive of the TCS techniques. A coating may be paint or a more sophisticated chemical applied to the surfaces of the spacecraft to lower or increase heat transfer. The characteristics of the type of coating depends on their absorptivity, emissivity, transparency, and reflectivity. The main disadvantage of coating is that it degrades quickly due to the operating environment.\n\n\nMultilayer Insulation (MLI)[edit]\n\nMultilayer insulation (MLI) is the most common passive thermal control element used on spacecrafts. MLI prevent both heat losses to the environment and excessive heating from the environment. Spacecraft components such as propellant tanks, propellant lines, batteries, and solid rocket motors are also covered in MLI blankets to maintain ideal operating temperature. MLI consist of an outer cover layer, interior layer, and an inner cover layer. The outer cover layer needs to be opaque to sunlight, generate a low amount of particulate contaminates, and be able to survive in the environment and temperature to which the spacecraft will be exposed. Some common materials used for the outer layer are fiberglass woven cloth impregnated with PTFE Teflon, PVF reinforced with Nomex bonded with polyester adhesive, and FEP Teflon. The general requirement for the interior layer is that it needs to have a low emittance. The most commonly used material for this layer is Mylar that is aluminized on one or both sides. The interior layers are usually thin compared to the outer layer to save weight and are perforated to aid in venting trapped air during launch. The inner cover faces the spacecraft hardware and is used to protect the thin interior layers. Inner covers are often not aluminized in order to prevent electrical shorts. Some materials used for the inner covers are Dacron and Nomex Netting. Mylar is not used because of flammability concerns. MLI blankets are an important element of the thermal control system.\n\n\nLouvers[edit]\n\nLouvers are active thermal control elements that are used in many different forms. Most commonly they are placed over external radiators, louvers can also be used to control heat transfer between internal spacecraft surfaces, or be placed on openings on the spacecraft walls. A louver in its fully open state can reject six times as much heat as it does in its fully closed state, with no power required to operate it. The most commonly used louver is the bimetallic, spring-actuated, rectangular blade louver also known as venetian-blind louver. Louver radiator assemblies consist of five main elements: baseplate, blades, actuators, sensing elements, and structural elements.\n\n\nHeaters[edit]\n\nHeaters are used in thermal control design to protect components under cold-case environmental conditions or to make up for heat that is not dissipated. Heaters are used with thermostats or solid-state controllers to provide exact temperature control of a particular component. Another common use for heaters is to warm up components to their minimum operating temperatures before the components are turned on. \n\n\n\tThe most common type of heater used on spacecraft is the patch heater which consists of an electrical-resistance element sandwiched between two sheets of flexible electrically insulating material, such as Kapton. The patch heater may contain either a single circuit or multiple circuits, depending on whether or not redundancy is required within it.\n\tAnother type of heater, the cartridge heater, is often used to heat blocks of material or high-temperature components such as propellants. This heater consists of a coiled resistor enclosed in a cylindrical metallic case. Typically a hole is drilled in the component to be heated and the cartridge is potted into the hole. Cartridge heaters are usually a quarter-inch or less in diameter and up to a few inches long.\n\tAnother type of heater used on spacecraft is the radioisotope heater units also known as RHUs. RHUs are used for traveling to outer planets past Jupiter due to very low solar radiance, which greatly reduces the power generated from solar panels. These heaters do not require any electrical power from the spacecraft and provide direct heat where it is needed. At the center of each RHU is a radioactive material which decays to provide heat. The most commonly used material is plutonium-dioxide. A single RHU weighs just 42 grams and can fit in a cylindrical enclosure 26mm in diameter and 32mm long. Each unit also generates 1 W of heat at encapsulation however the heat generation rate decreases with time. A total of 117 RHUs were used on the Cassini mission.\n\n\nRadiators[edit]\n\nExcess waste heat created on the spacecraft is rejected to space by the use of radiators. Radiators come in several different forms, such as spacecraft structural panels, flat-plate radiators mounted to the side of the spacecraft, and panels deployed after the spacecraft is on orbit. Whatever the configuration, all radiators reject heat by infrared (IR) radiation from their surfaces. The radiating power depends on the surface's emittance and temperature. The radiator must reject both the spacecraft waste heat and any radiant-heat loads from the environment. Most radiators are therefore given surface finishes with high IR emittance to maximize heat rejection and low solar absorptance to limit heat from the sun. Most spacecraft radiators reject between 100 and 350 W of internally generated electronics waste heat per square meter. Radiators weight typically varies from almost nothing, if an existing structural panel is used as a radiator, to around 12 kg/m2 for a heavy deployable radiator and its support structure.\n\nThe radiators of the International Space Station are clearly visible as arrays of white square panels attached to the main truss.[1]\n\n\nHeat pipes[edit]\n\nHeat pipes use a closed two-phase liquid-flow cycle with an evaporator and a condenser to transport relatively large quantities of heat from one location to another without electrical power.\n\n\nFuture of Thermal Control Systems[edit]\n\n\tComposite materials\n\tHeat rejection through Advanced Passive Radiators\n\tSpray cooling devices (e.g. liquid droplet radiator)\n\tLightweight thermal insulation\n\tVariable-emittance technologies\n\tDiamond films\n\tAdvanced thermal control coatings\n\tMicrosheets\n\tAdvanced spray on thin films\n\tSilvered quartz mirrors\n\tAdvanced metallized polymer-based films\n\n\n\n\nEvents[edit]\n\nA major event in the field of space thermal control is the International Conference on Environmental Systems, organized every year by AIAA.\n\n\nSun shield[edit]\n\n  \nSunshield full-size test for the James Webb Space Telescope\n\n\n\nIn spacecraft design, a sun shield restricts or reduces heat caused by sunlight hitting a spacecraft.[2] An example of use of a thermal shield is on the Infrared Space Observatory.[3] The ISO sunshield helped protect the cryostat from sunlight, and it was also covered with solar panels.[4]\n\nNot to be confused with concept of a  global scale sun shield in geoengineering, often called a Space sunshade or \"sun shield\", in that case the spacecraft itself is used to block sunlight on a planet, not as part the spacecraft's thermal design.[5]\n\nAn example of a sunshield in spacecraft design is the Sunshield (JWST) on the planned James Webb Space Telescope.[6]\n\n\nSee also[edit]\n\n\tEnvironmental Control and Life Support System\n\tSpace sunshade\n\tTemperature control\n\n\nBibliography[edit]\n\n\tGilmore, D.G., “Satellite Thermal Control Handbook”, The Aerospace Corporation Press, 1994.\n\tKaram, R.D., Satellite Thermal Control for Systems Engineers, Progress in Astronautics and Aeronautics, AIAA, 1998.\n\tGilmore, D.G., “Spacecraft Thermal Control Handbook 2nd ed.”, The Aerospace Corporation Press, 2002.\n\tDe Parolis, M.N., and W. Pinter-Krainer. Current and Future Techniques for Spacecraft Thermal Control 1. Design Drivers and Current Technologies. 1 Aug. 1996. Web. 5 Sept. 2014.\n\n\nReferences[edit]\n\n\n\t^ \"Radiators\". International Space Station. NASA. Retrieved September 26, 2015.\n\n\t^ [1]\n\n\t^ [2]\n\n\t^ [3]\n\n\t^ [4]\n\n\t^ [5]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Spacecraft_thermal_control&oldid=908549184\"\n\n\t\t\n\t\tCategories: \tTemperature control\n\tSpacecraft design\n\n\nHidden categories: \tArticles needing additional references from October 2015\n\tAll articles needing additional references\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tDeutsch\n\tEspañol\n\tFrançais\n\tItaliano\n\tРусский\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 30 July 2019, at 12:31 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Spacecraft thermal control - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/MESSENGER_04pd1465.jpg/1200px-MESSENGER_04pd1465.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-spacecraft_thermal_control", "title": "Spacecraft thermal control - Wikipedia"}}