{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThermoelectric cooling - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tThermoelectric cooling\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\tThermoelectric effect\n\t\n\t\nPrinciples\n\n\tThermoelectric effect\n\tSeebeck effect\n\tPeltier effect\n\tThomson effect\n\tSeebeck coefficient\n\n\n\tEttingshausen effect\n\tNernst effect\n\n\n\n\n\t\nApplications\n\n\tThermoelectric materials\n\tThermocouple\n\tThermopile\n\tThermoelectric cooling\n\tThermoelectric generator\n\tRadioisotope thermoelectric generator\n\tAutomotive thermoelectric generator\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\n\t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Thermoelectric cooling\" – news · newspapers · books · scholar · JSTOR  (July 2015) (Learn how and when to remove this template message)\n\n\n\nThermoelectric cooling uses the Peltier effect to create a heat flux at the junction of two different types of materials. A Peltier cooler, heater, or thermoelectric heat pump is a solid-state active heat pump which transfers heat from one side of the device to the other, with consumption of electrical energy, depending on the direction of the current. Such an instrument is also called a Peltier device, Peltier heat pump, solid state refrigerator, or thermoelectric cooler (TEC). It can be used either for heating or for cooling,[1] although in practice the main application is cooling. It can also be used as a temperature controller that either heats or cools.\n\nThis technology is far less commonly applied to refrigeration than vapor-compression refrigeration is. The primary advantages of a Peltier cooler compared to a vapor-compression refrigerator are its lack of moving parts or circulating liquid, very long life, invulnerability to leaks, small size, and flexible shape. Its main disadvantages are high cost for a given cooling capacity and poor power efficiency. Many researchers and companies are trying to develop Peltier coolers that are cheap and efficient. (See Thermoelectric materials.)\n\nA Peltier cooler can also be used as a thermoelectric generator. When operated as a cooler, a voltage is applied across the device, and as a result, a difference in temperature will build up between the two sides. When operated as a generator, one side of the device is heated to a temperature greater than the other side, and as a result, a difference in voltage will build up between the two sides (the Seebeck effect). However, a well-designed Peltier cooler will be a mediocre thermoelectric generator and vice versa, due to different design and packaging requirements.\n\n\nContents\n\n\n\t1 Operating principle\n\t2 Construction\n\t2.1 Design\n\t2.2 Materials\n\n\n\n\t3 Strengths and weaknesses\n\t3.1 Benefits\n\t3.2 Disadvantages\n\n\n\n\t4 Performance\n\t5 Uses\n\t5.1 Consumer products\n\t5.2 Industrial\n\t5.3 Science and imaging\n\n\n\n\t6 Identification\n\t7 See also\n\t8 References\n\n\n\n\n\nOperating principle[edit]\n\n  \nPeltier element schematic. Thermoelectric legs are thermally in parallel and electrically in series.\n\n\n\nMain article: Thermoelectric effect\n\nThermoelectric coolers operate by the Peltier effect (which also goes by the more general name thermoelectric effect). The device has two sides, and when a DC electric current flows through the device, it brings heat from one side to the other, so that one side gets cooler while the other gets hotter. The \"hot\" side is attached to a heat sink so that it remains at ambient temperature, while the cool side goes below room temperature. In special applications, multiple coolers can be cascaded together for lower temperature, but overall efficiency drops significantly.\n\n\nConstruction[edit]\n\nDesign[edit]\n\nTwo unique semiconductors, one n-type and one p-type, are used because they need to have different electron densities. The alternating p & n-type semiconductor pillars are placed thermally in parallel to each other and electrically in series and then joined with a thermally conducting plate on each side, usually ceramic removing the need for a separate insulator. When a voltage is applied to the free ends of the two semiconductors there is a flow of DC current across the junction of the semiconductors causing a temperature difference. The side with the cooling plate absorbs heat which is then transported by the semiconductor to the other side of the device. The cooling ability of the total unit is then proportional to the total cross section of all the pillars, many are connected electrically in series to reduce the current needed to practical levels. The length of the pillars is a balance between longer pillars which will have a greater thermal resistance between the sides and allow a lower temperature to be reached but produce more resistive heating, and shorter pillars which will have a greater electrical efficiency but let more heat leak from the hot to cold side by thermal conduction. For large temperature differences longer pillars are far less efficient than stacking separate, progressively larger modules, the modules get larger as each layer must remove both the heat moved by the above layer and the waste heat of the layer.\n\n\nMaterials[edit]\n\n  \nZT values for various materials and bismuth alloys.[2]\n\n\n\nMaterials suitable for high efficiency TEC systems must have a combination of low thermal conductivity and high electrical conductivity. The combined goodness of different material combinations is commonly compared using a figure of merit known as ZT, a measure of the system’s efficiency. The equation for ZT is given below, where alpha is the Seebeck coefficient, sigma is the electrical conductivity and kappa is the thermal conductivity.[3]\n\n\n  \n    \n      \n        \n          Z\n        \n        \n          T\n        \n        =\n        (\n        \n          α\n          \n            2\n          \n        \n        σ\n        \n          T\n        \n        )\n        \n          /\n        \n        κ\n      \n    \n    {\\displaystyle \\mathbb {Z} \\mathrm {T} =(\\alpha ^{2}\\sigma \\mathrm {T} )/\\kappa }\n  \n\n\nThere are few materials that are suitable for TEC applications since the relationship between thermal and electrical conductivity is usually a positive correlation. Improvements in reduced thermal transport with increased electrical conductivity are an active area of material science research.\n\n\nStrengths and weaknesses[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Thermoelectric cooling\" – news · newspapers · books · scholar · JSTOR  (March 2019) (Learn how and when to remove this template message)\n\n\n\nThere are many factors motivating further research on TEC including lower carbon emissions and ease of manufacturing. However, several challenges have arisen.\n\n\nBenefits[edit]\n\nA significant benefit of TEC systems is that they have no moving parts. This lack of mechanical wear and reduced instances of failure due to fatigue and fracture from mechanical vibration and stress increases the lifespan of the system and lowers the maintenance requirements. Current technologies show the mean time between failures (MTBF) to exceed 100,000 hours at ambient temperatures.[4]\n\nThe fact that TEC systems are current-controlled leads to another series of benefits. Because the flow of heat is directly proportional to the applied DC current, heat may be added or removed with accurate control of the direction and amount of electrical current. In contrast to methods that use resistive heating or cooling methods that involve gasses, TEC allows for an equal degree of control over the flow of heat (both in and out of a system under control). Because of this precise bidirectional heat flow control, temperatures of controlled systems can be precise to fractions of a degree, often reaching precision of milli Kelvin (mK) in laboratory settings.[5] TEC devices are also more flexible in shape than their more traditional counterparts. They can be used in environments with less space or more severe conditions than a conventional refrigerator. The ability to tailor their geometry allows for the delivery of precise cooling to very small areas. These factors make them a common choice in scientific and engineering applications with demanding requirements where cost and absolute energy efficiency are not primary concerns.\n\n\n\nAnother benefit of TEC is that it does not use refrigerants in its operation. Prior to their phaseout some early refrigerants, such as chlorofluorocarbons (CFCs), contributed significantly to ozone depletion. Many refrigerants used today also have significant environmental impact with global warming potential.[6]\n\n\nDisadvantages[edit]\n\nTEC systems have a number of notable disadvantages. Foremost is their limited energy efficiency compared to conventional vapor-compression systems and the constraints on the total heat flux (heat flow) that they are able to generate per unit area. [5]  This topic is further discussed in the performance section below.\n\n\nPerformance[edit]\n\nA single-stage thermoelectric cooler will typically produce a maximal temperature difference of 70 °C between its hot and cold sides.[7] The more heat moved using TEC, the less efficient it becomes, because the cooler needs to dissipate both the heat being moved and the waste heat generated from its own power consumption. The amount of heat that can be absorbed is proportional to the current and time.\n\n\n\t\n  \n    \n      \n        Q\n        =\n        P\n        I\n        t\n        ,\n      \n    \n    {\\displaystyle Q=PIt,}\n  \n\n\n\nwhere P is the Peltier coefficient, I is the current, and t is the time. The Peltier coefficient depends on temperature and the materials the cooler is made of.\n\nIn refrigeration applications, thermoelectric junctions have about 1/4 the efficiency compared to conventional means (they offer around 10–15% efficiency of the ideal Carnot cycle refrigerator, compared with 40–60% achieved by conventional compression-cycle systems (reverse Rankine systems using compression/expansion).[8]) Due to this lower efficiency, thermoelectric cooling is generally only used in environments where the solid-state nature (no moving parts), low maintenance, compact size, and orientation insensitivity outweighs pure efficiency.\n\nPeltier (thermoelectric) cooler performance is a function of ambient temperature, hot and cold side heat exchanger (heat sink) performance, thermal load, Peltier module (thermopile) geometry, and Peltier electrical parameters.[9]\n\nRequirements for thermoelectric materials:[citation needed]\n\n\n\tNarrow band-gap semiconductors because of room-temperature operation\n\tHeavy elements because of their high mobility and low thermal conductivity\n\tLarge unit cell, complex structure\n\tHighly anisotropic or highly symmetric\n\tComplex compositions\n\n\nCommon thermoelectric materials used as semiconductors include bismuth telluride, lead telluride, silicon germanium, and bismuth-antimony alloys. Of these bismuth telluride is the most commonly used. New high-performance materials for thermoelectric cooling are being actively researched.\n\n\nUses[edit]\n\n  \nA USB-powered beverage cooler\n\n\n\nThermoelectric coolers are used for applications that require heat removal ranging from milliwatts to several thousand watts. They can be made for applications as small as a beverage cooler or as large as a submarine or railroad car. TEC elements have limited life time. Their health strength can be measured by the change of their AC resistance (ACR). When a cooler element gets \"old\" or worn out, the ACR will increase.[citation needed]\n\n\nConsumer products[edit]\n\nPeltier elements are commonly used in consumer products. For example, Peltier elements are used in camping, portable coolers, cooling electronic components and small instruments. The cooling effect of Peltier heat pumps can also be used to extract water from the air in dehumidifiers. A camping/car type electric cooler can typically reduce the temperature by up to 20 °C (36 °F) below the ambient temperature. Climate-controlled jackets are beginning to use Peltier elements.[10][11] Thermoelectric coolers are used to augment heat sinks for microprocessors. They are also used for wine coolers.\n\n\nIndustrial[edit]\n\nThermoelectric coolers are used in many fields of industrial manufacturing and require a thorough performance analysis as they face the test of running thousands of cycles before these industrial products are launched to the market. Some of the applications include laser equipment, thermoelectric air conditioners or coolers, industrial electronics and telecommunications,[12] automotive, mini refrigerators or incubators, military cabinets, IT enclosures, and more.\n\n\nScience and imaging[edit]\n\nPeltier elements are used in scientific devices. They are a common component in thermal cyclers, used for the synthesis of DNA by polymerase chain reaction (PCR), a common molecular biological technique, which requires the rapid heating and cooling of the reaction mixture for denaturation primer annealing and enzymatic synthesis cycles.\n\nWith feedback circuitry, Peltier elements can be used to implement highly stable temperature controllers that keep desired temperature within ±0.01 °C. Such stability may be used in precise laser applications to avoid laser wavelength drifting as environment temperature changes.\n\nThe effect is used in satellites and spacecraft to reduce temperature differences caused by direct sunlight on one side of a craft by dissipating the heat over the cold shaded side, where it is dissipated as thermal radiation to space.[13] Since 1961, some unmanned spacecraft (including the Curiosity Mars rover) utilize radioisotope thermoelectric generators (RTGs) that convert thermal energy into electrical energy using the Seebeck effect. The devices can last several decades, as they are fueled by the decay of high-energy radioactive materials.\n\nPhoton detectors such as CCDs in astronomical telescopes, spectrometers, or very high-end digital cameras are often cooled by Peltier elements. This reduces dark counts due to thermal noise. A dark count occurs when a pixel registers an electron caused by thermal fluctuation rather than a photon. On digital photos taken at low light these occur as speckles (or \"pixel noise\").[citation needed]\n\nThermoelectric coolers can be used to cool computer components to keep temperatures within design limits or to maintain stable functioning when overclocking. A Peltier cooler with a heat sink or waterblock can cool a chip to well below ambient temperature.[14]\n\nIn fiber-optic applications, where the wavelength of a laser or a component is highly dependent on temperature, Peltier coolers are used along with a thermistor in a feedback loop to maintain a constant temperature and thereby stabilize the wavelength of the device.\n\nSome electronic equipment intended for military use in the field is thermoelectrically cooled.[citation needed]\n\n\nIdentification[edit]\n\n  \nPeltier elements all conform to a universal identification specification\n\n\n\nThe vast majority of thermoelectric coolers have an ID printed on the cooled side.[9]\n\nThese universal IDs clearly indicate the size, number of stages, number of couples, and current rating in amps, as seen in the adjacent diagram.[15]\n\n\nSee also[edit]\n\n\tThermoacoustics\n\tThermotunnel cooling\n\n\nReferences[edit]\n\n\n\t^ Taylor, R.A.; Solbrekken, G.L. (2008). \"Comprehensive system-level optimization of thermoelectric devices for electronic cooling applications\". IEEE Transactions on Components and Packaging Technologies. 31: 23–31. doi:10.1109/TCAPT.2007.906333.\n\n\t^ DiSalvo, Francis (July 1999). \"Thermoelectric Cooling and Power Generation\". Science. 285.\n\n\n\t^ Poudel, Bed (May 2008). \"High-Thermoelectric Performance of Nanostructured Bismuth Antimony Telluride Bulk Alloys\". Science. 320.\n\n\n\t^ Ghoshal, Uttam (2001-07-31). \"Highly reliable thermoelectric cooling apparatus and method\". patents.google.com. Retrieved 2019-03-12.\n\n\n\t^ a b Zhao, Dongliang (May 2014). \"A review of thermoelectric cooling: Materials, modeling and applications\". Applied Thermal Engineering. 66 (1–2): 15–24. doi:10.1016/j.applthermaleng.2014.01.074.\n\n\n\t^ University of California (April 18, 2017). \"Chlorofluorocarbons and Ozone Depletion\". American Chemical Society. Retrieved 2019-03-11.\n\n\n\t^ \"The Heatsink Guide\". Retrieved 3 May 2013.\n\n\n\t^ Brown, D. R.; N. Fernandez; J. A. Dirks; T. B. Stout (March 2010). \"The Prospects of Alternatives to Vapor Compression Technology for Space Cooling and Food Refrigeration Applications\" (PDF). Pacific Northwest National Laboratory (PNL). U.S. Department of Energy. Retrieved 16 March 2013.\n\n\n\t^ a b \"PCB Heaven – Peltier Elements Explained\". PCB Heaven. PCB Heaven. Retrieved 1 May 2013.\n\n\n\t^ Hsu, Jeremy (2011-06-14). \"Cold? Put this jacket on. Hot? Put this jacket on Climate-controlled coat goes from zero to 100 degrees C 'in the flip of a button'\". NBC News. NBC. Retrieved 16 March 2013.\n\n\n\t^ Ferro, Shaunacy (2013-03-15). \"How Winter Woes Inspired A Nanotech Fix For Everything From Cold Necks To Knee Pain\". Popular Mechanics. Bonnier Corp. Retrieved 16 March 2013.\n\n\n\t^ Using Peltier modules for thermal management of electronic systems. Electronics Weekly, 4 October 2017\n\n\t^ Kotlyarov, Evgeny; Peter de Crom; Raoul Voeten (2006). \"Some Aspects of Peltier-Cooler Optimization Applied for the Glove Box Air Temperature Control\". SAE International. SAE Technical Paper Series. 1: 1. doi:10.4271/2006-01-2043.\n\n\n\t^ Fylladitakis, E. (September 26, 2016) The Phononic HEX 2.0 TEC CPU Cooler Review. Anandtech.com. Retrieved on 2018-10-31.\n\n\t^ Versteeg, Owen. \"Peltier Element Identification\". Retrieved 14 October 2013.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Thermoelectric_cooling&oldid=917194682\"\n\n\t\t\n\t\tCategories: \tCooling technology\n\tThermoelectricity\n\n\nHidden categories: \tArticles needing additional references from July 2015\n\tAll articles needing additional references\n\tArticles needing additional references from March 2019\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from September 2017\n\tArticles with unsourced statements from July 2015\n\tArticles with unsourced statements from February 2016\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tEspañol\n\tEsperanto\n\tفارسی\n\tFrançais\n\t한국어\n\tעברית\n\tNederlands\n\tPortuguês\n\tSlovenčina\n\tTürkçe\n\tTiếng Việt\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 22 September 2019, at 18:15 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "Thermoelectric cooling - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Thermoelectric_Seebeck_power_module.jpg/1200px-Thermoelectric_Seebeck_power_module.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-thermoelectric_cooling", "title": "Thermoelectric cooling - Wikipedia"}}