{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTransmitter - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tTransmitter\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tElectronic device that emits radio waves\n \n  \nCommercial FM broadcasting transmitter at radio station WDET-FM, Wayne State University, Detroit, USA. It broadcasts at 101.9 MHz with a radiated power of 48 kW.\n\n\n \nIn electronics and telecommunications a transmitter or radio transmitter is an electronic device which produces radio waves with an antenna. The transmitter itself generates a radio frequency alternating current, which is applied to the antenna. When excited by this alternating current, the antenna radiates radio waves.\n\nTransmitters are necessary component parts of all electronic devices that communicate by radio, such as radio and television broadcasting stations, cell phones, walkie-talkies, wireless computer networks, Bluetooth enabled devices, garage door openers, two-way radios in aircraft, ships, spacecraft, radar sets and navigational beacons. The term transmitter is usually limited to equipment that generates radio waves for communication purposes; or radiolocation, such as radar and navigational transmitters. Generators of radio waves for heating or industrial purposes, such as microwave ovens or diathermy equipment, are not usually called transmitters, even though they often have similar circuits.\n\nThe term is popularly used more specifically to refer to a broadcast transmitter, a transmitter used in broadcasting, as in FM radio transmitter or television transmitter. This usage typically includes both the transmitter proper, the antenna, and often the building it is housed in.\n\n\nContents\n\n\n\t1 Description\n\t2 Operation\n\t2.1 Components\n\n\n\n\t3 Legal restrictions\n\t4 History\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nDescription[edit]\n\n  \nA radio transmitter is usually part of a radio communication system which uses electromagnetic waves (radio waves) to transport information (in this case sound) over a distance.\n\n\n\nA transmitter can be a separate piece of electronic equipment, or an electrical circuit within another electronic device.  A transmitter and a receiver combined in one unit is called a transceiver.  The term transmitter is often abbreviated \"XMTR\" or \"TX\" in technical documents.  The purpose of most transmitters is radio communication of information over a distance. The information is provided to the transmitter in the form of an electronic signal, such as an audio (sound) signal from a microphone, a video (TV) signal from a video camera, or in wireless networking devices, a digital signal from a computer. The transmitter combines the information signal to be carried with the radio frequency signal which generates the radio waves, which is called the carrier signal. This process is called modulation. The information can be added to the carrier in several different ways, in different types of transmitters. In an amplitude modulation (AM) transmitter, the information is added to the radio signal by varying its amplitude. In a frequency modulation (FM) transmitter, it is added by varying the radio signal's frequency slightly. Many other types of modulation are also used.\n\nThe radio signal from the transmitter is applied to the antenna, which radiates the energy as radio waves. The antenna may be enclosed inside the case or attached to the outside of the transmitter, as in portable devices such as cell phones, walkie-talkies, and garage door openers. In more powerful transmitters, the antenna may be located on top of a building or on a separate tower, and connected to the transmitter by a feed line, that is a transmission line.\n\n\nRadio transmitters\n\n\n35 kW, Continental 816R-5B FM transmitter, belonging to American FM radio station KWNR broadcasting on 95.5 MHz in Las Vegas\n\n\nModern amateur radio transceiver, the ICOM IC-746PRO. It can transmit on the amateur bands from 1.8 MHz to 144 MHz with an output power of 100 W\n\n\nA CB radio transceiver, a two way radio transmitting on 27 MHz with a power of 4 W, that can be operated without a license\n\n\n\n\n\n\nConsumer products that contain transmitters\n\n\nA cellphone has several transmitters: a duplex cell transceiver, a Wi-Fi modem, and a Bluetooth modem.\n\n\nBoth the handset and the base of a cordless phone contain low power 2.4 GHz radio transmitters to communicate with each other.\n\n\nA garage door opener control contains a low-power 2.4 GHz transmitter that sends coded commands to the garage door mechanism to open or close.\n\n\nIn a wireless computer network, wireless routers like this contain a 2.4 GHz transmitter that sends and receives network packets for computers on the local area network.\n\n\n\n\n\nOperation[edit]\n\n  \nAnimation of a half-wave dipole antenna transmitting radio waves, showing the electric field lines.  The antenna in the center is two vertical metal rods, with an alternating current applied at its center from a radio transmitter (not shown).  The voltage charges the two sides of the antenna alternately positive (+) and negative  (−).  Loops of electric field (black lines) leave the antenna and travel away at the speed of light; these are the radio waves.  This animation shows the action slowed down enormously\n\n\n\nElectromagnetic waves are radiated by electric charges when they are accelerated.[1][2]  Radio waves,  electromagnetic waves of radio frequency, are generated by time-varying electric currents, consisting of electrons flowing through a metal conductor called an antenna which are changing their velocity or direction and thus accelerating.[2]  An alternating current  flowing back and forth in an antenna will create an oscillating magnetic field around the conductor.  The alternating voltage will also charge the ends of the conductor alternately positive and negative, creating an oscillating electric field around the conductor.  If the frequency of the oscillations is high enough, in the radio frequency range above about 20 kHz, the oscillating coupled electric and magnetic fields will radiate away from the antenna into space as an electromagnetic wave, a radio wave.  \n\nA radio transmitter is an electronic circuit which transforms electric power from a power source into a radio frequency alternating current to apply to the antenna, and the antenna radiates the energy from this current as radio waves.  The transmitter also impresses information such as an audio or video signal onto the radio frequency current to be carried by the radio waves.  When they strike the antenna of a radio receiver, the waves excite similar (but less powerful) radio frequency currents in it. The radio receiver extracts the information from the received waves. \n\n\nComponents[edit]\n\nA practical radio transmitter usually consists of these parts:\n\n\n\tIn high power transmitters, a power supply circuit to transform the input electrical power to the higher voltages needed to produce the required power output.\n\tAn electronic oscillator circuit to generate the radio frequency signal. This usually generates a sine wave of constant amplitude called the carrier wave, because it serves to \"carry\" the information through space. In most modern transmitters, this is a crystal oscillator in which the frequency is precisely controlled by the vibrations of a quartz crystal.  The frequency of the carrier wave is considered the frequency of the transmitter.\n\tA modulator circuit to add the information to be transmitted to the carrier wave produced by the oscillator. This is done by varying some aspect of the carrier wave. The information is provided to the transmitter either in the form of an audio signal, which represents sound, a video signal which represents moving images, or for data in the form of a binary digital signal which represents a sequence of bits, a bitstream.  Different types of transmitters use different modulation methods to transmit information:\n\tIn an AM (amplitude modulation) transmitter the amplitude (strength) of the carrier wave is varied in proportion to the modulation signal.\n\tIn an FM (frequency modulation) transmitter the frequency of the carrier is varied by the modulation signal.\n\tIn an FSK (frequency-shift keying) transmitter, which transmits digital data, the frequency of the carrier is shifted between two frequencies which represent the two binary digits, 0 and 1.\n\tOFDM (orthogonal frequency division multiplexing) is a family of complicated digital modulation methods very widely used in high bandwidth systems such as WiFi networks, cellphones, digital television broadcasting, and digital audio broadcasting (DAB) to transmit digital data using a minimum of radio spectrum bandwidth.  OFDM has higher spectral efficiency and more resistance to fading than AM or FM.  In OFDM multiple radio carrier waves closely spaced in frequency are transmitted within the radio channel, with each carrier modulated with bits from the incoming bitstream so multiple bits are being sent simultaneously, in parallel.  At the receiver the carriers are demodulated and the bits are combined in the proper order into one bitstream.\n\n\n\n\n\tMany other types of modulation are also used.  In large transmitters the oscillator and modulator together are often referred to as the exciter.\n\n\n\tA radio frequency (RF) amplifier to increase the power of the signal, to increase the range of the radio waves.\n\tAn impedance matching (antenna tuner) circuit to match the impedance of the transmitter to the impedance of the antenna (or the transmission line to the antenna), to transfer power efficiently to the antenna.  If these impedances are not equal, it causes a condition called standing waves, in which the power is reflected back from the antenna toward the transmitter, wasting power and sometimes overheating the transmitter.\n\n\nIn higher frequency transmitters, in the UHF and microwave range, free running oscillators are unstable at the output frequency. Older designs used an oscillator at a lower frequency, which was multiplied by frequency multipliers to get a signal at the desired frequency. Modern designs more commonly use an oscillator at the operating frequency which is stabilized by phase locking to a very stable lower frequency reference, usually a crystal oscillator.\n\n\nLegal restrictions[edit]\n\nIn most parts of the world, use of transmitters is strictly controlled by law because of the potential for dangerous interference with other radio transmissions (for example to emergency communications). Transmitters must be licensed by governments, under a variety of license classes depending on use such as broadcast, marine radio, Airband, Amateur and are restricted to certain frequencies and power levels. A body called the International Telecommunications Union (ITU) allocates the frequency bands in the radio spectrum to various classes of users. In some classes, each transmitter is given a unique call sign consisting of a string of letters and numbers which must be used as an identifier in transmissions. The operator of the transmitter usually must hold a government license, such as a general radiotelephone operator license, which is obtained by passing a test demonstrating adequate technical and legal knowledge of safe radio operation.\n\nExceptions to the above regulations allow the unlicensed use of low-power short-range transmitters in consumer products such as cell phones, cordless telephones,  wireless microphones,  walkie-talkies, Wi-Fi and Bluetooth devices, garage door openers, and baby monitors. In the US, these fall under Part 15 of the Federal Communications Commission (FCC) regulations. Although they can be operated without a license, these devices still generally must be type-approved before sale.\n\n\nHistory[edit]\n\nMain article: History of radio\n\n  \nHertz discovering radio waves with his first primitive radio transmitter (background).\n\n\n\nThe first primitive radio transmitters (called spark gap transmitters) were built by German physicist Heinrich Hertz in 1887 during his pioneering investigations of radio waves. These generated radio waves by a high voltage spark between two conductors. Beginning in 1895, Guglielmo Marconi developed the first practical radio communication systems using these transmitters, and radio began to be used commercially around 1900.  Spark transmitters could not transmit audio (sound) and instead transmitted information by radiotelegraphy, the operator tapped on a telegraph key which turned the transmitter on and off to produce pulses of radio waves spelling out text messages in Morse code. These spark-gap transmitters were used during the first three decades of radio (1887-1917), called the wireless telegraphy or \"spark\" era. Because they generated damped waves, spark transmitters were electrically \"noisy\". Their energy was spread over a broad band of frequencies, creating radio noise which interfered with other transmitters. Damped wave emissions were banned by international law in 1934.\n\nTwo short-lived competing transmitter technologies came into use after the turn of the century, which were the first continuous wave transmitters: the arc converter (Poulsen arc) in 1904 and the Alexanderson alternator around 1910, which were used into the 1920s. \n\nAll these early technologies were replaced by vacuum tube transmitters in the 1920s, which used the feedback oscillator invented by Edwin Armstrong and Alexander Meissner around 1912, based on the Audion (triode) vacuum tube invented by Lee De Forest in 1906. Vacuum tube transmitters were inexpensive and produced continuous waves, and could be easily modulated to transmit audio (sound) using amplitude modulation (AM). This made AM radio broadcasting possible, which began in about 1920. Practical frequency modulation (FM) transmission was invented by Edwin Armstrong in 1933, who showed that it was less vulnerable to noise and static than AM.  The first FM radio station was licensed in 1937. Experimental television transmission had been conducted by radio stations since the late 1920s, but practical television broadcasting didn't begin until the late 1930s. The development of radar during World War II motivated the evolution of high frequency transmitters in the UHF and microwave ranges, using new active devices such as the magnetron, klystron, and traveling wave tube.  \n\nThe invention of the transistor allowed the development in the 1960s of small portable transmitters such as wireless microphones, garage door openers and walkie-talkies. The development of the integrated circuit (IC) in the 1970s made possible the current proliferation of wireless devices, such as cell phones and Wifi networks, in which integrated digital transmitters and receivers (wireless modems) in portable devices operate automatically, in the background, to exchange data with wireless networks. \n\nThe need to conserve bandwidth in the increasingly congested radio spectrum is driving the development of new types of transmitters such as spread spectrum, trunked radio systems and cognitive radio.   A related trend has been an ongoing transition from analog to digital radio transmission methods.  Digital modulation can have greater spectral efficiency than analog modulation; that is it can often transmit more information (data rate) in a given bandwidth than analog, using data compression algorithms.  Other advantages of digital transmission are increased noise immunity, and greater flexibility and processing power of digital signal processing integrated circuits.\n\n\n\t\n\t\t\t\n\n\n\t\t\t\nGuglielmo Marconi's spark gap transmitter, with which he performed the first experiments in practical radio communication in 1895-1897\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nHigh power spark gap transmitter in Australia around 1910.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\n1 MW US Navy Poulsen arc transmitter which generated continuous waves using an electric arc in a magnetic field, a technology used from 1903 until the 1920s.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nAn Alexanderson alternator, a huge rotating machine used as a radio transmitter for a short period from about 1910 until vacuum tube transmitters took over in the 1920s\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nOne of the first vacuum tube AM radio transmitters, built by Lee De Forest in 1914. The early Audion (triode) tube is visible at right.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nOne of the BBC's first broadcast transmitters, early 1920s, London.  The 4 triode tubes, connected in parallel to form an oscillator, each produced around 4 kilowatts with 12 thousand volts on their anodes.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nArmstrong's first experimental FM broadcast transmitter W2XDG, in the Empire State Building, New York City, used for secret tests 1934-1935. It transmitted on 41 MHz at a power of 2 kW.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nTransmitter assembly of a 20 kW, 9.375 GHz  air traffic control radar, 1947.  The magnetron tube mounted between two magnets (right) produces microwaves which pass from the aperture (left) into a waveguide which conducts them to the dish antenna.\n\n\n\t\t\t\n\n\t\t\n\n\n\nSee also[edit]\n\n\tList of transmission sites\n\tRadio transmitter design\n\tTransmitter station\n\tTransposer\n\tTelevision transmitter\n\n\nReferences[edit]\n\n\n\t^ Serway, Raymond; Faughn, Jerry; Vuille, Chris (2008). College Physics, 8th Ed. Cengage Learning. p. 714. ISBN 0495386936.\n\n\t^ a b Ellingson, Steven W. (2016). Radio Systems Engineering. Cambridge University Press. pp. 16–17. ISBN 1316785165.\n\n\n\n\n\n\nExternal links[edit]\n\n\t\tLook up transmitter in Wiktionary, the free dictionary.\n\n\n\tInternational Telecommunication Union\n\tJim Hawkins' Radio and Broadcast Technology Page\n\tWCOV-TV's Transmitter Technical Website\n\tMajor UK television transmitters including change of group information, see Transmitter Planning section.\n\tDetails of UK digital television transmitters\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nTelecommunications\n\n\tHistory\t\n\tBeacon\n\tBroadcasting\n\tCable protection system\n\tCable TV\n\tCommunications satellite\n\tComputer network\n\tDrums\n\tElectrical telegraph\n\tFax\n\tHeliographs\n\tHydraulic telegraph\n\tInternet\n\tMass media\n\tMobile phone\n\tOptical telecommunication\n\tOptical telegraphy\n\tPager\n\tPhotophone\n\tPrepaid mobile phone\n\tRadio\n\tRadiotelephone\n\tSatellite communications\n\tSemaphore\n\tSmartphone\n\tSmoke signals\n\tTelecommunications history\n\tTelautograph\n\tTelegraphy\n\tTeleprinter (teletype)\n\tTelephone\n\tThe Telephone Cases\n\tTelevision\n\tUndersea telegraph line\n\tVideoconferencing\n\tVideophone\n\tVideotelephony\n\tWhistled language\n\n\n\n\t\n\n\tPioneers\t\n\tEdwin Howard Armstrong\n\tJohn Logie Baird\n\tPaul Baran\n\tAlexander Graham Bell\n\tTim Berners-Lee\n\tJagadish Chandra Bose\n\tVint Cerf\n\tClaude Chappe\n\tDonald Davies\n\tLee de Forest\n\tPhilo Farnsworth\n\tReginald Fessenden\n\tElisha Gray\n\tErna Schneider Hoover\n\tCharles K. Kao\n\tHedy Lamarr\n\tInnocenzo Manzetti\n\tGuglielmo Marconi\n\tAntonio Meucci\n\tRadia Perlman\n\tAlexander Stepanovich Popov\n\tJohann Philipp Reis\n\tHenry Sutton\n\tNikola Tesla\n\tCamille Tissot\n\tAlfred Vail\n\tCharles Wheatstone\n\tVladimir K. Zworykin\n\n\n\n\n\tTransmission\nmedia\t\n\tCoaxial cable\n\tFiber-optic communication\n\tOptical fiber\n\n\n\tFree-space optical communication\n\tMolecular communication\n\tRadio waves\n\tTransmission line\n\n\n\n\n\tNetwork topology\nand switching\t\n\tLinks\n\tNodes\n\tTerminal node\n\tNetwork switching (circuit\n\tpacket)\n\tTelephone exchange\n\n\n\n\n\tMultiplexing\t\n\tSpace-division\n\tFrequency-division\n\tTime-division\n\tPolarization-division\n\tOrbital angular-momentum\n\tCode-division\n\n\n\n\n\tNetworks\t\n\tARPANET\n\tBITNET\n\tCellular network\n\tComputer\n\tCYCLADES\n\tEthernet\n\tFidoNet\n\tInternet\n\tInternet2\n\tISDN\n\tLAN\n\tMobile\n\tNGN\n\tNPL network\n\tPublic Switched Telephone\n\tRadio\n\tTelecommunications equipment\n\tTelevision\n\tTelex\n\tWAN\n\tWireless network\n\tWorld Wide Web\n\n\n\n\n\t\n\t Category\n\t Outline\n\t Portal\n\t Commons\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Transmitter&oldid=915132516\"\n\n\t\t\n\t\tCategories: \tBroadcast transmitters\n\tTelecommunications equipment\n\tRadar\n\n\nHidden categories: \tArticles with short description\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tবাংলা\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tItaliano\n\tעברית\n\tҚазақша\n\tМакедонски\n\tമലയാളം\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tОлык марий\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tShqip\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 11 September 2019, at 11:58 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "Transmitter - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/f/f3/WDET-FM_transmitter.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-transmitter", "title": "Transmitter - Wikipedia"}}