{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVan Allen radiation belt - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tVan Allen radiation belt\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tZone of energetic charged particles around the planet Earth\n\nPlay media\n  \nThis video illustrates changes in the shape and intensity of a cross section of the Van Allen belts.\n\n\n\n  \nA cross section of Van Allen radiation belts\n\n\n\nA Van Allen radiation belt is a  zone of energetic charged particles, most of which originate from the solar wind, that are captured by and held around a planet by that planet's magnetic field. Earth has two such belts and sometimes others may be temporarily created. The discovery of the belts is credited to James Van Allen, and as a result, Earth's belts are known as the Van Allen belts. Earth's two main belts extend from an altitude of about 640 to 58,000 km (400 to 36,040 mi)[1] above the surface in which region radiation levels vary. Most of the particles that form the belts are thought to come from solar wind and other particles by cosmic rays.[2] By trapping the solar wind, the magnetic field deflects those energetic particles and protects the atmosphere from destruction.\n\nThe belts are located in the inner region of Earth's magnetosphere. The belts trap energetic electrons and protons. Other nuclei, such as alpha particles, are less prevalent. The belts endanger satellites, which must have their sensitive components protected with adequate shielding if they spend significant time near that zone. In 2013, NASA reported that the Van Allen Probes had discovered a transient, third radiation belt, which was observed for four weeks until it was destroyed by a powerful, interplanetary shock wave from the Sun.[3]\n\n\nContents\n\n\n\t1 Discovery\n\t2 Research\n\t3 Inner belt\n\t4 Outer belt\n\t5 Flux values\n\t6 Antimatter confinement\n\t7 Implications for space travel\n\t8 Causes\n\t9 Proposed removal\n\t10 See also\n\t11 Notes\n\t12 References\n\t13 Additional sources\n\t14 External links\n\n\n\n\n\nDiscovery[edit]\n\nKristian Birkeland, Carl Størmer, and Nicholas Christofilos had investigated the possibility of trapped charged particles before the Space Age.[4] Explorer 1 and Explorer 3 confirmed the existence of the belt in early 1958 under James Van Allen at the University of Iowa. The trapped radiation was first mapped by Explorer 4, Pioneer 3 and Luna 1.\n\nThe term Van Allen belts refers specifically to the radiation belts surrounding Earth; however, similar radiation belts have been discovered around other planets. The Sun does not support long-term radiation belts, as it lacks a stable, global, dipole field. The Earth's atmosphere limits the belts' particles to regions above 200–1,000 km,[5] (124–620 miles) while the belts do not extend past 8 Earth radii RE.[5] The belts are confined to a volume which extends about 65°[5] on either side of the celestial equator.\n\n\nResearch[edit]\n\n  \nJupiter's variable radiation belts\n\n\n\nThe NASA Van Allen Probes mission aims at understanding (to the point of predictability) how populations of relativistic electrons and ions in space form or change in response to changes in solar activity and the solar wind.\nNASA Institute for Advanced Concepts–funded studies have proposed magnetic scoops to collect antimatter that naturally occurs in the Van Allen belts of Earth, although only about 10 micrograms of antiprotons are estimated to exist in the entire belt.[6]\n\nThe Van Allen Probes mission successfully launched on August 30, 2012.[7] The primary mission is scheduled to last two years with expendables expected to last four. NASA's Goddard Space Flight Center manages the Living With a Star program of which the Van Allen Probes is a project, along with Solar Dynamics Observatory (SDO). The Applied Physics Laboratory is responsible for the implementation and instrument management for the Van Allen Probes.[8]\n\nRadiation belts exist around other planets and moons in the solar system that have magnetic fields powerful enough to sustain them. To date, most of these radiation belts have been poorly mapped. The Voyager Program (namely Voyager 2) only nominally confirmed the existence of similar belts around Uranus and Neptune.\n\n\nInner belt[edit]\n\n  \nCutaway drawing of two radiation belts around Earth: the inner belt (red) dominated by protons and the outer one (blue) by electrons. Image Credit: NASA\n\n\n\nThe inner Van Allen Belt extends typically from an altitude of 0.2 to 2 Earth radii (L values of 1 to 3) or 1,000 km (620 mi) to 12,000 km (7,500 mi) above the Earth.[2][9] In certain cases when solar activity is stronger or in geographical areas such as the South Atlantic Anomaly, the inner boundary may decline to roughly 200 kilometers[10] above the Earth's surface. The inner belt contains high concentrations of electrons in the range of hundreds of keV and energetic protons with energies exceeding 100 MeV, trapped by the strong (relative to the outer belts) magnetic fields in the region.[11]\n\nIt is believed that proton energies exceeding 50 MeV in the lower belts at lower altitudes are the result of the beta decay of neutrons created by cosmic ray collisions with nuclei of the upper atmosphere. The source of lower energy protons is believed to be proton diffusion due to changes in the magnetic field during geomagnetic storms.[12]\n\nDue to the slight offset of the belts from Earth's geometric center, the inner Van Allen belt makes its closest approach to the surface at the South Atlantic Anomaly.[13]\n[14]\n\nOn March 2014, a pattern resembling \"zebra stripes\" was observed in the radiation belts by the Radiation Belt Storm Probes Ion Composition Experiment (RBSPICE) onboard Van Allen Probes. The reason reported was that due to the tilt in Earth's magnetic field axis, the planet's rotation generated an oscillating, weak electric field that permeates through the entire inner radiation belt.[15] It was later demonstrated that the zebra stripes were, in fact, an imprint of ionospheric winds on radiation belts.[16]\n\n\nOuter belt[edit]\n\n  \nLaboratory simulation of the Van Allen belt's influence on the Solar Wind; these aurora-like Birkeland currents were created by the scientist Kristian Birkeland in his terrella, a magnetized anode globe in an evacuated chamber\n\n\n\nThe outer belt consists mainly of high energy (0.1–10 MeV) electrons trapped by the Earth's magnetosphere. It is more variable than the inner belt as it is more easily influenced by solar activity. It is almost toroidal in shape, beginning at an altitude of three and extending to ten Earth radii (RE) 13,000 to 60,000 kilometres (8,100 to 37,300 mi) above the Earth's surface. Its greatest intensity is usually around 4–5 RE. The outer electron radiation belt is mostly produced by the inward radial diffusion[17][18] and local acceleration[19] due to transfer of energy from whistler-mode plasma waves to radiation belt electrons. Radiation belt electrons are also constantly removed by collisions with Earth's atmosphere,[19] losses to the magnetopause, and their outward radial diffusion. The gyroradii of energetic protons would be large enough to bring them into contact with the Earth's atmosphere. Within this belt, the electrons have a high flux and at the outer edge (close to the magnetopause), where geomagnetic field lines open into the geomagnetic \"tail\", the flux of energetic electrons can drop to the low interplanetary levels within about 100 km (62 mi), a decrease by a factor of 1,000.\n\nIn 2014 it was discovered that the inner edge of the outer belt is characterized by a very sharp transition, below which highly relativistic electrons (> 5MeV) cannot penetrate.[20] The reason for this shield-like behavior is not well understood.\n\nThe trapped particle population of the outer belt is varied, containing electrons and various ions. Most of the ions are in the form of energetic protons, but a certain percentage are alpha particles and O+ oxygen ions, similar to those in the ionosphere but are much more energetic. This mixture of ions suggests that ring current particles probably come from more than one source.\n\nThe outer belt is larger than the inner belt and its particle population fluctuates widely. Energetic (radiation) particle fluxes can increase and decrease dramatically in response to geomagnetic storms, which are themselves triggered by magnetic field and plasma disturbances produced by the Sun. The increases are due to storm-related injections and acceleration of particles from the tail of the magnetosphere.\n\nOn February 28, 2013, a third radiation belt, consisting of high-energy ultrarelativistic charged particles, was reported to be discovered. In a news conference by NASA's Van Allen Probe team, it was stated that this third belt is a product of coronal mass ejection from the Sun. It has been represented as a separate creation which splits the Outer Belt, like a knife, on its outer side, and exists separately as a storage container of particles for a month's time, before merging once again with the Outer Belt.[21]\n\nThe unusual stability of this third, transient belt has been explained as due to a 'trapping' by the Earth's magnetic field of ultrarelativistic particles as they are lost from the second, traditional outer belt. While the outer zone, which forms and disappears over a day, is highly variable due to interactions with the atmosphere, the ultrarelativistic particles of the third belt are thought to not scatter into the atmosphere, as they are too energetic to interact with atmospheric waves at low latitudes.[22] This absence of scattering and the trapping allows them to persist for a long time, finally only being destroyed by an unusual event, such as the shock wave from the Sun.\n\n\nFlux values[edit]\n\nIn the belts, at a given point, the flux of particles of a given energy decreases sharply with energy.\n\nAt the magnetic equator, electrons of energies exceeding 500 keV (resp. 5 MeV) have omnidirectional fluxes ranging from 1.2×106 (resp. 3.7×104) up to 9.4×109 (resp. 2×107) particles per square centimeter per second.\n\nThe proton belts contain protons with kinetic energies ranging from about 100 keV, which can penetrate 0.6 µm of lead,  to over 400 MeV, which can penetrate 143 mm of lead.[23]\n\nMost published flux values for the inner and outer belts may not show the maximum probable flux densities that are possible in the belts. There is a reason for this discrepancy: the flux density and the location of the peak flux is variable, depending primarily on solar activity, and the number of spacecraft with instruments observing the belt in real time has been limited. The Earth has not experienced a solar storm of Carrington event intensity and duration, while spacecraft with the proper instruments have been available to observe the event.\n\nRegardless of the differences of the flux levels in the Inner and Outer Van Allen belts, the beta radiation levels would be dangerous to humans if they were exposed for an extended period of time. The Apollo missions minimised hazards for astronauts by sending spacecraft at high speeds through the thinner areas of the upper belts, bypassing inner belts completely, except for the Apollo 14 mission where the spacecraft traveled through the heart of the trapped radiation belts.[13][24][25][26]\n\n\n\tFlux values, normal solar conditions\n\t\n\t\t\t\n\n\n\t\t\t\nAP8 MIN omnidirectional proton flux ≥ 100 keV\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nAP8 MIN omnidirectional proton flux ≥ 1 MeV\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nAP8 MIN omnidirectional proton flux ≥ 400 MeV\n\n\n\t\t\t\n\n\t\t\n\n\n\nAntimatter confinement[edit]\n\nIn 2011, a study confirmed earlier speculation that the Van Allen belt could confine antiparticles. The Payload for Antimatter Matter Exploration and Light-nuclei Astrophysics (PAMELA) experiment detected levels of antiprotons orders of magnitude higher than are expected from normal particle decays while passing through the South Atlantic Anomaly. This suggests the Van Allen belts confine a significant flux of antiprotons produced by the interaction of the Earth's upper atmosphere with cosmic rays.[27] The energy of the antiprotons has been measured in the range from 60–750 MeV.\n\nResearch funded by the NASA Institute for Advanced Concepts concluded that harnessing these antiprotons for spacecraft propulsion would be feasible.  Researchers believed that this approach would have advantages over antiproton generation at CERN, because collecting the particles in situ eliminates transportation losses and costs.  Jupiter and Saturn are also possible sources, but the Earth belt is the most productive.  Jupiter is less productive than might be expected due to magnetic shielding from cosmic rays of much of its atmosphere. In 2019 CMS announced, that the construction of a device that would be capable of collecting these particles has already begun[citation needed]. NASA will use this device to collect these particles and transport them to institutes all around the world for further examination. These so-called \"antimatter-containers\" could be used for industrial purpose as well in the future.[28]\n\n\nImplications for space travel[edit]\n\n  \nComparison of geostationary, GPS, GLONASS, Galileo, Compass (MEO), International Space Station, Hubble Space Telescope, Iridium constellation and graveyard orbits, with the Van Allen radiation belts and the Earth to scale.[a] The Moon's orbit is around 9 as large as geostationary orbit.[b] (In the SVG file, hover over an orbit or its label to highlight it; click to load its article.)\n\n\n\nSpacecraft travelling beyond low Earth orbit enter the zone of radiation of the Van Allen belts. Beyond the belts, they face additional hazards from cosmic rays and solar particle events. A region between the inner and outer Van Allen belts lies at two to four Earth radii and is sometimes referred to as the \"safe zone\".[29][30]\n\nSolar cells, integrated circuits, and sensors can be damaged by radiation. Geomagnetic storms occasionally damage electronic components on spacecraft. Miniaturization and digitization of electronics and logic circuits have made satellites more vulnerable to radiation, as the total electric charge in these circuits is now small enough so as to be comparable with the charge of incoming ions. Electronics on satellites must be hardened against radiation to operate reliably. The Hubble Space Telescope, among other satellites, often has its sensors turned off when passing through regions of intense radiation.[31] A satellite shielded by 3 mm of aluminium in an elliptic orbit (200 by 20,000 miles (320 by 32,190 km)) passing the radiation belts will receive about 2,500 rem (25 Sv) per year (for comparison, a full-body dose of 5 Sv is deadly). Almost all radiation will be received while passing the inner belt.[32]\n\nThe Apollo missions marked the first event where humans traveled through the Van Allen belts, which was one of several radiation hazards known by mission planners.[33] The astronauts had low exposure in the Van Allen belts due to the short period of time spent flying through them. Apollo flight trajectories bypassed the inner belts completely, passing through the thinner areas of the outer belts.[25][34]\n\nAstronauts' overall exposure was actually dominated by solar particles once outside Earth's magnetic field. The total radiation received by the astronauts varied from mission to mission but was measured to be between 0.16 and 1.14 rads (1.6 and 11.4 mGy), much less than the standard of 5 rem (50 mSv) per year set by the United States Atomic Energy Commission for people who work with radioactivity.[33]\n\n\nCauses[edit]\n\nIt is generally understood that the inner and outer Van Allen belts result from different processes. The inner belt, consisting mainly of energetic protons, is the product of the decay of so-called \"albedo\" neutrons which are themselves the result of cosmic ray collisions in the upper atmosphere. The outer belt consists mainly of electrons. They are injected from the geomagnetic tail following geomagnetic storms, and are subsequently energized through wave-particle interactions.\n\nIn the inner belt, particles that originate from the Sun are trapped in the Earth's magnetic field. Particles spiral along the magnetic lines of flux as they move \"longitudinally\" along those lines. As particles move toward the poles, the magnetic field line density increases and their \"longitudinal\" velocity is slowed and can be reversed, reflecting the particle and causing them to bounce back and forth between the Earth's poles.[35] In addition to the spiral about and motion along the flux lines, the electrons move slowly in an eastward direction, while the ions move westward.\n\nA gap between the inner and outer Van Allen belts, sometimes called safe zone or safe slot, is caused by the Very Low Frequency (VLF) waves which scatter particles in pitch angle which results in the gain of particles to the atmosphere. Solar outbursts can pump particles into the gap but they drain again in a matter of days. The radio waves were originally thought to be generated by turbulence in the radiation belts, but recent work by James L. Green of the Goddard Space Flight Center comparing maps of lightning activity collected by the Microlab 1 spacecraft with data on radio waves in the radiation-belt gap from the IMAGE spacecraft suggests that they are actually generated by lightning within Earth's atmosphere. The radio waves that generate strike the ionosphere at the correct angle to pass through only at high latitudes, where the lower ends of the gap approach the upper atmosphere. These results are still under scientific debate.\n\n\nProposed removal[edit]\n\nHigh Voltage Orbiting Long Tether, or HiVOLT, is a concept proposed by Russian physicist V. V. Danilov and further refined by Robert P. Hoyt and Robert L. Forward for draining and removing the radiation fields of the Van Allen radiation belts[36] that surround the Earth.[37] A proposed configuration consists of a system of five 100 km long conducting tethers deployed from satellites, and charged to a large voltage. This would cause charged particles that encounter the tethers to have their pitch angle changed; thus, over time, dissolving the inner belts. Hoyt and Forward's company, Tethers Unlimited, performed a preliminary analysis simulation in 2011, and produced a chart depicting a theoretical radiation flux reduction,[38] to less than 1% of current levels within two months for the inner belts that threaten LEO objects.[39]\n\n\nSee also[edit]\n\n\tDipole model of the Earth's magnetic field\n\tL-shell\n\tList of artificial radiation belts\n\tList of plasma (physics) articles\n\tSpace weather\n\n\n\n\nNotes[edit]\n\n\n\t^ Orbital periods and speeds are calculated using the relations 4π2R3 = T2GM and V2R = GM, where R = radius of orbit in metres, T = orbital period in seconds, V = orbital speed in m/s, G = gravitational constant ≈ 6.673×10−11 Nm2/kg2, M = mass of Earth ≈ 5.98×1024 kg.\n\n\t^ Approximately 8.6 times (in radius and length) when the moon is nearest (363 104 km ÷ 42 164 km) to 9.6 times when the moon is farthest (405 696 km ÷ 42 164 km).\n\n\n\n\n\nReferences[edit]\n\n\n\t^ Zell, Holly (February 12, 2015). \"Van Allen Probes Spot an Impenetrable Barrier in Space\". NASA/Goddard Space Flight Center. Retrieved 2017-06-04.\n\n\t^ a b \"Van Allen Radiation Belts\". HowStuffWorks. Silver Spring, MD: Discovery Communications, Inc. 2009-04-23. Retrieved 2011-06-05.\n\n\n\t^ Phillips, Tony, ed. (February 28, 2013). \"Van Allen Probes Discover a New Radiation Belt\". Science@NASA. NASA. Retrieved 2013-04-05.\n\n\n\t^ Stern, David P.; Peredo, Mauricio. \"Trapped Radiation – History\". The Exploration of the Earth's Magnetosphere. NASA/GSFC. Retrieved 2009-04-28.\n\n\n\t^ a b c Walt, Martin (2005) [Originally published 1994]. Introduction to Geomagnetically Trapped Radiation. Cambridge; New York: Cambridge University Press. ISBN 978-0-521-61611-9. LCCN 2006272610. OCLC 63270281.\n\n\n\t^ Bickford, James. \"Extraction of Antiparticles Concentrated in Planetary Magnetic Fields\" (PDF). NASA/NIAC. Retrieved 2008-05-24.\n\n\n\t^ Zell, Holly, ed. (August 30, 2012). \"RBSP Launches Successfully – Twin Probes are Healthy as Mission Begins\". NASA. Retrieved 2012-09-02.\n\n\n\t^ \"Construction Begins!\". The Van Allen Probes Web Site. The Johns Hopkins University Applied Physics Laboratory. January 2010. Archived from the original on 2012-07-24. Retrieved 2013-09-27.\n\n\n\t^ Ganushkina, N. Yu; Dandouras, I.; Shprits, Y. Y.; Cao, J. (2011). \"Locations of boundaries of outer and inner radiation belts as observed by Cluster and Double Star\" (PDF). Journal of Geophysical Research. 116 (A9): n/a. Bibcode:2011JGRA..116.9234G. doi:10.1029/2010JA016376.\n\n\n\t^ \"Space Environment Standard ECSS-E-ST-10-04C\" (PDF). ESA Requirements and Standards Division. November 15, 2008. Retrieved 2013-09-27.\n\n\n\t^ Gusev, A. A.; Pugacheva, G. I.; Jayanthi, U. B.; Schuch, N. (2003). \"Modeling of Low-altitude Quasi-trapped Proton Fluxes at the Equatorial Inner Magnetosphere\". Brazilian Journal of Physics. 33 (4): 775–781. Bibcode:2003BrJPh..33..775G.\n\n\n\t^ Tascione, Thomas F. (2004). Introduction to the Space Environment (2nd ed.). Malabar, FL: Krieger Publishing Co. ISBN 978-0-89464-044-5. LCCN 93036569. OCLC 28926928.\n\n\n\t^ a b \"The Van Allen Belts\". NASA/GSFC. Retrieved 2011-05-25.\n\n\n\t^ Underwood, C.; Brock, D.; Williams, P.; Kim, S.; Dilão, R.; Ribeiro Santos, P.; Brito, M.; Dyer, C.; Sims, A. (December 1994). \"Radiation Environment Measurements with the Cosmic Ray Experiments On-Board the KITSAT-1 and PoSAT-1 Micro-Satellites\". IEEE Transactions on Nuclear Science. 41 (6): 2353–2360. Bibcode:1994ITNS...41.2353U. doi:10.1109/23.340587.\n\n\n\t^ \"Twin NASA probes find 'zebra stripes' in Earth's radiation belt\". Universe Today. 2014-03-19. Retrieved 20 March 2014.\n\n\n\t^ Lejosne, S.; Roederer, J.G. (2016). \"The \"zebra stripes\": An effect of F region zonal plasma drifts on the longitudinal distribution of radiation belt particles\". Journal of Geophysical Research. 121 (1): 507–518. Bibcode:2016JGRA..121..507L. doi:10.1002/2015JA021925.\n\n\n\t^ Elkington, S. R.; Hudson, M. K.; Chan, A. A. (May 2001). \"Enhanced Radial Diffusion of Outer Zone Electrons in an Asymmetric Geomagnetic Field\". Spring Meeting 2001. Washington, D.C.: American Geophysical Union. Bibcode:2001AGUSM..SM32C04E.\n\n\n\t^ Shprits, Y. Y.; Thorne, R. M. (2004). \"Time dependent radial diffusion modeling of relativistic electrons with realistic loss rates\". Geophysical Research Letters. 31 (8): L08805. Bibcode:2004GeoRL..31.8805S. doi:10.1029/2004GL019591.\n\n\n\t^ a b Horne, Richard B.; Thorne, Richard M.; Shprits, Yuri Y.;  et al. (2005). \"Wave acceleration of electrons in the Van Allen radiation belts\". Nature. 437 (7056): 227–230. Bibcode:2005Natur.437..227H. doi:10.1038/nature03939. PMID 16148927.\n\n\n\t^ D. N. Baker; A. N. Jaynes; V. C. Hoxie; R. M. Thorne; J. C. Foster; X. Li; J. F. Fennell; J. R. Wygant; S. G. Kanekal; P. J. Erickson; W. Kurth; W. Li; Q. Ma; Q. Schiller; L. Blum; D. M. Malaspina; A. Gerrard & L. J. Lanzerotti (27 November 2014). \"An impenetrable barrier to ultrarelativistic electrons in the Van Allen radiation belts\". Nature. 515. pp. 531–534. Bibcode:2014Natur.515..531B. doi:10.1038/nature13956.\n\n\n\t^ NASA's Van Allen Probes Discover Third Radiation Belt Around Earth on YouTube\n\n\t^ Shprits, Yuri Y.; Subbotin, Dimitriy; Drozdov, Alexander;  et al. (2013). \"Unusual stable trapping of the ultrarelativistic electrons in the Van Allen radiation belts\". Nature Physics. 9 (11): 699–703. Bibcode:2013NatPh...9..699S. doi:10.1038/nphys2760.\n\n\n\t^ Hess, Wilmot N. (1968). The Radiation Belt and Magnetosphere. Waltham, MA: Blaisdell Pub. Co. LCCN 67019536. OCLC 712421.\n\n\n\t^ Modisette, Jerry L.; Lopez, Manuel D.; Snyder, Joseph W. (January 20–22, 1969). Radiation Plan for the Apollo Lunar Mission. AIAA 7th Aerospace Sciences Meeting. New York. doi:10.2514/6.1969-19. AIAA Paper No. 69-19.\n\n\n\t^ a b \"Apollo Rocketed Through the Van Allen Belts\".\n\n\n\t^ \"Apollo 14 Mission Report, Chapter 10\". www.hq.nasa.gov. Retrieved 2019-08-07.\n\n\n\t^ Adriani, O.; Barbarino, G. C.; Bazilevskaya, G. A.;  et al. (2011). \"The Discovery of Geomagnetically Trapped Cosmic-Ray Antiprotons\". The Astrophysical Journal Letters. 737 (2): L29. arXiv:1107.4882. Bibcode:2011ApJ...737L..29A. doi:10.1088/2041-8205/737/2/L29.\n\n\n\t^ James Bickford, Extraction of Antiparticles Concentrated in Plaetary Magnetic Fields, NIAC phase II report, Draper Laboratory, August 2007.\n\n\t^ \"Earth's Radiation Belts with Safe Zone Orbit\". NASA/GSFC. Retrieved 2009-04-27.\n\n\n\t^ Weintraub, Rachel A. (December 15, 2004). \"Earth's Safe Zone Became Hot Zone During Legendary Solar Storms\". NASA/GSFC. Retrieved 2009-04-27.\n\n\n\t^ Weaver, Donna (July 18, 1996). \"Hubble Achieves Milestone: 100,000th Exposure\" (Press release). Baltimore, MD: Space Telescope Science Institute. STScI-1996-25. Retrieved 2009-01-25.\n\n\n\t^ Ptak, Andy (1997). \"Ask an Astrophysicist\". NASA/GSFC. Retrieved 2006-06-11.\n\n\n\t^ a b Bailey, J. Vernon. \"Radiation Protection and Instrumentation\". Biomedical Results of Apollo. Retrieved 2011-06-13.\n\n\n\t^ Woods, W. David (2008). How Apollo Flew to the Moon. New York: Springer-Verlag. p. 109. ISBN 978-0-387-71675-6.\n\n\n\t^ Stern, David P.; Peredo, Mauricio. \"The Exploration of the Earth's Magnetosphere\". The Exploration of the Earth's Magnetosphere. NASA/GSFC. Retrieved 2013-09-27.\n\n\n\t^ \"NASA outreach: RadNews\". Archived from the original on 2013-06-13. Retrieved 2013-09-27.\n\n\n\t^ Mirnov, Vladimir; Üçer, Defne; Danilov, Valentin (November 10–15, 1996). \"High-Voltage Tethers For Enhanced Particle Scattering In Van Allen Belts\". APS Division of Plasma Physics Meeting Abstracts. 38: 7. Bibcode:1996APS..DPP..7E06M. OCLC 205379064. Abstract #7E.06.\n\n\n\t^ \"HiVOLT_Results.jpg\". Tethers Unlimited. Retrieved 2013-09-27.\n Chart depicting radiation flux reduction.\n\n\t^ \"High-Voltage Orbiting Long Tether (HiVOLT): A System for Remediation of the Van Allen Radiation Belts\". Tethers Unlimited. Retrieved 2011-06-18.\n\n\n\n\n\nAdditional sources[edit]\n\n\tAdams, L.; Daly, E. J.; Harboe-Sorensen, R.; Holmes-Siedle, A. G.; Ward, A. K.; Bull, R. A. (December 1991). \"Measurement of SEU and total dose in geostationary orbit under normal and solar flare conditions\". IEEE Transactions on Nuclear Science. 38 (6): 1686–1692. Bibcode:1991ITNS...38.1686A. doi:10.1109/23.124163. OCLC 4632198117.\n\n\tHolmes-Siedle, Andrew; Adams, Len (2002). Handbook of Radiation Effects (2nd ed.). Oxford; New York: Oxford University Press. ISBN 978-0-19-850733-8. LCCN 2001053096. OCLC 47930537.\n\n\tShprits, Yuri Y.; Elkington, Scott R.; Meredith, Nigel P.; Subbotin, Dmitriy A. (November 2008). \"Review of modeling of losses and sources of relativistic electrons in the outer radiation belt\". Journal of Atmospheric and Solar-Terrestrial Physics. 70 (14).\n Part I: Radial transport, pp. 1679–1693, doi:10.1016/j.jastp.2008.06.008; Part II: Local acceleration and loss, pp. 1694–1713, doi:10.1016/j.jastp.2008.06.014.\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Van Allen radiation belts.\n\n\n\tAn explanation of the belts by David P. Stern and Mauricio Peredo\n\tBackground: Trapped particle radiation models – Introduction to the trapped radiation belts by SPENVIS\n\tSPENVIS – Space Environment, Effects, and Education System – Gateway to the SPENVIS orbital dose calculation software\n\tThe Van Allen Probes Web Site Johns Hopkins University Applied Physics Laboratory\n\n\n\t\tv\n\tt\n\te\n\n\nMagnetospherics\n\n\tSubmagnetosphere\t\n\tAtmospheric circulation\n\tAurora\n\tEarth's magnetic field\n\tGeosphere\n\tJet stream\n\tPolar wind\n\n\n\n\n\tEarth's magnetosphere\t\n\tBirkeland current\n\tBow shock\n\tIonosphere\n\tMagnetopause\n\tMagnetosheath\n\tMagnetosphere\n\tMagnetosphere chronology\n\tMagnetosphere particle motion\n\tPlasmasphere\n\tRing current\n\tVan Allen radiation belt\n\n\n\n\n\tSolar wind\t\n\tCoronal cloud\n\tCoronal mass ejection\n\tSolar flare\n\tGeomagnetic storm\n\tHeliosphere\n\tInterplanetary magnetic field\n\tHeliospheric current sheet\n\tHeliopause\n\tSolar particle event\n\tSpace climate\n\tSpace weather\n\n\n\n\n\tSatellites\t\n\tFull list\n\tArase (2016)\n\tCluster II\n\tDouble Star\n\tGeotail\n\tIMAGE\n\tMMS (2015)\n\tPolar\n\tTHEMIS\n\tVan Allen Probes\n\tWind\n\n\n\n\n\tResearch projects\t\n\tHAARP\n\tSHARE\n\tUnwin Radar\n\n\n\tSuperDARN\n\n\n\n\n\tOther magnetospheres\t\n\tHermian\n\tLunar\n\tJovian\n\tGanymedian\n\tSaturnian\n\tUranian\n\tNeptunian\n\n\n\n\n\tRelated topics\t\n\tFlux tube\n\tGas torus\n\tLunar swirls\n\tPlanetary rings\n\tJupiter\n\tSaturn\n\tUranus\n\tNeptune\n\n\n\n\n\n\n\n\n\n\tAuthority control \t\n\tBNF: cb11979019w (data)\n\tGND: 4187401-8\n\tLCCN: sh85141956\n\tSUDOC: 027833658\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Van_Allen_radiation_belt&oldid=916573906\"\n\n\t\t\n\t\tCategories: \tGeomagnetism\n\tSpace physics\n\tSpace plasmas\n\t1958 in science\n\n\nHidden categories: \tArticles with short description\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from August 2019\n\tCommons category link is on Wikidata\n\tWikipedia articles with BNF identifiers\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with SUDOC identifiers\n\tArticles containing video clips\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\t한국어\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tKiswahili\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tMagyar\n\tМакедонски\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tТатарча/tatarça\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 19 September 2019, at 15:20 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "6", "dc:title": "Van Allen radiation belt - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Van_Allen_Belts.ogv/1200px--Van_Allen_Belts.ogv.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-van_allen_radiation_belt", "title": "Van Allen radiation belt - Wikipedia"}}