{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWeather satellite - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tWeather satellite\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\n\n\n  \nGOES-8, a United States weather satellite of the meteorological-satellite service\n\n\n\nThe weather satellite is a type of satellite that is primarily used to monitor the weather and climate of the Earth.  Satellites can be polar orbiting, covering the entire Earth asynchronously, or geostationary, hovering over the same spot on the equator.[1]\n\nMeteorological satellites see more than clouds: city lights, fires, effects of pollution, auroras, sand and dust storms, snow cover, ice mapping, boundaries of ocean currents, energy flows, etc. Other types of environmental information are collected using weather satellites. Weather satellite images helped in monitoring the volcanic ash cloud from Mount St. Helens and activity from other volcanoes such as Mount Etna.[2] Smoke from fires in the western United States such as Colorado and Utah have also been monitored.\n\nEl Niño and its effects on weather are monitored daily from satellite images.  The Antarctic ozone hole is mapped from weather satellite data.  Collectively, weather satellites flown by the U.S., Europe, India, China, Russia, and Japan provide nearly continuous observations for a global weather watch.\n\n\nContents\n\n\n\t1 History\n\t2 Observation\n\t2.1 Visible spectrum\n\t2.2 Infrared spectrum\n\n\n\n\t3 Types\n\t3.1 Geostationary\n\t3.2 Polar orbiting\n\t3.2.1 DMSP\n\n\n\n\n\n\n\t4 Uses\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nHistory[edit]\n\n  \nThe first television image of Earth from space from the TIROS-1 weather satellite in 1960\n\n\n\n  \nA mosaic of photographs of the United States from the ESSA-9 weather satellite, taken on June 26, 1969\n\n\n\nAs early as 1946, the idea of cameras in orbit to observe the weather was being developed.  This was due to sparse data observation coverage and the expense of using cloud cameras on rockets.  By 1958, the early prototypes for TIROS and Vanguard (developed by the Army Signal Corps) were created.[3]  The first weather satellite, Vanguard 2, was launched on February 17, 1959.[4]  It was designed to measure cloud cover and resistance, but a poor axis of rotation and its elliptical orbit kept it from collecting a notable amount of useful data.  The Explorer VI and VII satellites also contained weather-related experiments.[3]\n\nThe first weather satellite to be considered a success was TIROS-1, launched by NASA on April 1, 1960.[5]  TIROS operated for 78 days and proved to be much more successful than Vanguard 2.  TIROS paved the way for the Nimbus program, whose technology and findings are the heritage of most of the Earth-observing satellites NASA and NOAA have launched since then.  Beginning with the Nimbus 3 satellite in 1969, temperature information through the tropospheric column began to be retrieved by satellites from the eastern Atlantic and most of the Pacific Ocean, which led to significant improvements to weather forecasts.[6]\n\nThe ESSA and NOAA polar orbiting satellites followed suit from the late 1960s onward.  Geostationary satellites followed, beginning with the ATS and SMS series in the late 1960s and early 1970s, then continuing with the GOES series from the 1970s onward.  Polar orbiting satellites such as QuikScat and TRMM began to relay wind information near the ocean's surface starting in the late 1970s, with microwave imagery which resembled radar displays, which significantly improved the diagnoses of tropical cyclone strength, intensification, and location during the 2000s and 2010s.\n\n\nObservation[edit]\n\nObservation is typically made via different 'channels' of the electromagnetic spectrum, in particular, the visible and infrared portions.\n\nSome of these channels include:[7][8]\n\n\n\tVisible and Near Infrared: 0.6–1.6 μm – for recording cloud cover during the day\n\tInfrared: 3.9–7.3 μm (water vapor), 8.7–13.4 μm (thermal imaging)\n\n\nVisible spectrum[edit]\n\nVisible-light images from weather satellites during local daylight hours are easy to interpret even by the average person; clouds, cloud systems such as fronts and tropical storms, lakes, forests, mountains, snow ice, fires, and pollution such as smoke, smog, dust and haze are readily apparent.  Even wind can be determined by cloud patterns, alignments and movement from successive photos.[9]\n\n\nInfrared spectrum[edit]\n\nThe thermal or infrared images recorded by sensors called scanning radiometers enable a trained analyst to determine cloud heights and types, to calculate land and surface water temperatures, and to locate ocean surface features.  Infrared satellite imagery can be used effectively for tropical cyclones with a visible eye pattern, using the Dvorak technique, where the difference between the temperature of the warm eye and the surrounding cold cloud tops can be used to determine its intensity (colder cloud tops generally indicate a more intense storm).[10]  Infrared pictures depict ocean eddies or vortices and map currents such as the Gulf Stream which are valuable to the shipping industry. Fishermen and farmers are interested in knowing land and water temperatures to protect their crops against frost or increase their catch from the sea. Even El Niño phenomena can be spotted. Using color-digitized techniques, the gray shaded thermal images can be converted to color for easier identification of desired information.\n\n\nTypes[edit]\n\n  \nThe geostationary Himawari 8 satellite's first true-colour composite PNG image\n\n\n\nEach meteorological satellite is designed to use one of two different classes of orbit: geostationary and polar orbiting.\n\n\nGeostationary[edit]\n\n\"geostationary meteorological satellite\" redirects here. For the Japanese satellites called \"Geostationary Meteorological Satellite\", see Himawari (satellite).\n\nGeostationary weather satellites orbit the Earth above the equator at altitudes of 35,880 km (22,300 miles).  Because of this orbit, they remain stationary with respect to the rotating Earth and thus can record or transmit images of the entire hemisphere below continuously with their visible-light and infrared sensors. The news media use the geostationary photos in their daily weather presentation as single images or made into movie loops. These are also available on the city forecast pages of www.noaa.gov (example Dallas, TX).[11]\n\nSeveral geostationary meteorological spacecraft are in operation. The United States' GOES series has three in operation: GOES-15, GOES-16 and GOES-17. GOES-16 and-17 remain stationary over the Atlantic and Pacific Oceans, respectively.[12] GOES-15 will be retired in early July 2019.[13]\n\nRussia's new-generation weather satellite Elektro-L No.1 operates at 76°E over the Indian Ocean. The Japanese have the MTSAT-2 located over the mid Pacific at 145°E and the Himawari 8 at 140°E. The Europeans have four in operation, Meteosat-8 (3.5°W) and Meteosat-9 (0°) over the Atlantic Ocean and have Meteosat-6 (63°E) and Meteosat-7 (57.5°E) over the Indian Ocean. China currently has three Fengyun (风云) geostationary satellites (FY-2E at 86.5°E, FY-2F at 123.5°E, and FY-2G at 105°E) operated.[14] India also operates geostationary satellites called INSAT  which carry instruments for meteorological purposes.\n\n\nPolar orbiting[edit]\n\n  \nComputer-controlled motorized parabolic dish antenna for tracking LEO weather satellites.\n\n\nPolar orbiting weather satellites circle the Earth at a typical altitude of 850 km (530 miles) in a north to south (or vice versa) path, passing over the poles in their continuous flight.  Polar orbiting weather satellites are in sun-synchronous orbits, which means they are able to observe any place on Earth and will view every location twice each day with the same general lighting conditions due to the near-constant local solar time. Polar orbiting weather satellites offer a much better resolution than their geostationary counterparts due their closeness to the Earth.\n\nThe United States has the NOAA series of polar orbiting meteorological satellites, presently NOAA-15, NOAA-18 and NOAA-19 (POES) and NOAA-20 (JPSS). Europe has the Metop-A and Metop-B satellites operated by EUMETSAT. Russia has the Meteor and RESURS series of satellites. China has FY-3A, 3B and 3C. India has polar orbiting satellites as well.\n\n\nDMSP[edit]\n\n  \nTurnstile antenna for reception of 137 MHz LEO weather satellite transmissions\n\n\n\nThe United States Department of Defense's Meteorological Satellite (DMSP) can \"see\" the best of all weather vehicles with its ability to detect objects almost as 'small' as a huge oil tanker.  In addition, of all the weather satellites in orbit, only DMSP can \"see\" at night in the visual.  Some of the most spectacular photos have been recorded by the night visual sensor; city lights, volcanoes, fires, lightning, meteors, oil field burn-offs, as well as the Aurora Borealis and Aurora Australis have been captured by this 450-mile-high space vehicle's low moonlight sensor.\n\nAt the same time, energy use and city growth can be monitored since both major and even minor cities, as well as highway lights, are conspicuous.  This informs astronomers of light pollution. The New York City Blackout of 1977 was captured by one of the night orbiter DMSP space vehicles.\n\nIn addition to monitoring city lights, these photos are a life saving asset in the detection and monitoring of fires.  Not only do the satellites see the fires visually day and night, but the thermal and infrared scanners on board these weather satellites detect potential fire sources below the surface of the Earth where smoldering occurs.  Once the fire is detected, the same weather satellites provide vital information about wind that could fan or spread the fires.  These same cloud photos from space tell the firefighter when it will rain.\n\nSome of the most dramatic photos showed the 600 Kuwaiti oil fires that the fleeing Army of Iraq started on February 23, 1991.  The night photos showed huge flashes, far outstripping the glow of large populated areas.  The fires consumed millions of gallons of oil; the last was doused on November 6, 1991.\n\n\nUses[edit]\n\n  \nInfrared image of storms over the central United States from the GOES-17 satellite\n\n\n\nSnowfield monitoring, especially in the Sierra Nevada, can be helpful to the hydrologist keeping track of available snowpack for runoff vital to the watersheds of the western United States.  This information is gleaned from existing satellites of all agencies of the U.S. government (in addition to local, on-the-ground measurements).  Ice floes, packs and bergs can also be located and tracked from weather space craft.\n\nEven pollution whether it is nature-made or man-made can be pinpointed.  The visual and infrared photos show effects of pollution from their respective areas over the entire earth.  Aircraft and rocket pollution, as well as condensation trails, can also be spotted.  The ocean current and low level wind information gleaned from the space photos can help predict oceanic oil spill coverage and movement. Almost every summer, sand and dust from the Sahara Desert in Africa drifts across the equatorial regions of the Atlantic Ocean.  GOES-EAST photos enable meteorologists to observe, track and forecast this sand cloud.  In addition to reducing visibilities and causing respiratory problems, sand clouds suppress hurricane formation by modifying the solar radiation balance of the tropics. Other dust storms in Asia and mainland China are common and easy to spot and monitor, with recent examples of dust moving across the Pacific Ocean and reaching North America.\n\nIn remote areas of the world with few local observers, fires could rage out of control for days or even weeks and consume millions of acres before authorities are alerted.  Weather satellites can be a tremendous asset in such situations. Nighttime photos also show the burn-off in gas and oil fields.  Atmospheric temperature and moisture profiles have been taken by weather satellites since 1969.[15]\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\tEarth observation satellite\n\tList of Earth observation satellites\n\n\n\tGeostationary orbit\n\tLow Earth orbit\n\tRemote sensing\n\tSatellite temperature measurements\n\tEnvironmental satellite\n\n\nReferences[edit]\n\n\n\t^ NESDIS. Satellites. Retrieved on July 4, 2008.\n\n\t^ NOAA. NOAA Satellites, Scientists Monitor Mt. St. Helens for Possible Eruption. Retrieved on July 4, 2008.\n\n\t^ a b Janice Hill (1991). Weather From Above: America's Meteorological Satellites. Smithsonian Institution. pp. 4–7. ISBN 978-0-87474-394-4.\n\n\t^ \"VANGUARD - A HISTORY, CHAPTER 12, SUCCESS - AND AFTER\". NASA. Archived from the original on May 9, 2008.\n\n\n\t^ \"U.S. Launches Camera Weather Satellite\". The Fresno Bee. AP and UPI. April 1, 1960. pp. 1a, 4a.\n\n\n\t^ National Environmental Satellite Center (January 1970). \"SIRS and the Improved Marine Weather Forecast\". Mariners Weather Log. Environmental Science Services Administration. 14 (1): 12–15.\n\n\n\t^ EUMETSAT – MSG Spectrum Archived November 28, 2007, at the Wayback Machine (PDF)\n\n\t^ EUMETSAT – MFG Payload Archived December 12, 2012, at Archive.today\n\n\t^ A. F. Hasler, K. Palaniappan, C. Kambhammetu, P. Black, E. Uhlhorn, and D. Chesters. High-Resolution Wind Fields within the Inner Core and Eye of a Mature Tropical Cyclone from GOES 1-min Images. Retrieved on 2008-07-04.\n\n\t^ Chris Landsea. Subject: H1) What is the Dvorak technique and how is it used? Retrieved on January 3, 2009.\n\n\t^ Service, US Department of Commerce, NOAA, National Weather. \"National Weather Service\".\n\n\n\t^ Tollefson, Jeff (March 2, 2018). \"Latest US weather satellite highlights forecasting challenges\". Nature. 555 (7695): 154. Bibcode:2018Natur.555..154T. doi:10.1038/d41586-018-02630-w.\n\n\n\t^ \"GOES-17 Transition to Operations │ GOES-R Series\". www.goes-r.gov. Retrieved May 26, 2019.\n\n\n\t^ \"卫星运行\" [Satellite Operation]. National Satellite Meteorological Center of CMA (in Chinese). Archived from the original on August 28, 2015.\n\n\n\t^ Ann K. Cook (July 1969). \"The Breakthrough Team\" (PDF). ESSA World. Environmental Satellite Services Administration: 28–31. Retrieved April 21, 2012.\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Meteorological satellites.\n\n\n\tTheory\n\n\n\tRalph E. Taggard (1994). Weather satellite handbook (5th edition). Newington, CT: American Radio Relay League. ISBN 978-0-87259-448-7.\n\n\tCooperative Institute for Meteorological Satellite Studies\n\tDr. Verner Suomi (\"father of the geostationary satellite\") biography\n\tInterpreting Satellite Images – Suomi Virtual Museum\n\n\n\tPhysical Characteristics of Geostationary and Polar-Orbiting weather satellites\n\tNOAA Economics & Social Benefits of POES\n\n\n\n\n\tData\n\n\n\tNear realtime composite of satellite image of the Earth by Intellicast\n\tInternational weather satellite viewer Online geostationary weather satellite viewer with 2 months of archived data.\n\tEarth at night by NASA\n\tEUMETSAT – the European Organisation for the Exploitation of Meteorological Satellites\n\tNASA Langley Cloud and Radiation Research  Near real-time and archived satellite imagery and cloud products.\n\tISCCP Global ISCCP B1 Browse System (GIBBS)  http://www.ncdc.noaa.gov/gibbs/\n\n\n\tGovernment policy\n\n\n\tGeostationary Weather Satellites: Progress Made, but Weaknesses in Scheduling, Contingency Planning, and Communicating with Users Need To Be Addressed: Report to the Committee on Science, Space, and Technology, House of Representatives Government Accountability Office\n\tPolar Weather Satellites: NOAA Identified Ways to Mitigate Data Gaps, but Contingency Plans and Schedules Require Further Attention: Report to the Committee on Science, Space, and Technology, House of Representatives Government Accountability Office\n\n\n\t\tv\n\tt\n\te\n\n\nOrbital meteorological and remote sensing systems\n\n\tConcepts\t\n\tEarth observation satellite\n\tGeographic information system (GIS)\n\tWeather satellite\n\n\n\n\n\tCurrent\nprojects\t\n\tEarth Observing\nSystem (EOS)\t\n\tGPM\n\tTRMM\n\tLandsat 7\n\tQuikSCAT\n\tTerra\n\tACRIMSAT\n\tNMP/EO-1\n\tJason-1\n\tOSTM/Jason-2\n\tJason-3\n\tMeteor 3M-1/Sage III\n\tGRACE-FO\n\tAqua\n\tSORCE\n\tAura\n\tCloudSat\n\tCALIPSO\n\tNPOESS\n\tMegha-Tropiques\n\tSARAL\n\tIRS\n\tESSP\n\tAquarius\n\tLandsat 8\n\tSMAP\n\tJPSS\n\tNISAR\n\tICESat-2\n\tWSF-M\n\n\n\n\n\tA-train satellites\t\n\tAqua\n\tAura\n\tCALIPSO\n\tCloudSat\n\tGCOM-W1 (Shizuku)\n\tOCO-2\n\n\n\n\n\tCopernicus\nprogramme\t\n\tSentinel-1\n\tSentinel-2\n\tSentinel-3\n\tSentinel-4\n\tSentinel-5 Precursor\n\tSentinel-5\n\n\n\n\n\tGeostationary\nmeteorological\nsatellites\t\n\tElektro–L\n\tFengyun-2 & -4\n\tGOES\n\tINSAT\n\tMeteosat\n\tHimawari-8\n\n\n\n\n\tOther satellites\t\n\tCBERS\n\tCOSMO-SkyMed\n\tSAOCOM\n\tDMSP\n\tDMC\n\tEROS\n\tFengyun-3\n\tGCOM-C (Shikisai)\n\tGOSAT (Ibuki)\n\tLandsat\n\tMetOp\n\tMeteor\n\tPOES\n\tRADARSAT-2\n\tRapidEye\n\tResurs-P\n\tSMOS\n\tSPOT\n\tTerraSAR-X\n\tTHEOS\n\n\n\n\n\n\n\n\tFormer\nprojects\t\n\tCompleted\t\n\tADEOS (Midori)\n\tADEOS II (Midori 2)\n\tCOSMIC (FORMOSAT-3)\n\tEnvisat\n\tERS\n\tFORMOSAT-1\n\tFORMOSAT-2\n\tGeosat\n\tGRACE\n\tGMS (Himawari)\n\tICESat\n\tIKONOS\n\tJERS-1 (Fuyo-1)\n\tNimbus\n\tPARASOL\n\tQuickBird\n\tRADARSAT-1\n\tSeasat\n\tSeaWiFS\n\tTIROS\n\tTOPEX/Poseidon\n\tUARS\n\tVanguard\n\n\n\n\n\tFailed\t\n\tOCO\n\tGlory\n\n\n\n\n\tCancelled\t\n\tNMP/EO-3\n\n\n\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpaceflight\n\n\tGeneral\t\n\tAstrodynamics\n\tHistory\n\tTimeline\n\tSpace Race\n\tAsian Space Race\n\tRecords\n\tAccidents and incidents\n\n\n\tSpace policy\n\tAustralia\n\tChina\n\tEuropean Union\n\tIndia\n\tJapan\n\tRussia\n\tSoviet Union\n\tUnited States\n\n\n\tSpace law\n\tOuter Space Treaty\n\tRescue Agreement\n\tSpace Liability Convention\n\tRegistration Convention\n\tMoon Treaty\n\n\n\tPrivate spaceflight\n\n\n\n\t\n\n\tApplications\t\n\tAstronomy\n\tEarth observation\n\tArchaeology\n\tImagery and mapping\n\tReconnaissance\n\tWeather and environment monitoring\n\n\n\tSatellite communications\n\tInternet\n\tRadio\n\tTelephone\n\tTelevision\n\n\n\tSatellite navigation\n\tCommercial use of space\n\tSpace launch market competition\n\tMilitarisation of space\n\tSpace architecture\n\tSpace exploration\n\tSpace research\n\tSpace technology\n\tSpace weather\n\n\n\n\n\tHuman spaceflight\t\n\tGeneral\t\n\tAstronaut\n\tcommercial\n\n\n\tLife support system\n\tAnimals in space\n\tBioastronautics\n\tSpace suit\n\n\n\tExtravehicular activity\n\tWeightlessness\n\tSpace toilet\n\tSpace tourism\n\tSpace colonization\n\n\n\n\n\tPrograms\t\n\tVostok\n\tMercury\n\tVoskhod\n\tGemini\n\tSoyuz\n\tApollo\n\tSkylab\n\tApollo–Soyuz\n\n\n\tSpace Shuttle\n\tMir\n\tShuttle–Mir\n\n\n\tInternational Space Station\n\tShenzhou\n\tTiangong\n\n\n\n\n\tHealth issues\t\n\tEffect of spaceflight on the human body\n\tSpace adaptation syndrome\n\n\n\tHealth threat from cosmic rays\n\tSpace psychology\n\tPsychological and sociological effects\n\n\n\tSpace and survival\n\tSpace medicine\n\tSpace nursing\n\n\n\n\n\n\n\n\tSpacecraft\t\n\tLaunch vehicle\n\tRocket\n\tSpaceplane\n\tRobotic spacecraft\n\tSatellite\n\tSpace probe\n\tLander\n\tRover\n\tSelf-replicating spacecraft\n\tSpace telescope\n\n\n\tSpacecraft propulsion\n\tRocket engine\n\tElectric propulsion\n\tSolar sail\n\tGravity assist\n\n\n\n\n\n\n\tDestinations\t\n\tSub-orbital\n\tOrbital\n\tGeocentric\n\tGeosynchronous\n\n\n\tInterplanetary\n\tInterstellar\n\tIntergalactic\n\n\n\n\n\tSpace launch\t\n\tDirect ascent\n\tEscape velocity\n\tExpendable and reusable launch systems\n\tLaunch pad\n\tNon-rocket spacelaunch\n\tSpaceport\n\n\n\n\n\tGround segment\t\n\tFlight controller\n\tGround station\n\tPass\n\tMission control center\n\n\n\n\n\tSpace agencies\t\n\t CoNAE\n\t ASA\n\t AEB\n\t CSA\n\t CNSA\n\t ESA\n\t CNES\n\t DLR\n\t ISRO\n\t LAPAN\n\t ISA\n\t ISA\n\t ASI\n\t AEM\n\t JAXA\n\t NADA\n\t KARI\n\t SUPARCO\n\t Roscosmos\n\t SNSA\n\t SSAU\n\t UKSA\n\t NASA\n\n\n\n\n\t\n\t  Category\n\t  Portal\n\t  WikiProject\n\n\n\n\n\n\n\n\tAuthority control \t\n\tLCCN: sh85084328\n\tNARA: 10646491\n\tNDL: 00566013\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Weather_satellite&oldid=916482552\"\n\n\t\t\n\t\tCategories: \tWeather satellites\n\tAmerican inventions\n\t1959 introductions\n\n\nHidden categories: \tWebarchive template wayback links\n\tWebarchive template archiveis links\n\tCS1 Chinese-language sources (zh)\n\tUse mdy dates from January 2012\n\tCommons category link is on Wikidata\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NARA identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\t한국어\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tLatviešu\n\tMagyar\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tPolski\n\tPortuguês\n\tРусский\n\tSlovenčina\n\tСрпски / srpski\n\tSuomi\n\tSvenska\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 19 September 2019, at 03:57 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "6", "dc:title": "Weather satellite - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/GOES_8_Spac0255.jpg/1200px-GOES_8_Spac0255.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-weather_satellite", "title": "Weather satellite - Wikipedia"}}