{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nX Band Satellite Communication - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tX Band Satellite Communication\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tX band or SHF Satellite Communication is widely used by military forces for beyond line of sight communications.  X band is used because it provides a compromise between the characteristics of different frequency bands which is particularly suited to the needs of military users.  The characteristics include interference and rain resilience, terminal size, data rates, remote coverage and whether it is reserved for governmental use.\n\n\nContents\n\n\n\t1 Characteristics of the SHF frequency band\n\t1.1 Frequency\n\t1.2 Rain resilience\n\t1.3 >4° separation between satellites\n\t1.4 Terminal size v data rates\n\t1.5 Remote and maritime coverage\n\n\n\n\t2 Characteristics of SHF Satcom systems\n\t3 Components of SHF Satcom systems\n\t4 Satellite communication systems operating at X band\n\t4.1 Skynet\n\t4.2 Wideband Global SATCOM system (WGS)\n\t4.3 XTAR-EUR\n\t4.4 Spainsat\n\t4.5 Sicral\n\t4.6 Syracuse\n\t4.7 Anik G1\n\t4.8 DC-MS Series 2\n\t4.9 NATO SATCOM Post-2000\n\n\n\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nCharacteristics of the SHF frequency band[edit]\n\nFrequency[edit]\n\nx Band Satellite Communication operates in the part of the X band or Super High Frequency (SHF) spectrum which is designated by the International Telecommunication Union (ITU) for satellite communication, which is those frequencies in the range 7.25 GHz to 7.75 GHz (Space to Earth) and 7.9 GHz to 8.4 GHz (Earth to Space).[1] The ITU Frequency allocation defines the primary use of this spectrum as Fixed satellite service (FSS) and a portion to Mobile Satellite Services (MSS), primarily used for ship based satellite communications.  UK Frequency Allocation Table (UK FAT)[2] along with other NATO countries and some other countries’ (but not all) national frequency allocations tables, have an additional note detailing the primary allocation for government use.  It is important to note that the allocation of these frequencies and services is for government use and not, as commonly stated, military use.  The ITU and the UK Ofcom considers military use as just one part of government use.\n\n\nRain resilience[edit]\n\nX band is below those frequencies which are severely affected by Rain Fade, therefore X band provides extremely good rain resilience unlike higher frequencies such as Ku or Ka which are also used for satellite communication.  This allows extremely high link availability, in some cases as high as 99.9%\n\n\n>4° separation between satellites[edit]\n\nX band satellites typically have at least 4° separation between satellites, therefore there is less chance of adjacent satellite interference (ASI) and higher power density carriers allowed.[3]\n\n\nTerminal size v data rates[edit]\n\nAs with any satellite communication link, the data rate that can be achieved with a terminal is dependent on the gain of the parabolic antenna.  Antenna gain increases with the square of the ratio of aperture width to wavelength.  Therefore, for a fixed antenna size the gain, and hence the achievable data rate increases with frequency.  Thus X band provides data rates which are much higher than can be achieved with UHF, L band, or C band.  The achievable data rates will approach those achievable with Ku band, the exact values will depend on other link parameters (satellite power, link margin, modulation scheme, etc.).\n\nTherefore, X band provides a good compromise between terminal size and data rates while maintaining resilience to rain fade.  Data rates of 10Mbit/s are achievable to a 45 cm antenna without interfering with adjacent satellites.  National Frequency Planning Group on behalf of the Committee on UK Spectrum Strategy\n\n\nRemote and maritime coverage[edit]\n\nX band spot beams typically have a diameter of 1000 km or more.  This is the result of the frequency and the size of Parabolic antenna which can be accommodated inside satellite launch vehicles.  This means that a single beam is able to be steered to cover an entire region of interest.  X band satellites also have an earth cover or global beam providing coverage of the entire planet that is visible from the satellite.  This is in contrast to satellites in commercial bands which typically provide fixed beams for areas of high density of users.  Therefore, X band satellites are able to support users in remote areas with little or no infrastructure and in mid ocean away from land and shipping lanes.\n\n\nCharacteristics of SHF Satcom systems[edit]\n\nSHF Satcom systems often possess features designed to meet the needs of military users and to counter threats to the system.  Features include \n\n\n\tSteerable beams\n\tHigh power spectral density\n\tProtection against nuclear events and space weather\n\tMilitary grade cryptography on the telecommand system\n\tProtection against laser threats\n\tMilitary specification control facilities\n\tProtection against jamming attacks\n\tFlexible connectivity\n\n\nComponents of SHF Satcom systems[edit]\n\nLike other Satellite Communications X band satellite communication systems comprise the following segments\nSatellite space segment: the satellite which comprises the platform and the payload\n\n\n\tControl Segment: the ground equipment to control the satellite\n\tAnchor facilities: while mesh configurations are possible most X band satcom systems use anchor facilities to exploit the link budget benefits from large antennas and to provide terrestrial connectivity\n\tNetwork management: the facilities to manage the communication network in particular the baseband elements\n\tUser terminals: the terminals used by deployed users to connect to the satellite system.  User terminals may be interoperable with several different X band systems.  User terminals are adapted to the requirements of the environment in which the operate\n\n\nSatellite communication systems operating at X band[edit]\n\nSkynet[edit]\n\nMain article: Skynet (satellite)\n\nThe Skynet fleet of satellites are owned and operated by Airbus Defence & Space who hold a long term concession for beyond line of sight communications with the UK MOD.  The fleet includes four high performance Skynet 5 satellites with 160W TWTAs providing up to 8W/MHz and an active receive antenna capable of creating multiple uplink beam patterns.  The Skynet fleet also includes older Skynet 4 satellites which are beyond their original design life and in inclined orbits, these orbits enable them to provide communications to arctic and Antarctic regions.\nIn addition to SHF capacity the Skynet satellites also have UHF capacity.[4]\n\n\nWideband Global SATCOM system (WGS)[edit]\n\nMain article: Wideband Global SATCOM\n\nThe WGS system is a constellation of military communications satellites procured by the U.S. Air Force MILSATCOM Systems Directorate at Los Angeles Air Force Base (AFB).  Each WGS satellite provides capacity in both the X and Ka frequency bands.   Each WGS satellite is digitally channelized and transponded.[5] International partners participating on the program are Australia, Canada, Denmark, Luxembourg, The Netherlands and New Zealand.[6]\n\n\nXTAR-EUR[edit]\n\nThe XTAR-EUR satellite is owned and operated by XTAR LLC.  It was launched in February 2005 and is positioned at 29 degrees east.  XTAR-EUR has 100W, 72 MHz transponders[7]\n\n\nSpainsat[edit]\n\nSpainSat is owned by Hisdesat. SpainSat was launched in March 2006 and is positioned at 29 degrees west.  Spainsat has an X-Band payload with 100W, 72 MHz transponders.  It also has Ka band capacity.[8]\n\n\nSicral[edit]\n\nSICRAL (Sistema Italiano per Comunicazioni Riservate ed Allarmi) is Italy’s satellite system for military communications.  The SICRAL 1 satellite was launched in 2001 and the SICRAL 1B satellite was launched in 2009.[9]\n\n\nSyracuse[edit]\n\nSyracuse III (système de radiocommunications utilisant un satellite) is the military satellite communication system of the French ministry of Defence.  Syracuse 3A was launched in 2005 and Syracuse 3B was launched in 2006.[10]\n\n\nAnik G1[edit]\n\nAnik G1 was launched in April 2013, and includes a 3-transponder, global-beam X-band payload, operating from 107.3°W.[11]\n\n\nDC-MS Series 2[edit]\n\nDC-MS Series 2 consists of 2 triple-transponder global-beam X-band payload, operated by Delta Communications. DC-MS Series 2 was launched in January 2014.\n\n\nNATO SATCOM Post-2000[edit]\n\nThe NATO X Band satellite system consists of a NATO owned ground segment with capacity leased from a consortium formed by the British, French and Italian governments.[12]\n\n\nSee also[edit]\n\n\tSatellite communications\n\tMilitary communications\n\tArtificial satellite\n\n\nReferences[edit]\n\n\n\t^ \"ITU Radio Regulations 2012\" (PDF). Retrieved 18 June 2014.\n\n\t^ National Frequency Planning Group on behalf of the Committee on UK Spectrum Strategy. \"United Kingdom Frequency Allocation Table Issue 17\" (PDF). www.ofcom.org.uk. Retrieved 19 June 2014.\n\n\n\t^ \"Commercial X-Band: The Technical + Operational Advantages\". Retrieved 18 June 2014.\n\n\n\t^ \"Skynet Data Sheet\" (PDF). Retrieved 18 June 2014.\n\n\n\t^ \"Boeing WGS Factsheet\". Archived from the original on June 13, 2014. Retrieved 18 June 2014.\n\n\n\t^ \"Los Angeles Airforce Base WGS Factsheet\". Archived from the original on March 25, 2014. Retrieved 18 June 2014.\n\n\n\t^ \"XTAR-EUR Data sheet\" (PDF). Retrieved 18 June 2014.\n\n\n\t^ \"Spainsat data sheet\". Retrieved 18 June 2014.\n\n\n\t^ \"Italian MOD announcement of Sicral 1B launch (Lancio del Satellite SICRAL 1B)\". Retrieved 18 June 2014.\n\n\n\t^ \"Syracuse III\". Archived from the original on March 6, 2014. Retrieved 18 June 2014.\n\n\n\t^ \"Anik G1 Datasheet\" (PDF). Retrieved 18 June 2014.\n\n\n\t^ \"SATCOM Post-2000\". Retrieved 18 June 2014.\n\n\n\n\n\n\nExternal links[edit]\n\n\tSATELLITE COMMUNICATIONS (SATCOM) https://fas.org/spp/military/docops/army/ref_text/chap07b.htm\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=X_Band_Satellite_Communication&oldid=916431814\"\n\n\t\t\n\t\tCategories: \tCommunications satellites\n\tMilitary communications\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\n\n\t\t\t\tAdd links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 18 September 2019, at 21:53 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "3", "dc:title": "X Band Satellite Communication - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-x_band_satellite_communication", "title": "X Band Satellite Communication - Wikipedia"}}