{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYo-yo de-spin - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tYo-yo de-spin\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tPlay media\n  \nAnimation showing a PAM-D with the Phoenix spacecraft. The stage is successively spun, fired, yo-yo de-spun and jettisoned.\n\n\n\nA yo-yo de-spin mechanism is a device used to reduce the spin of satellites, typically soon after launch.  It consists of two lengths of cable with weights on the ends.  The cables are wrapped around the final stage and/or satellite, in the manner of a double yo-yo.  When the weights are released, the spin of the rocket flings them away from the spin axis.  This transfers enough angular momentum to the weights to reduce the spin of the satellite to the desired value.  Subsequently, the weights are often released.[1]\n\nDe-spin is needed since some final stages are spin-stabilized, and require fairly rapid rotation (around 50 rpm. Some, such as Pioneer, rotated at over 600 rpm) to remain stable during firing.  (See, for example, the Star 48, a solid fuel rocket motor.)  After firing, the satellite cannot be simply released, since such a spin rate is beyond the capability of the satellite's attitude control.  Therefore, after rocket firing but before satellite release, the yo-yo weights are used to reduce the spin rates to something the satellite can endure (often 2-5 RPM).[2]  Yo-yo de-spin systems are commonly used on NASA sub-orbital sounding rocket flights, as the vehicles are spin stabilized through ascent and have minimal flight time for roll cancellation using the payload's attitude control system.[3]\n\nAs an example of yo-yo de-spin, on the Dawn Mission, roughly 3 kg of weights, and 12 meter cables, reduced the initial spin rate of the 1420 kg spacecraft from 46 RPM to 3 RPM in the opposite direction.[4]   The relatively small weights have a large effect since they are far from the spin axis, and their effect increases as the square of the length of the cables.\n\nYo-yo de-spin was invented, built, and tested at Caltech's Jet Propulsion Laboratory.[5]\n\nYo-yo hardware can contribute to the space debris problem on orbital missions, but this is not a problem when used on the upper stages of earth escape missions such as Dawn, as the cables and weights are also on an escape trajectory.\n\n\n\"Yo-weight\"[edit]\n\nSometimes only a single weight and cable is used.  Such an arrangement is colloquially named a \"yo-weight.\"  When the final stage is a solid rocket, the stage may continue to thrust slightly even after spacecraft release.  This is from residual fuel and insulation in the motor casing outgassing, even without significant combustion.  In a few cases, the spent stage has rammed the payload.[6]  By using one weight without a matching counterpart, the stage eventually tumbles.  The tumbling motion prevents residual thrust from accumulating in a single direction. Instead, the stage's exhaust averages out to a much lower value over a wide range of directions.\n\nIn March 2009, a leftover yo-weight caused a scare when it came too close to the International Space Station.[7]\n\n\nSee also[edit]\n\n\tAttitude dynamics and control\n\tSpace debris\n\n\nReferences[edit]\n\nCornille, H. J., Jr., A Method of Accurately Reducing the Spin Rate of a Rotating Spacecraft, NASA Technical Note D- 1420, October 1962.\n\nFedor, J. V., Analytical Theory of the Stretch Yo-Yo for De-Spin of Satellites, NASA Technical Note D-1676, April 1963.\n\nFedor, J. V., \"Theory and Design Curves for a Yo-Yo De-Spin Mechanism for Satellites,\" NASA Technical Note D-708, August 1961.\n\n\n\n\t^ \"Space debris mitigation: the case for a code of conduct\". ESA. European Space Agency. 15 April 2005. Retrieved 14 November 2014.\n\n\t^ Scott R. Starin and John Eterno. \"Attitude Determination and Control Systems\" (PDF). NASA.\n\n\n\t^ \"General Description of Sounding Rockets\". Johns Hopkins.\n\n\n\t^ Dawn Journal, 12 September 2007\n\n\t^ US 3030049  Pilkington, W. C., Jr., McDonald, W. S., and Wells, W. H., Satellite Spin Control, April 1962\n\n\t^ Nobuaki Ishii, Separation Motion Analysis of Sounding Rockets using Unbalanced YoYo Mechanism,  The Institute of Space and Astronautical Science, Japan Aerospace Exploration Agency.  From this article: 'In sounding rocket experiments and a final stage of satellite insertion, when the payload section or the satellite is separated from the lower motor, collision of the motor due to the residual thrust should be avoided.  Conventionally, a tumble motor (small solid rocket propellant) or Yo tumbler is utilized for the collision avoidance.'\n\n\t^ Space station crew has close call with space junk\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Yo-yo_de-spin&oldid=881335786\"\n\n\t\t\n\t\tCategories: \tSpacecraft propulsion\n\tSpacecraft components\n\tSpacecraft design\n\n\nHidden categories: \tArticles containing video clips\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tDeutsch\n\tFrançais\n\tItaliano\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 February 2019, at 22:02 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "2", "dc:title": "Yo-yo de-spin - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/PAM-D_1920x1080.ogv/1200px--PAM-D_1920x1080.ogv.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-yo-yo_de-spin", "title": "Yo-yo de-spin - Wikipedia"}}