{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2001 Mars Odyssey - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\t2001 Mars Odyssey\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t2001 Mars Odyssey\tArtist's impression of the Mars Odyssey spacecraft\n\n\t\n\tMission type\tMars orbiter\n\tOperator\tNASA / JPL\n\tCOSPAR ID\t2001-014A\n\tSATCAT no.\t26734\n\tWebsite\tmars.jpl.nasa.gov/odyssey/\n\tMission duration\tElapsed:\n18 years, 5 months and 21 days from launch\n17 years, 11 months and 4 days at Mars (6373 sols)\n\nEn route: 6 months, 17 days\nPrimary mission: 32 months (1007 sols)\nExtended mission: 15 years, 1 month and 3 days (5365 sols) elapsed\n\t\n\n\t\n\tSpacecraft properties\n\tManufacturer\tLockheed Martin\n\tLaunch mass\t758 kilograms (1,671 lb)\n\tDry mass\t376.3 kilograms (830 lb)\n\tPower\t750 W\n\t\n\n\t\n\tStart of mission\n\tLaunch date\t7 April 2001, 15:02:22 (2001-04-07UTC15:02:22Z) UTC\n\tRocket\tDelta II 7925-9.5\n\tLaunch site\tCape Canaveral SLC-17A\n\t\n\n\t\n\tOrbital parameters\n\tReference system\tAreocentric\n\tRegime\tSun-synchronous\n\tSemi-major axis\t3,793.4 km (2,357.1 mi)[1]\n\tEccentricity\t0.0\n\tPeriareion altitude\t400 km (250 mi)[1]\n\tApoareion altitude\t400 km (250 mi)[1]\n\tInclination\t93.064 degrees[1]\n\tPeriod\t2 hours[1]\n\tEpoch\t19 October 2002[1]\n\t\n\n\t\n\tMars orbiter\n\tOrbital insertion\t24 October 2001, 02:18:00 UTC\nMSD 45435 12:21 AMT\n\t\n\n\t\n \n\n\n2001 Mars Odyssey is a robotic spacecraft orbiting the planet Mars. The project was developed by NASA, and contracted out to Lockheed Martin, with an expected cost for the entire mission of US$297 million. Its mission is to use spectrometers and a thermal imager to detect evidence of past or present water and ice, as well as study the planet's geology and radiation environment.[2] It is hoped that the data Odyssey obtains will help answer the question of whether life existed on Mars and create a risk-assessment of the radiation that future astronauts on Mars might experience. It also acts as a relay for communications between the Mars Science Laboratory, and previously the Mars Exploration Rovers and Phoenix lander, to Earth. The mission was named as a tribute to Arthur C. Clarke, evoking the name of 2001: A Space Odyssey.[3]\n\nOdyssey was launched April 7, 2001, on a Delta II rocket from Cape Canaveral Air Force Station, and reached Mars orbit on October 24, 2001, at 02:30 UTC (October 23, 19:30 PDT, 22:30 EDT).[4]\n\nBy December 15, 2010, it broke the record for longest serving spacecraft at Mars, with 3,340 days of operation.[5]  It is currently in a polar orbit around Mars with a semi-major axis of about 3,800 km or 2,400 miles. It has enough propellant to function until 2025.\n\n\nContents\n\n\n\t1 Overview\n\t2 Naming\n\t3 Scientific instruments\n\t4 Mission\n\t4.1 Water on Mars\n\t4.2 Odyssey and Curiosity\n\n\n\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nOverview[edit]\n\nOn May 28, 2002 (sol 210), NASA reported that Odyssey's GRS instrument had detected large amounts of hydrogen, a sign that there must be ice lying within a meter of the planet's surface, and proceeded to map the distribution of water below the shallow surface.[6] The orbiter also discovered vast deposits of bulk water ice near the surface of equatorial regions.[7]\n\nOdyssey has also served as the primary means of communications for NASA's Mars surface explorers in the past decade, up to the Curiosity rover. By December 15, 2010, it broke the record for longest serving spacecraft at Mars, with 3,340 days of operation, claiming the title from NASA's Mars Global Surveyor.[5] It currently holds the record for the longest-surviving continually active spacecraft in orbit around a planet other than Earth, ahead of the Pioneer Venus Orbiter (served 14 years[8]) and the Mars Express (serving over 14 years), at 17 years, 11 months and 4 days.\n\n\nNaming[edit]\n\nIn August 2000, NASA solicited candidate names for the mission. Out of 200 names submitted, the committee chose Astrobiological Reconnaissance and Elemental Surveyor, abbreviated ARES (a tribute to Ares, the Greek god of war). Faced with criticism that this name was not very compelling, and too aggressive, the naming committee reconvened. The candidate name \"2001 Mars Odyssey\" had earlier been rejected because of copyright and trademark concerns. However, NASA e-mailed Arthur C. Clarke in Sri Lanka, who responded that he would be delighted to have the mission named after his books, and he had no objections. On September 20, NASA associate administrator Ed Weiler wrote to the associate administrator for public affairs recommending a name change from ARES to 2001 Mars Odyssey. Peggy Wilhide then approved the name change.[9][10]\n\n\nScientific instruments[edit]\n\nThe three primary instruments Odyssey uses are the:\n\n\n\tThermal Emission Imaging System (THEMIS).[11]\n\tGamma Ray Spectrometer (GRS),[12] includes the High Energy Neutron Detector (HEND), provided by Russia. GRS is a collaboration between University of Arizona's Lunar and Planetary Lab., the Los Alamos National Laboratory, and Russia's Space Research Institute.\n\tMars Radiation Environment Experiment (MARIE).\n\n\nMission[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"2001 Mars Odyssey\" – news · newspapers · books · scholar · JSTOR  (April 2017) (Learn how and when to remove this template message)\n\n\n\n  \nSummary of Mars Odyssey mission start\n\n\n\n  \nAnimation of 2001 Mars Odyssey's trajectory around Mars from 24 October 2001 to 24 October 2002\n   2001 Mars Odyssey ·   Mars\n\n\n\n  \nMars Odyssey as imaged by Mars Global Surveyor\n\n\n\nMars Odyssey launched from Cape Canaveral on April 7, 2001, and arrived at Mars about 200 days later on October 24. The spacecraft's main engine fired in order to decelerate, which allowed it to be captured into orbit around Mars.  Odyssey then spent about three months aerobraking, using friction from the upper reaches of the Martian atmosphere to gradually slow down and reduce and circularize its orbit.  By using the atmosphere of Mars to slow the spacecraft in its orbit rather than firing its engine or thrusters, Odyssey was able to save more than 200 kilograms (440 lb) of propellant. This reduction in spacecraft weight allowed the mission to be launched on a Delta II 7925 launch vehicle, rather than a larger, more expensive launcher.[13]\n\nAerobraking ended in January 2002, and Odyssey began its science mapping mission on February 19, 2002. Odyssey's original, nominal mission lasted until August 2004, but repeated mission extensions have kept the mission active.[14]\n\nAbout 85% of images and other data from NASA's twin Mars Exploration Rovers, Spirit and Opportunity, have reached Earth via communications relay by Odyssey. The orbiter helped analyze potential landing sites for the rovers and performed the same task for NASA's Phoenix mission, which landed on Mars in May 2008. Odyssey aided NASA's Mars Reconnaissance Orbiter, which reached Mars in March 2006, by monitoring atmospheric conditions during months when the newly arrived orbiter used aerobraking to alter its orbit into the desired shape.[15]\n\nOdyssey is in a Sun-synchronous orbit, which provides consistent lighting for its photographs. On September 30, 2008 (sol 2465) the spacecraft altered its orbit to gain better sensitivity for its infrared mapping of Martian minerals. The new orbit eliminated the use of the gamma ray detector, due to the potential for overheating the instrument at the new orbit.\n\n\n  \nMARIE hardware, designed to measure radiation\n\n\n\nThe payload's MARIE radiation experiment stopped taking measurements after a large solar event bombarded the Odyssey spacecraft on October 28, 2003. Engineers believe the most likely cause is that a computer chip was damaged by a solar particle smashing into the MARIE computer board.\n\nThe orbiter's orientation is controlled by a set of three reaction wheels and a spare. When one failed in June 2012, the fourth was spun up and successfully brought into service. Since July 2012, Odyssey has been back in full, nominal operation mode following three weeks of 'safe' mode on remote maintenance.[16][17]\n\nOn February 11, 2014, mission control accelerated Odyssey's drift toward a morning-daylight orbit to \"enable observation of changing ground temperatures after sunrise and after sunset in thousands of places on Mars\". The orbital change occurred gradually until November 2015.[18] Those observations could yield insight about the composition of the ground and about temperature-driven processes, such as warm seasonal flows observed on some slopes, and geysers fed by spring thawing of carbon dioxide (CO2) ice near Mars' poles.[18]\n\nOn October 19, 2014, NASA reported that the Mars Odyssey Orbiter,[19] as well as the Mars Reconnaissance Orbiter[20] and MAVEN,[21] were healthy after the Comet Siding Spring flyby.[22][23]\n\nIn 2010, a spokesman for NASA's Jet Propulsion Laboratory stated that Odyssey could continue operating until at least 2016.[24] This estimate has since been extended until 2025.[25]\n\n\nWater on Mars[edit]\n\nMain article: Water on Mars\n\nBy 2008, Mars Odyssey had mapped the basic distribution of water below the shallow surface.[26]   The ground truth for its measurements came on July 31, 2008, when NASA announced that the Phoenix lander confirmed the presence of water on Mars,[27] as predicted in 2002 based on data from the Odyssey orbiter. The science team is trying to determine whether the water ice ever thaws enough to be available for microscopic life, and if carbon-containing chemicals and other raw materials for life are present.\n\nThe orbiter also discovered vast deposits of bulk water ice near the surface of equatorial regions.[7] Evidence for equatorial hydration is both morphological and compositional and is seen at both the Medusae Fossae formation and the Tharsis Montes.[7]\n\n\nOdyssey and Curiosity[edit]\n\nMars Odyssey's THEMIS instrument was used to help select a landing site for the Mars Science Laboratory (MSL).[28] Several days before MSL's landing in August 2012, Odyssey's orbit was altered to ensure that it would be able to capture signals from the rover during its first few minutes on the Martian surface.[29] Odyssey also acts as a relay for UHF radio signals from the (MSL) rover Curiosity.[29]  Because Odyssey is in a Sun-synchronous orbit, it consistently passes over Curiosity's location at the same two times every day, allowing for convenient scheduling of contact with Earth.\n\n\nSee also[edit]\n\n\n\tSolar System portal\n\tSpaceflight portal\n\tUnited States portal\n\n\n\n\n\tExploration of Mars\n\tList of Mars orbiters\n\tList of missions to Mars\n\tMars Express Orbiter\n\tMars Global Surveyor\n\tMars Orbiter Mission\n\tMars Student Imaging Project (MSIP)\n\n\n\n\nReferences[edit]\n\n\n\t^ a b c d e f Makovsky, A., Barbieri, A., Tung, R. (October 2002). Odyssey Telecommunications (PDF) (Report).CS1 maint: uses authors parameter (link)\n\n\t^ \"Mars Odyssey Goals\". NASA JPL.\n\n\n\t^ \"Mars Odyssey: Overview\". JPL, CIT. Archived from the original on 2011-09-19.\n\n\n\t^ Beatty, J. Kelly (2012-05-24). \"Mars Odyssey Arrives\". Sky and Telescope. Sky Publishing.\n\n\n\t^ a b \"NASA's Odyssey Spacecraft Sets Exploration Record on Mars\". Press Releases. JPL, NASA. 2010-12-15. Archived from the original on 2011-04-25.\n\n\n\t^ \"January, 2008: Hydrogen Map\". Lunar & Planetary Lab at The University of Arizona.\n\n\n\t^ a b c Equatorial locations of water on Mars: Improved resolution maps based on Mars Odyssey Neutron Spectrometer data (PDF). Jack T. Wilson, Vincent R. Eke, Richard J. Massey, Richard C. Elphic, William C. Feldman, Sylvestre Maurice, Luıs F. A. Teodoroe. Icarus,  299, 148-160. January 2018.\n\n\t^ Pioneer Venus 1: In Depth[permanent dead link]. NASA.\n\n\t^ Hubbard, Scott (2011). Exploring Mars: Chronicles from a Decade of Discovery. University of Arizona Press. pp. 149–51. ISBN 978-0-8165-2896-7.\n\n\n\t^ \"It's \"2001 Mars Odyssey\" for NASA's Next Trip to the Red Planet\" (Press release). NASA HQ/JPL. 2000-09-28. Retrieved 2016-03-12.\n\n\n\t^ Christensen, P. R.; Jakosky, B. M.; Kieffer, H. H.; Malin, M. C.; McSween Jr., H. Y.; Nealson, K.; Mehall, G. L.; Silverman, S. H.; Ferry, S.; Caplinger, M.; Ravine, M. (2004). \"The Thermal Emission Imaging System (THEMIS) for the Mars 2001 Odyssey Mission\". Space Science Reviews. 110 (1–2): 85. Bibcode:2004SSRv..110...85C. doi:10.1023/B:SPAC.0000021008.16305.94.\n\n\n\t^ Boynton, W.V.; Feldman, W.C.; Mitrofanov, I.G.; Evans, L.G.; Reedy, R.C.; Squyres, S.W.; Starr, R.; Trombka, J.I.; d'Uston, C.; Arnold, J.R.; Englert, P.A.J.; Metzger, A.E.; Wänke, H.; Brückner, J.; Drake, D.M.; Shinohara, C.; Fellows, C.; Hamara, D.K.; Harshman, K.; Kerry, K.; Turner, C.; Ward1, M.; Barthe, H.; Fuller, K.R.; Storms, S.A.; Thornton, G.W.; Longmire, J.L.; Litvak, M.L.; Ton'chev, A.K. (2004). \"The Mars Odyssey Gamma-Ray Spectrometer Instrument Suite\". Space Science Reviews. 110 (1–2): 37. Bibcode:2004SSRv..110...37B. doi:10.1023/B:SPAC.0000021007.76126.15.\n\n\n\t^ \"Mars Odyssey: Newsroom\". NASA Jet Propulsion Laboratory.\n\n\n\t^ \"Mission Timeline - Mars Odyssey\". NASA Jet Propulsion Laboratory.\n\n\n\t^ NASA, JPL. \"Communications Relay - Mars Odyssey\". mars.nasa.gov. Retrieved 2018-10-31.\n\n\n\t^ \"Longest-Lived Mars Orbiter Is Back in Service\". Status Reports. JPL. 2012-06-27. Archived from the original on 2012-07-03.\n\n\n\t^ NASA, JPL. \"Guidance, Navigation, and Control - Mars Odyssey\". mars.nasa.gov. Retrieved 2018-10-31.\n\n\n\t^ a b Staff (2014-02-12). \"NASA Moves Longest-Serving Mars Spacecraft for New Observations\". Press Releases. Jet Propulsion Laboratory. Archived from the original on 2014-02-26.\n\n\n\t^ Webster, Guy; Brown, Dwayne (October 19, 2014). \"NASA's Mars Odyssey Orbiter Watches Comet Fly Near\". NASA. Retrieved 2014-10-20.\n\n\n\t^ Webster, Guy; Brown, Dwayne (October 19, 2014). \"NASA's Mars Reconnaissance Orbiter Studies Comet Flyby\". NASA. Retrieved 2014-10-20.\n\n\n\t^ Jones, Nancy; Steigerwald, Bill; Webster, Guy; Brown, Dwayne (October 19, 2014). \"NASA's MAVEN Studies Passing Comet and Its Effects\". NASA. Retrieved 2014-10-20.\n\n\n\t^ Webster, Guy; Brown, Dwayne; Jones, Nancy; Steigerwald, Bill (October 19, 2014). \"All Three NASA Mars Orbiters Healthy After Comet Flyby\". NASA. Retrieved 2014-10-20.\n\n\n\t^ France-Presse, Agence (October 19, 2014). \"A Comet's Brush With Mars\". The New York Times. Retrieved 2014-10-20.\n\n\n\t^ Kremer, Ken (2010-12-13). \"The Longest Martian Odyssey Ever\". Universe Today. Archived from the original on 2010-12-20.\n\n\n\t^ \"THEMIS makes 60,000 orbits of Red Planet | Mars Odyssey Mission THEMIS\". themis.asu.edu. Retrieved 2017-02-21.\n\n\n\t^ \"January, 2008: Hydrogen Map\". Lunar & Planetary Lab at The University of Arizona.\n\n\n\t^ \"Confirmation of Water on Mars\". Phoenix Mars Lander. NASA. 2008-06-20. Archived from the original on 2008-07-01.\n\n\n\t^ \"THEMIS Support for MSL Landing Site Selection\". THEMIS. Arizona State University. 2006-07-28. Archived from the original on 2006-08-14.\n\n\n\t^ a b Gold, Scott (2012-08-07). \"Curiosity's perilous landing? 'Cleaner than any of our tests'\". Los Angeles Times. Archived from the original on 2012-08-09.\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to 2001 Mars Odyssey.\n\n\n\tThe Mars Odyssey site\n\t2001 Mars Odyssey Mission Profile by NASA's Solar System Exploration\n\tSky & Telescope: \"Mars Odyssey Pays Early Dividends\"\n\tBBC News story on Mars Odyssey observations of apparent ice deposits\n\tMars Trek - Shows present overhead position of Mars Odyssey\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft missions to Mars\n\n\tActive missions\t\n\tOrbiters\t\n\t2001 Mars Odyssey\n\tMars Express (MEX)\n\tMars Reconnaissance Orbiter (MRO)\n\tMangalyaan (MOM)\n\tMAVEN\n\tExoMars Trace Gas Orbiter (TGO)\n\n\n\n\n\tLanders\t\n\tInSight\n\n\n\n\n\tRovers\t\n\tCuriosity\n\ttimeline\n\n\n\n\n\n\n\n\n\t\n \n \n \n \n\n\n\tPast missions\t\n\tFlybys\t\n\tMars 1†\n\tMariner 4\n\tZond 2†\n\tMariner 6 and 7\n\tMars 6\n\tMars 7\n\tRosetta\n\tDawn\n\tMars Cube One (MarCO)\n\n\n\n\n\tOrbiters\t\n\tMars 2\n\tMars 3\n\tMariner 9\n\tMars 4†\n\tMars 5\n\tViking program\n\tViking 1\n\tViking 2\n\n\n\tPhobos program\n\tPhobos 1†\n\tPhobos 2†\n\n\n\tMars Observer†\n\tMars Global Surveyor (MGS)\n\tNozomi†\n\tMars Climate Orbiter†\n\n\n\n\n\tLanders\t\n\tMars 2†\n\tMars 3†\n\tMars 6†\n\tMars 7†\n\tViking 1\n\tViking 2\n\tMars Pathfinder\n\tMars Polar Lander† / Deep Space 2†\n\tBeagle 2†\n\tPhoenix\n\tExoMars Schiaparelli†\n\n\n\n\n\tRovers\t\n\tProp-M†\n\tSojourner\n\tSpirit\n\tobservations\n\n\n\tOpportunity\n\ttimeline\n\tobservations\n\n\n\n\n\n\n\n\n\n\tMars-crossing objects\t\n\tZond 3\n\tElon Musk's Tesla Roadster\n\n\n\n\n\tFailed launches\t\n\tMars 1M No.1\n\t1M No.2\n\t2MV-4 No.1\n\t2MV-3 No.1\n\tMariner 3\n\tMars 2M No.521\n\t2M No.522\n\tMariner 8\n\tMars 3MS No.170\n\tMars 96\n\tFobos-Grunt / Yinghuo-1\n\n\n\n\n\tFuture missions\t\n\tPlanned\t\n\tHope Mars Mission (2020)\n\tExoMars (2020)\n\tRosalind Franklin rover\n\tKazachok lander\n\n\n\tMars 2020 (2020)\n\tMars Helicopter Scout\n\n\n\tHX-1 (2020)\n\tMars Orbiter Mission 2 (2022 or 2023)\n\tPsyche (2022, flyby in 2023)\n\tJupiter Icy Moons Explorer (JUICE) (2022, flyby in 2025)\n\tTera-hertz Explorer (TEREX) (2022 lander, 2024 orbiter)\n\tMartian Moons Exploration (MMX) (2024)\n\n\n\n\n\tProposed\t\n\tBiological Oxidant and Life Detection (BOLD)\n\tSpaceX base\n\tDePhine\n\tIcebreaker Life\n\tMars Geyser Hopper\n\tMars-Grunt\n\tMars Micro Orbiter‎\n\tMELOS rover\n\tMetNet\n\tNext Mars Orbiter (NeMO)\n\tPADME\n\tPhootprint\n\tSky-Sailor\n\n\n\n\n\n\n\n\tCancelled proposals\t\n\tAerial Regional-scale Environmental Survey (ARES)\n\tAstrobiology Field Laboratory\n\tBeagle 3\n\tMars 4NM & 5NM\n\tMars 5M (Mars-79)\n\tMars-Aster\n\tMars Astrobiology Explorer-Cacher (MAX-C)\n\tMars One\n\tMars Surveyor Lander\n\tMars Telecommunications Orbiter\n\tNetLander\n\tNorthern Light\n\tRed Dragon\n\tSample Collection for Investigation of Mars (SCIM)\n\tVesta\n\tVoyager Mars\n\n\n\n\n\tExploration of Mars\t\n\tConcepts\t\n\tFlyby\n\tOrbiter\n\tLanding\n\tRover\n\tSample return\n\tHuman mission\n\tPermanent settlement\n\tColonization\n\tTerraforming\n\n\n\n\n\tStrategies\t\n\tMars Scout Program\n\tMars Exploration Program\n\tMars Exploration Joint Initiative\n\tMars Next Generation\n\n\n\n\n\tAdvocacy\t\n\tThe Mars Project\n\tThe Case for Mars\n\tInspiration Mars\n\tMars Institute\n\tMars Society\n\tMars race\n\n\n\n\n\n\n\n\tLists\t\n\tList of missions to Mars\n\tList of Mars orbiters\n\tList of artificial objects on Mars\n\n\n\n\n\tMissions are ordered by launch date. Sign † indicates failure en route or before intended mission data returned.\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n21st-century space probes\n\n\tActive space probes\n(deep space missions)\t\n\tMoon\t\n\tARTEMIS\n\tChandrayaan-2\n\tChang'e 3\n\tChang'e 4 (Yutu-2)\n\tLunar Reconnaissance Orbiter\n\n\n\n\n\tMars\t\n\tExoMars TGO\n\tInSight\n\tMars Orbiter Mission\n\tMars Express\n\t2001 Mars Odyssey\n\tMAVEN\n\tMRO\n\tMSL Curiosity\n\n\n\n\n\tVenus\t\n\tAkatsuki\n\n\n\n\n\tMinor planet\t\n\tChang'e 2\n\tHayabusa2 / MINERVA-II\n\tNew Horizons\n\tOSIRIS-REx\n\n\n\n\n\tSolar science\t\n\tACE\n\tDSCOVR\n\tParker Solar Probe\n\tSOHO\n\tSTEREO\n\tWind\n\n\n\n\n\tOthers\t\n\tBepiColombo\n\tGaia\n\tJuno\n\tTHEMIS\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\n\n\n\tCompleted after 2000\n(by termination date)\t\n\t2000s\t\n\t2001\n\tNEAR Shoemaker\n\tDeep Space 1\n\n\n\t2003\n\tPioneer 10\n\tGalileo\n\tNozomi\n\n\n\t2004\n\tGenesis\n\n\n\t2005\n\tHuygens\n\n\n\t2006\n\tMars Global Surveyor\n\n\n\t2008\n\tPhoenix\n\n\n\t2009\n\tChang'e 1\n\tUlysses\n\tChandrayaan-1\n\tSELENE\n\tLCROSS\n\n\n\n\n\n\n\t2010s\t\n\t2010\n\tHayabusa\n\tMER Spirit\n\n\n\t2011\n\tStardust\n\n\n\t2012\n\tGRAIL\n\n\n\t2013\n\tDeep Impact\n\n\n\t2014\n\tLADEE\n\tVenus Express\n\tChang'e 5-T1\n\n\n\t2015\n\tMESSENGER\n\tPROCYON\n\tIKAROS\n\n\n\t2016\n\tRosetta / Philae\n\tYutu\n\tExoMars Schiaparelli\n\n\n\t2017\n\tLISA Pathfinder\n\tCassini\n\n\n\t2018\n\tMASCOT\n\tDawn\n\tLongjiang-1\n\n\n\t2019\n\tMarCO\n\tMER Opportunity\n\tBeresheet\n\tLongjiang-2\n\tVikram / Pragyan\n\n\n\n\n\n\n\n\n\n\t\n\tList of Solar System probes\n\tList of lunar probes\n\tList of space telescopes\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNASA\n\n\tPolicy and history\t\n\tHistory\t\n\tNACA (1915)\n\tNational Aeronautics and Space Act (1958)\n\tSpace Task Group (1958)\n\tPaine (1986)\n\tRogers (1986)\n\tRide (1987)\n\tSpace Exploration Initiative (1989)\n\tAugustine (1990)\n\tU.S. National Space Policy (1996)\n\tCFUSAI (2002)\n\tCAIB (2003)\n\tVision for Space Exploration (2004)\n\tAldridge (2004)\n\tAugustine (2009)\n\n\n\n\n\tGeneral\t\n\tSpace Race\n\tAdministrator and Deputy Administrator\n\tChief Scientist\n\tAstronaut Corps\n\tRanks and positions\n\tChief\n\n\n\tBudget\n\tSpin-off technologies\n\tNASA TV\n\tNASA Social\n\tLaunch Services Program\n\tMercury Control Center\n\tKennedy Space Center\n\tVehicle Assembly Building\n\tLaunch Complex 39\n\tLaunch Control Center\n\tOperations and Checkout Building\n\n\n\tJohnson Space Center\n\tMission Control\n\tLunar Sample Laboratory\n\n\n\n\n\n\n\n\n\t\n\n\tRobotic programs\t\n\tPast\t\n\tHitchhiker\n\tMariner\n\tMariner Mark II\n\tMESUR\n\tMars Surveyor '98\n\tNew Millennium\n\tLunar Orbiter\n\tPioneer\n\tPlanetary Observer\n\tRanger\n\tSurveyor\n\tViking\n\tProject Prometheus\n\tMars Scout\n\tMars Exploration Rover\n\n\n\n\n\tCurrent\t\n\tLiving With a Star\n\tLunar Precursor Robotic Program\n\tEarth Observing System\n\tGreat Observatories program\n\tExplorer\n\tSmall explorer\n\tVoyager\n\tDiscovery\n\tNew Frontiers\n\tSolar Terrestrial Probes\n\tCommercial Lunar Payload Services\n\n\n\n\n\n\n\n\tHuman spaceflight\nprograms\t\n\tPast\t\n\tX-15 (suborbital)\n\tMercury\n\tGemini\n\tApollo\n\tApollo–Soyuz Test Project (with the Soviet space program)\n\tSkylab\n\tSpace Shuttle\n\tShuttle–Mir (with Roscosmos State Corporation)\n\tConstellation\n\n\n\n\n\tCurrent\t\n\tInternational Space Station\n\tCommercial Orbital Transportation Services\n\tCommercial Crew Development\n\tOrion\n\tArtemis\n\tLunar Gateway\n\n\n\n\n\n\n\n\tIndividual featured\n missions\n(human and robotic)\t\n\tPast\t\n\tCOBE\n\tMercury 3\n\tMercury-Atlas 6\n\tMagellan\n\tPioneer 10\n\tPioneer 11\n\tGalileo\n\tGALEX\n\tGRAIL\n\tWMAP\n\tSpace Shuttle\n\tSojourner rover\n\tSpirit rover\n\tLADEE\n\tMESSENGER\n\tAquarius\n\tCassini\n\tDawn\n\tKepler space telescope\n\tOpportunity rover\n\tRHESSI\n\tobserved\n\n\n\n\n\n\n\tCurrently\noperating\t\n\tMars Reconnaissance Orbiter\n\t2001 Mars Odyssey\n\tNew Horizons\n\tInternational Space Station\n\tHubble Space Telescope\n\tSpitzer\n\tSwift\n\tTHEMIS\n\tMars Exploration Rover\n\tCuriosity rover\n\ttimeline\n\n\n\tInSight\n\tGOES 14\n\tLunar Reconnaissance Orbiter\n\tGOES 15\n\tVan Allen Probes\n\tSolar Dynamics Observatory\n\tJuno\n\tMars Science Laboratory\n\ttimeline\n\n\n\tNuSTAR\n\tVoyager 1\n\tVoyager 2\n\tWISE\n\tMAVEN\n\tMMS\n\tOSIRIS-REx\n\tTransiting Exoplanet Survey Satellite\n\n\n\n\n\tFuture\t\n\tJoint Polar Satellite System\n\tJames Webb Space Telescope\n\tWide Field Infrared Survey Telescope\n\tMars 2020\n\tNISAR\n\tEuropa Clipper\n\n\n\n\n\n\n\n\tCommunications\nand navigation\t\n\tNear Earth Network\n\tSpace Network\n\tDeep Space Network (Goldstone\n\tMadrid\n\tCanberra\n\tSpace Flight Operations Facility)\n\tDeep Space Atomic Clock\n\n\n\n\n\tNASA lists\t\n\tAstronauts\n\tby name\n\tby year\n\tGemini astronauts\n\tApollo astronauts\n\n\n\tList of NASA aircraft\n\tList of NASA missions\n\tuncrewed missions\n\n\n\tList of NASA contractors\n\tList of United States rockets\n\tList of NASA cancellations\n\tList of Space Shuttle missions\n\tcrews\n\n\n\tList of NASA cameras on spacecraft\n\n\n\n\n\tNASA images\nand artwork\t\n\tEarthrise\n\tThe Blue Marble\n\tFamily Portrait\n\tPale Blue Dot\n\n\n\tPillars of Creation\n\tMystic Mountain\n\tSolar System Family Portrait\n\tThe Day the Earth Smiled\n\tFallen Astronaut\n\tLunar plaques\n\tPioneer plaques\n\tVoyager Golden Record\n\tApollo 11 goodwill messages\n\tNASA insignia\n\tGemini and Apollo medallions\n\tMission patches\n\n\n\n\n\tRelated\t\n\tApollo 15 postal covers incident\n\tSpace Mirror Memorial\n\tThe Astronaut Monument\n\tU.S. Astronaut Hall of Fame\n\tSpace program on U.S. stamps\n\tApollo 17 Moon mice\n\tOther primates in space\n\tNASA spinoff technologies\n\n\n\n\n\t\n\t Category\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nJet Propulsion Laboratory\n\n\tCurrent missions\t\n\tACRIMSAT\n\tASTER\n\tAtmospheric infrared sounder (AIRS)\n\tDeep Space Atomic Clock\n\tGRACE-FO\n\tInSight\n\tJuno\n\tKeck observatory\n\tLarge Binocular Telescope (LBT)\n\tMars Odyssey\n\tMars Reconnaissance Orbiter (MRO)\n\tMars Science Laboratory (MSL)\n\tMicrowave limb sounder (MLS)\n\tMulti-angle imaging spectroradiometer (MISR)\n\tSpitzer Space Telescope\n\tTropospheric Emission Spectrometer (TES)\n\tVoyager program\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\n\n\tPlanned\t\n\tMars 2020 rover\n\tPsyche\n\tEuclid\n\tEuropa Clipper\n\tLunar Flashlight\n\tNEA Scout\n\tSPHEREx\n\tSWOT\n\tWFIRST\n\n\n\n\n\tProposed\t\n\tEuropa Lander\n\tFINESSE\n\n\n\n\n\tPast\t\n\tCassini-Huygens\n\tDawn\n\tDeep Impact\n\tDeep Space 1\n\tDeep Space 2\n\tExplorers\n\tGALEX\n\tGalileo\n\tGenesis\n\tGRACE\n\tHerschel\n\tIRAS\n\tJason-1\n\tKepler\n\tMagellan\n\tMariner\n\tMars Climate Orbiter\n\tMars Cube One (MarCO)\n\tMars Observer\n\tMars Pathfinder\n\tMars Polar Lander\n\tMars Global Surveyor\n\tMars Exploration Rover (MER)\n\tNSCAT\n\tPhoenix\n\tPioneer\n\tQuikSCAT\n\tRanger\n\tRosetta\n\tSeasat\n\tShuttle Radar Topography Mission (SRTM)\n\tSolar Mesosphere Explorer (SME)\n\tSpaceborne Imaging Radar (SIR)\n\tStardust\n\tSurveyor\n\tSVLBI\n\tTOPEX/Poseidon\n\tUlysses\n\tViking\n\tWide Field and Planetary Camera (WFPC)\n\tWide Field Infrared Explorer (WIRE)\n\n\n\n\n\tCancelled missions\t\n\tAstrobiology Field Laboratory (AFL)\n\tMars Astrobiology Explorer-Cacher (MAX-C)\n\n\n\n\n\tRelated organizations\t\n\tNASA\n\tCaltech\n\tNASA Deep Space Network\n\tGoldstone Complex\n\tTable Mountain Observatory\n\tSolar System Ambassadors\n\n\n\n\n\t\n\tJet Propulsion Laboratory Science Division\n\tNear-Earth Asteroid Tracking\n\tSpace Flight Operations Facility\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n← 2000  ·  Orbital launches in 2001  ·  2002 →\n\n\tShenzhou 2 | Türksat 2A | Progress M1-5 | USA-156 | Sicral 1 ·  Skynet 4F | STS-98 (Destiny) | Odin | Progress M-44 | USA-157 | STS-102 (Leonardo MPLM) | Eurobird 1 ·  BSAT-2a | XM-2 | Ekran-M No.18L | 2001 Mars Odyssey | GSAT-1 | STS-100 (Raffaello MPLM) | Soyuz TM-32 | XM-1 | PAS-10 | USA-158 | Progress M1-6 | Kosmos 2377 | Kosmos 2378 | Intelsat 901 | Astra 2C | ICO F2 | MAP | STS-104 (Quest) | Artemis ·  BSAT-2b | Molniya-3K No.11 | GOES 12 | Koronas-F | USA-159 | Genesis | STS-105 (Leonardo MPLM ·  Simplesat) | Progress M-45 | Kosmos 2379 | VEP-2 ·  LRE | Intelsat 902 | USA-160 | Progress M-SO1 (Pirs) | OrbView-4 ·  QuickTOMS ·  SBD ·  Odyssey | Atlantic Bird 2 | Starshine 3 ·  PICOSat ·  PCSat ·  SAPPHIRE | USA-161 | Globus No.14L | USA-162 | QuickBird-2 | Soyuz TM-33 | TES ·  PROBA ·  BIRD | Molniya-3 No.64 | Progress M1-7 (Kolibri 2000) | DirecTV-4S | Kosmos 2380 ·  Kosmos 2381 ·  Kosmos 2382 | STS-108 (Raffaello MPLM ·  Starshine 2 | Jason-1 ·  TIMED | Meteor-3M #1 ·  Kompass ·  Badr-B ·  Maroc-Tubsat ·  Reflektor | Kosmos 2383 | Kosmos 2384 ·  Kosmos 2385 ·  Kosmos 2386 ·  Gonets-D1 No.10 ·  Gonets-D1 No.11 ·  Gonets-D1 No.12\n\n\tPayloads are separated by bullets ( · ), launches by pipes ( | ). Manned flights are indicated in bold text. Uncatalogued launch failures are listed in italics. Payloads deployed from other spacecraft are denoted in brackets.\n\n\n\n\n\tSolar System portal\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=2001_Mars_Odyssey&oldid=914787675\"\n\n\t\t\n\t\tCategories: \t2001 Mars Odyssey\n\tArtificial satellites orbiting Mars\n\tMissions to Mars\n\tNASA space probes\n\tSpace probes launched in 2001\n\tSpacecraft launched by Delta II rockets\n\tGeography of Mars\n\n\nHidden categories: \tCS1 maint: uses authors parameter\n\tAll articles with dead external links\n\tArticles with dead external links from August 2019\n\tArticles with permanently dead external links\n\tArticles needing additional references from April 2017\n\tAll articles needing additional references\n\tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tБългарски\n\tBosanski\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tMagyar\n\tमराठी\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tPolski\n\tPortuguês\n\tРусский\n\tSlovenčina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 9 September 2019, at 11:08 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "15", "dc:title": "2001 Mars Odyssey - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Mars_Odyssey_spacecraft_model.png/1200px-Mars_Odyssey_spacecraft_model.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-2001_mars_odyssey", "title": "2001 Mars Odyssey - Wikipedia"}}