{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOhm's law - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\n\n\tOhm's law\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about the law related to electricity. For other uses, see Ohm's acoustic law.\n\n\n\n\n  \nV, I, and R, the parameters of Ohm's law\n\n\n\n\tPart of a series of articles about\n\tElectromagnetism\n\t\n\t\n\tElectricity\n\tMagnetism\n\n\n\t\nElectrostatics\n\n\tConductor\n\tCoulomb's law\n\tElectric charge\n\tElectric dipole moment\n\tElectric field\n\tElectric flux / potential energy\n\tElectrostatic discharge\n\tGauss's law\n\tInduction\n\tInsulator\n\tPolarization density\n\tStatic electricity\n\tTriboelectricity\n\n\n\n\n\t\nMagnetostatics\n\n\tAmpère's law\n\tBiot–Savart law\n\tGauss's law for magnetism\n\tMagnetic field\n\tMagnetic flux\n\tMagnetic dipole moment\n\tMagnetization\n\tMagnetomotive force\n\n\n\n\n\t\nElectrodynamics\n\n\tLorentz force law\n\tElectromagnetic induction\n\tFaraday's law\n\tLenz's law\n\tDisplacement current\n\tMagnetic potential\n\tMaxwell's equations\n\tElectromagnetic field\n\tElectromagnetic pulse\n\tElectromagnetic radiation\n\tMaxwell tensor\n\tPoynting vector\n\tLiénard–Wiechert potential\n\tJefimenko's equations\n\tEddy current\n\tLondon equations\n\n\n\tMathematical descriptions of the electromagnetic field\n\n\n\n\n\n\t\nElectrical network\n\n\tAlternating current\n\tCapacitance\n\tDirect current\n\tElectric current\n\tElectric potential\n\tElectromotive force\n\tImpedance\n\tInductance\n\tOhm's law\n\tParallel circuit\n\tResistance\n\tResonant cavities\n\tSeries circuit\n\tVoltage\n\tWaveguides\n\n\n\n\n\t\nCovariant formulation\n\n\tElectromagnetic tensor\n(stress–energy tensor)\n\n\n\n\tFour-current\n\tElectromagnetic four-potential\n\n\n\n\n\t\nScientists\n\n\tAmpère\n\tBiot\n\tCoulomb\n\tFaraday\n\tGauss\n\tHeaviside\n\tHenry\n\tHertz\n\tLenz\n\tLorentz\n\tMaxwell\n\tØrsted\n\tSavart\n\tTesla\n\tVolta\n\tWeber\n\t\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nOhm's law states that the current through a conductor between two points is directly proportional to the voltage across the two points. Introducing the constant of proportionality, the resistance,[1] one arrives at the usual mathematical equation that describes this relationship:[2]\n\n\n\t\n  \n    \n      \n        I\n        =\n        \n          \n            V\n            R\n          \n        \n        ,\n      \n    \n    {\\displaystyle I={\\frac {V}{R}},}\n  \n\n\n\nwhere I is the current through the conductor in units of amperes, V is the voltage measured across the conductor in units of volts,  and R is the resistance of the conductor in units of ohms.  More specifically, Ohm's law states that the R in this relation is constant, independent of the current.[3]  Ohm's law is an empirical relation which accurately describes the conductivity of the vast majority of electrically conductive materials over many orders of magnitude of current.  However some materials do not obey Ohm's law, these are called non-ohmic.\n\nThe law was named after the German physicist Georg Ohm, who, in a treatise published in 1827, described measurements of applied voltage and current through simple electrical circuits containing various lengths of wire. Ohm explained his experimental results by a slightly more complex equation than the modern form above (see History).\n\nIn physics, the term Ohm's law is also used to refer to various generalizations of the law; for example the vector form of the law used in electromagnetics and material science:\n\n\n\t\n  \n    \n      \n        \n          J\n        \n        =\n        σ\n        \n          E\n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {J} =\\sigma \\mathbf {E} ,}\n  \n\n\n\nwhere J is the current density at a given location in a resistive material, E is the electric field at that location, and σ (sigma) is a material-dependent parameter called the conductivity.  This reformulation of Ohm's law is due to Gustav Kirchhoff.[4]\n\n\nContents\n\n\n\t1 History\n\t2 Scope\n\t3 Microscopic origins\n\t4 Hydraulic analogy\n\t5 Circuit analysis\n\t5.1 Resistive circuits\n\t5.2 Reactive circuits with time-varying signals\n\t5.3 Linear approximations\n\n\n\n\t6 Temperature effects\n\t7 Relation to heat conductions\n\t8 Other versions\n\t8.1 Magnetic effects\n\t8.2 Conductive fluids\n\n\n\n\t9 See also\n\t10 References\n\t11 External links and further reading\n\n\n\n\n\nHistory\n\n  \nGeorg Ohm\n\n\n\nIn January 1781, before Georg Ohm's work, Henry Cavendish experimented with Leyden jars and glass tubes of varying diameter and length filled with salt solution.  He measured the current by noting how strong a shock he felt as he completed the circuit with his body.  Cavendish wrote that the \"velocity\" (current) varied directly as the \"degree of electrification\" (voltage). He did not communicate his results to other scientists at the time,[5] and his results were unknown until Maxwell published them in 1879.[6]\n\nFrancis Ronalds delineated “intensity” (voltage) and “quantity” (current) for the dry pile – a high voltage source – in 1814 using a gold-leaf electrometer.  He found for a dry pile that the relationship between the two parameters was not proportional under certain meteorological conditions.[7][8]\n\nOhm did his work on resistance in the years 1825 and 1826, and published his results in 1827 as the book Die galvanische Kette, mathematisch bearbeitet (\"The galvanic circuit investigated mathematically\").[9] He drew considerable inspiration from Fourier's work on heat conduction in the theoretical explanation of his work.  For experiments, he initially used voltaic piles, but later used a thermocouple as this provided a more stable voltage source in terms of internal resistance and constant voltage.  He used a galvanometer to measure current, and knew that the voltage between the thermocouple terminals was proportional to the junction temperature.  He then added test wires of varying length, diameter, and material to complete the circuit.  He found that his data could be modeled through the equation\n\n\n\t\n  \n    \n      \n        x\n        =\n        \n          \n            a\n            \n              b\n              +\n              l\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle x={\\frac {a}{b+l}},}\n  \n\n\n\nwhere x was the reading from the galvanometer, l was the length of the test conductor, a depended on the thermocouple junction temperature, and b was a constant of the entire setup.  From this, Ohm determined his law of proportionality and published his results.\n\n\n  \nInternal resistance model\n\n\n\nIn modern notation we would write,\n\n\n\t\n  \n    \n      \n        I\n        =\n        \n          \n            \n              E\n            \n            \n              r\n              +\n              R\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle I={\\frac {\\mathcal {E}}{r+R}},}\n  \n\n\n\nwhere \n  \n    \n      \n        \n          \n            E\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {E}}}\n  \n is the open-circuit emf of the thermocouple, \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n  \n is the internal resistance of the thermocouple and \n  \n    \n      \n        R\n      \n    \n    {\\displaystyle R}\n  \n is the resistance of the test wire.  In terms of the length of the wire this becomes,\n\n\n\t\n  \n    \n      \n        I\n        =\n        \n          \n            \n              E\n            \n            \n              r\n              +\n              \n                \n                  R\n                \n              \n              l\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle I={\\frac {\\mathcal {E}}{r+{\\mathcal {R}}l}},}\n  \n\n\n\nwhere \n  \n    \n      \n        \n          \n            R\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {R}}}\n  \n is the resistance of the test wire per unit length.  Thus, Ohm's coefficients are,\n\n\n\t\n  \n    \n      \n        a\n        =\n        \n          \n            \n              E\n            \n            \n              R\n            \n          \n        \n        ,\n        \n        b\n        =\n        \n          \n            \n              r\n            \n            \n              R\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle a={\\frac {\\mathcal {E}}{\\mathcal {R}}},\\quad b={\\frac {\\mathcal {r}}{\\mathcal {R}}}.}\n  \n\n\n\n  \nOhm's law in Georg Ohm's lab book.\n\n\n\nOhm's law was probably the most important of the early quantitative descriptions of the physics of electricity.  We consider it almost obvious today. When Ohm first published his work, this was not the case; critics reacted to his treatment of the subject with hostility.  They called his work a \"web of naked fancies\"[10] and the German Minister of Education proclaimed that \"a professor who preached such heresies was unworthy to teach science.\"[11] The prevailing scientific philosophy in Germany at the time asserted that experiments need not be performed to develop an understanding of nature because nature is so well ordered, and that scientific truths may be deduced through reasoning alone.[12]  Also, Ohm's brother Martin, a mathematician, was battling the German educational system. These factors hindered the acceptance of Ohm's work, and his work did not become widely accepted until the 1840s.  However, Ohm received recognition for his contributions to science well before he died.\n\nIn the 1850s, Ohm's law was known as such and was widely considered proved, and alternatives, such as \"Barlow's law\", were discredited, in terms of real applications to telegraph system design, as discussed by Samuel F. B. Morse in 1855.[13]\n\nThe electron was discovered in 1897 by J. J. Thomson, and it was quickly realized that it is the particle (charge carrier) that carries electric currents in electric circuits.  In 1900 the first (classical) model of electrical conduction, the Drude model, was proposed by Paul Drude, which finally gave a scientific explanation for Ohm's law.  In this model, a solid conductor consists of a stationary lattice of atoms (ions), with conduction electrons moving randomly in it.  A voltage across a conductor causes an electric field, which accelerates the electrons in the direction of the electric field, causing a drift of electrons which is the electric current.  However the electrons collide with and scatter off of the atoms, which randomizes their motion, thus converting the kinetic energy added to the electron by the field to heat (thermal energy).  Using statistical distributions, it can be shown that the average drift velocity of the electrons, and thus the current, is proportional to the electric field, and thus the voltage, over a wide range of voltages.\n\nThe development of quantum mechanics in the 1920s modified this picture somewhat, but in modern theories the average drift velocity of electrons can still be shown to be proportional to the electric field, thus deriving Ohm's law. In 1927 Arnold Sommerfeld applied the quantum Fermi-Dirac distribution of electron energies to the Drude model, resulting in the free electron model. A year later, Felix Bloch showed that electrons move in waves (Bloch waves) through a solid crystal lattice, so scattering off the lattice atoms as postulated in the Drude model is not a major process; the electrons scatter off impurity atoms and defects in the material. The final successor, the modern quantum band theory of solids, showed that the electrons in a solid cannot take on any energy as assumed in the Drude model but are restricted to energy bands, with gaps between them of energies that electrons are forbidden to have.   The size of the band gap is a characteristic of a particular substance which has a great deal to do with its electrical resistivity, explaining why some substances are electrical conductors, some semiconductors, and some insulators.\n\nWhile the old term for electrical conductance, the mho (the inverse of the resistance unit ohm), is still used, a new name, the siemens, was adopted in 1971, honoring Ernst Werner von Siemens.  The siemens is preferred in formal papers.\n\nIn the 1920s, it was discovered that the current through a practical resistor actually has statistical fluctuations, which depend on temperature, even when voltage and resistance are exactly constant; this fluctuation, now known as Johnson–Nyquist noise, is due to the discrete nature of charge.  This thermal effect implies that measurements of current and voltage that are taken over sufficiently short periods of time will yield ratios of V/I that fluctuate from the value of R implied by the time average or ensemble average of the measured current; Ohm's law remains correct for the average current, in the case of ordinary resistive materials.\n\nOhm's work long preceded Maxwell's equations and any understanding of frequency-dependent effects in AC circuits. Modern developments in electromagnetic theory and circuit theory do not contradict Ohm's law when they are evaluated within the appropriate limits.\n\n\nScope\n\nOhm's law is an empirical law, a generalization from many experiments that have shown that current is approximately proportional to electric field for most materials. It is less fundamental than Maxwell's equations and is not always obeyed. Any given material will break down under a strong-enough electric field, and some materials of interest in electrical engineering are \"non-ohmic\" under weak fields.[14][15]\n\nOhm's law has been observed on a wide range of length scales. In the early 20th century, it was thought that Ohm's law would fail at the atomic scale, but experiments have not borne out this expectation. As of 2012, researchers have demonstrated that Ohm's law works for silicon wires as small as four atoms wide and one atom high.[16]\n\n\nMicroscopic origins\n\n  \nDrude Model electrons (shown here in blue) constantly bounce among heavier, stationary crystal ions (shown in red).\n\n\n\nMain article: Drude model\n\nThe dependence of the current density on the applied electric field is essentially quantum mechanical in nature;  (see Classical and quantum conductivity.)  A qualitative description leading to Ohm's law can be based upon classical mechanics using the Drude model developed by Paul Drude in 1900.[17][18]\n\nThe Drude model treats electrons (or other charge carriers) like pinballs bouncing among the ions that make up the structure of the material.  Electrons will be accelerated in the opposite direction to the electric field by the average electric field at their location. With each collision, though, the electron is deflected in a random direction with a velocity that is much larger than the velocity gained by the electric field.  The net result is that electrons take a zigzag path due to the collisions, but generally drift in a direction opposing the electric field.\n\nThe drift velocity then determines the electric current density and its relationship to E and is independent of the collisions.  Drude calculated the average drift velocity from p = −eEτ where p is the average momentum, −e is the charge of the electron and τ is the average time between the collisions.   Since both the momentum and the current density are proportional to the drift velocity, the current density becomes proportional to the applied electric field; this leads to Ohm's law.\n\n\nHydraulic analogy\n\nA hydraulic analogy is sometimes used to describe Ohm's law.  Water pressure, measured by pascals (or PSI), is the analog of voltage because establishing a water pressure difference between two points along a (horizontal) pipe causes water to flow.  Water flow rate, as in liters per second, is the analog of current, as in coulombs per second. Finally, flow restrictors—such as apertures placed in pipes between points where the water pressure is measured—are the analog of resistors. We say that the rate of water flow through an aperture restrictor is proportional to the difference in water pressure across the restrictor. Similarly, the rate of flow of electrical charge, that is, the electric current, through an electrical resistor is proportional to the difference in voltage measured across the resistor.\n\nFlow and pressure variables can be calculated in fluid flow network with the use of the hydraulic ohm analogy.[19][20]  The method can be applied to both steady and transient flow situations.  In the linear laminar flow region, Poiseuille's law describes the hydraulic resistance of a pipe, but in the turbulent flow region the pressure–flow relations become nonlinear.\n\nThe hydraulic analogy to Ohm's law has been used, for example, to approximate blood flow through the circulatory system.[21]\n\n\nCircuit analysis\n\n  \nOhm's law triangle\n\n\n\n  \nOhm’s law wheel with international unit symbols\n\n\n\nIn circuit analysis, three equivalent expressions of Ohm's law are used interchangeably:\n\n\n\t\n  \n    \n      \n        I\n        =\n        \n          \n            V\n            R\n          \n        \n        \n        \n          or\n        \n        \n        V\n        =\n        I\n        R\n        \n        \n          or\n        \n        \n        R\n        =\n        \n          \n            V\n            I\n          \n        \n        .\n      \n    \n    {\\displaystyle I={\\frac {V}{R}}\\quad {\\text{or}}\\quad V=IR\\quad {\\text{or}}\\quad R={\\frac {V}{I}}.}\n  \n\n\n\nEach equation is quoted by some sources as the defining relationship of Ohm's law,[2][22][23]\nor all three are quoted,[24] or derived from a proportional form,[25]\nor even just the two that do not correspond to Ohm's original statement may sometimes be given.[26][27]\n\nThe interchangeability of the equation may be represented by a triangle, where V (voltage) is placed on the top section, the I (current) is placed to the left section, and the R (resistance) is placed to the right. The line that divides the left and right sections indicates multiplication, and the divider between the top and bottom sections indicates division (hence the division bar).\n\n\n\n\nResistive circuits\n\nResistors are circuit elements that impede the passage of electric charge in agreement with Ohm's law, and are designed to have a specific resistance value R.  In a schematic diagram the resistor is shown as a zig-zag symbol.  An element (resistor or conductor) that behaves according to Ohm's law over some operating range is referred to as an ohmic device (or an ohmic resistor) because Ohm's law and a single value for the resistance suffice to describe the behavior of the device over that range.\n\nOhm's law holds for circuits containing only resistive elements (no capacitances or inductances) for all forms of driving voltage or current, regardless of whether the driving voltage or current is constant (DC) or time-varying such as AC.  At any instant of time Ohm's law is valid for such circuits.\n\nResistors which are in series or in parallel may be grouped together into a single \"equivalent resistance\" in order to apply Ohm's law in analyzing the circuit.\n\n\nReactive circuits with time-varying signals\n\nWhen reactive elements such as capacitors, inductors, or transmission lines are involved in a circuit to which AC or time-varying voltage or current is applied, the relationship between voltage and current becomes the solution to a differential equation, so Ohm's law (as defined above) does not directly apply since that form contains only resistances having value R, not complex impedances which may contain capacitance (\"C\") or inductance (\"L\").\n\nEquations for time-invariant AC circuits take the same form as Ohm's law. However, the variables are generalized to complex numbers and the current and voltage waveforms are complex exponentials.[28]\n\nIn this approach, a voltage or current waveform takes the form \n  \n    \n      \n        A\n        \n          e\n          \n            s\n            t\n          \n        \n      \n    \n    {\\displaystyle Ae^{st}}\n  \n, where t is time, s is a complex parameter, and A is a complex scalar.  In any linear time-invariant system, all of the currents and voltages can be expressed with the same s parameter as the input to the system, allowing the time-varying complex exponential term to be canceled out and the system described algebraically in terms of the complex scalars in the current and voltage waveforms.\n\nThe complex generalization of resistance is impedance, usually denoted Z; it can be shown that for an inductor,\n\n\n\t\n  \n    \n      \n        Z\n        =\n        s\n        L\n        \n      \n    \n    {\\displaystyle Z=sL\\,}\n  \n\n\n\nand for a capacitor,\n\n\n\t\n  \n    \n      \n        Z\n        =\n        \n          \n            1\n            \n              s\n              C\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle Z={\\frac {1}{sC}}.}\n  \n\n\n\nWe can now write,\n\n\n\t\n  \n    \n      \n        \n          V\n        \n        =\n        \n          I\n        \n        ⋅\n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\boldsymbol {V}}={\\boldsymbol {I}}\\cdot {\\boldsymbol {Z}}}\n  \n\n\n\nwhere V and I are the complex scalars in the voltage and current respectively and Z is the complex impedance.\n\nThis form of Ohm's law, with Z taking the place of R, generalizes the simpler form.  When Z is complex, only the real part is responsible for dissipating heat.\n\nIn the general AC circuit, Z varies strongly with the frequency parameter s, and so also will the relationship between voltage and current.\n\nFor the common case of a steady sinusoid, the s parameter is taken to be \n  \n    \n      \n        j\n        ω\n      \n    \n    {\\displaystyle j\\omega }\n  \n, corresponding to a complex sinusoid \n  \n    \n      \n        A\n        \n          e\n          \n            \n              \n                 \n              \n            \n            j\n            ω\n            t\n          \n        \n      \n    \n    {\\displaystyle Ae^{{\\mbox{ }}j\\omega t}}\n  \n.  The real parts of such complex current and voltage waveforms describe the actual sinusoidal currents and voltages in a circuit, which can be in different phases due to the different complex scalars.\n\n\nLinear approximations\n\nSee also: Small-signal modeling and Network analysis (electrical circuits) § Small signal equivalent circuit\n\nOhm's law is one of the basic equations used in the analysis of electrical circuits.  It applies to both metal conductors and circuit components (resistors) specifically made for this behaviour.  Both are ubiquitous in electrical engineering.  Materials and components that obey Ohm's law are described as \"ohmic\" [29] which means they produce the same value for resistance (R = V/I) regardless of the value of V or I which is applied and whether the applied voltage or current is DC (direct current) of either positive or negative polarity or AC (alternating current).\n\nIn a true ohmic device, the same value of resistance will be calculated from R = V/I regardless of the value of the applied voltage V.  That is, the ratio of V/I is constant, and when current is plotted as a function of voltage the curve is linear (a straight line).  If voltage is forced to some value V, then that voltage V divided by measured current I will equal R.  Or if the current is forced to some value I, then the measured voltage V divided by that current I is also R.  Since the plot of I versus V is a straight line, then it is also true that for any set of two different voltages V1 and V2 applied across a given device of resistance R, producing currents I1 = V1/R and I2 = V2/R, that the ratio (V1−V2)/(I1−I2) is also a constant equal to R.  The operator \"delta\" (Δ) is used to represent a difference in a quantity, so we can write ΔV = V1−V2 and ΔI = I1−I2.  Summarizing, for any truly ohmic device having resistance R, V/I = ΔV/ΔI = R for any applied voltage or current or for the difference between any set of applied voltages or currents.\n\n\n  \nThe I–V curves of four devices: Two resistors, a diode, and a battery. The two resistors follow Ohm's law: The plot is a straight line through the origin. The other two devices do not follow Ohm's law.\n\n\n\nThere are, however, components of electrical circuits which do not obey Ohm's law; that is, their relationship between current and voltage (their I–V curve) is nonlinear (or non-ohmic).  An example is the p-n junction diode (curve at right).  As seen in the figure, the current does not increase linearly with applied voltage for a diode.  One can determine a value of current (I) for a given value of applied voltage (V) from the curve, but not from Ohm's law, since the value of \"resistance\" is not constant as a function of applied voltage.  Further, the current only increases significantly if the applied voltage is positive, not negative.  The ratio V/I for some point along the nonlinear curve is sometimes called the static, or chordal, or DC, resistance,[30][31] but as seen in the figure the value of total V over total I varies depending on the particular point along the nonlinear curve which is chosen.  This means the \"DC resistance\" V/I at some point on the curve is not the same as what would be determined by applying an AC signal having peak amplitude ΔV volts or ΔI amps centered at that same point along the curve and measuring ΔV/ΔI. However, in some diode applications, the AC signal applied to the device is small and it is possible to analyze the circuit in terms of the dynamic, small-signal, or incremental resistance, defined as the one over the slope of the V–I curve at the average value (DC operating point) of the voltage (that is, one over the derivative of current with respect to voltage).  For sufficiently small signals, the dynamic resistance allows the Ohm's law small signal resistance to be calculated as approximately one over the slope of a line drawn tangentially to the V-I curve at the DC operating point.[32]\n\n\nTemperature effects\n\nOhm's law has sometimes been stated as, \"for a conductor in a given state, the electromotive force is proportional to the current produced.\"  That is, that the resistance, the ratio of the applied electromotive force (or voltage) to the current, \"does not vary with the current strength .\"  The qualifier \"in a given state\" is usually interpreted as meaning \"at a constant temperature,\" since the resistivity of materials is usually temperature dependent. Because the conduction of current is related to Joule heating of the conducting body, according to Joule's first law, the temperature of a conducting body may change when it carries a current.  The dependence of resistance on temperature therefore makes resistance depend upon the current in a typical experimental setup, making the law in this form difficult to directly verify.  Maxwell and others worked out several methods to test the law experimentally in 1876, controlling for heating effects.[33]\n\n\nRelation to heat conductions\n\nSee also: Conduction (heat)\n\nOhm's principle predicts the flow of electrical charge (i.e. current) in electrical conductors when subjected to the influence of voltage differences; Jean-Baptiste-Joseph Fourier's principle predicts the flow of heat in heat conductors when subjected to the influence of temperature differences.\n\nThe same equation describes both phenomena, the equation's variables taking on different meanings in the two cases. Specifically, solving a heat conduction (Fourier) problem with temperature (the driving \"force\") and flux of heat (the rate of flow of the driven \"quantity\", i.e. heat energy) variables also solves an analogous electrical conduction (Ohm) problem having electric potential (the driving \"force\") and electric current (the rate of flow of the driven \"quantity\", i.e. charge) variables.\n\nThe basis of Fourier's work was his clear conception and definition of thermal conductivity. He assumed that, all else being the same, the flux of heat is strictly proportional to the gradient of temperature. Although undoubtedly true for small temperature gradients, strictly proportional behavior will be lost when real materials (e.g. ones having a thermal conductivity that is a function of temperature) are subjected to large temperature gradients.\n\nA similar assumption is made in the statement of Ohm's law: other things being alike, the strength of the current at each point is proportional to the gradient of electric potential. The accuracy of the assumption that flow is proportional to the gradient is more readily tested, using modern measurement methods, for the electrical case than for the heat case.\n\n\nOther versions\n\nOhm's law, in the form above, is an extremely useful equation in the field of electrical/electronic engineering because it describes how voltage, current and resistance are interrelated on a \"macroscopic\" level, that is, commonly, as circuit elements in an electrical circuit. Physicists who study the electrical properties of matter at the microscopic level use a closely related and more general vector equation, sometimes also referred to as Ohm's law, having variables that are closely related to the V, I, and R scalar variables of Ohm's law, but which are each functions of position within the conductor.  Physicists often use this continuum form of Ohm's Law:[34]\n\n\n\t\n  \n    \n      \n        \n          E\n        \n        =\n        ρ\n        \n          J\n        \n      \n    \n    {\\displaystyle \\mathbf {E} =\\rho \\mathbf {J} }\n  \n\n\n\nwhere \"E\" is the electric field vector with units of volts per meter (analogous to \"V\" of Ohm's law which has units of volts), \"J\" is the current density vector with units of amperes per unit area (analogous to \"I\" of Ohm's law which has units of amperes), and \"ρ\" (Greek \"rho\") is the resistivity with units of ohm·meters (analogous to \"R\" of Ohm's law which has units of ohms).  The above equation is sometimes written[35] as J = \n  \n    \n      \n        σ\n      \n    \n    {\\displaystyle \\sigma }\n  \nE where \"σ\" (Greek \"sigma\") is the conductivity which is the reciprocal of ρ.\n\n\n  \nCurrent flowing through a uniform cylindrical conductor (such as a round wire) with a uniform field applied.\n\n\n\nThe voltage between two points is defined as:[36]\n\n\n\t\n  \n    \n      \n        \n          Δ\n          V\n        \n        =\n        −\n        ∫\n        \n          \n            E\n          \n          ⋅\n          d\n          \n            l\n          \n        \n      \n    \n    {\\displaystyle {\\Delta V}=-\\int {\\mathbf {E} \\cdot d\\mathbf {l} }}\n  \n\n\n\nwith \n  \n    \n      \n        d\n        \n          l\n        \n      \n    \n    {\\displaystyle d\\mathbf {l} }\n  \n the element of path along the integration of electric field vector E. If the applied E field is uniform and oriented along the length of the conductor as shown in the figure, then defining the voltage V in the usual convention of being opposite in direction to the field (see figure), and with the understanding that the voltage V is measured differentially across the length of the conductor allowing us to drop the Δ symbol, the above vector equation reduces to the scalar equation:\n\n\n\t\n  \n    \n      \n        V\n        =\n        \n          E\n        \n        \n          l\n        \n         \n         \n        \n          or\n        \n         \n         \n        E\n        =\n        \n          \n            V\n            l\n          \n        \n        .\n      \n    \n    {\\displaystyle V={E}{l}\\ \\ {\\text{or}}\\ \\ E={\\frac {V}{l}}.}\n  \n\n\n\nSince the E field is uniform in the direction of wire length, for a conductor having uniformly consistent resistivity ρ, the current density J will also be uniform in any cross-sectional area and oriented in the direction of wire length, so we may write:[37]\n\n\n\t\n  \n    \n      \n        J\n        =\n        \n          \n            I\n            a\n          \n        \n        .\n      \n    \n    {\\displaystyle J={\\frac {I}{a}}.}\n  \n\n\n\nSubstituting the above 2 results (for E and J respectively) into the continuum form shown at the beginning of this section:\n\n\n\t\n  \n    \n      \n        \n          \n            V\n            l\n          \n        \n        =\n        \n          \n            I\n            a\n          \n        \n        ρ\n        \n        \n          or\n        \n        \n        V\n        =\n        I\n        ρ\n        \n          \n            l\n            a\n          \n        \n        .\n      \n    \n    {\\displaystyle {\\frac {V}{l}}={\\frac {I}{a}}\\rho \\qquad {\\text{or}}\\qquad V=I\\rho {\\frac {l}{a}}.}\n  \n\n\n\nThe electrical resistance of a uniform conductor is given in terms of resistivity by:[37]\n\n\n\t\n  \n    \n      \n        \n          R\n        \n        =\n        ρ\n        \n          \n            l\n            a\n          \n        \n      \n    \n    {\\displaystyle {R}=\\rho {\\frac {l}{a}}}\n  \n\n\n\nwhere l is the length of the conductor in SI units of meters, a is the cross-sectional area (for a round wire a = πr2 if r is radius) in units of meters squared, and ρ is the resistivity in units of ohm·meters.\n\nAfter substitution of R from the above equation into the equation preceding it, the continuum form of Ohm's law for a uniform field (and uniform current density) oriented along the length of the conductor reduces to the more familiar form:\n\n\n\t\n  \n    \n      \n        \n          V\n        \n        =\n        \n          I\n        \n        \n          R\n        \n        .\n         \n      \n    \n    {\\displaystyle {V}={I}{R}.\\ }\n  \n\n\n\nA perfect crystal lattice, with low enough thermal motion and no deviations from periodic structure, would have no resistivity,[38] but a real metal has crystallographic defects, impurities, multiple isotopes, and thermal motion of the atoms. Electrons scatter from all of these, resulting in resistance to their flow.\n\nThe more complex generalized forms of Ohm's law are important to condensed matter physics, which studies the properties of matter and, in particular, its electronic structure. In broad terms, they fall under the topic of constitutive equations and the theory of transport coefficients.\n\n\nMagnetic effects\n\nIf an external B-field is present and the conductor is not at rest but moving at velocity v, then an extra term must be added to account for the current induced by the Lorentz force on the charge carriers.\n\n\n\t\n  \n    \n      \n        \n          J\n        \n        =\n        σ\n        (\n        \n          E\n        \n        +\n        \n          v\n        \n        ×\n        \n          B\n        \n        )\n      \n    \n    {\\displaystyle \\mathbf {J} =\\sigma (\\mathbf {E} +\\mathbf {v} \\times \\mathbf {B} )}\n  \n\n\n\nIn the rest frame of the moving conductor this term drops out because v= 0. There is no contradiction because the electric field in the rest frame differs from the E-field in the lab frame: E′  = E + v×B.\nElectric and magnetic fields are relative, see Lorentz transformation.\n\nIf the current J is alternating because the applied voltage or E-field varies in time, then reactance must be added to resistance to account for self-inductance, see electrical impedance. The reactance may be strong if the frequency is high or the conductor is coiled.\n\n\nConductive fluids\n\nIn a conductive fluid, such as a plasma, there is a similar effect. Consider a fluid moving with the velocity \n  \n    \n      \n        \n          v\n        \n      \n    \n    {\\displaystyle \\mathbf {v} }\n  \n in a magnetic field \n  \n    \n      \n        \n          B\n        \n      \n    \n    {\\displaystyle \\mathbf {B} }\n  \n. The relative motion induces an electric field \n  \n    \n      \n        \n          E\n        \n      \n    \n    {\\displaystyle \\mathbf {E} }\n  \n which exerts electric force on the charged particles giving rise to an electric current \n  \n    \n      \n        \n          J\n        \n      \n    \n    {\\displaystyle \\mathbf {J} }\n  \n. The equation of motion for the electron gas, with a number density \n  \n    \n      \n        \n          n\n          \n            e\n          \n        \n      \n    \n    {\\displaystyle n_{e}}\n  \n, is written as\n\n\n\t\n  \n    \n      \n        \n          m\n          \n            e\n          \n        \n        \n          n\n          \n            e\n          \n        \n        \n          \n            \n              d\n              \n                \n                  v\n                \n                \n                  e\n                \n              \n            \n            \n              d\n              t\n            \n          \n        \n        =\n        −\n        \n          n\n          \n            e\n          \n        \n        e\n        \n          E\n        \n        +\n        \n          n\n          \n            e\n          \n        \n        \n          m\n          \n            e\n          \n        \n        ν\n        (\n        \n          v\n          \n            i\n          \n        \n        −\n        \n          v\n          \n            e\n          \n        \n        )\n        −\n        e\n        \n          n\n          \n            e\n          \n        \n        \n          \n            v\n          \n          \n            e\n          \n        \n        ×\n        \n          B\n        \n        ,\n      \n    \n    {\\displaystyle m_{e}n_{e}{d\\mathbf {v} _{e} \\over dt}=-n_{e}e\\mathbf {E} +n_{e}m_{e}\\nu (v_{i}-v_{e})-en_{e}\\mathbf {v} _{e}\\times \\mathbf {B} ,}\n  \n\n\n\nwhere \n  \n    \n      \n        e\n      \n    \n    {\\displaystyle e}\n  \n, \n  \n    \n      \n        \n          m\n          \n            e\n          \n        \n      \n    \n    {\\displaystyle m_{e}}\n  \n and \n  \n    \n      \n        \n          \n            v\n          \n          \n            e\n          \n        \n      \n    \n    {\\displaystyle \\mathbf {v} _{e}}\n  \n are the charge, mass and velocity of the electrons, respectively. Also, \n  \n    \n      \n        ν\n      \n    \n    {\\displaystyle \\nu }\n  \n is the frequency of collisions of the electrons with ions which have a velocity field \n  \n    \n      \n        \n          \n            v\n          \n          \n            i\n          \n        \n      \n    \n    {\\displaystyle \\mathbf {v} _{i}}\n  \n. Since, the electron has a very small mass compared with that of ions, we can ignore the left hand side of the above equation to write\n\n\n\t\n  \n    \n      \n        σ\n        (\n        \n          E\n        \n        +\n        \n          v\n        \n        ×\n        \n          B\n        \n        )\n        =\n        \n          J\n        \n        ,\n      \n    \n    {\\displaystyle \\sigma (\\mathbf {E} +\\mathbf {v} \\times \\mathbf {B} )=\\mathbf {J} ,}\n  \n\n\n\nwhere we have used the definition of the current density, and also put \n  \n    \n      \n        σ\n        =\n        \n          \n            \n              \n                n\n                \n                  e\n                \n              \n              \n                e\n                \n                  2\n                \n              \n            \n            \n              ν\n              \n                m\n                \n                  e\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle \\sigma ={n_{e}e^{2} \\over \\nu m_{e}}}\n  \n which is the electrical conductivity. This equation can also be equivalently written as\n\n\n\t\n  \n    \n      \n        \n          E\n        \n        +\n        \n          v\n        \n        ×\n        \n          B\n        \n        =\n        ρ\n        \n          J\n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {E} +\\mathbf {v} \\times \\mathbf {B} =\\rho \\mathbf {J} ,}\n  \n\n\n\nwhere \n  \n    \n      \n        ρ\n        =\n        \n          σ\n          \n            −\n            1\n          \n        \n      \n    \n    {\\displaystyle \\rho =\\sigma ^{-1}}\n  \n is the electrical resistivity. It is also common to write \n  \n    \n      \n        η\n      \n    \n    {\\displaystyle \\eta }\n  \n instead of \n  \n    \n      \n        ρ\n      \n    \n    {\\displaystyle \\rho }\n  \n which can be confusing since it is the same notation used for the magnetic diffusivity defined as \n  \n    \n      \n        η\n        =\n        1\n        \n          /\n        \n        \n          μ\n          \n            0\n          \n        \n        σ\n      \n    \n    {\\displaystyle \\eta =1/\\mu _{0}\\sigma }\n  \n.\n\n\nSee also\n\n\n\tElectronics portal\n\n\n\n\tFick's law of diffusion\n\tHopkinson's law (\"Ohm's law for magnetics\")\n\tMaximum power transfer theorem\n\tNorton's theorem\n\tSheet resistance\n\tSuperposition theorem\n\tThermal noise\n\tThévenin's theorem\n\n\nReferences\n\n\n\t^ Consoliver, Earl L. & Mitchell, Grover I. (1920). Automotive ignition systems. McGraw-Hill. p. 4.\n\n\t^ a b Robert A. Millikan and E. S. Bishop (1917). Elements of Electricity. American Technical Society. p. 54.\n\n\n\t^ \nOliver Heaviside (1894). Electrical papers. 1. Macmillan and Co. p. 283. ISBN 978-0-8218-2840-3.\n\n\n\t^ Olivier Darrigol, Electrodynamics from Ampère to Einstein, p.70, Oxford University Press, 2000 \nISBN 0-19-850594-9.\n\n\t^ Fleming, John Ambrose (1911). \"Electricity\" .  In Chisholm, Hugh (ed.). Encyclopædia Britannica. 9 (11th ed.). Cambridge University Press. p. 182.\n\n\n\t^ Sanford P. Bordeau (1982)  Volts to Hertz...the Rise of Electricity.  Burgess Publishing Company, Minneapolis, MN.  pp.86–107, \nISBN 0-8087-4908-0\n\n\t^ Ronalds, B. F. (2016). Sir Francis Ronalds: Father of the Electric Telegraph. London: Imperial College Press. ISBN 978-1-78326-917-4.\n\n\n\t^ Ronalds, B. F. (July 2016). \"Francis Ronalds (1788–1873): The First Electrical Engineer?\". Proceedings of the IEEE. 104 (7): 1489–1498. doi:10.1109/JPROC.2016.2571358.\n\n\n\t^ G. S. Ohm (1827). Die galvanische Kette, mathematisch bearbeitet (PDF). Berlin: T. H. Riemann. Archived from the original (PDF) on 2009-03-26.\n\n\n\t^ \nDavies, B, \"A web of naked fancies?\", Physics Education 15 57–61, Institute of Physics, Issue 1, Jan 1980 [1]\n\n\t^ Hart, IB, Makers of Science, London, Oxford University Press, 1923. p. 243. [2]\n\n\t^ Herbert Schnädelbach, Philosophy in Germany 1831–1933, pages 78-79, Cambridge University Press, 1984 \nISBN 0521296463.\n\n\t^ Taliaferro Preston (1855). Shaffner's Telegraph Companion: Devoted to the Science and Art of the Morse Telegraph. Vol.2. Pudney & Russell.\n\n\n\t^ Purcell, Edward M. (1985), Electricity and magnetism, Berkeley Physics Course, 2 (2nd ed.), McGraw-Hill, p. 129, ISBN 978-0-07-004908-6\n\n\n\t^ Griffiths, David J. (1999), Introduction to electrodynamics (3rd ed.), Prentice Hall, p. 289, ISBN 978-0-13-805326-0\n\n\n\t^ Weber, B.; Mahapatra, S.; Ryu, H.; Lee, S.; Fuhrer, A.; Reusch, T. C. G.; Thompson, D. L.; Lee, W. C. T.; Klimeck, G.; Hollenberg, L. C. L.; Simmons, M. Y. (2012). \"Ohm's Law Survives to the Atomic Scale\". Science. 335 (6064): 64–67. Bibcode:2012Sci...335...64W. doi:10.1126/science.1214319. PMID 22223802.\n\n\n\t^ Drude, Paul (1900). \"Zur Elektronentheorie der Metalle\". Annalen der Physik. 306 (3): 566–613. Bibcode:1900AnP...306..566D. doi:10.1002/andp.19003060312.\n[dead link]\n\n\t^ Drude, Paul (1900). \"Zur Elektronentheorie der Metalle; II. Teil. Galvanomagnetische und thermomagnetische Effecte\". Annalen der Physik. 308 (11): 369–402. Bibcode:1900AnP...308..369D. doi:10.1002/andp.19003081102.\n[dead link]\n\n\t^ A. Akers; M. Gassman & R. Smith (2006). Hydraulic Power System Analysis. New York: Taylor & Francis. Chapter 13. ISBN 978-0-8247-9956-4.\n\n\n\t^ A. Esposito, \"A Simplified Method for Analyzing Circuits by Analogy\", Machine Design, October 1969, pp. 173–177.\n\n\t^ Guyton, Arthur; Hall, John (2006). \"Chapter 14: Overview of the Circulation; Medical Physics of Pressure, Flow, and Resistance\".  In Gruliow, Rebecca (ed.). Textbook of Medical Physiology (11th ed.). Philadelphia, Pennsylvania: Elsevier Inc. p. 164. ISBN 978-0-7216-0240-0.\n\n\n\t^ James William Nilsson & Susan A. Riedel (2008). Electric circuits. Prentice Hall. p. 29. ISBN 978-0-13-198925-2.\n\n\n\t^ Alvin M. Halpern & Erich Erlbach (1998). Schaum's outline of theory and problems of beginning physics II. McGraw-Hill Professional. p. 140. ISBN 978-0-07-025707-8.\n\n\n\t^ Dale R. Patrick & Stephen W. Fardo (1999). Understanding DC circuits. Newnes. p. 96. ISBN 978-0-7506-7110-1.\n\n\n\t^ Thomas O'Conor Sloane (1909). Elementary electrical calculations. D. Van Nostrand Co. p. 41.\n\n\n\t^ Linnaeus Cumming (1902). Electricity treated experimentally for the use of schools and students. Longman's Green and Co. p. 220.\n\n\n\t^ Benjamin Stein (1997). Building technology (2nd ed.). John Wiley and Sons. p. 169. ISBN 978-0-471-59319-5.\n\n\n\t^ Rajendra Prasad (2006). Fundamentals of Electrical Engineering. Prentice-Hall of India. ISBN 978-81-203-2729-0.\n\n\n\t^ Hughes, E, Electrical Technology, pp10, Longmans, 1969.\n\n\t^ Forbes T. Brown (2006). Engineering System Dynamics. CRC Press. p. 43. ISBN 978-0-8493-9648-9.\n\n\n\t^ Kenneth L. Kaiser (2004). Electromagnetic Compatibility Handbook. CRC Press. pp. 13–52. ISBN 978-0-8493-2087-3.\n\n\n\t^ Horowitz, Paul; Winfield Hill (1989). The Art of Electronics (2nd ed.). Cambridge University Press. p. 13. ISBN 978-0-521-37095-0.\n\n\n\t^ \nNormal Lockyer, ed. (September 21, 1876). \"Reports\". Nature. Macmillan Journals Ltd. 14 (360): 451–9 [452]. Bibcode:1876Natur..14..451.. doi:10.1038/014451a0.\n\n\n\t^ Lerner, Lawrence S. (1977). Physics for scientists and engineers. Jones & Bartlett. p. 736. ISBN 978-0-7637-0460-5.\n\n\n\t^ Seymour J, Physical Electronics, Pitman, 1972, pp 53–54\n\n\t^ Lerner L, Physics for scientists and engineers, Jones & Bartlett, 1997, pp. 685–686\n\n\t^ a b Lerner L, Physics for scientists and engineers, Jones & Bartlett, 1997, pp. 732–733\n\n\t^ Seymour J, Physical Electronics, pp 48–49, Pitman, 1972\n\n\n\n\nExternal links and further reading\n\n\t\tWikimedia Commons has media related to Ohm's law.\n\n\n\tOhm's Law chapter from Lessons In Electric Circuits Vol 1 DC book and series.\n\tJohn C. Shedd and Mayo D. Hershey,\"The History of Ohm's Law\",  Popular Science, December 1913, pages 599-614, Bonnier Corporation \nISSN 0161-7370, gives the history of Ohm's investigations, prior work, Ohm's false equation in the first paper, illustration of Ohm's experimental apparatus.\n\tSchagrin, Morton L. (1963). \"Resistance to Ohm's Law\". American Journal of Physics. 31 (7): 536–547. doi:10.1119/1.1969620.\n Explores the conceptual change underlying Ohm's experimental work.\n\tKenneth L. Caneva, \"Ohm, Georg Simon.\" Complete Dictionary of Scientific Biography. 2008\n\tWikisource:Scientific Memoirs/2/The Galvanic Circuit investigated Mathematically, a translation of Ohm's original paper.\n\n\n\tAuthority control \t\n\tGND: 4426059-3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Ohm%27s_law&oldid=917285361\"\n\n\t\t\n\t\tCategories: \tElectronic engineering\n\tCircuit theorems\n\tEmpirical laws\n\tElectrical resistance and conductance\n\tVoltage\n\tGeorg Ohm\n\n\nHidden categories: \tWikipedia articles incorporating a citation from the 1911 Encyclopaedia Britannica with Wikisource reference\n\tCS1: long volume value\n\tAll articles with dead external links\n\tArticles with dead external links from February 2019\n\tCS1: Julian–Gregorian uncertainty\n\tWikipedia pages semi-protected against vandalism\n\tCommons category link is on Wikidata\n\tWikipedia articles with GND identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tView source\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\tWikiversity\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tБеларуская\n\tБългарски\n\tBosanski\n\tBrezhoneg\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEmiliàn e rumagnòl\n\tEspañol\n\tEsperanto\n\tEstremeñu\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGàidhlig\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tҚазақша\n\tKreyòl ayisyen\n\tКыргызча\n\tLatviešu\n\tLietuvių\n\tLimburgs\n\tMagyar\n\tМакедонски\n\tMalagasy\n\tമലയാളം\n\tBahasa Melayu\n\tМонгол\n\tမြန်မာဘာသာ\n\tNederlands\n\tनेपाली\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tଓଡ଼ିଆ\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tPiemontèis\n\tPlattdüütsch\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tShqip\n\tසිංහල\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tТатарча/tatarça\n\tతెలుగు\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t文言\n\t吴语\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 23 September 2019, at 03:49 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "8", "dc:title": "Ohm's law - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/OhmsLaw.svg/1200px-OhmsLaw.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-ohm-27s_law", "title": "Ohm's law - Wikipedia"}}