{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAttitude control - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tAttitude control\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from 3-axis stabilized spacecraft)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about attitude control in spacecraft. For attitude control in aircraft, see attitude control (fixed-wing aircraft). For attitude control in psychology, see attitude change.\n\n\t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Attitude control\" – news · newspapers · books · scholar · JSTOR  (May 2013) (Learn how and when to remove this template message)\n\n\n\nAttitude control is controlling the orientation of an object with respect to an inertial frame of reference or another entity like the celestial sphere, certain fields, and nearby objects, etc.\n\nControlling vehicle attitude requires sensors to measure vehicle orientation, actuators to apply the torques needed to re-orient the vehicle to a desired attitude, and algorithms to command the actuators based on (1) sensor measurements of the current attitude and (2) specification of a desired attitude. The integrated field that studies the combination of sensors, actuators and algorithms is called \"Guidance, Navigation and Control\" (GNC).\n\n\nContents\n\n\n\t1 Introduction\n\t1.1 Types of stabilization\n\t1.2 Articulation\n\n\n\n\t2 Geometry\n\t3 Sensors\n\t3.1 Relative attitude sensors\n\t3.1.1 Gyroscopes\n\t3.1.2 Motion reference units\n\n\n\n\t3.2 Absolute attitude sensors\n\t3.2.1 Horizon sensor\n\t3.2.2 Orbital gyrocompass\n\t3.2.3 Sun sensor\n\t3.2.4 Earth sensor\n\t3.2.5 Star tracker\n\t3.2.6 Magnetometer\n\n\n\n\n\n\n\t4 Attitude Determination\n\t4.1 Static Attitude Estimation Methods\n\t4.2 Sequential Estimation Methods\n\n\n\n\t5 Control Algorithms\n\t6 Actuators\n\t6.1 Thrusters\n\t6.2 Spin stabilization\n\t6.3 Momentum wheels\n\t6.4 Control moment gyros\n\t6.5 Solar sails\n\t6.6 Gravity-gradient stabilization\n\t6.7 Magnetic torquers\n\t6.8 Pure passive attitude control\n\n\n\n\t7 See also\n\t8 References\n\n\n\n\n\nIntroduction[edit]\n\n\t\n\tThis article may need to be cleaned up. It has been merged from 3-axis stabilized spacecraft.\n\n\n\nA spacecraft's attitude must typically be stabilized and controlled for a variety of reasons. It is oftentimes needed so that the spacecraft high-gain antenna may be accurately pointed to Earth for communications, so that onboard experiments may accomplish precise pointing for accurate collection and subsequent interpretation of data, so that the heating and cooling effects of sunlight and shadow may be used intelligently for thermal control, and also for guidance: short propulsive maneuvers must be executed in the right direction.\n\n\nTypes of stabilization[edit]\n\nThere are two principal approaches to stabilizing attitude control on spacecraft:[citation needed]\n\n\n\tSpin stabilization is accomplished by setting the spacecraft spinning, using the gyroscopic action of the rotating spacecraft mass as the stabilizing mechanism. Propulsion system thrusters are fired only occasionally to make desired changes in spin rate, or in the spin-stabilized attitude. If desired, the spinning may be stopped through the use of thrusters or by yo-yo de-spin. The Pioneer 10 and Pioneer 11 probes in the outer solar system are examples of spin-stabilized spacecraft.\n\tThree-axis stabilization is an alternative method of spacecraft attitude control in which the spacecraft is held fixed in the desired orientation without any rotation.\n\tOne method is to use small  thrusters to continually nudge the spacecraft back and forth within a deadband of allowed attitude error. Thrusters may also be referred to as mass-expulsion control (MEC)[1] systems, or reaction control systems (RCS). The space probes Voyager 1 and Voyager 2 employ this method, and have used up about three quarters[2] of their 100 kg of propellant as of July 2015.\n\tAnother method for achieving three-axis stabilization is to use electrically powered reaction wheels, also called momentum wheels, which are mounted on three orthogonal axes aboard the spacecraft. They provide a means to trade angular momentum back and forth between spacecraft and wheels. To rotate the vehicle on a given axis, the reaction wheel on that axis is accelerated in the opposite direction. To rotate the vehicle back, the wheel is slowed. Excess momentum that builds up in the system due to external torques from, for example, solar photon pressure or gravity gradients, must be occasionally removed from the system by applying controlled torque to the spacecraft to allowing the wheels to return to a desired speed under computer control. This is done during maneuvers called momentum desaturation or momentum unload maneuvers. Most spacecraft use a system of thrusters to apply the torque for desaturation maneuvers. A different approach was used by the Hubble Space Telescope, which had sensitive optics that could be contaminated by thruster exhaust, and instead used magnetic torquers for desaturation maneuvers.\n\n\n\n\nThere are advantages and disadvantages to both spin stabilization and three-axis stabilization. Spin-stabilized craft provide a continuous sweeping motion that is desirable for fields and particles instruments, as well as some optical scanning instruments, but they may require complicated systems to de-spin antennas or optical instruments that must be pointed at targets for science observations or communications with Earth. Three-axis controlled craft can point optical instruments and antennas without having to de-spin them, but they may have to carry out special rotating maneuvers to best utilize their fields and particle instruments. If thrusters are used for routine stabilization, optical observations such as imaging must be designed knowing that the spacecraft is always slowly rocking back and forth, and not always exactly predictably. Reaction wheels provide a much steadier spacecraft from which to make observations, but they add mass to the spacecraft, they have a limited mechanical lifetime, and they require frequent momentum desaturation maneuvers, which can perturb navigation solutions because of accelerations imparted by the use of thrusters.[citation needed]\n\n\nArticulation[edit]\n\nMany spacecraft have components that require articulation. Voyager and Galileo, for example, were designed with scan platforms for pointing optical instruments at their targets largely independently of spacecraft orientation. Many spacecraft, such as Mars orbiters, have solar panels that must track the Sun so they can provide electrical power to the spacecraft. Cassini's main engine nozzles were steerable. Knowing where to point a solar panel, or scan platform, or a nozzle — that is, how to articulate it — requires knowledge of the spacecraft's attitude. Because a single subsystem keeps track of the spacecraft's attitude, the Sun's location, and Earth's location, it can compute the proper direction to point the appendages. It logically falls to the same subsystem – the Attitude and Articulation Control Subsystem (AACS), then, to manage both attitude and articulation. The name AACS may even be carried over to a spacecraft even if it has no appendages to articulate.[citation needed]\n\n\nGeometry[edit]\n\nMain article: Attitude (geometry)\nAttitude is part of the description of how an object is placed in the space it occupies.  Coupled with position, this full describes how an object is placed in space.  (For some applications such as in robotics and computer vision, it is customary to combine position and attitude together into a single description known as Pose).\n\nAttitude can be described using a variety of methods, however the most common are Rotation matrices, Quaternions, and Euler angles.  While euler angles are often times the most straightforward representation to visualize, they can cause problems for highly maneuverable systems due to a phenomenon known as Gimbal lock.  A rotation matrix on the other-hand provides a full description of the attitude at the expense of requiring 9 values instead of 3.  This can lead to increased computational expense and be more difficult to work with.  Quaternions offer a decent compromise in that they do not suffer from gimbal lock, and only require 4 values to fully describe the attitude.  \n\n\n  \nChanging orientation of a rigid body is the same as rotating the axes of a reference frame attached to it.\n\n\n\nSensors[edit]\n\nRelative attitude sensors[edit]\n\nMany sensors generate outputs that reflect the rate of change in attitude. These require a known initial attitude, or external information to use them to determine attitude. Many of this class of sensor have some noise, leading to inaccuracies if not corrected by absolute attitude sensors.\n\n\nGyroscopes[edit]\n\nGyroscopes are devices that sense rotation in three-dimensional space without reliance on the observation of external objects. Classically, a gyroscope consists of a spinning mass, but there are also \"ring laser gyros\" utilizing coherent light reflected around a closed path. Another type of \"gyro\" is a hemispherical resonator gyro where a crystal cup shaped like a wine glass can be driven into oscillation just as a wine glass \"sings\" as a finger is rubbed around its rim. The orientation of the oscillation is fixed in inertial space, so measuring the orientation of the oscillation relative to the spacecraft can be used to sense the motion of the spacecraft with respect to inertial space.[3]\n\n\nMotion reference units[edit]\n\nMotion reference units are a kind of inertial measurement unit with single- or multi-axis motion sensors. They utilize MEMS gyroscopes. Some multi-axis MRUs are capable of measuring roll, pitch, yaw and heave. They have applications outside the aeronautical field, such as:[4]\n\n\n\tAntenna motion compensation and stabilization\n\tDynamic positioning\n\tHeave compensation of offshore cranes\n\tHigh speed craft motion control and damping systems\n\tHydro acoustic positioning\n\tMotion compensation of single and multibeam echosounders\n\tOcean wave measurements\n\tOffshore structure motion monitoring\n\tOrientation and attitude measurements on Autonomous underwater vehicles and Remotely operated underwater vehicles\n\tShip motion monitoring\n\n\nAbsolute attitude sensors[edit]\n\nThis class of sensors sense the position or orientation of fields, objects or other phenomena outside the spacecraft.\n\n\nHorizon sensor[edit]\n\nA horizon sensor is an optical instrument that detects light from the 'limb' of Earth's atmosphere, i.e., at the horizon. Thermal infrared sensing is often used, which senses the comparative warmth of the atmosphere, compared to the much colder cosmic background. This sensor provides orientation with respect to Earth about two orthogonal axes. It tends to be less precise than sensors based on stellar observation. Sometimes referred to as an Earth sensor.[citation needed]\n\n\nOrbital gyrocompass[edit]\n\nSimilar to the way that a terrestrial gyrocompass uses a pendulum to sense local gravity and force its gyro into alignment with Earth's spin vector, and therefore point north, an orbital gyrocompass uses a horizon sensor to sense the direction to Earth's center, and a gyro to sense rotation about an axis normal to the orbit plane. Thus, the horizon sensor provides pitch and roll measurements, and the gyro provides yaw.[citation needed] See Tait-Bryan angles.\n\n\nSun sensor[edit]\n\nA sun sensor is a device that senses the direction to the Sun. This can be as simple as some solar cells and shades, or as complex as a steerable telescope, depending on mission requirements.\n\n\nEarth sensor[edit]\n\nAn Earth sensor is a device that senses the direction to Earth. It is usually an infrared camera; nowadays the main method to detect attitude is the star tracker, but Earth sensors are still integrated in satellites for their low cost and reliability.[citation needed]\n\n\nStar tracker[edit]\n\n  \nThe STARS real-time star tracking software operates on an image from EBEX 2012, a high-altitude balloon-borne cosmology experiment launched from Antarctica on 2012-12-29\n\n\n\nA star tracker is an optical device that measures the position(s) of star(s) using photocell(s) or a camera.[5] It uses magnitude of brightness and spectral type to identify and then calculate the relative position of stars around it.\n\n\nMagnetometer[edit]\n\nA magnetometer is a device that senses magnetic field strength and, when used in a three-axis triad, magnetic field direction. As a spacecraft navigational aid, sensed field strength and direction is compared to a map of Earth's magnetic field stored in the memory of an on-board or ground-based guidance computer. If spacecraft position is known then attitude can be inferred.[citation needed]\n\n\nAttitude Determination[edit]\n\nMain article: Attitude determination\n\nBefore attitude control can be performed, the current attitude must be determined.  Attitude cannot be measured directly by any single measurement, and so must be calculated (or estimated) from a set of measurements (often using different sensors).  This can be done either statically (calculating the attitude using only the measurements currently available), or through the use of a statistical filter (most commonly, the Kalman filter) that statistically combine previous attitude estimates with current sensor measurements to obtain an optimal estimate of the current attitude.\n\nFor some sensors and applications (such as spacecraft using magnetometers) the precise location must also be known.  While pose estimation can be employed, for spacecraft it is usually sufficient to estimate the position (via Orbit determination) separate from the attitude estimation.  For terrestrial vehicles and spacecraft operating near the earth, the advent of Satellite navigation systems allows for precise position knowledge to be obtained easily.  This problem becomes more complicated for deep space vehicles, or terrestrial vehicles operating in  Global Navigation Satellite System (GNSS) denied environments (see Navigation).\n\n\nStatic Attitude Estimation Methods[edit]\n\nStatic attitude estimation methods are solutions to Wahba's problem.  Many solutions have been proposed, notably Davenport's q-method, QUEST, TRIAD, and singular value decomposition.[6]\n\n\nSequential Estimation Methods[edit]\n\nKalman filtering can be used to sequentially estimate the attitude, as well as the angular rate.[7]  Because attitude dynamics (combination of rigid body dynamics and attitude kinematics) are non-linear, a linear kalman filter is not sufficient.  Because attitude dynamics is not very non-linear, the Extended Kalman filter is usually sufficient (however Crassidis and Markely demonstrated that the Unscented Kalman filter could be used, and can provide benefits in cases where the initial estimate is poor).[8]  Multiple methods have been proposed, however the Multiplicative Extended Kalman Filter (MEKF) is by far the most common approach.  This approach utilizes the multiplicative formulation of the error quaternion, which allows for the unity constraint on the quaternion to be better handled.  It is also common to use a technique known as dynamic model replacement, where the angular rate is not estimated directly, but rather the measured angular rate from the gyro is used directly to propagate the rotational dynamics forward in time.  This is valid for most applications as gyros are typically far more precise than one's knowledge of disturbance torques acting on the system (which is required for precise estimation of the angular rate).\n\n\nControl Algorithms[edit]\n\nControl algorithms are computer programs that receive data from vehicle sensors and derive the appropriate commands to the actuators to rotate the vehicle to the desired attitude. The algorithms range from very simple, e.g. proportional control, to complex nonlinear estimators or many in-between types, depending on mission requirements. Typically, the attitude control algorithms are part of the software running on the hardware, which receives commands from the ground and formats vehicle data telemetry for transmission to a ground station.\n\nThe attitude control algorithms are written and implemented based on requirement for a particular attitude maneuver. Asides the implementation of passive attitude control such as the gravity-gradient stabilization, most spacecrafts make use of active control which exhibits a typical attitude control loop. The design of the control algorithm depends on the actuator to be used for the specific attitude maneuver although using a simple proportional–integral–derivative controller (PID controller) satisfies most control needs.\n\nThe appropriate commands to the actuators are obtained based on error signals described as the difference between the measured and desired attitude. The error signals are commonly measured as euler angles (Φ, θ, Ψ), however an alternative to this could be described in terms of direction cosine matrix or error quaternions. The PID controller which is most common reacts to an error signal (deviation) based on attitude as follows\n\n\n  \n    \n      \n        \n          T\n          \n            c\n          \n        \n        (\n        t\n        )\n        =\n        \n          K\n          \n            p\n          \n        \n        e\n        (\n        t\n        )\n        +\n        \n          K\n          \n            i\n          \n        \n        \n          ∫\n          \n            0\n          \n          \n            t\n          \n        \n        e\n        (\n        τ\n        )\n        \n        d\n        τ\n        +\n        \n          K\n          \n            d\n          \n        \n        \n          \n            \n              e\n              ˙\n            \n          \n        \n        (\n        t\n        )\n        ,\n      \n    \n    {\\displaystyle T_{c}(t)=K_{\\text{p}}e(t)+K_{\\text{i}}\\int _{0}^{t}e(\\tau )\\,d\\tau +K_{\\text{d}}{\\dot {e}}(t),}\n  \n\n\nwhere \n  \n    \n      \n        \n          T\n          \n            c\n          \n        \n      \n    \n    {\\displaystyle T_{c}}\n  \n is the control torque, \n  \n    \n      \n        e\n      \n    \n    {\\displaystyle e}\n  \n is the attitude deviation signal, and  \n  \n    \n      \n        \n          K\n          \n            p\n          \n        \n        ,\n        \n          K\n          \n            i\n          \n        \n        ,\n        \n          K\n          \n            d\n          \n        \n      \n    \n    {\\displaystyle K_{\\text{p}},K_{\\text{i}},K_{\\text{d}}}\n  \n are the PID controller parameters.\n\nA simple implementation of this can be the application of the proportional control for nadir pointing making use of either momentum or reaction wheels as actuators. Based on the change in momentum of the wheels, the control law can be defined in 3-axes x, y, z as\n\n\n  \n    \n      \n        \n          T\n          \n            c\n          \n        \n        x\n        =\n        −\n        \n          K\n          \n            q1\n          \n        \n        \n          q\n          \n            1\n          \n        \n        +\n        \n          K\n          \n            w1\n          \n        \n        \n          \n            w\n            \n              x\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle T_{c}x=-K_{\\text{q1}}q_{1}+K_{\\text{w1}}{w_{x}},}\n  \n\n\n\n  \n    \n      \n        \n          T\n          \n            c\n          \n        \n        y\n        =\n        −\n        \n          K\n          \n            q2\n          \n        \n        \n          q\n          \n            2\n          \n        \n        +\n        \n          K\n          \n            w2\n          \n        \n        \n          \n            w\n            \n              y\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle T_{c}y=-K_{\\text{q2}}q_{2}+K_{\\text{w2}}{w_{y}},}\n  \n\n\n\n  \n    \n      \n        \n          T\n          \n            c\n          \n        \n        z\n        =\n        −\n        \n          K\n          \n            q3\n          \n        \n        \n          q\n          \n            3\n          \n        \n        +\n        \n          K\n          \n            w3\n          \n        \n        \n          \n            w\n            \n              z\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle T_{c}z=-K_{\\text{q3}}q_{3}+K_{\\text{w3}}{w_{z}},}\n  \n\n\nThis control algorithm also affects momentum dumping.\n\nAnother important and common control algorithm involves the concept of detumbling, which is attenuating the angular momentum of the spacecraft. The need to detumble the spacecraft arises from the uncontrollable state after release from the launch vehicle. Most spacecraft in low earth orbit (LEO) makes use of magnetic detumbling concept which utilizes the effect of the earth's magnetic field. The control algorithm is called the B-Dot controller and relies on magnetic coils or torque rods as control actuators. The control law is based on the measurement of the rate of change of body-fixed magnetometer signals.\n\n\n  \n    \n      \n        m\n        =\n        −\n        K\n        \n          \n            \n              B\n              ˙\n            \n          \n        \n      \n    \n    {\\displaystyle m=-K{\\dot {B}}}\n  \n\n\nwhere \n  \n    \n      \n        m\n      \n    \n    {\\displaystyle m}\n  \n is the commanded magnetic dipole moment of the magnetic torquer and \n  \n    \n      \n        k\n      \n    \n    {\\displaystyle k}\n  \n is the proportional gain and \n  \n    \n      \n        \n          \n            \n              B\n              ˙\n            \n          \n        \n      \n    \n    {\\displaystyle {\\dot {B}}}\n  \n is the rate of change of the Earth's magnetic field.\n\n\nActuators[edit]\n\nAttitude control can be obtained by several mechanisms, specifically:[citation needed]\n\n\nThrusters[edit]\n\nMain article: Reaction control system\n\nVernier thrusters are the most common actuators, as they may be used for station keeping as well. Thrusters must be organized as a system to provide stabilization about all three axes, and at least two thrusters are generally used in each axis to provide torque as a couple in order to prevent imparting a translation to the vehicle. Their limitations are fuel usage, engine wear, and cycles of the control valves. The fuel efficiency of an attitude control system is determined by its specific impulse (proportional to exhaust velocity) and the smallest torque impulse it can provide (which determines how often the thrusters must fire to provide precise control). Thrusters must be fired in one direction to start rotation, and again in the opposing direction if a new orientation is to be held. Thruster systems have been used on most manned space vehicles, including Vostok, Mercury, Gemini, Apollo, Soyuz, and the Space Shuttle.\n\nTo minimize the fuel limitation on mission duration, auxiliary attitude control systems may be used to reduce vehicle rotation to lower levels, such as small ion thrusters that accelerate ionized gases electrically to extreme velocities, using power from solar cells.\n\n\nSpin stabilization[edit]\n\nMain article: Spin-stabilisation\n\nThe entire space vehicle itself can be spun up to stabilize the orientation of a single vehicle axis. This method is widely used to stabilize the final stage of a launch vehicle. The entire spacecraft and an attached solid rocket motor are spun up about the rocket's thrust axis, on a \"spin table\" oriented by the attitude control system of the lower stage on which the spin table is mounted. When final orbit is achieved, the satellite may be de-spun by various means, or left spinning. Spin stabilization of satellites is only applicable to those missions with a primary axis of orientation that need not change dramatically over the lifetime of the satellite and no need for extremely high precision pointing. It is also useful for missions with instruments that must scan the star field or Earth's surface or atmosphere.[citation needed] See spin-stabilized satellite.\n\n\nMomentum wheels[edit]\n\nMain article: Momentum wheel\n\nThese are electric motor driven rotors made to spin in the direction opposite to that required to re-orient the vehicle. Because momentum wheels make up a small fraction of the spacecraft's mass and are computer controlled, they give precise control. Momentum wheels are generally suspended on magnetic bearings to avoid bearing friction and breakdown problems.[citation needed] To maintain orientation in three dimensional space a minimum of three must be used,[9] with additional units providing single failure protection. See Euler angles.\n\n\nControl moment gyros[edit]\n\nMain article: Control moment gyroscope\n\nThese are rotors spun at constant speed, mounted on gimbals to provide attitude control. Although a CMG provides control about the two axes orthogonal to the gyro spin axis, triaxial control still requires two units. A CMG is a bit more expensive in terms of cost and mass, because gimbals and their drive motors must be provided. The maximum torque (but not the maximum angular momentum change) exerted by a CMG is greater than for a momentum wheel, making it better suited to large spacecraft. A major drawback is the additional complexity, which increases the number of failure points. For this reason, the International Space Station uses a set of four CMGs to provide dual failure tolerance.\n\n\nSolar sails[edit]\n\nMain article: Solar sail\n\nSmall solar sails (devices that produce thrust as a reaction force induced by reflecting incident light) may be used to make small attitude control and velocity adjustments. This application can save large amounts of fuel on a long-duration mission by producing control moments without fuel expenditure. For example, Mariner 10 adjusted its attitude using its solar cells and antennas as small solar sails.\n\n\nGravity-gradient stabilization[edit]\n\nMain article: Gravity-gradient stabilization\n\nIn orbit, a spacecraft with one axis much longer than the other two will spontaneously orient so that its long axis points at the planet's center of mass. This system has the virtue of needing no active control system or expenditure of fuel. The effect is caused by a tidal force. The upper end of the vehicle feels less gravitational pull than the lower end. This provides a restoring torque whenever the long axis is not co-linear with the direction of gravity. Unless some means of damping is provided, the spacecraft will oscillate about the local vertical. Sometimes tethers are used to connect two parts of a satellite, to increase the stabilizing torque. A problem with such tethers is that meteoroids as small as a grain of sand can part them.\n\n\nMagnetic torquers[edit]\n\nMain article: Magnetic torquers\n\nCoils or (on very small satellites) permanent magnets exert a moment against the local magnetic field. This method works only where there is a magnetic field against which to react. One classic field \"coil\" is actually in the form of a conductive tether in a planetary magnetic field. Such a conductive tether can also generate electrical power, at the expense of orbital decay. Conversely, by inducing a counter-current, using solar cell power, the orbit may be raised. Due to massive variability in Earth's magnetic field from an ideal radial field, control laws based on torques coupling to this field will be highly non-linear. Moreover, only two-axis control is available at any given time meaning that a vehicle reorient may be necessary to null all rates.\n\n\nPure passive attitude control[edit]\n\nThere exist two main passive control types for satellites. The first one uses gravity gradient, and it leads to four stable states with the long axis (axis with smallest moment of inertia) pointing towards Earth. As this system has four stable states, if the satellite has a preferred orientation, e.g. a camera pointed at the planet, some way to flip the satellite and its tether end-for-end is needed. The other passive system orients the satellite along Earth's magnetic field thanks to a magnet.[10] These purely passive attitude control systems have limited pointing accuracy, because the spacecraft will oscillate around energy minima. This drawback is overcome by adding damper, which can be hysteretic materials or a viscous damper. The viscous damper is a small can or tank of fluid mounted in the spacecraft, possibly with internal baffles to increase internal friction. Friction within the damper will gradually convert oscillation energy into heat dissipated within the viscous damper.\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\tLongitudinal static stability\n\tDirectional stability\n\tReaction control system\n\n\nReferences[edit]\n\n\n\t^ \"Basics of Space Flight Section II. Space Flight Projects\". Nasa.gov. Retrieved 2015-07-15.\n\n\t^ \"Voyager Weekly Reports\". Nasa.gov. Retrieved 2015-07-15.\n\n\n\t^ \"Hemispherical Resonator Gyros\" (PDF). Northropgrumman.com. Retrieved 2013-09-09.\n\n\n\t^ \"MRU Applications\". Kongsberg Maritime AS. Retrieved 29 Jan 2015.\n\n\n\t^ \"Star Camera\". NASA. May 2004. Archived from the original on July 21, 2011. Retrieved 25 May 2012.\n\n\n\t^ Markley, F. Landis; Crassidis, John L. (2014), \"Static Attitude Determination Methods\", Fundamentals of Spacecraft Attitude Determination and Control, Springer New York, pp. 183–233, ISBN 9781493908011, retrieved 2019-08-21\n\n\n\t^ Markley, F. Landis; Crassidis, John L. (2014), \"Estimation of Dynamic Systems: Applications\", Fundamentals of Spacecraft Attitude Determination and Control, Springer New York, pp. 451–512, ISBN 9781493908011, retrieved 2019-08-21\n\n\n\t^ Crassidis, John L.; Markley, F. Landis (23 May 2012). \"Unscented Filtering for Spacecraft Attitude Estimation\". Journal of Guidance, Control and Dynamics. 26: 536.\n\n\n\t^ \"Investigation of Pulsed Plasma Thrusters for Spacecraft Attitude Control\" (PDF). Erps.spacegrant.org. Retrieved 2013-09-09.\n\n\n\t^ Attitude and Determination Control Systems for the OUFTI nanosatellites. Vincent Francois-Lavet (2010-05-31)\n\n\n\n\n\n\tAuthority control \t\n\tNDL: 00575354\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Attitude_control&oldid=917006014#Types_of_stabilization\"\n\n\t\t\n\t\tCategories: \tSpacecraft attitude control\n\tAstrodynamics\n\tOrbits\n\tSpaceflight concepts\n\n\nHidden categories: \tArticles needing additional references from May 2013\n\tAll articles needing additional references\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from January 2014\n\tArticles with unsourced statements from December 2011\n\tArticles with unsourced statements from January 2011\n\tArticles with unsourced statements from September 2015\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tEesti\n\tEspañol\n\tفارسی\n\tFrançais\n\tBahasa Indonesia\n\tItaliano\n\tLatviešu\n\t日本語\n\tPortuguês\n\tРусский\n\tУкраїнська\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 21 September 2019, at 20:26 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "12", "dc:title": "Attitude control - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-3-axis_stabilized_spacecraft", "title": "Attitude control - Wikipedia"}}