{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdvanced Extremely High Frequency - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tAdvanced Extremely High Frequency\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tAdvanced Extremely High Frequency\tArtist's impression of an AEHF satellite\n\n\t\n\tManufacturer\tLockheed Martin\nNorthrop Grumman\n\tCountry of origin\tUnited States\n\tOperator\tUS Air Force\n\tApplications\tMilitary communications\n\t\n\n\t\n\tSpecifications\n\tBus\tA2100M\n\tDesign life\t14 years\n\tLaunch mass\t6,168 kg (13,598 lb)\n\tRegime\tGeosynchronous\n\t\n\n\tDimensions\n\t\n\tProduction\n\tStatus\tIn production\nActive\n\tBuilt\t4[1]\n\tOn order\t2[2]\n\tLaunched\t4[2]\n\tOperational\t3[2]\n\tMaiden launch\tUSA-214, 2010-08-14\n\t\n\n\n\nAdvanced Extremely High Frequency (AEHF) is a series of communications satellites operated by the United States Air Force Space Command. They will be used to relay secure communications for the Armed Forces of the United States, the British Armed Forces, the Canadian Armed Forces, the Royal Netherlands Armed Forces and the Australian Defence Force.[3] The system will consist of six satellites in geostationary orbits, five of which have been launched. AEHF is backward compatible with, and will replace, the older Milstar system and will operate at 44 GHz Uplink (EHF band) and 20 GHz Downlink (SHF band). AEHF systems is a joint service communications system that will provide survivable, global, secure, protected, and jam-resistant communications for high-priority military ground, sea and air assets. It is the follow-on to the Milstar system. AEHF systems' uplinks and crosslinks will operate in the extremely high frequency (EHF) range and downlinks in the super high frequency (SHF) range.[4]\n\nAEHF satellites use many narrow spot beams directed towards the Earth to relay communications to and from users. Crosslinks between the satellites allow them to relay communications directly rather than via a ground station. The satellites are designed to provide jam-resistant communications with a low probability of interception. They incorporate frequency-hopping radio technology, as well as phased array antennas that can adapt their radiation patterns in order to block out potential sources of jamming.\n\nAEHF incorporates the existing Milstar low data-rate and medium data-rate signals, providing 75–2400 bit/s and 4.8 kbit/sec–1.544 Mbit/s respectively. It also incorporates a new signal, allowing data rates of up to 8.192 Mbit/s.[5] When complete, the space segment of the AEHF system will consist of six satellites, which will provide coverage of the surface of the Earth between latitudes of 65 degrees north and 65 degrees south.[6][7] For northern polar regions, the Enhanced Polar System acts as an adjunct to AEHF to provide EHF coverage.[8]\n\nThe initial contract for the design and development of the AEHF satellites was awarded to Lockheed Martin Space Systems and Northrop Grumman Space Technology in November 2001, and covered the System Development and Demonstration phase of the program. The contract covered the construction and launch [9] of three satellites, and the construction of a mission control segment. The contract was managed by the MILSATCOM Program Office of the United States Air Force Space and Missile Systems Center. Like the Milstar system, AEHF will be operated by the 4th Space Operations Squadron, located  at Schriever Air Force Base.\n\nIt extends the  \"cross-links\" among AEHF of earlier MILSTAR satellites, which makes it much less vulnerable to attacks on ground stations. As a geosynchronous satellite over the Equator, it still needs to be supplemented, with additional systems optimized for polar coverage in high latitudes.\n\nIn the April 2009 Defense Department budget request, Secretary of Defense Robert Gates said he planned to cancel the Transformational Satellite Communications System, still in the design phase, in favor of additional AEHF capacity.  Individual AEHF satellites, exclusive of launch expenses, cost US$850 million.\n\n\nContents\n\n\n\t1 Bands\n\t2 Launch and positioning\n\t3 Electronics\n\t4 Services\n\t5 Satellites\n\t5.1 AEHF-1 (USA-214)\n\t5.1.1 Successful launch\n\t5.1.2 Failure of the kick motor, and recovery using the Hall-effect thrusters\n\n\n\n\t5.2 AEHF-2 (USA-235)\n\t5.3 AEHF-3 (USA-246)\n\t5.4 AEHF-4 (USA 288)\n\t5.5 AEHF-5 (USA-292)\n\t5.6 AEHF-6\n\n\n\n\t6 See also\n\t7 References\n\t8 External links\n\n\n\n\n\nBands[edit]\n\nPrior to the AEHF, U.S. and allied military satellite communications systems fell into one of three categories:[10]\n\n\n\tWideband:  maximum bandwidth among fixed and semifixed earth stations\n\tProtected: survivable against electronic warfare and other attacks, even if bandwidth is sacrificed\n\tNarrowband: principally for tactical use, sacrificing bandwidth for simplicity, reliability, and light weight of  terrestrial equipment.\n\n\nAEHF, however, converges the role of its wideband Defense Satellite Communications System and protected MILSTAR predecessors, while increasing bandwidth over both. There will still need to be specialized satellite communications for extremely high data rate space sensors, such as geospatial and signals intelligence satellites, but their downlinked data will typically go to a specialized receiver and be processed into smaller amounts;  the processed data will flow through AEHF.\n\n\nLaunch and positioning[edit]\n\nAEHF satellites are sent into space using an Evolved Expendable Launch Vehicle (EELV). The payload weight at launch is approximately 14,500 pounds (6,600 kg); by the time it expends propellants to achieve proper orbit, its weight is approximately 9,000 pounds (4,100 kg). The satellites will operate in geosynchronous earth orbit (GEO) orbit; it takes over 100 days for the orbital adjustments to reach its stable geo-position after launch.\n\n\nElectronics[edit]\n\nUplinks and crosslinks are in the extremely high frequency (EHF) while the  downlinks use the super high frequency (SHF). The variety of frequencies used, as well as the desire to have tightly focused downlinks for security, require a range of antennas, seen in the picture:\n\n\n\t2 SHF downlink phased arrays\n\t2 satellite-to-satellite crosslinks\n\t2 uplink/downlink nulling antennas\n\t1 uplink EHF phased array\n\t6 uplink/downlink gimbaled dish antenna\n\t1 uplink/downlink earth coverage horns\n\n\nPhased array technology is new in communications satellites, but increases reliability by removing the mechanical movement required for gimbaled, motor-driven antennas.\n\nThe low gain earth coverage antennas send information anywhere in the third of the earth covered by each satellite's footprint. Phased array antennas provide super high-gain earth coverages, enabling worldwide unscheduled access for all users, including small portable terminals and submarines. The six medium resolution coverage antennas (MRCA), are highly directional \"spot\" coverage; they can be time-shared to cover up to 24 targets. The two  high resolution coverage area antennas enable operations in the presence of in-beam jamming; the nulling antennas are part of the electronic defense that helps discriminate true signals from electronic attack.[11]\n\nAnother change from existing satellites is using solid-state  transmitters rather than the traveling wave tubes used in most high-power military SHF/EHF applications. TWTs have a fixed power output; the newer devices allow varying the transmitted power, both for lowering the probability of intercept and for overall power efficiency.\n\n\nServices[edit]\n\nAEHF provides individual digital data streams from rates of 75 bit/s to approximately 8 Mbit/s. These include and go beyond MILSTAR's low data rate (LDR) and medium data rate (MDR) as well as the actually fairly slow high data rate (HDR) for submarines. The faster links are designated extended data rates (XDR).\n\nWhile there are a number of ground terminals, the airborne terminal has been part of the  Family of Advanced Beyond Line-of-Sight-Terminal (FAB-T) project. Other ground stations include the Single-Channel Antijam Man-Portable Terminal (SCAMP), Secure Mobile Antijam Reliable Tactical Terminal (SMART-T), and Submarine High Data Rate (Sub HDR) system.\n\nWith Boeing as the prime contractor and L-3 Communications and Rockwell as major subcontractors, the first FAB-T (Increment 1)was delivered, for use on the B-2 Spirit aircraft, in February 2009. It is planned for other aircraft including the  B-52, RC-135, E-4, and E-6 aircraft. Other installations will go into fixed and transportable command posts. It successfully interoperated with legacy communications using an command post terminal and the Army Single Channel Anti-jam ManPortable Terminal,[12]\n\n\nSatellites[edit]\n\nAEHF-1 (USA-214)[edit]\n\nMain article: USA-214\n\nThe first satellite, USA-214, was successfully launched by an Atlas V 531 rocket on 14 August 2010, from Space Launch Complex 41 at the Cape Canaveral Air Force Station. This occurred four years behind schedule; when the contract was awarded in 2000 the first launch was expected to have taken place in 2006.[citation needed]  The program was restructured in October 2004, when the National Security Agency did not deliver key cryptographic equipment to the payload contractor in time to meet the launch schedule.[13]\n\n\nSuccessful launch[edit]\n\nThe Atlas V launch vehicle successfully placed the satellite into a supersynchronous-apogee transfer orbit with 50,000 km (31,060 mile) apogee, 275 kilometer (170 mile) perigee, 22.1° inclination,[14]\n\n\nFailure of the kick motor, and recovery using the Hall-effect thrusters[edit]\n\nThe satellite vehicle's Liquid Apogee Engine (LAE) provided by IHI failed to raise the orbit after two attempts.[15] To solve the problem, the perigee altitude was raised to 4700 km (2900 miles) with twelve firings of the smaller Aerojet-provided Reaction Engine Assembly thrusters, originally intended for attitude control during the LAE engine burns.[14]  From this altitude, the solar arrays were deployed and the orbit was raised toward the operational orbit over the course of nine months using the 0.27 Newton Hall thrusters, also provided by Aerojet, a form of electric propulsion which is highly efficient, but low thrust. This took much longer than initially intended due to the lower starting altitude for the HCT maneuvers. This led to program delays, as the second and third satellite vehicle LAEs were analyzed.  The investigation into the propulsion anomaly[16] has been completed (but not publicly released as of June 2011[update])[needs update] and the remaining satellites were declared flight ready.[17]\n\nA Government Accounting Office report released in July 2011 stated that the blocked fuel line in the Liquid Apogee Engine was most likely caused by a piece of cloth inadvertently left in the line during the manufacturing process.[18]\n\n\nAEHF-2 (USA-235)[edit]\n\nLike the first AEHF satellite, the second (AEHF-2) was launched on an Atlas V flying in the 531 configuration. The launch from Space Launch Complex 41 at Cape Canaveral took place on 4 May 2012.[19] After three months of maneuvering, it reached its proper position and the testing procedures were started. Completion of checkout of AEHF-2 was announced on 14 Nov. 2012 and control turned over to the 14th Air Force for operations for an expected 14-year service life through 2026.[20]\n\n\nAEHF-3 (USA-246)[edit]\n\nThe third AEHF satellite was launched from Cape Canaveral on 18 September 2013 at 4:10 a.m. EDT.[21] \nThe two-hour window to launch the satellite opened at 3:04 a.m. EDT[22]\nand the launch occurred as soon as weather-related clouds and high-altitude winds cleared sufficiently to meet the launch criteria.[21]\n\n\nAEHF-4 (USA 288)[edit]\n\nThe fourth AEHF satellite was launched on 17 October 2018 from Cape Canaveral at 12:15 AM EDT using the United Launch Alliance Atlas 5 rocket.[23]\n\n\nAEHF-5 (USA-292)[edit]\n\nThe fifth AEHF satellite was launched August 8, 2019 from Cape Canaveral at 6:13 AM EDT using the United Launch Alliance Atlas 5 rocket.[24].\n\n\nAEHF-6[edit]\n\nThe sixth AEHF satellite is projected for launch in 2019.[25]\n\n\nSee also[edit]\n\n\tWideband Global SATCOM system (WGS)\n\n\nReferences[edit]\n\nAs of this edit, this article uses content from \"Advanced Extremely High Frequency (satellite)\", which is licensed in a way that permits reuse under the Creative Commons Attribution-ShareAlike 3.0 Unported License, but not under the GFDL. All relevant terms must be followed.\n\n\n\n\t^ Ray, Justin (August 2, 2017). \"Two U.S. military satellite launches delayed into next year\". Spaceflight Now. Spaceflight Now Inc. Retrieved January 4, 2018.\n\n\t^ a b c \"AEHF Achieves Initial Operational Capability\". Los Angeles Air Force Base. U.S. Air Force. July 30, 2015. Retrieved January 4, 2018.\n\n\n\t^ \"AEHF-5 Ready for Launch\". Los Angeles Air Force Base. Retrieved 2019-08-12.\n\n\n\t^ \"Northrup Grumman AEHF\". Retrieved 2011-06-15.\n\n\n\t^ \"Northrop Grumman\". Archived from the original on 2010-03-23. Retrieved 2009-11-11.\n\n\n\t^ White, Andrew. \"USMC eyes improved Arctic communications systems, procedures\". Jane's Information Group. Moreover, Capt Hill warned that US Air Force Space Command's Advanced Extremely High Frequency (AEHF) satcom constellation can be ineffective above the 65th Parallel North[...]\n\n\n\t^ \"Lockheed Martin\". Archived from the original on 11 October 2007. Retrieved 2007-09-12.\n\n\n\t^ http://www.northropgrumman.com/Capabilities/EnhancedPolarSystem/Pages/default.aspx\n\n\t^ Lorell, Mike (January 2015). \"Extreme Cost Growth Themes from Six US Air Force Major Defense Acquisition Programs\". ResearchGate. Retrieved April 7, 2019.\n\n\n\t^ Elfers G, Miller SB (Winter 2002), \"Future U.S. Military Satellite Communication Systems\", Aerospace Corporation Crosslink, archived from the original on 2012-01-20, retrieved 2018-08-17\n\n\n\t^ Robinson CA Jr. (July 2005), \"Agile Antennas Aid Warriors\", AFCEA Signal\n\n\n\t^ \"B-2 Bomber Receives First FAB-T Satellite Communication Terminal\", Deagel, February 2, 2009\n\n\n\t^ GAO-07-406SP Defense Acquisitions: Assessments of Selected Weapon Programs, United States Government Accountability Office, March 30, 2007\n\n\n\t^ a b Justin Ray, SPACEFLIGHT NOW, \"Air Force satellite's epic ascent should finish soon\". October 9, 2011  (accessed Dec. 14 2011)\n\n\t^ \"Main engine probably not to blame for AEHF 1 trouble\". Archived from the original on 23 October 2010. Retrieved 2010-10-19.\n\n\n\t^ Justin Ray, SPACEFLIGHT NOW, \"Investigators probing what went wrong with AEHF 1\", Sept. 2, 2010 (accessed Dec. 14, 2011)\n\n\t^ \"Air Force recoups costs to save stranded AEHF satellite\". Retrieved 2011-06-15.\n\n\n\t^ \"Spaceflight Now | Atlas Launch Report | Air Force satellite's epic ascent should finish soon\". spaceflightnow.com. Retrieved 2019-04-07.\n\n\n\t^ \"Spaceflightnow Mission Status Center\". Archived from the original on 2012-05-02. Retrieved 2012-05-02.\n\n\n\t^ \"Spaceflightnow Mission Status Center\". Retrieved 2012-11-28.\n\n\n\t^ a b \nHalvorsen, Todd (2013-09-18). \"Atlas V roars to life with Air Force satellite onboard\". Florida Today. Retrieved 2013-09-18.\n\n\n\t^ Atlas V to Launch AEHF-3 Archived October 2, 2013, at the Wayback Machine, United Launch Alliance, accessed 2013-09-17.\n\n\t^ https://ml-fd.caf-fac.ca/en/2018/11/21999\n\n\t^ ULA. \"Atlas V AEHF-5 United Launch Alliance\". ULA. Retrieved June 10, 2019.\n\n\n\t^ \"USAF's sixth AEHF satellite to feature 3D printed part\". Air Force Technology. Kable Intelligence Limited. April 6, 2017. Retrieved January 4, 2018.\n\n\n\n\n\nExternal links[edit]\n\n\tAEHF-1 Launch. SLC-41, CCAFS, 14 Aug 2010 @ 7:07 am EDT\n\tAEHF-2 Launch. SLC-41, CCAFS, 04 May 2012 @ 2:42 pm EDT\n\tAEHF-3 Launch. SLC-41, CCAFS, 18 Sept 2013 @ 4:10 am EDT\n\n\n\t\tv\n\tt\n\te\n\n\n1962–present United States Air Force space vehicle designations\n\n\tSLV series\t\n\tSLV-1\n\tSLV-2\n\tSLV-3\n\tSLV-4\n\tSLV-5\n\n\n\n\n\tSB series\t\n\tSB-1\n\tSB-2\n\tSB-3\n\tSB-4\n\tSB-5\n\tSB-6\n\tSSB-7\n\tSSB-8\n\tSSB-9\n\tSSB-10\n\tASB-11\n\n\n\n\n\tSatellites\t\n\tWS-1\n\tWS-2\n\tLS-3\n\tES-4\n\tES-5\n\tLS-6\n\tNS-7\n\tES-8\n\tLS-9\n\tLS-10 (I)\n\tXSS-10 (II)\n\tXSS-112\n\tXSS-12\n\tS-131\n\tES-14\n\tLS-153\n\tLS-163\n\tES-17\n\n\n\n\n\t\n\t1 Not assigned\n\t2 Unofficial designation\n\t3 Designation believed to be this type but unconfirmed\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Advanced_Extremely_High_Frequency&oldid=918407883\"\n\n\t\t\n\t\tCategories: \tMilitary communications\n\tCommunications satellites\n\tCommunications satellite constellations\n\tMilitary satellites\n\tTelecommunications equipment\n\tMilitary space program of the United States\n\tSatellites using the A2100 bus\n\n\nHidden categories: \tWebarchive template wayback links\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from August 2010\n\tArticles containing potentially dated statements from June 2011\n\tAll articles containing potentially dated statements\n\tWikipedia articles in need of updating from September 2013\n\tAll Wikipedia articles in need of updating\n\tArticles with imported Creative Commons Attribution-ShareAlike 3.0 text\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tDeutsch\n\tFrançais\n\tHrvatski\n\tItaliano\n\tLatviešu\n\t日本語\n\tРусский\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 28 September 2019, at 14:24 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "7", "dc:title": "Advanced Extremely High Frequency - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/1/18/AEHF_1.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-advanced_extremely_high_frequency", "title": "Advanced Extremely High Frequency - Wikipedia"}}