{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAerospace - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tAerospace\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tNot to be confused with Airspace.\n\nFor the corporation, see The Aerospace Corporation.\n\n  \nA view of the Earth's atmosphere with the Moon beyond\n\n\n\nAerospace is the human effort in science, engineering, and business to fly in the atmosphere of Earth (aeronautics) and surrounding space (astronautics). Aerospace organizations research, design, manufacture, operate, or maintain aircraft or spacecraft. Aerospace activity is very diverse, with a multitude of commercial, industrial and military applications.\n\nAerospace is not the same as airspace, which is the physical air space directly above a location on the ground. The beginning of space and the ending of the air is considered as 100 km above the ground according to the physical explanation that the air pressure is too low for a lifting body to generate meaningful lift force without exceeding orbital velocity.[1]\n\n\nContents\n\n\n\t1 Overview\n\t2 History\n\t3 Manufacturing\n\t4 Technology\n\t5 Functional safety\n\t6 Spinoffs\n\t7 See also\n\t8 References\n\t9 External links\n\n\n\n\n\nOverview[edit]\n\nIn most industrial countries, the aerospace industry is a cooperation of public and private industries. For example, several countries have a civilian space program funded by the government through tax collection, such as National Aeronautics and Space Administration in the United States, European Space Agency in Europe, the Canadian Space Agency in Canada, Indian Space Research Organisation in India, Japanese Aeronautics Exploration Agency in Japan, RKA in Russia, China National Space Administration in China, SUPARCO in Pakistan, Iranian Space Agency in Iran, and Korea Aerospace Research Institute (KARI) in South Korea.\n\nAlong with these public space programs, many companies produce technical tools and components such as spaceships and satellites. Some known companies involved in space programs include Boeing, Cobham, Airbus, SpaceX,  Lockheed Martin, United Technologies, MacDonald Dettwiler and Northrop Grumman. These companies are also involved in other areas of aerospace such as the construction of aircraft.\n\n\nHistory[edit]\n\nMain articles: History of aviation and Timeline of space exploration\n\nModern aerospace began with Engineer George Cayley in 1799. Cayley proposed an aircraft with a \"fixed wing and a horizontal and vertical tail,\" defining characteristics of the modern airplane.[2]\n\nThe 19th century saw the creation of the Aeronautical Society of Great Britain (1866), the American Rocketry Society, and the Institute of Aeronautical Sciences, all of which made aeronautics a more serious scientific discipline.[2] Airmen like Otto Lilienthal, who introduced cambered airfoils in 1891, used gliders to analyze aerodynamic forces.[2] The Wright brothers were interested in Lilienthal's work and read several of his publications.[2] They also found inspiration in Octave Chanute, an airman and the author of Progress in Flying Machines (1894).[2] It was the preliminary work of Cayley, Lilienthal, Chanute, and other early aerospace engineers that brought about the first powered sustained flight at Kitty Hawk, North Carolina on December 17, 1903, by the Wright brothers.\n\nWar and science fiction inspired great minds like Konstantin Tsiolkovsky and Wernher von Braun to achieve flight beyond the atmosphere.\n\nThe launch of Sputnik 1 in October 1957 started the Space Age, and on July 20, 1969 Apollo 11 achieved the first manned moon landing.[2] In April 1981, the Space Shuttle Columbia launched, the start of regular manned access to orbital space. A sustained human presence in orbital space started with \"Mir\" in 1986 and is continued by the \"International Space Station\".[2] Space commercialization and space tourism are more recent features of aerospace.\n\n\nManufacturing[edit]\n\nMain article: Aerospace manufacturer\n\nAerospace manufacturing is a high-technology industry that produces \"aircraft, guided missiles, space vehicles, aircraft engines, propulsion units, and related parts\".[3] Most of the industry is geared toward governmental work.  For each original equipment manufacturer (OEM), the US government has assigned a Commercial and Government Entity (CAGE) code. These codes help to identify each manufacturer, repair facilities, and other critical aftermarket vendors in the aerospace industry.\n\nIn the United States, the Department of Defense and the National Aeronautics and Space Administration (NASA) are the two largest consumers of aerospace technology and products. Others include the very large airline industry. The aerospace industry employed 472,000 wage and salary workers in 2006.[4] Most of those jobs were in Washington state and in California, with Missouri, New York and Texas also being important. The leading aerospace manufacturers in the U.S. are Boeing, United Technologies Corporation, SpaceX, Northrop Grumman and Lockheed Martin. These manufacturers are facing an increasing labor shortage as skilled U.S. workers age and retire. Apprenticeship programs such as the Aerospace Joint Apprenticeship Council (AJAC) work in collaboration with Washington state aerospace employers and community colleges to train new manufacturing employees to keep the industry supplied.\n\nImportant locations of the civilian aerospace industry worldwide include Washington state (Boeing), California (Boeing, Lockheed Martin, etc.); Montreal, Quebec, Canada (Bombardier, Pratt & Whitney Canada); Toulouse, France (Airbus/EADS);  Hamburg, Germany (Airbus/EADS); and São José dos Campos, Brazil (Embraer),  Querétaro, Mexico (Bombardier Aerospace, General Electric Aviation) and Mexicali, Mexico (United Technologies Corporation, Gulfstream Aerospace).\n\nIn the European Union, aerospace companies such as EADS, BAE Systems, Thales, Dassault, Saab AB and Leonardo S.p.A. (formerly Finmeccnica)[5] account for a large share of the global aerospace industry and research effort, with the European Space Agency as one of the largest consumers of aerospace technology and products.\n\nIn India, Bangalore is a major center of the aerospace industry, where Hindustan Aeronautics Limited, the National Aerospace Laboratories and the Indian Space Research Organisation are headquartered. The Indian Space Research Organisation (ISRO) launched India's first Moon orbiter, Chandrayaan-1, in October 2008.\n\nIn Russia, large aerospace companies like Oboronprom and the United Aircraft Building Corporation (encompassing Mikoyan, Sukhoi, Ilyushin, Tupolev, Yakovlev, and Irkut which includes Beriev) are among the major global players in this industry. The historic Soviet Union was also the home of a major aerospace industry.\n\nThe United Kingdom formerly attempted to maintain its own large aerospace industry, making its own airliners and warplanes, but it has largely turned its lot over to cooperative efforts with continental companies, and it has turned into a large import customer, too, from countries such as the United States. However, the UK has a very active aerospace sector, including the second largest defence contractor in the world, BAE Systems, supplying fully assembled aircraft, aircraft components, sub-assemblies and sub-systems to other manufacturers, both in Europe and all over the world.\n\nCanada has formerly manufactured some of its own designs for jet warplanes, etc. (e.g. the CF-100 fighter), but for some decades, it has relied on imports from the United States and Europe to fill these needs. However Canada still manufactures some military aircraft although they are generally not combat capable. Another notable example was the late 1950s development of the Avro Canada CF-105 Arrow, a supersonic fighter-interceptor that was  cancelled in 1959 a highly controversial decision.\n\nFrance has continued to make its own warplanes for its air force and navy, and Sweden continues to make its own warplanes for the Swedish Air Force—especially in support of its position as a neutral country. (See Saab AB.) Other European countries either team up in making fighters (such as the Panavia Tornado and the Eurofighter Typhoon), or else to import them from the United States.\n\nPakistan has a developing aerospace engineering industry. The National Engineering and Scientific Commission, Khan Research Laboratories and Pakistan Aeronautical Complex are among the premier organizations involved in research and development in this sector. Pakistan has the capability of designing and manufacturing guided rockets, missiles and space vehicles. The city of Kamra is home to the Pakistan Aeronautical Complex which contains several factories. This facility is responsible for manufacturing the MFI-17, MFI-395, K-8 and JF-17 Thunder aircraft. Pakistan also has the capability to design and manufacture both armed and unarmed unmanned aerial vehicles.\n\nIn the People's Republic of China, Beijing, Xi'an, Chengdu, Shanghai, Shenyang and Nanchang are major research and manufacture centers of the aerospace industry. China has developed an extensive capability to design, test and produce military aircraft, missiles and space vehicles. Despite the cancellation in 1983 of the experimental Shanghai Y-10, China is still developing its civil aerospace industry.\n\nThe aircraft parts industry was born out of the sale of second-hand or used aircraft parts from the aerospace manufacture sector.  Within the United States there is a specific process that parts brokers or resellers must follow.  This includes leveraging a certified repair station to overhaul and \"tag\" a part.  This certification guarantees that a part was repaired or overhauled to meet OEM specifications.  Once a part is overhauled its value is determined from the supply and demand of the aerospace market.  When an airline has an aircraft on the ground, the part that the airline requires to get the plane back into service becomes invaluable.  This can drive the market for specific parts.  There are several online marketplaces that assist with the commodity selling of aircraft parts.\n\nIn the aerospaces & defense industry, a lot of consolidation has appeared over the last couple of decades. Between 1988 and 2011, worldwide more than 6,068 mergers & acquisitions with a total known value of 678 bil. USD have been announced.[6] The largest transactions have been:\n\n\n\tThe acquisition of Rockwell Collins by United Technologies Corporation for 30.0 bil. USD in 2018\n\tThe acquisition of Goodrich Corporation by United Technologies Corporation for 16.2 bil. USD in 2011[7]\n\tAllied Signal merged with Honeywell in a stock swap valued 15.6 bil. USD in 1999[8]\n\tThe merger of Boeing with McDonnell valued at 13.4 bil. USD in 1996[9]\n\tMarconi Electronic Systems, a subsidiary of GEC, was acquired by British Aerospace for 12.9 bil. USD in 1999[10] (now called: BAE Systems)\n\tRaytheon acquired Hughes Aircraft for 9.5 bil. USD in 1997\n\n\nTechnology[edit]\n\nMultiple technologies and innovations are used in aerospace, many of them pioneered around World War II:[11]\n\n\n\tpatented by Short Brothers,  folding wings optimise aircraft carrier storage from a simple fold to the entire rotating wing of the V-22, and the 12 ft (3.7 m) wingtip fold of the Boeing 777X for airport compatibility.\n\tTo improve low-speed performance, a de Havilland DH4 was modified by Handley Page to a monoplane with high-lift devices: full-span leading-edge slats and trailing-edge flaps; in 1924, Fowler flaps that extend backward and downward were invented in the US, and used on the Lockheed Model 10 Electra while in 1943 forward-hinged leading-edge Krueger flaps were invented in Germany and later used on the Boeing 707.\n\tThe 1927 large Propeller Research Tunnel at NACA Langley confirmed that the landing gear was a major source of drag, in 1930 the Boeing Monomail featured a retractable gear.\n\tThe flush rivet displaced the domed rivet in the 1930s and pneumatic rivet guns work in combination with a heavy reaction bucking bar; not depending on plastic deformation, specialist rivets were developed to improve fatigue life as shear fasteners like the Hi-Lok, threaded pins tightened until a collar breaks off with enough torque.\n\tFirst flown in 1935, the Queen Bee was a radio-controlled target drone derived from the Tiger Moth for Flak training; the Ryan Firebee was a jet-powered target drone developed into long-range reconnaissance UAVs: the Ryan Model 147 Fire Fly and Lightning Bug; the Israeli IAI Scout and Tadiran Mastiff launched a line of battlefield UAVs including the IAI Searcher; developed from the General Atomics GNAT long-endurance UAV for the CIA, the MQ-1 Predator led to the armed MQ-9 Reaper.\n\tAt the end of World War I, piston engine power could be boosted by compressing intake air with a compressor, also compensating for decreasing air density with altitude, improved with 1930s turbochargers for the Boeing B-17  and the first pressurized airliners.\n\tThe 1937 Hindenburg disaster ended the era of passenger airships but the US Navy used airships for anti-submarine warfare and airborne early warning into the 1960s, while small airships continue to be used for aerial advertising, sightseeing flights, surveillance and research, and the Airlander 10 or the Lockheed Martin LMH-1 continue to be developed.\n\tAs US airlines were interested in high-altitude flying in the mid-1930s, the Lockheed XC-35 with a pressurized cabin was tested in 1937 and the Boeing 307 Stratoliner was developed as the first pressurized airliner.\n\tIn 1933, Plexiglas, a transparent Acrylic plastic, was introduced in Germany and shortly before World War II, was first used for aircraft windshields as it is lighter than glass, and the bubble canopy improved fighter pilots visibility.\n\tIn January 1930, Royal Air Force pilot and engineer Frank Whittle filed a patent for a gas turbine aircraft engine with an inlet, compressor, combustor, turbine and nozzle, while an independent turbojet was developed by researcher Hans von Ohain in Germany; both engines ran within weeks in early 1937 and the Heinkel HeS 3-propelled Heinkel He 178 experimental aircraft made its first flight on Aug 27, 1939 while the Whittle W.1-powered Gloster E.28/39 prototype flew on May 15, 1941.\n\tIn 1935, Britain demonstrated aircraft radio detection and ranging and in 1940 the RAF introduced the first VHF airborne radars on Bristol Blenheims, then higher-resolution microwave-frequency radar with a cavity magnetron on Bristol Beaufighters in 1941, and in 1959 the radar-homing Hughes AIM-4 Falcon became the first US guided missile on the Convair F-106.\n\tIn the early 1940s, British Hurricane and Spitfire pilots wore g-suits to prevent G-LOC due to blood pooling in the lower body in high g situations; Mayo Clinic researchers developed air-filled bladders to replace water-filled bladders and in 1943 the US military began using pressure suits from the David Clark Company.\n\tThe modern ejection seat was developed during World War II, a seat on rails ejected by rockets before deploying a parachute, which could have been enhanced by the USAF in the late 1960s as a turbojet-powered autogyro with 50 nm of range, the Kaman KSA-100 SAVER.\n\tIn 1942, numerical control machining was conceived by machinist John T. Parsons to cut complex structures from solid blocks of alloy, rather than assembling them, improving quality, reducing weight, and saving time and cost to produce bulkheads or wing skins.\n\tIn World War II, the German V-2 combined gyroscopes, an accelerometer and a primitive computer for real-time inertial navigation allowing dead reckoning without reference to landmarks or guide stars, leading to packaged IMUs for spacecraft and aircraft.\n\tThe UK Miles M.52 supersonic aircraft was to have an afterburner, augmenting a turbojet thrust by burning additional fuel in the nozzle, but was cancelled in 1946.\n\tIn 1935, German aerodynamicist Adolf Busemann proposed using swept wings to reduce high-speed drag and the Messerschmitt P.1101 fighter prototype was 80% complete by the end of World War II; the later US North American F-86 and Boeing B-47 flew in 1947, as the Soviet MiG-15, and the British de Havilland Comet in 1949.\n\tIn 1951, the Avro Jetliner featured an ice protection system from Goodyear through electro-thermal resistances in the wing and tail leading edges; jet aircraft use hot engine bleed air and lighter aircraft use pneumatic deicing boots or weep anti-icing fluid on propellers, wing and tail leading edges.\n\tIn 1954, Bell Labs developed the first transistorized airborne digital computer, Tradic for the US Boeing B-52 and in the 1960s Raytheon built the MIT-developed Apollo Guidance Computer; the MIL-STD-1553 avionics digital bus was defined in 1973 then first used in the General Dynamics F-16, while the civil ARINC 429 was first used in the Boeing 757/B767 and Airbus A310 in the early 1980s.\n\tAfter World War II, the initial promoter of Photovoltaic power for spacecraft, Hans K. Ziegler, was brought to the US under Operation Paperclip along Wernher von Braun and Vanguard 1 was its first application in 1958, later enhanced in space-deployable structures like the International Space Station solar arrays of 0.33 hectares (0.82 acres).\n\tTo board an airliner, jet bridges  are more accessible, comfortable and efficient than climbing the stairs.\n\tIn the 1950s, to improve thrust and fuel efficiency, the jet engine airflow was divided into a core stream and a bypass stream with a lower velocity for better propulsive efficiency: the first was the Rolls-Royce Conway with a 0.3 BPR on the Boeing 707 in 1960, followed by the Pratt & Whitney JT3D with a 1.5 BPR and, derived from the J79, the General Electric CJ805 powered the Convair 990 with a 28%  lower cruise fuel burn; bypass ratio improved to the 9.3 BPR Rolls-Royce Trent XWB, the 10:1 BPR GE9X and the Pratt & Whitney GTF with high-pressure ratio cores.\n\n\nFunctional safety[edit]\n\nFunctional safety relates to a part of the general safety of a system or a piece of equipment. It implies that the system or equipment can be operated properly and without causing any danger, risk, damage or injury.\n\nFunctional safety is crucial in the aerospace industry, which allows no compromises or negligence. In this respect, supervisory bodies, such as the European Aviation Safety Agency (EASA\n),[12] regulate the aerospace market with strict certification standards. This is meant to reach and ensure the highest possible level of safety. The standards AS 9100 in America, EN 9100 on the European market or JISQ 9100 in Asia particularly address the aerospace and aviation industry. These are standards applying to the functional safety of aerospace vehicles. Some companies are therefore specialized in the certification, inspection verification and testing of the vehicles and spare parts to ensure and attest compliance with the appropriate regulations.\n\n\nSpinoffs[edit]\n\nSpinoffs refer to any technology that is a direct result of coding or products created by NASA and redesigned for an alternate purpose.[13] These technological advancements are one of the primary results of the aerospace industry, with $5.2 billion worth of revenue generated by spinoff technology, including computers and cellular devices.[13] These spinoffs have applications in a variety of different fields including medicine, transportation, energy, consumer goods, public safety and more.[13] NASA publishes an annual report called “Spinoffs”, regarding many of the specific products and benefits to the aforementioned areas in an effort to highlight some of the ways funding is put to use.[14] For example, in the most recent edition of this publication, “Spinoffs 2015”, endoscopes are featured as one of the medical derivations of aerospace achievement.[13] This device enables more precise and subsequently cost-effective neurosurgery by reducing complications through a minimally invasive procedure that abbreviates hospitalization.[13]\n\n\nSee also[edit]\n\nMain article: Outline of aerospace\n\n\tAerodynamics\n\tAeronautics\n\tAerospace engineering\n\tAircraft\n\tAstronautics\n\tNewSpace\n\tSpace agencies (List of)\n\tSpace exploration\n\tSpacecraft\n\tWiktionary: Aviation, aerospace, and aeronautical terms\n\n\nReferences[edit]\n\n\n\t^ \"Where does space begin? - Aerospace Engineering, Aviation News, Salary, Jobs and Museums\". Aerospace Engineering, Aviation News, Salary, Jobs and Museums. Archived from the original on 2015-11-17. Retrieved 2015-11-10.\n\n\t^ a b c d e f g Jr, John D. Anderson (2008). Introduction to flight (6th ed.). Boston: McGraw-Hill. ISBN 978-0-07-352939-4.\n\n\n\t^ \"United States Bureau of Labor Statistics\". Archived from the original on 2013-04-23.\n\n\n\t^ \"U.S. Bureau of Labor Statistics, Aerospace Product and Parts Manufacturing\". Archived from the original on 14 August 2009. Retrieved 2009-07-04.\n\n\n\t^ \"It's Official: Finmeccanica Is Now Leonardo\". Defensenews.\n\n\n\t^ \"Statistics on Mergers & Acquisitions (M&A) - M&A Courses | Company Valuation Courses | Mergers & Acquisitions Courses\". Imaa-institute.org. Archived from the original on 2012-01-06. Retrieved 2013-09-27.\n\n\n\t^ \"United Technologies To Acquire Goodrich Corporation Complements And Strengthens Position In Aerospace And Defense Industry\". UTC. Archived from the original on 2013-10-02. Retrieved 2013-09-27.\n\n\n\t^ \"Allied Signal And Honeywell To Announce Merger Today - New York Times\". Nytimes.com. 1999-06-07. Archived from the original on 2013-10-02. Retrieved 2013-09-27.\n\n\n\t^ [1] Archived June 15, 2013, at the Wayback Machine\n\n\t^ [2] Archived August 25, 2010, at the Wayback Machine\n\n\t^ James R. Asker, John Croft, Guy Norris and Graham Warwick (May 6, 2016). \"Top Technologies: 'Protecting the Pilot' to 'Keeping It Together'\". Aviation Week & Space Technology.CS1 maint: uses authors parameter (link)\n\n\n\t^ \"Archived copy\". Archived from the original on 2013-06-20. Retrieved 2013-06-03.CS1 maint: archived copy as title (link)\n European Aviation Safety Agency\n\n\t^ a b c d e \"Archived copy\" (PDF). Archived (PDF) from the original on 2015-10-16. Retrieved 2015-03-12.CS1 maint: archived copy as title (link)\n\n\n\t^ \"What Are The Benefits Of Space Exploration? - Universe Today\". 26 January 2015. Archived from the original on 21 March 2015.\n\n\n\n\n\nExternal links[edit]\n\n\t\tLook up aerospace in Wiktionary, the free dictionary.\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Aerospace&oldid=916175208\"\n\n\t\t\n\t\tCategories: \tAerospace\n\n\nHidden categories: \tWebarchive template wayback links\n\tCS1 maint: uses authors parameter\n\tCS1 maint: archived copy as title\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tBân-lâm-gú\n\tCatalà\n\tČeština\n\tEspañol\n\tEsperanto\n\tفارسی\n\tFrançais\n\t한국어\n\tहिन्दी\n\tBahasa Indonesia\n\tಕನ್ನಡ\n\t日本語\n\tPortuguês\n\tScots\n\tShqip\n\tTürkçe\n\tاردو\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 17 September 2019, at 13:01 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "7", "dc:title": "Aerospace - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Top_of_Atmosphere.jpg/1200px-Top_of_Atmosphere.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-aerospace", "title": "Aerospace - Wikipedia"}}