{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlpha decay - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tAlpha decay\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nVisual representation of alpha decay\n\n\n\n\tNuclear physics\n\t\n\t\nNucleus ·  Nucleons (p, n) ·  Nuclear matter ·  Nuclear force ·  Nuclear structure ·  Nuclear reaction\n\t\nModels of the nucleus\nLiquid drop ·  Nuclear shell model ·  Interacting boson model ·  Ab initio\n\n\n\t\nNuclides' classification\nIsotopes – equal Z\nIsobars – equal A\nIsotones – equal N\nIsodiaphers – equal N − Z\n     Isomers – equal all the above\nMirror nuclei – Z ↔ N\n\nStable ·  Magic ·  Even/odd ·  Halo\n\n\n\t\nNuclear stability\nBinding energy ·  p–n ratio ·  Drip line ·  Island of stability ·  Valley of stability\n\n\n\t\nRadioactive decay\nAlpha α ·  Beta β (2β, β+) ·  K/L capture ·  Isomeric (Gamma γ ·  Internal conversion) ·  Spontaneous fission ·  Cluster decay ·  Neutron emission ·  Proton emissionDecay energy ·  Decay chain ·  Decay product ·  Radiogenic nuclide\n\n\n\n\t\nNuclear fission\nSpontaneous ·  Products (pair breaking) ·  Photofission\n\n\n\t\nCapturing processes\nelectron (2×) ·  neutron (s ·  r) ·  proton (p ·  rp)\n\n\n\t\nHigh-energy processes\nSpallation (by cosmic ray) ·  Photodisintegration\n\n\n\t\nNucleosynthesis and\n nuclear astrophysics\nNuclear fusion\nProcesses: Stellar ·  Big Bang ·  Supernova\nNuclides: Primordial ·  Cosmogenic ·  Artificial\n\n\n\t\nHigh-energy nuclear physics\nQuark–gluon plasma ·  RHIC ·  LHC\n\n\n\t\nScientists\nAlvarez ·  Becquerel ·  Bethe ·  A. Bohr ·  N. Bohr ·  Chadwick ·  Cockcroft ·  Ir. Curie ·  Fr. Curie ·  Pi. Curie ·  Skłodowska-Curie ·  Davisson ·  Fermi ·  Hahn ·  Jensen ·  Lawrence ·  Mayer ·  Meitner ·  Oliphant ·  Oppenheimer ·  Proca ·  Purcell ·  Rabi ·  Rutherford ·  Soddy ·  Strassmann ·  Świątecki ·  Szilárd ·  Teller ·  Thomson ·  Walton ·  Wigner\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nAlpha decay or α-decay is a type of radioactive decay in which an atomic nucleus emits an alpha particle (helium nucleus) and thereby transforms or 'decays' into a different atomic nucleus, with a mass number that is reduced by four and an atomic number that is reduced by two. An alpha particle is identical to the nucleus of a helium-4 atom, which consists of two protons and two neutrons. It has a charge of +2 e and a mass of 4 u.  For example, uranium-238 decays to form thorium-234. Alpha particles have a charge +2 e, but as a nuclear equation describes a nuclear reaction without considering the electrons – a convention that does not imply that the nuclei necessarily occur in neutral atoms – the charge is not usually shown.\n\nAlpha decay typically occurs in the heaviest nuclides. Theoretically, it can occur only in nuclei somewhat heavier than nickel (element 28), where the overall binding energy per nucleon is no longer a minimum and the nuclides are therefore unstable toward spontaneous fission-type processes. In practice, this mode of decay has only been observed in nuclides considerably heavier than nickel, with the lightest known alpha emitters being the lightest isotopes (mass numbers 104–109) of tellurium (element 52). Exceptionally, however, beryllium-8 decays to two alpha particles.\n\nAlpha decay is by far the most common form of cluster decay, where the parent atom ejects a defined daughter collection of nucleons, leaving another defined product behind. It is the most common form because of the combined extremely high nuclear binding energy and relatively small mass of the alpha particle. Like other cluster decays, alpha decay is fundamentally a quantum tunneling process. Unlike beta decay, it is governed by the interplay between both the nuclear force and the electromagnetic force.\n\nAlpha particles have a typical kinetic energy of 5 MeV (or ≈ 0.13% of their total energy, 110 TJ/kg) and have a speed of about 15,000,000 m/s, or 5% of the speed of light. There is surprisingly small variation around this energy, due to the heavy dependence of the half-life of this process on the energy produced (see equations in the Geiger–Nuttall law). Because of their relatively large mass, electric charge of +2 e and relatively low velocity, alpha particles are very likely to interact with other atoms and lose their energy, and their forward motion can be stopped by a few centimeters of air. Approximately 99% of the helium produced on Earth is the result of the alpha decay of underground deposits of minerals containing uranium or thorium. The helium is brought to the surface as a by-product of natural gas production.\n\n\nContents\n\n\n\t1 History\n\t2 Mechanism\n\t3 Uses\n\t4 Toxicity\n\t5 References\n\t6 Notes\n\t7 External links\n\n\n\n\n\nHistory[edit]\n\nSee also: Alpha particle § History of discovery and use\n\nAlpha particles were first described in the investigations of radioactivity by Ernest Rutherford in 1899, and by 1907 they were identified as He2+ ions.\n\nBy 1928, George Gamow had solved the theory of alpha decay via tunneling. The alpha particle is trapped in a potential well by the nucleus. Classically, it is forbidden to escape, but according to the (then) newly discovered principles of quantum mechanics, it has a tiny (but non-zero) probability of \"tunneling\" through the barrier and appearing on the other side to escape the nucleus. Gamow solved a model potential for the nucleus and derived, from first principles, a relationship between the half-life of the decay, and the energy of the emission, which had been previously discovered empirically, and was known as the Geiger–Nuttall law.[1]\n\n\nMechanism[edit]\n\nThe nuclear force holding an atomic nucleus together is very strong, in general much stronger than the repulsive electromagnetic forces between the protons. However, the nuclear force is also short range, dropping quickly in strength beyond about 1 femtometre, while the electromagnetic force has unlimited range. The strength of the attractive nuclear force keeping a nucleus together is thus proportional to the number of nucleons, but the total disruptive electromagnetic force trying to break the nucleus apart is roughly proportional to the square of its atomic number. A nucleus with 210 or more nucleons is so large that the strong nuclear force holding it together can just barely counterbalance the electromagnetic repulsion between the protons it contains. Alpha decay occurs in such nuclei as a means of increasing stability by reducing size.[2]\n\nOne curiosity is why alpha particles, helium nuclei, should be preferentially emitted as opposed to other particles like a single proton or neutron or other atomic nuclei.[note 1] The main reason is the very high binding energy of the alpha particle. Computing the total disintegration energy given by the equation:\n\n\n\t\n  \n    \n      \n        E\n        =\n        (\n        \n          m\n          \n            i\n          \n        \n        −\n        \n          m\n          \n            f\n          \n        \n        −\n        \n          m\n          \n            p\n          \n        \n        )\n        \n          c\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle E=(m_{\\text{i}}-m_{\\text{f}}-m_{\\text{p}})c^{2}}\n  \n\n\n\nWhere \n  \n    \n      \n        \n          m\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle m_{\\text{i}}}\n  \n is the initial mass of the nucleus, \n  \n    \n      \n        \n          m\n          \n            f\n          \n        \n      \n    \n    {\\displaystyle m_{\\text{f}}}\n  \n is the mass of the nucleus after particle emission, and \n  \n    \n      \n        \n          m\n          \n            p\n          \n        \n      \n    \n    {\\displaystyle m_{\\text{p}}}\n  \n is the mass of the emitted particle, shows that alpha particle emission will usually be possible just with energy from the nucleus itself, while other decay modes will require additional energy. For example, performing the calculation for uranium-232 shows that alpha particle emission would need only 5.4 MeV, while a single proton emission would require 6.1 MeV. Most of this disintegration energy becomes the kinetic energy of the alpha particle itself, although to maintain conservation of momentum part of this energy becomes the recoil of the nucleus itself. However, since the mass numbers of most alpha emitting radioisotopes exceed 210, far greater than the mass number of the alpha particle (4) the part of the energy going to the recoil of the nucleus is generally quite small.[2]\n\nThese disintegration energies however are substantially smaller than the potential barrier provided by the nuclear force, which prevents the alpha particle from escaping. The energy needed is generally in the range of about 25 MeV, the amount of work that must be done against electromagnetic repulsion to bring an alpha particle from infinity to a point near the nucleus just outside the range of the nuclear force's influence. An alpha particle can be thought of as being inside a potential barrier whose walls are 25 MeV. However, decay alpha particles only have kinetic energies of 4 MeV to about 9 MeV, far less than the energy needed to escape.\n\nQuantum mechanics, however, allows the alpha particle to escape via quantum tunneling. The quantum tunneling theory of alpha decay, independently developed by George Gamow[3] and Ronald Wilfred Gurney and Edward Condon in 1928,[4] was hailed as a very striking confirmation of quantum theory. Essentially, the alpha particle escapes from the nucleus not by acquiring enough energy to pass over the wall confining it, but by tunneling through the wall. Gurney and Condon made the following observation in their paper on it:\n\n\nIt has hitherto been necessary to postulate some special arbitrary ‘instability’ of the nucleus; but in the following note it is pointed out that disintegration is a natural consequence of the laws of quantum mechanics without any special hypothesis... Much has been written of the explosive violence with which the α-particle is hurled from its place in the nucleus. But from the process pictured above, one would rather say that the α-particle almost slips away unnoticed.[4]\n\n\nThe theory supposes that the alpha particle can be considered an independent particle within a nucleus that is in constant motion, but held within the nucleus by nuclear forces. At each collision with the potential barrier of the nuclear force, there is a small non-zero probability that it will tunnel its way out. An alpha particle with a speed of 1.5×107 m/s within a nuclear diameter of approximately 10−14 m will collide with the barrier more than 1021 times per second. However, if the probability of escape at each collision is very small, the half-life of the radioisotope will be very long, since it is the time required for the total probability of escape to reach 50%. As an extreme example, the half-life of the isotope bismuth-209 is 1.9 x 1019 years.\n\nThe isotopes in beta-decay stable isobars that are also stable with regards to double beta decay with mass number A = 5, A = 8, 143 ≤ A ≤ 155, 160 ≤ A ≤ 162, and A ≥ 165 are theorized to undergo alpha decay (\"5\" decay to helium-4 and a proton or a neutron, and \"8\" decay to two helium-4, the half-life of them (helium-5, lithium-5, and beryllium-8) are very short, unlike the half-life for all other such nuclides with A ≤ 209, which are very long. All other such nuclides with A ≤ 209 are primordial nuclides except A = 146). However, only such nuclides with A = 5, 8, 144, 146, 147, 148, 151, 186, and ≥ 209 have been observed to alpha decay (the decay has also been searched for such nuclides with A = 145, 149, 182, 183, 184, 192, 204, and 208). All other mass numbers (isobars) have exactly one theoretically stable nuclide).\n\nWorking out the details of the theory leads to an equation relating the half-life of a radioisotope to the decay energy of its alpha particles, a theoretical derivation of the empirical Geiger–Nuttall law.\n\n\nUses[edit]\n\nAmericium-241, an alpha emitter, is used in smoke detectors. The alpha particles ionize air in an open ion chamber and a small current flows through the ionized air. Smoke particles from fire that enter the chamber reduce the current, triggering the smoke detector's alarm.\n\nAlpha decay can provide a safe power source for radioisotope thermoelectric generators used for space probes[5] and were used for artificial heart pacemakers.[6] Alpha decay is much more easily shielded against than other forms of radioactive decay.\n\nStatic eliminators typically use polonium-210, an alpha emitter, to ionize air, allowing the 'static cling' to dissipate more rapidly.\n\n\nToxicity[edit]\n\nHighly charged and heavy, alpha particles lose their several MeV of energy within a small volume of material, along a very short mean free path. This increases the chance of double-strand breaks to the DNA in cases of internal contamination, when ingested, inhaled, injected or introduced through the skin. Otherwise, touching an alpha source is typically not harmful, as alpha particles are effectively shielded by a few centimeters of air, a piece of paper, or the thin layer of dead skin cells that make up the epidermis; however, many alpha sources are also accompanied by beta-emitting radio daughters, and both are often accompanied by gamma photon emission.\n\nRBE relative biological effectiveness quantifies the ability of radiation to cause certain biological effects, notably either cancer or cell-death, for equivalent radiation exposure. Alpha radiation has high linear energy transfer (LET) coefficient, which is about one ionization of a molecule/atom for every angstrom of travel by the alpha particle. The RBE has been set at the value of 20 for alpha radiation by various government regulations. The RBE is set at 10 for neutron irradiation, and at 1 for beta radiation and ionizing photons.\n\nHowever, the recoil of the parent nucleus (alpha recoil) gives it a significant amount of energy, which also causes ionization damage (see ionizing radiation). This energy is roughly the weight of the alpha (4 u) divided by the weight of the parent (typically about 200 u) times the total energy of the alpha. By some estimates, this might account for most of the internal radiation damage, as the recoil nucleus is part of an atom that is much larger than an alpha particle, and causes a very dense trail of ionization; the atom is typically a heavy metal, which preferentially collect on the chromosomes. In some studies,[7] this has resulted in an RBE approaching 1,000 instead of the value used in governmental regulations.\n\nThe largest natural contributor to public radiation dose is radon, a naturally occurring, radioactive gas found in soil and rock.[8] If the gas is inhaled, some of the radon particles may attach to the inner lining of the lung. These particles continue to decay, emitting alpha particles, which can damage cells in the lung tissue.[9] The death of Marie Curie at age 66 from aplastic anemia was probably caused by prolonged exposure to high doses of ionizing radiation, but it is not clear if this was due to alpha radiation or X-rays. Curie worked extensively with radium, which decays into radon,[10] along with other radioactive materials that emit beta and gamma rays. However, Curie also worked with unshielded X-ray tubes during World War I, and analysis of her skeleton during a reburial showed a relatively low level of radioisotope burden.\n\nThe Russian dissident Alexander Litvinenko's 2006 murder by radiation poisoning is thought to have been carried out with polonium-210, an alpha emitter.\n\n\nReferences[edit]\n\n\n\t^ \"Gamow theory of alpha decay\". 6 November 1996. Archived from the original on 24 February 2009.\n\n\t^ a b Arthur Beiser (2003). \"Chapter 12: Nuclear Transformations\". Concepts of Modern Physics (PDF) (6th ed.). McGraw-Hill. pp. 432–434. ISBN 0-07-244848-2.\n\n\n\t^ \nG. Gamow (1928). \"Zur Quantentheorie des Atomkernes (On the quantum theory of the atomic nucleus)\". Zeitschrift für Physik. 51 (3): 204–212. Bibcode:1928ZPhy...51..204G. doi:10.1007/BF01343196.\n\n\n\t^ a b Ronald W. Gurney &  Edw. U. Condon (1928). \"Wave Mechanics and Radioactive Disintegration\". Nature. 122: 439. Bibcode:1928Natur.122..439G. doi:10.1038/122439a0.\n\n\n\t^ \"Radioisotope Thermoelectric Generator\". Solar System Exploration. NASA. Retrieved 25 March 2013.\n\n\n\t^ \"Nuclear-Powered Cardiac Pacemakers\". Off-Site Source Recovery Project. LANL. Retrieved 25 March 2013.\n\n\n\t^ \nWinters TH, Franza JR (1982). \"Radioactivity in Cigarette Smoke\". New England Journal of Medicine. 306 (6): 364–365. doi:10.1056/NEJM198202113060613.\n\n\n\t^ ANS : Public Information : Resources : Radiation Dose Chart\n\n\t^ EPA Radiation Information: Radon. October 6, 2006, [1], Accessed December 6, 2006\n\n\t^ Health Physics Society, \"Did Marie Curie die of a radiation overexposure?\" [2] Archived 2007-10-19 at the Wayback Machine\n\n\n\n\n\n\tAlpha emitters by increasing energy (Appendix 1)\n\n\nNotes[edit]\n\n\n\t^ These other decay modes, while possible, are extremely rare compared to alpha decay.\n\n\n\n\n\nExternal links[edit]\n\n\t The LIVEChart of Nuclides - IAEA  with filter on alpha decay\n\tAlpha decay with 3 animated examples showing the recoil of daughter\n\n\n\t\tv\n\tt\n\te\n\n\nNuclear processes\n\n\tRadioactive\ndecay\n\t\n\tAlpha decay\n\tBeta decay\n\tGamma radiation\n\tCluster decay\n\tDouble beta decay\n\tDouble electron capture\n\tInternal conversion\n\tIsomeric transition\n\tNeutron emission\n\tPositron emission\n\tProton emission\n\tSpontaneous fission\n\n\n\n\n\tStellar\nnucleosynthesis\n\t\n\tDeuterium fusion\n\tLithium burning\n\tpp-chain\n\tCNO cycle\n\tα process\n\tTriple-α\n\tC burning\n\tNe burning\n\tO burning\n\tSi burning\n\tR-process\n\tS-process\n\tP-process\n\tRp-process\n\n\n\n\n\tOther\nprocesses\n\t\n\tPhotodisintegration\n\tPhotofission\n\n\n \n\tCapture\n\t\n\tElectron capture\n\tNeutron capture\n\tProton capture\n\n\n\n\n\tExchange\n\t\n\t(n-p) reaction\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Alpha_decay&oldid=917639237\"\n\n\t\t\n\t\tCategories: \tHelium\n\tNuclear physics\n\tRadioactivity\n\n\nHidden categories: \tWebarchive template wayback links\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tБългарски\n\tCatalà\n\tDansk\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tҚазақша\n\tLatviešu\n\tLietuvių\n\tLimburgs\n\tMagyar\n\tМакедонски\n\tBahasa Melayu\n\tМонгол\n\tNederlands\n\t日本語\n\tOccitan\n\tOʻzbekcha/ўзбекча\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tසිංහල\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tТатарча/tatarça\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 24 September 2019, at 19:19 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "19", "dc:title": "Alpha decay - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Alpha_Decay.svg/1200px-Alpha_Decay.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-alpha_decay", "title": "Alpha decay - Wikipedia"}}