{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlternating current - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tAlternating current\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nAlternating current (green curve). The horizontal axis measures time; the vertical, current or voltage.\n\n\n\n\tPart of a series of articles about\n\tElectromagnetism\n\t\n\t\n\tElectricity\n\tMagnetism\n\n\n\t\nElectrostatics\n\n\tConductor\n\tCoulomb's law\n\tElectric charge\n\tElectric dipole moment\n\tElectric field\n\tElectric flux / potential energy\n\tElectrostatic discharge\n\tGauss's law\n\tInduction\n\tInsulator\n\tPolarization density\n\tStatic electricity\n\tTriboelectricity\n\n\n\n\n\t\nMagnetostatics\n\n\tAmpère's law\n\tBiot–Savart law\n\tGauss's law for magnetism\n\tMagnetic field\n\tMagnetic flux\n\tMagnetic dipole moment\n\tMagnetization\n\tMagnetomotive force\n\n\n\n\n\t\nElectrodynamics\n\n\tLorentz force law\n\tElectromagnetic induction\n\tFaraday's law\n\tLenz's law\n\tDisplacement current\n\tMagnetic potential\n\tMaxwell's equations\n\tElectromagnetic field\n\tElectromagnetic pulse\n\tElectromagnetic radiation\n\tMaxwell tensor\n\tPoynting vector\n\tLiénard–Wiechert potential\n\tJefimenko's equations\n\tEddy current\n\tLondon equations\n\n\n\tMathematical descriptions of the electromagnetic field\n\n\n\n\n\n\t\nElectrical network\n\n\tAlternating current\n\tCapacitance\n\tDirect current\n\tElectric current\n\tElectric potential\n\tElectromotive force\n\tImpedance\n\tInductance\n\tOhm's law\n\tParallel circuit\n\tResistance\n\tResonant cavities\n\tSeries circuit\n\tVoltage\n\tWaveguides\n\n\n\n\n\t\nCovariant formulation\n\n\tElectromagnetic tensor\n(stress–energy tensor)\n\n\n\n\tFour-current\n\tElectromagnetic four-potential\n\n\n\n\n\t\nScientists\n\n\tAmpère\n\tBiot\n\tCoulomb\n\tFaraday\n\tGauss\n\tHeaviside\n\tHenry\n\tHertz\n\tLenz\n\tLorentz\n\tMaxwell\n\tØrsted\n\tSavart\n\tTesla\n\tVolta\n\tWeber\n\t\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nAlternating current (AC) is an electric current which periodically reverses direction, in contrast to direct current (DC) which flows only in one direction. Alternating current is the form in which electric power is delivered to businesses and residences, and it is the form of electrical energy that consumers typically use when they plug kitchen appliances, televisions, fans and electric lamps into a wall socket. A common source of DC power is a battery cell in a flashlight. The abbreviations AC and DC are often used to mean simply alternating and direct, as when they modify current or voltage.[1][2]\n\nThe usual waveform of alternating current in most electric power circuits is a sine wave, whose positive half-period corresponds with positive direction of the current and vice versa. In certain applications, like guitar amplifiers, different waveforms are used, such as triangular or square waves. Audio and radio signals carried on electrical wires are also examples of alternating current. These types of alternating current carry information such as sound (audio) or images (video) sometimes carried by modulation of an AC carrier signal. These currents typically alternate at higher frequencies than those used in power transmission.\n\n\nContents\n\n\n\t1 Transmission, distribution, and domestic power supply\n\t2 AC power supply frequencies\n\t3 Effects at high frequencies\n\t3.1 Techniques for reducing AC resistance\n\t3.2 Techniques for reducing radiation loss\n\t3.2.1 Twisted pairs\n\t3.2.2 Coaxial cables\n\t3.2.3 Waveguides\n\t3.2.4 Fiber optics\n\n\n\n\n\n\n\t4 Mathematics of AC voltages\n\t4.1 Power\n\t4.2 Root mean square voltage\n\t4.3 Example\n\n\n\n\t5 Information transmission\n\t6 History\n\t6.1 Transformers\n\t6.2 Pioneers\n\n\n\n\t7 See also\n\t8 References\n\t9 Further reading\n\t10 External links\n\n\n\n\n\n\nTransmission, distribution, and domestic power supply[edit]\n\nMain articles: Electric power transmission and Electric power distribution\n\n  \nA schematic representation of long distance electric power transmission.  C=consumers, D=step down transformer, G=generator, I=current in the wires, Pe=power reaching the end of the transmission line, Pt=power entering the transmission line, Pw=power lost in the transmission line, R=total resistance in the wires, V=voltage at the beginning of the transmission line, U=step up transformer.\n\n\n\nElectrical energy is distributed as alternating current because AC voltage may be increased or decreased with a transformer. This allows the power to be transmitted through power lines efficiently at high voltage, which reduces the energy lost as heat due to resistance of the wire, and transformed to a lower, safer, voltage for use. Use of a higher voltage leads to significantly more efficient transmission of power. The power losses (\n  \n    \n      \n        \n          P\n          \n            \n              w\n            \n          \n        \n      \n    \n    {\\displaystyle P_{\\rm {w}}}\n  \n) in the wire are a product of the square of the current (I) and the resistance (R) of the wire, described by the formula:\n\n\n\t\n  \n    \n      \n        \n          P\n          \n            \n              w\n            \n          \n        \n        =\n        \n          I\n          \n            2\n          \n        \n        R\n        \n        .\n      \n    \n    {\\displaystyle P_{\\rm {w}}=I^{2}R\\,.}\n  \n\n\n\nThis means that when transmitting a fixed power on a given wire, if the current is halved (i.e. the voltage is doubled), the power loss due to the wire's resistance will be reduced to one quarter.\n\nThe power transmitted is equal to the product of the current and the voltage (assuming no phase difference); that is,\n\n\n\t\n  \n    \n      \n        \n          P\n          \n            \n              t\n            \n          \n        \n        =\n        I\n        V\n        \n        .\n      \n    \n    {\\displaystyle P_{\\rm {t}}=IV\\,.}\n  \n\n\n\nConsequently, power transmitted at a higher voltage requires less loss-producing current than for the same power at a lower voltage. Power is often transmitted at hundreds of kilovolts, and transformed to 100 V – 240 V for domestic use.\n\n\n  \nHigh voltage transmission lines deliver power from electric generation plants over long distances using alternating current. These lines are located in eastern Utah.\n\n\n\nHigh voltages have disadvantages, such as the increased insulation required, and generally increased difficulty in their safe handling. In a power plant, energy is generated at a convenient voltage for the design of a generator, and then stepped up to a high voltage for transmission. Near the loads, the transmission voltage is stepped down to the voltages used by equipment. Consumer voltages vary somewhat depending on the country and size of load, but generally motors and lighting are built to use up to a few hundred volts between phases. The voltage delivered to equipment such as lighting and motor loads is standardized, with an allowable range of voltage over which equipment is expected to operate. Standard power utilization voltages and percentage tolerance vary in the different mains power systems found in the world. High-voltage direct-current (HVDC) electric power transmission systems have become more viable as technology has provided efficient means of changing the voltage of DC power. Transmission with high voltage direct current was not feasible in the early days of electric power transmission, as there was then no economically viable way to step down the voltage of DC for end user applications such as lighting incandescent bulbs.\n\nThree-phase electrical generation is very common. The simplest way is to use three separate coils in the generator stator, physically offset by an angle of 120° (one-third of a complete 360° phase) to each other. Three current waveforms are produced that are equal in magnitude and 120° out of phase to each other. If coils are added opposite to these (60° spacing), they generate the same phases with reverse polarity and so can be simply wired together. In practice, higher \"pole orders\" are commonly used. For example, a 12-pole machine would have 36 coils (10° spacing). The advantage is that lower rotational speeds can be used to generate the same frequency. For example, a 2-pole machine running at 3600 rpm and a 12-pole machine running at 600 rpm produce the same frequency; the lower speed is preferable for larger machines. If the load on a three-phase system is balanced equally among the phases, no current flows through the neutral point. Even in the worst-case unbalanced (linear) load, the neutral current will not exceed the highest of the phase currents. Non-linear loads (e.g. the switch-mode power supplies widely used) may require an oversized neutral bus and neutral conductor in the upstream distribution panel to handle harmonics. Harmonics can cause neutral conductor current levels to exceed that of one or all phase conductors.\n\nFor three-phase at utilization voltages a four-wire system is often used. When stepping down three-phase, a transformer with a Delta (3-wire) primary and a Star (4-wire, center-earthed) secondary is often used so there is no need for a neutral on the supply side. For smaller customers (just how small varies by country and age of the installation) only a single phase and neutral, or two phases and neutral, are taken to the property. For larger installations all three phases and neutral are taken to the main distribution panel. From the three-phase main panel, both single and three-phase circuits may lead off. Three-wire single-phase systems, with a single center-tapped transformer giving two live conductors, is a common distribution scheme for residential and small commercial buildings in North America. This arrangement is sometimes incorrectly referred to as \"two phase\". A similar method is used for a different reason on construction sites in the UK. Small power tools and lighting are supposed to be supplied by a local center-tapped transformer with a voltage of 55 V between each power conductor and earth. This significantly reduces the risk of electric shock in the event that one of the live conductors becomes exposed through an equipment fault whilst still allowing a reasonable voltage of 110 V between the two conductors for running the tools.\n\nA third wire, called the bond (or earth) wire, is often connected between non-current-carrying metal enclosures and earth ground. This conductor provides protection from electric shock due to accidental contact of circuit conductors with the metal chassis of portable appliances and tools. Bonding all non-current-carrying metal parts into one complete system ensures there is always a low electrical impedance path to ground sufficient to carry any fault current for as long as it takes for the system to clear the fault. This low impedance path allows the maximum amount of fault current, causing the overcurrent protection device (breakers, fuses) to trip or burn out as quickly as possible, bringing the electrical system to a safe state. All bond wires are bonded to ground at the main service panel, as is the neutral/identified conductor if present.\n\n\nAC power supply frequencies[edit]\n\nFurther information: Mains electricity by country\n\nThe frequency of the electrical system varies by country and sometimes within a country; most electric power is generated at either 50 or 60 Hertz. Some countries have a mixture of 50 Hz and 60 Hz supplies, notably electricity power transmission in Japan. A low frequency eases the design of electric motors, particularly for hoisting, crushing and rolling applications, and commutator-type traction motors for applications such as railways. However, low frequency also causes noticeable flicker in arc lamps and incandescent light bulbs. The use of lower frequencies also provided the advantage of lower impedance losses, which are proportional to frequency. The original Niagara Falls generators were built to produce 25 Hz power, as a compromise between low frequency for traction and heavy induction motors, while still allowing incandescent lighting to operate (although with noticeable flicker). Most of the 25 Hz residential and commercial customers for Niagara Falls power were converted to 60 Hz by the late 1950s, although some[which?] 25 Hz industrial customers still existed as of the start of the 21st century. 16.7 Hz power (formerly 16 2/3 Hz) is still used in some European rail systems, such as in Austria, Germany, Norway, Sweden and Switzerland. Off-shore, military, textile industry, marine, aircraft, and spacecraft applications sometimes use 400 Hz, for benefits of reduced weight of apparatus or higher motor speeds. Computer mainframe systems were often powered by 400 Hz or 415 Hz for benefits of ripple reduction while using smaller internal AC to DC conversion units.[3] In any case, the input to the M-G set is the local customary voltage and frequency, variously 200 V (Japan), 208 V, 240 V (North America), 380 V, 400 V or 415 V (Europe), and variously 50 Hz or 60 Hz.\n\n\nEffects at high frequencies[edit]\n\nMain article: Skin effect\n\nPlay media\n  \nA Tesla coil producing high-frequency current that is harmless to humans, but  lights a fluorescent lamp when brought near it\n\n\n\nA direct current flows uniformly throughout the cross-section of a uniform wire. An alternating current of any frequency is forced away from the wire's center, toward its outer surface. This is because the acceleration of an electric charge in an alternating current produces waves of electromagnetic radiation that cancel the propagation of electricity toward the center of materials with high conductivity. This phenomenon is called skin effect. At very high frequencies the current no longer flows in the wire, but effectively flows on the surface of the wire, within a thickness of a few skin depths. The skin depth is the thickness at which the current density is reduced by 63%. Even at relatively low frequencies used for power transmission (50 Hz – 60 Hz), non-uniform distribution of current still occurs in sufficiently thick conductors. For example, the skin depth of a copper conductor is approximately 8.57 mm at 60 Hz, so high current conductors are usually hollow to reduce their mass and cost. Since the current tends to flow in the periphery of conductors, the effective cross-section of the conductor is reduced. This increases the effective AC resistance of the conductor, since resistance is inversely proportional to the cross-sectional area. The AC resistance often is many times higher than the DC resistance, causing a much higher energy loss due to ohmic heating (also called I2R loss).\n\n\n\n\nTechniques for reducing AC resistance[edit]\n\nFor low to medium frequencies, conductors can be divided into stranded wires, each insulated from one another, with the relative positions of individual strands specially arranged within the conductor bundle. Wire constructed using this technique is called Litz wire. This measure helps to partially mitigate skin effect by forcing more equal current throughout the total cross section of the stranded conductors. Litz wire is used for making high-Q inductors, reducing losses in flexible conductors carrying very high currents at lower frequencies, and in the windings of devices carrying higher radio frequency current (up to hundreds of kilohertz), such as switch-mode power supplies and radio frequency transformers.\n\n\nTechniques for reducing radiation loss[edit]\n\nAs written above, an alternating current is made of electric charge under periodic acceleration, which causes radiation of electromagnetic waves. Energy that is radiated is lost. Depending on the frequency, different techniques are used to minimize the loss due to radiation.\n\n\nTwisted pairs[edit]\n\nAt frequencies up to about 1 GHz, pairs of wires are twisted together in a cable, forming a twisted pair. This reduces losses from electromagnetic radiation and inductive coupling. A twisted pair must be used with a balanced signalling system, so that the two wires carry equal but opposite currents. Each wire in a twisted pair radiates a signal, but it is effectively cancelled by radiation from the other wire, resulting in almost no radiation loss.\n\n\nCoaxial cables[edit]\n\nCoaxial cables are commonly used at audio frequencies and above for convenience. A coaxial cable has a conductive wire inside a conductive tube, separated by a dielectric layer. The current flowing on the surface of the inner conductor is equal and opposite to the current flowing on the inner surface of the outer tube. The electromagnetic field is thus completely contained within the tube, and (ideally) no energy is lost to radiation or coupling outside the tube. Coaxial cables have acceptably small losses for frequencies up to about 5 GHz. For microwave frequencies greater than 5 GHz, the losses (due mainly to the electrical resistance of the central conductor) become too large, making waveguides a more efficient medium for transmitting energy. Coaxial cables with an air rather than solid dielectric are preferred as they transmit power with lower loss.\n\n\nWaveguides[edit]\n\nWaveguides are similar to coaxial cables, as both consist of tubes, with the biggest difference being that the waveguide has no inner conductor. Waveguides can have any arbitrary cross section, but rectangular cross sections are the most common. Because waveguides do not have an inner conductor to carry a return current, waveguides cannot deliver energy by means of an electric current, but rather by means of a guided electromagnetic field. Although surface currents do flow on the inner walls of the waveguides, those surface currents do not carry power. Power is carried by the guided electromagnetic fields. The surface currents are set up by the guided electromagnetic fields and have the effect of keeping the fields inside the waveguide and preventing leakage of the fields to the space outside the waveguide. Waveguides have dimensions comparable to the wavelength of the alternating current to be transmitted, so they are only feasible at microwave frequencies. In addition to this mechanical feasibility, electrical resistance of the non-ideal metals forming the walls of the waveguide cause dissipation of power (surface currents flowing on lossy conductors dissipate power). At higher frequencies, the power lost to this dissipation becomes unacceptably large.\n\n\nFiber optics[edit]\n\nAt frequencies greater than 200 GHz, waveguide dimensions become impractically small, and the ohmic losses in the waveguide walls become large. Instead, fiber optics, which are a form of dielectric waveguides, can be used. For such frequencies, the concepts of voltages and currents are no longer used.\n\n\nMathematics of AC voltages[edit]\n\n  \nA sinusoidal alternating voltage.\tPeak, also amplitude,\n\tPeak-to-peak,\n\tEffective value,\n\tPeriod\n\n\n\n\n\n\n  \nA sine wave, over one cycle (360°). The dashed line represents the root mean square (RMS) value at about 0.707.\n\n\n\nAlternating currents are accompanied (or caused) by alternating voltages. An AC voltage v can be described mathematically as a function of time by the following equation:\n\n\n\t\n  \n    \n      \n        v\n        (\n        t\n        )\n        =\n        \n          V\n          \n            peak\n          \n        \n        sin\n        ⁡\n        (\n        ω\n        t\n        )\n      \n    \n    {\\displaystyle v(t)=V_{\\text{peak}}\\sin(\\omega t)}\n  \n,\n\n\nwhere\n\n\n\t\n  \n    \n      \n        \n          V\n          \n            peak\n          \n        \n      \n    \n    {\\displaystyle V_{\\text{peak}}}\n  \n is the peak voltage (unit: volt),\n\t\n  \n    \n      \n        ω\n      \n    \n    {\\displaystyle \\omega }\n  \n is the angular frequency (unit: radians per second). \nThe angular frequency is related to the physical frequency, \n  \n    \n      \n        f\n      \n    \n    {\\displaystyle f}\n  \n (unit: hertz), which represents the number of cycles per second, by the equation \n  \n    \n      \n        ω\n        =\n        2\n        π\n        f\n      \n    \n    {\\displaystyle \\omega =2\\pi f}\n  \n.\n\t\n  \n    \n      \n        t\n      \n    \n    {\\displaystyle t}\n  \n is the time (unit: second).\n\n\nThe peak-to-peak value of an AC voltage is defined as the difference between its positive peak and its negative peak. Since the maximum value of \n  \n    \n      \n        sin\n        ⁡\n        (\n        x\n        )\n      \n    \n    {\\displaystyle \\sin(x)}\n  \n is +1 and the minimum value is −1, an AC voltage swings between \n  \n    \n      \n        +\n        \n          V\n          \n            peak\n          \n        \n      \n    \n    {\\displaystyle +V_{\\text{peak}}}\n  \n and \n  \n    \n      \n        −\n        \n          V\n          \n            peak\n          \n        \n      \n    \n    {\\displaystyle -V_{\\text{peak}}}\n  \n. The peak-to-peak voltage, usually written as \n  \n    \n      \n        \n          V\n          \n            pp\n          \n        \n      \n    \n    {\\displaystyle V_{\\text{pp}}}\n  \n or \n  \n    \n      \n        \n          V\n          \n            P-P\n          \n        \n      \n    \n    {\\displaystyle V_{\\text{P-P}}}\n  \n, is therefore \n  \n    \n      \n        \n          V\n          \n            peak\n          \n        \n        −\n        (\n        −\n        \n          V\n          \n            peak\n          \n        \n        )\n        =\n        2\n        \n          V\n          \n            peak\n          \n        \n      \n    \n    {\\displaystyle V_{\\text{peak}}-(-V_{\\text{peak}})=2V_{\\text{peak}}}\n  \n.\n\n\nPower[edit]\n\nMain article: AC power\n\nThe relationship between voltage and the power delivered is:\n\n\n\t\n  \n    \n      \n        p\n        (\n        t\n        )\n        =\n        \n          \n            \n              \n                v\n                \n                  2\n                \n              \n              (\n              t\n              )\n            \n            R\n          \n        \n      \n    \n    {\\displaystyle p(t)={\\frac {v^{2}(t)}{R}}}\n  \n\n\n\nwhere \n  \n    \n      \n        R\n      \n    \n    {\\displaystyle R}\n  \n represents a load resistance.\n\nRather than using instantaneous power, \n  \n    \n      \n        p\n        (\n        t\n        )\n      \n    \n    {\\displaystyle p(t)}\n  \n, it is more practical to use a time averaged power (where the averaging is performed over any integer number of cycles). Therefore, AC voltage is often expressed as a root mean square (RMS) value, written as \n  \n    \n      \n        \n          V\n          \n            rms\n          \n        \n      \n    \n    {\\displaystyle V_{\\text{rms}}}\n  \n, because\n\n\n\t\n  \n    \n      \n        \n          P\n          \n            time averaged\n          \n        \n        =\n        \n          \n            \n              \n                \n                  V\n                  \n                    rms\n                  \n                \n              \n              \n                2\n              \n            \n            R\n          \n        \n        .\n      \n    \n    {\\displaystyle P_{\\text{time averaged}}={\\frac {{V_{\\text{rms}}}^{2}}{R}}.}\n  \n\n\n\n\tPower oscillation\n\t\n  \n    \n      \n        \n          \n            \n              \n                v\n                (\n                t\n                )\n              \n              \n                \n                =\n                \n                  V\n                  \n                    peak\n                  \n                \n                sin\n                ⁡\n                (\n                ω\n                t\n                )\n              \n            \n            \n              \n                i\n                (\n                t\n                )\n              \n              \n                \n                =\n                \n                  \n                    \n                      v\n                      (\n                      t\n                      )\n                    \n                    R\n                  \n                \n                =\n                \n                  \n                    \n                      V\n                      \n                        peak\n                      \n                    \n                    R\n                  \n                \n                sin\n                ⁡\n                (\n                ω\n                t\n                )\n              \n            \n            \n              \n                P\n                (\n                t\n                )\n              \n              \n                \n                =\n                v\n                (\n                t\n                )\n                i\n                (\n                t\n                )\n                =\n                \n                  \n                    \n                      (\n                      \n                        V\n                        \n                          peak\n                        \n                      \n                      \n                        )\n                        \n                          2\n                        \n                      \n                    \n                    R\n                  \n                \n                \n                  sin\n                  \n                    2\n                  \n                \n                ⁡\n                (\n                ω\n                t\n                )\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}v(t)&=V_{\\text{peak}}\\sin(\\omega t)\\\\i(t)&={\\frac {v(t)}{R}}={\\frac {V_{\\text{peak}}}{R}}\\sin(\\omega t)\\\\P(t)&=v(t)i(t)={\\frac {(V_{\\text{peak}})^{2}}{R}}\\sin ^{2}(\\omega t)\\end{aligned}}}\n  \n\n\n\nRoot mean square voltage[edit]\n\nFurther information: RMS amplitude\n\nFor broader coverage of this topic, see Root mean square voltage.\n\nBelow it is assumed an AC waveform (with no DC component).\n\nThe RMS voltage is the square root of the mean over one cycle of the square of the instantaneous voltage.\n\n\n\tFor an arbitrary periodic waveform \n  \n    \n      \n        v\n        (\n        t\n        )\n      \n    \n    {\\displaystyle v(t)}\n  \n of period \n  \n    \n      \n        T\n      \n    \n    {\\displaystyle T}\n  \n:\n\t\n  \n    \n      \n        \n          V\n          \n            rms\n          \n        \n        =\n        \n          \n            \n              \n                1\n                T\n              \n            \n            \n              ∫\n              \n                0\n              \n              \n                T\n              \n            \n            \n              [\n              v\n              (\n              t\n              )\n              \n                ]\n                \n                  2\n                \n              \n              d\n              t\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle V_{\\text{rms}}={\\sqrt {{\\frac {1}{T}}\\int _{0}^{T}{[v(t)]^{2}dt}}}.}\n  \n\n\n\n\tFor a sinusoidal voltage:\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  V\n                  \n                    rms\n                  \n                \n              \n              \n                \n                =\n                \n                  \n                    \n                      \n                        1\n                        T\n                      \n                    \n                    \n                      ∫\n                      \n                        0\n                      \n                      \n                        T\n                      \n                    \n                    [\n                    \n                      \n                        V\n                        \n                          p\n                          k\n                        \n                      \n                      sin\n                      ⁡\n                      (\n                      ω\n                      t\n                      +\n                      ϕ\n                      )\n                      \n                        ]\n                        \n                          2\n                        \n                      \n                      d\n                      t\n                    \n                  \n                \n              \n            \n            \n              \n              \n                \n                =\n                \n                  V\n                  \n                    pk\n                  \n                \n                \n                  \n                    \n                      \n                        1\n                        \n                          2\n                          T\n                        \n                      \n                    \n                    \n                      ∫\n                      \n                        0\n                      \n                      \n                        T\n                      \n                    \n                    [\n                    \n                      1\n                      −\n                      cos\n                      ⁡\n                      (\n                      2\n                      ω\n                      t\n                      +\n                      2\n                      ϕ\n                      )\n                      ]\n                      d\n                      t\n                    \n                  \n                \n              \n            \n            \n              \n              \n                \n                =\n                \n                  V\n                  \n                    pk\n                  \n                \n                \n                  \n                    \n                      \n                        1\n                        \n                          2\n                          T\n                        \n                      \n                    \n                    \n                      ∫\n                      \n                        0\n                      \n                      \n                        T\n                      \n                    \n                    \n                      d\n                      t\n                    \n                  \n                \n              \n            \n            \n              \n              \n                \n                =\n                \n                  \n                    \n                      V\n                      \n                        pk\n                      \n                    \n                    \n                      2\n                    \n                  \n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}V_{\\text{rms}}&={\\sqrt {{\\frac {1}{T}}\\int _{0}^{T}[{V_{pk}\\sin(\\omega t+\\phi )]^{2}dt}}}\\\\&=V_{\\text{pk}}{\\sqrt {{\\frac {1}{2T}}\\int _{0}^{T}[{1-\\cos(2\\omega t+2\\phi )]dt}}}\\\\&=V_{\\text{pk}}{\\sqrt {{\\frac {1}{2T}}\\int _{0}^{T}{dt}}}\\\\&={\\frac {V_{\\text{pk}}}{\\sqrt {2}}}\\end{aligned}}}\n  \n\n\n\nwhere the trigonometric identity \n  \n    \n      \n        \n          sin\n          \n            2\n          \n        \n        ⁡\n        (\n        x\n        )\n        =\n        \n          \n            \n              1\n              −\n              cos\n              ⁡\n              (\n              2\n              x\n              )\n            \n            2\n          \n        \n      \n    \n    {\\displaystyle \\sin ^{2}(x)={\\frac {1-\\cos(2x)}{2}}}\n  \n has been used and the factor \n  \n    \n      \n        \n          \n            2\n          \n        \n      \n    \n    {\\displaystyle {\\sqrt {2}}}\n  \n is called the crest factor, which varies for different waveforms.\n\tFor a triangle waveform centered about zero\n\t\n  \n    \n      \n        \n          V\n          \n            rms\n          \n        \n        =\n        \n          \n            \n              V\n              \n                peak\n              \n            \n            \n              3\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle V_{\\text{rms}}={\\frac {V_{\\text{peak}}}{\\sqrt {3}}}.}\n  \n\n\n\n\tFor a square waveform centered about zero\n\t\n  \n    \n      \n        \n          V\n          \n            rms\n          \n        \n        =\n        \n          V\n          \n            peak\n          \n        \n        .\n      \n    \n    {\\displaystyle V_{\\text{rms}}=V_{\\text{peak}}.}\n  \n\n\n\n\n\n\n\nExample[edit]\n\nTo illustrate these concepts, consider a 230 V AC mains supply used in many countries around the world. It is so called because its root mean square value is 230 V. This means that the time-averaged power delivered is equivalent to the power delivered by a DC voltage of 230 V. To determine the peak voltage (amplitude), we can rearrange the above equation to:\n\n\n\t\n  \n    \n      \n        \n          V\n          \n            peak\n          \n        \n        =\n        \n          \n            2\n          \n        \n         \n        \n          V\n          \n            rms\n          \n        \n        .\n      \n    \n    {\\displaystyle V_{\\text{peak}}={\\sqrt {2}}\\ V_{\\text{rms}}.}\n  \n\n\n\nFor 230 V AC, the peak voltage \n  \n    \n      \n        \n          V\n          \n            peak\n          \n        \n      \n    \n    {\\displaystyle V_{\\text{peak}}}\n  \n is therefore \n  \n    \n      \n        230\n        \n           V\n        \n        ×\n        \n          \n            2\n          \n        \n      \n    \n    {\\displaystyle 230{\\text{ V}}\\times {\\sqrt {2}}}\n  \n, which is about 325 V. During the course of one cycle the voltage rises from zero to 325 V, falls through zero to −325 V, and returns to zero.\n\n\nInformation transmission[edit]\n\nAlternating current is used to transmit information, as in the cases of telephone and cable television. Information signals are carried over a wide range of AC frequencies. POTS telephone signals have a frequency of about 3 kHz, close to the baseband audio frequency. Cable television and other cable-transmitted information currents may alternate at frequencies of tens to thousands of megahertz. These frequencies are similar to the electromagnetic wave frequencies often used to transmit the same types of information over the air.\n\n\nHistory[edit]\n\nThe first alternator to produce alternating current was a dynamo electric generator based on Michael Faraday's principles constructed by the French instrument maker Hippolyte Pixii in 1832.[4] Pixii later added a commutator to his device to produce the (then) more commonly used direct current. The earliest recorded practical application of alternating current is by Guillaume Duchenne, inventor and developer of electrotherapy. In 1855, he announced that AC was superior to direct current for electrotherapeutic triggering of muscle contractions.[5] Alternating current technology was developed further by the Hungarian Ganz Works company (1870s), and in the 1880s: Sebastian Ziani de Ferranti, Lucien Gaulard, and Galileo Ferraris.\n\nIn 1876, Russian engineer Pavel Yablochkov invented a lighting system where sets of induction coils were installed along a high voltage AC line. Instead of changing voltage, the primary windings transferred power to the secondary windings which were connected to one or several 'electric candles' (arc lamps) of his own design,[6][7] used to keep the failure of one lamp from disabling the entire circuit.[6] In 1878, the Ganz factory, Budapest, Hungary, began manufacturing equipment for electric lighting and, by 1883, had installed over fifty systems in Austria-Hungary. Their AC systems used arc and incandescent lamps, generators, and other equipment.[8]\n\n\nTransformers[edit]\n\nAlternating current systems can use transformers to change voltage from low to high level and back, allowing generation and consumption at low voltages but transmission, possibly over great distances, at high voltage, with savings in the cost of conductors and energy losses. A bipolar open-core power transformer developed by Lucien Gaulard and John Dixon Gibbs was demonstrated in London in 1881, and attracted the interest of Westinghouse. They also exhibited the invention in Turin in 1884. However these early induction coils with open magnetic circuits are inefficient at transferring power to loads. Until about 1880, the paradigm for AC power transmission from a high voltage supply to a low voltage load was a series circuit. Open-core transformers with a ratio near 1:1 were connected with their primaries in series to allow use of a high voltage for transmission while presenting a low voltage to the lamps. The inherent flaw in this method was that turning off a single lamp (or other electric device) affected the voltage supplied to all others on the same circuit. Many adjustable transformer designs were introduced to compensate for this problematic characteristic of the series circuit, including those employing methods of adjusting the core or bypassing the magnetic flux around part of a coil.[9] The direct current systems did not have these drawbacks, giving it significant advantages over early AC systems.\n\n\nPioneers[edit]\n\n  \nThe Hungarian \"ZBD\" Team (Károly Zipernowsky, Ottó Bláthy, Miksa Déri), inventors of the first high efficiency, closed-core shunt connection transformer\n\n\n\n  \nThe prototype of the ZBD transformer on display at the Széchenyi István Memorial Exhibition, Nagycenk in Hungary\n\n\n\nIn the autumn of 1884, Károly Zipernowsky, Ottó Bláthy and Miksa Déri (ZBD), three engineers associated with the Ganz factory, determined that open-core devices were impractical, as they were incapable of reliably regulating voltage.[10] In their joint 1885 patent applications for novel transformers (later called ZBD transformers), they described two designs with closed magnetic circuits where copper windings were either wound around a ring core of iron wires or else surrounded by a core of iron wires.[9] In both designs, the magnetic flux linking the primary and secondary windings traveled almost entirely within the confines of the iron core, with no intentional path through air (see toroidal cores). The new transformers were 3.4 times more efficient than the open-core bipolar devices of Gaulard and Gibbs.[11] The Ganz factory in 1884 shipped the world's first five high-efficiency AC transformers.[12] This first unit had been manufactured to the following specifications: 1,400 W, 40 Hz, 120:72 V, 11.6:19.4 A, ratio 1.67:1, one-phase, shell form.[12]\n\nThe ZBD patents included two other major interrelated innovations: one concerning the use of parallel connected, instead of series connected, utilization loads, the other concerning the ability to have high turns ratio transformers such that the supply network voltage could be much higher (initially 1400 V to 2000 V) than the voltage of utilization loads (100 V initially preferred).[13][14] When employed in parallel connected electric distribution systems, closed-core transformers finally made it technically and economically feasible to provide electric power for lighting in homes, businesses and public spaces.[15][16] The other essential milestone was the introduction of 'voltage source, voltage intensive' (VSVI) systems'[17] by the invention of constant voltage generators in 1885.[18] Ottó Bláthy also invented the first AC electricity meter.[19][20][21][22]\n\nThe AC power systems was developed and adopted rapidly after 1886 due to its ability to distribute electricity efficiently over long distances, overcoming the limitations of the direct current system. In 1886, the ZBD engineers designed the world's first power station that used AC generators to power a parallel-connected common electrical network, the steam-powered Rome-Cerchi power plant.[23] The reliability of the AC technology received impetus after the Ganz Works electrified a large European metropolis: Rome in 1886.[23]\n\n\n  \nWestinghouse Early AC System 1887\n (US patent 373035)\n\n\n In the UK, Sebastian de Ferranti, who had been developing AC generators and transformers in London since 1882, redesigned the AC system at the Grosvenor Gallery power station in 1886 for the London Electric Supply Corporation (LESCo) including alternators of his own design and transformer designs similar to Gaulard and Gibbs.[24] In 1890 he designed their power station at Deptford[25] and converted the Grosvenor Gallery station across the Thames into an electrical substation, showing the way to integrate older plants into a universal AC supply system.[26]\n\nIn the U.S., William Stanley, Jr. designed one of the first practical devices to transfer AC power efficiently between isolated circuits. Using pairs of coils wound on a common iron core, his design, called an induction coil, was an early transformer. Stanley also worked on engineering and adapting European designs such as the Gaulard and Gibbs transformer for US entrepreneur George Westinghouse who started building AC systems in 1886. The spread of Westinghouse and other AC systems triggered a push back in late 1887 by Edison (a proponent of direct current) who attempted to discredit alternating current as too dangerous in a public campaign called the \"War of Currents\". In 1888 alternating current systems gained further viability with introduction of a functional AC motor, something these systems had lacked up till then. The design, an induction motor, was independently invented by Galileo Ferraris and Nikola Tesla (with Tesla's design being licensed by Westinghouse in the US). This design was further developed into the modern practical three-phase form by Mikhail Dolivo-Dobrovolsky and Charles Eugene Lancelot Brown.[27]\n\nThe Ames Hydroelectric Generating Plant and the original Niagara Falls Adams Power Plant were among the first hydroelectric alternating current power plants. The first long distance transmission of single-phase electricity was from a hydroelectric generating plant in Oregon at Willamette Falls which in 1890 sent power fourteen miles downriver to downtown Portland for street lighting.[28]  In 1891, a second transmission system was installed in Telluride Colorado.[29] The San Antonio Canyon Generator was the third commercial single-phase hydroelectric AC power plant in the United States to provide long-distance electricity.  It was completed on December 31, 1892, by Almarian William Decker to provide power to the city of Pomona, California, which was 14 miles away. In 1893 he designed the first commercial three-phase power plant in the United States using alternating current–the hydroelectric Mill Creek No. 1 Hydroelectric Plant near Redlands, California.  Decker's design incorporated 10 kV three-phase transmission and established the standards for the complete system of generation, transmission and motors used today. The Jaruga Hydroelectric Power Plant in Croatia was set in operation on 28 August 1895. The two generators (42 Hz, 550 kW each) and the transformers were produced and installed by the Hungarian company Ganz. The transmission line from the power plant to the City of Šibenik was 11.5 kilometers (7.1 mi) long on wooden towers, and the municipal distribution grid 3000 V/110 V included six transforming stations. Alternating current circuit theory developed rapidly in the latter part of the 19th and early 20th century. Notable contributors to the theoretical basis of alternating current calculations include Charles Steinmetz, Oliver Heaviside, and many others.[30][31] Calculations in unbalanced three-phase systems were simplified by the symmetrical components methods discussed by Charles Legeyt Fortescue in 1918. \n\n\nSee also[edit]\n\n\n\tElectronics portal\n\tEnergy portal\n\n\n\n\n\tAC power\n\tElectrical wiring\n\tHeavy-duty power plugs\n\tHertz\n\tMains power systems\n\tAC power plugs and sockets\n\tUtility frequency\n\tWar of Currents\n\tAC/DC receiver design\n\n\n\n\nReferences[edit]\n\n\n\t^ N. N. Bhargava & D. C. Kulshreshtha (1983). Basic Electronics & Linear Circuits. Tata McGraw-Hill Education. p. 90. ISBN 978-0-07-451965-3.\n\n\t^ National Electric Light Association (1915). Electrical meterman's handbook. Trow Press. p. 81.\n\n\n\t^ \"The Basics of 400-Hz Power Systems\". Electrical Construction & Maintenance (EC&M) Magazine. March 1, 1995.\n\n\n\t^ \"Pixii Machine invented by Hippolyte Pixii, National High Magnetic Field Laboratory\". Archived from the original on 2008-09-07. Retrieved 2012-03-23.\n\n\n\t^ Licht, Sidney Herman., \"History of Electrotherapy\", in Therapeutic Electricity and Ultraviolet Radiation, 2nd ed., ed. Sidney Licht, New Haven: E. Licht, 1967, Pp. 1-70.\n\n\t^ a b \"Stanley Transformer\". Los Alamos National Laboratory; University of Florida. Archived from the original on 2009-01-19. Retrieved Jan 9, 2009.\n\n\n\t^ De Fonveille, W. (Jan 22, 1880). \"Gas and Electricity in Paris\". Nature. 21 (534): 283. Bibcode:1880Natur..21..282D. doi:10.1038/021282b0. Retrieved Jan 9, 2009.\n\n\n\t^ Hughes, Thomas P. (1993). Networks of Power: Electrification in Western Society, 1880–1930. Baltimore: The Johns Hopkins University Press. p. 96. ISBN 0-8018-2873-2. Retrieved Sep 9, 2009.\n\n\n\t^ a b Uppenborn, F. J. (1889). History of the Transformer. London: E. & F. N. Spon. pp. 35–41.\n\n\n\t^ Hughes (1993), p. 95.\n\n\t^ Jeszenszky, Sándor. \"Electrostatics and Electrodynamics at Pest University in the Mid-19th Century\" (PDF). University of Pavia. Retrieved Mar 3, 2012.\n\n\n\t^ a b Halacsy, A. A.; Von Fuchs, G. H. (April 1961). \"Transformer Invented 75 Years Ago\". IEEE Transactions of the American Institute of Electrical Engineers. 80 (3): 121–125. doi:10.1109/AIEEPAS.1961.4500994.\n\n\n\t^ \"Hungarian Inventors and Their Inventions\". Institute for Developing Alternative Energy in Latin America. Archived from the original on 2012-03-22. Retrieved Mar 3, 2012.\n\n\n\t^ \"Bláthy, Ottó Titusz\". Budapest University of Technology and Economics, National Technical Information Centre and Library. Retrieved Feb 29, 2012.\n\n\n\t^ \"Bláthy, Ottó Titusz (1860–1939)\". Hungarian Patent Office. Retrieved Jan 29, 2004.\n\n\n\t^ Zipernowsky, K.; Déri, M.; Bláthy, O.T. \"Induction Coil\" (PDF). U.S. Patent 352 105, issued Nov. 2, 1886. Retrieved July 8, 2009.\n\n\n\t^ American Society for Engineering Education. Conference – 1995: Annual Conference Proceedings, Volume 2, (PAGE: 1848)\n\n\t^ Hughes (1993), p. 96.\n\n\t^ Eugenii Katz. \"Blathy\". People.clarkson.edu. Archived from the original on June 25, 2008. Retrieved 2009-08-04.\n\n\n\t^ Ricks, G.W.D. (March 1896). \"Electricity Supply Meters\". Journal of the Institution of Electrical Engineers. 25 (120): 57–77. doi:10.1049/jiee-1.1896.0005.\n Student paper read on January 24, 1896, at the Students' Meeting.\n\n\t^ The Electrician, Volume 50. 1923\n\n\t^ Official gazette of the United States Patent Office: Volume 50. (1890)\n\n\t^ a b \"Ottó Bláthy, Miksa Déri, Károly Zipernowsky\". IEC Techline. Archived from the original on September 30, 2007. Retrieved Apr 16, 2010.\n\n\n\t^ Hughes (1993), p. 98.\n\n\t^ Ferranti Timeline Archived 2015-10-03 at the Wayback Machine – Museum of Science and Industry (Accessed 22-02-2012)\n\n\t^ Hughes (1993), p. 208.\n\n\t^ Arnold Heertje, Mark Perlman Evolving Technology and Market Structure: Studies in Schumpeterian Economics, page 138\n\n\t^ \"Electric Transmission of Power\". General Electric Review. XVIII. 1915.\n\n\n\t^ \"Electric Transmission of Power\". General Electric. XVIII. 1915.\n\n\n\t^ Grattan-Guinness, I. (September 19, 2003). Companion Encyclopedia of the History and Philosophy of the Mathematical Sciences. JHU Press. ISBN 978-0-8018-7397-3 – via Google Books.\n\n\n\t^ Suzuki, Jeff (August 27, 2009). Mathematics in Historical Context. MAA. ISBN 978-0-88385-570-6 – via Google Books.\n\n\n\n\n\n\nFurther reading[edit]\n\n\n\tWillam A. Meyers, History and Reflections on the Way Things Were: Mill Creek Power Plant – Making History with AC, IEEE Power Engineering Review, February 1997, pages 22–24\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Alternating current.\n\n\n\t\"AC/DC: What's the Difference?\". Edison's Miracle of Light, American Experience. (PBS)\n\t\"AC/DC: Inside the AC Generator\". Edison's Miracle of Light, American Experience. (PBS)\n\tKuphaldt, Tony R., \"Lessons In Electric Circuits : Volume II – AC\". March 8, 2003. (Design Science License)\n\tNave, C. R., \"Alternating Current Circuits Concepts\". HyperPhysics.\n\t\"Alternating Current (AC)\". Magnetic Particle Inspection, Nondestructive Testing Encyclopedia.\n\t\"Alternating current\". Analog Process Control Services.\n\tHiob, Eric, \"An Application of Trigonometry and Vectors to Alternating Current\". British Columbia Institute of Technology, 2004.\n\t\"Introduction to alternating current and transformers\". Integrated Publishing.\n\tChan. Keelin, \"Alternating current Tools\". JC Physics, 2002.\n\tWilliams, Trip \"Kingpin\", \"Understanding Alternating Current, Some more power concepts\".\n\t\"Table of Voltage, Frequency, TV Broadcasting system, Radio Broadcasting, by Country\".\n\tProfessor Mark Csele's tour of the 25 Hz Rankine generating station\n\t50/60 hertz information\n\tAC circuits Animations and explanations of vector (phasor) representation of RLC circuits\n\tBlalock, Thomas J., \"The Frequency Changer Era: Interconnecting Systems of Varying Cycles\". The history of various frequencies and interconversion schemes in the US at the beginning of the 20th century\n\t(in Italian) Generating an AC voltage. Interactive.\n\tAC Power History and Timeline\n\n\n\tAuthority control \t\n\tGND: 4064931-3\n\tLCCN: sh85041643\n\tNDL: 00566656\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Alternating_current&oldid=916659359\"\n\n\t\t\n\t\tCategories: \tElectrical engineering\n\tElectric current\n\tElectric power\n\tAC power\n\n\nHidden categories: \tCS1: Julian–Gregorian uncertainty\n\tWebarchive template wayback links\n\tAll articles with specifically marked weasel-worded phrases\n\tArticles with specifically marked weasel-worded phrases from December 2011\n\tCommons category link is on Wikidata\n\tArticles with Italian-language external links\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tአማርኛ\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBosanski\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tҚазақша\n\tKreyòl ayisyen\n\tKurdî\n\tLatviešu\n\tLietuvių\n\tMagyar\n\tМакедонски\n\tMalagasy\n\tമലയാളം\n\tBahasa Melayu\n\tNederlands\n\tनेपाली\n\t日本語\n\tNordfriisk\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tSeeltersk\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tతెలుగు\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\tWinaray\n\tWolof\n\t吴语\n\tייִדיש\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 20 September 2019, at 00:17 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "15", "dc:title": "Alternating current - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Types_of_current.svg/1200px-Types_of_current.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-alternating_current", "title": "Alternating current - Wikipedia"}}