{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnik (satellite) - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tAnik (satellite)\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Anik A1)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nLaunch of Anik B1 in December 1978\n\n\n\nThe Anik satellites are a series of geostationary communications satellites launched by Telesat Canada for television in Canada, from 1972 through 2013. Some of the later satellites in the series remain operational in orbit, while others have been retired and are derelict.  \nThe naming of the satellite was determined by a national contest, and was won by Julie-Frances Czapla of St. Leonard, Quebec.[1] In Inuktitut, Anik means \"little brother\".[2]\n\n\nContents\n\n\n\t1 The Satellites\n\t1.1 Anik A\n\t1.2 Anik B\n\t1.3 Anik C\n\t1.4 Anik D\n\t1.5 Anik E\n\t1.6 Anik F1 and F1R\n\t1.7 Anik F2\n\t1.8 Anik F3\n\t1.9 Anik G1\n\n\n\n\t2 References\n\t3 External links\n\n\n\n\n\nThe Satellites[edit]\n\n\tName\n\tSatellite type\n\tLaunched\n\tRetired\n\tLaunch vehicle\n\n\tAnik A1\n\tHughes Aircraft HS-333\n\tNovember 9, 1972\n\tJuly 15, 1982\n\tDelta 1914 rocket\n\n\tAnik A2\n\tHughes Aircraft HS-333\n\tApril 20, 1973\n\tOctober 6, 1982\n\tDelta rocket\n\n\tAnik A3\n\tHughes Aircraft HS-333\n\tMay 7, 1975\n\tNovember 21, 1984\n\tDelta rocket\n\n\tAnik B1\n\tRCA Astro Satcom\n\tDecember 15, 1978[3]\n\tDecember 1, 1986\n\tDelta rocket\n\n\tAnik C1\n\tHughes Aircraft HS-376\n\tApril 12, 1985\n\tMay 5, 2003\n\tSpace Shuttle Discovery\n\n\tAnik C2\n\tHughes Aircraft HS-376\n\tJune 18, 1983\n\tJanuary 7, 1998\n\tSpace Shuttle Challenger\n\n\tAnik C3\n\tHughes Aircraft HS-376\n\tNovember 11, 1982\n\tJune 18, 1997\n\tSpace Shuttle Columbia\n\n\tAnik D1\n\tHughes Aircraft HS-376\n\tAugust 26, 1982\n\tDecember 16, 1991\n\tDelta rocket\n\n\tAnik D2\n\tHughes Aircraft HS-376\n\tNovember 8, 1984\n\tJanuary 31, 1995\n\tSpace Shuttle Discovery\n\n\tAnik E1\n\tGE Astro 5000\n\tSeptember 26, 1991\n\tJanuary 18, 2005[citation needed]\n\tAriane 4\n\n\tAnik E2\n\tGE Astro 5000\n\tApril 4, 1991\n\tNovember 23, 2005[citation needed]\n\tAriane 4\n\n\tAnik F1\n\tHS 702 (later, became the Boeing 702)\n\tNovember 21, 2000\n\tStill in use\n\tAriane 4\n\n\tAnik F2\n\tBoeing 702\n\tJuly 17, 2004\n\tStill in use\n\tAriane 5G\n\n\tAnik F1R\n\tEurostar E3000\n\tSeptember 9, 2005\n\tStill in use\n\tProton/Breeze-M\n\n\tAnik F3\n\tEurostar E3000\n\tApril 10, 2007\n\tStill in use\n\tProton/Breeze-M\n\n\tAnik G1\n\tSpace Systems Loral 1300[4]\n\tApril 16, 2013\n\tStill in use\n\tProton/Breeze-M\n\n\n\nAnik A[edit]\n\n  \nInspection of an Anik A in the early 1970s\n\n\n\nThe Anik A satellites were the world's first national domestic satellites. (Prior to Anik A1's launch, all geosynchronous communications satellites were transcontinental, i.e. Intelsat I and others.)[5] The Anik A fleet of three satellites gave CBC the ability to reach the Canadian North for the first time. Each of the satellites was equipped with 12 C-band transponders, and thus had the capacity for 12 colour television channels. Three channels were allocated for CBC, two to TCTS and CNCP Telecommunications, two to Bell Canada, one for Canadian Overseas Telecommunications. Two channels were to put on reserve and the remaining two were unallocated (future use).[6][7]\n\n\nAnik B[edit]\n\nIt was launched on December 15, 1978, and was the successor to the Anik A series and Hermes (aka Communications Technology Satellite, or CTS) experimental satellite.\n\nMost of the transponders were devoted to CBC Television—East and West feed, CBC Parliamentary Television Network, CITV-TV Edmonton, CHCH Hamilton, and TVOntario.\n\nCNCP Telecommunications[8] also used Anik B as a relay for its services. The Globe and Mail used Anik B to transmit copy to printing plants across Canada.[9]\n\n\nAnik C[edit]\n\n  \nThe Canadian Telesat-F (Anik C2) communications satellite in June 1983, about to be deployed by the shuttle Challenger to begin its way to its earth-orbital destination.\n\n\n\nThe Anik C satellite series was three times more powerful[further explanation needed] than the Anik A series. They each had sixteen Ku band transponders.\n\nAnik C-3 was used to distribute Canada's first pay television networks -- First Choice, Superchannel, C-Channel, Star Channel, AIM Pay-TV since February 1983.\n\nAnik C-3 transponder lineup (1983): \n\n\n\t02 - Atlantic Satellite Network\n\t03 - Assiniboia Downs Racing Network\n\t06 - Super Écran TV Payante\n\t10 - Radio-Quebec\n\t14 - La Sette 2\n\t15 - Knowledge\n\t16 - La Sette 1\n\t17 - Access Alberta\n\t18 - TFO\n\t19 - Premier Choix/TVEC TV Payante\n\t20 - TVOntario\n\t23 - Superchannel\n\t24 - TVOntario-Legislature Channel\n\t25 - CHSC Canadian Home Shopping Club (West feed)\n\t27 - Knowledge Network\n\t30 - First Choice\n\t32 - CHSC Canadian Home Shopping Club (East feed)\n\n\nAnik D[edit]\n\nAnik D1 & D2 series C-Band satellites were launched in 1982 and 1984. They were based on the Hughes 376 design.\n\n\nAnik E[edit]\n\nAnik E1 & E2 were launched in the early 1990s to replace Anik D1 & D2. Unlike the cylinder-shaped spin-stabilised satellites of the D-series, these were cubical, 3-axis satellites using momentum wheels for attitude stabilisation.\n\nAnik E2 experienced an anomaly during deployment of its C-band antenna, which was successfully deployed after several corrective maneuvers.[10]\n\nOn Thursday, January 20, 1994, Anik E1 and E2 suffered problems due to solar activity. E1 failed first at 12:50 EST, knocking out satellite-delivered television signals in Canada. After a few hours, Telesat managed to restore normal functions on E1 at 20:15 EST. At 21:00 EST, both the primary and redundant E2 momentum wheels failed, thus eliminating the gyroscope effect that helps keep the satellite pointed correctly towards Earth. The exact problem lay with the circuitry having to do with the stabilizing momentum wheel.[11] E2 was not restored to service for five months; users had to relocate services to E1 and reposition satellite dishes; for some users, such as Northwestel in northern Canada, it meant days of flying technicians from one community to another to reposition the dishes.\n\nTelesat ultimately restored E2 by constructing special earth stations at each end of the country to monitor the satellite's position, and designed specialised software to use a combination of its control jets and magnetic torquing coils to finely position the satellite.  Even though a small amount of extra stationkeeping fuel was needed for pitch control, the efficiencies from using the magnetic coils for roll-yaw adjustment compensated for fuel usage that would have been used in those axes, so there was an insignificant overall effect on fuel use throughout the life of the satellite.  The Anik E2 satellite continued to provide full service for 14 years; two years longer than its design life of 12 years.\n\nOn March 26, 1996, another catastrophic failure occurred.  A critical diode on Anik E1's solar panel shorted out, causing a permanent loss of half the satellite's power.[12]\n\n\nAnik F1 and F1R[edit]\n\nAnik F1\n\tGeneral information\n\n\tLaunch Date\tNovember 21, 2000\n\n\tLaunch Mass\t4710 kg\n\n\tOrbit Mass\t3,015 kilograms (6,647 lb)\n\n\tManufacturer\t\n\n\tModel\t\n\n\tLauncher /\nFlight Number\tAriane 4 / Flight 136 [1]\n\n\tLifetime\t15 year\n\n\tTransponder Information\n\n\tTransponder Capacity\t\n\n\tTwta output power\t\n\n\tBandwidth\t\n\n\tEIRP\t\n\n\tSundries\n\n\tExpendable Energy\t\n\n\tLocation\n\n\tFormer location\t\n\n\tCurrent location\t\n\n\tList of broadcast satellites\n\n\n\n  \nAnimation of Anik-F1R trajectory around Earth showing the Geostationary transfer orbit\n\n\n\nAnik F1 is a Canadian geosynchronous communications satellite that was launched on November 21, 2000, by an Ariane 4 rocket from the European Space Agency  Guiana Space Centre at Kourou. At the moment of its launch it was the most powerful communications satellite ever built.  It has an advanced xenon Ion thruster propulsion system and its communication \"footprint\" covers Central America as well as North America.\n\nIt was launched by Telesat, a Canadian communications company.  The primary customers are the Canadian Broadcasting Corporation, Shaw Direct, CHUM Limited and Canadian Satellite Communications Inc.\n\n\n\tManufacturer: Telesat Canada\n\tSatellite Type: Boeing Satellite Systems (formerly Hughes aircraft) bus model 702\n\tMass:  4710 kg (10,384 lb) at launch and  3015 kg (6647 lb) in orbit\n\tDimensions:  40.4 m (132.5 feet) long and  9.0 m (29.5 feet) wide with the solar panels and antennas deployed.\n\tDC power: 17.5 kW\n\tExpected lifetime: 15 years\n\tTransponders: 84 C band and Ku band\n\tLaunch vehicle: Ariane 4\n\n\nThe solar panels of Anik F1 degraded more rapidly than expected, and a replacement Anik F1R was launched in 2005, with Anik F1 switching to serving only South America [2].  Anik F1R also carries a GPS/WAAS payload in addition to the C band and Ku band transponders.\n\n\nAnik F2[edit]\n\nAt 5,900 kilograms (13,000 lb), it is more than ten times the size of Anik A2 and is one of the largest, most powerful communications satellites ever built. Anik F2 is a Boeing 702-series satellite, designed to support and enhance current North American voice, data, and broadcast services with its C- and Ku-band technologies. It is the fifteenth satellite to be launched by Telesat.\n\nWith its use of Ka band technology, low-cost two-way satellite delivery will be available for wireless broadband Internet connections, telemedicine, teleteaching, teleworking and e-commerce in the most remote regions of Canada.\n\nOn October 6, 2011, starting around 6:30 am EST a \"technical\" anomaly caused the satellite to point away from the earth causing an outage in Internet, telephone and bank machine connectivity throughout much of Canada's northern areas.  The outage also affected flights in the region.[13][14][15] Some hospitals in Quebec reported an outage in their communications systems as a result of the satellite outage.[16] The anomaly was caused when the satellite did not respond well to a software update. As it failed, it turned away from the Earth and positioned itself towards the sun in order to keep critical systems running. This was Anik F2's first outage. The event caused the Canadian military's research arm, Defence Research and Development Canada, to start considering satellites as critical infrastructure systems and to invest in research to develop innovations that will help protect Canadian satellites from failures.[17]\n\nOn October 2, 2016, at approximately 5:00 pm EDT, another malfunction with Anik F2 resulted in a loss of Northwestel's long distance and cellular service, Xplornet and some of SSI Micro Internet, and some TV signals for Shaw Direct Satellite TV.[18][19]\n\n\nAnik F3[edit]\n\nAccording to SatNews Publishers, Anik F3 is a 4,634-kilogram (10,216 lb) broadcasting and telecommunications satellite which will provide direct-to-home television in the United States, broadband Internet and telecommunications for Bell Canada, and broadcast TV in northern and other remote areas of Canada.[20] It was built by EADS Astrium and launched on a Proton M rocket. It was successfully placed into orbit by International Launch Services, who also launched Anik F1R, Nimiq 1 and Nimiq 2.\n\nHowever, previous to launch, it was announced that Dish [formerly Dish Network] would be leasing the entire capacity of Anik F3 for its entire estimated life of approximately 15 years.  Today, Anik F3 is  used by Dish to beam its \"international\" foreign language channel offerings. A slightly larger reflector provided by Dish to its customers is required to receive the weaker (as compared to the stronger Ku DBS band used by Dish and DirecTV as their primary satellites) Ku FSS band reliably.  Also, Dish uses a specially designed \"combo\" LNB that houses both elements necessary to receive Dish services from both 118 and 119 taking the space of only a single LNB.  The combo LNB is also available part of a single LNBF unit that can also receive additional Dish programming at 110 and 129 satellite locations for reception of Dish's entire Western Arc constellation of satellites providing both SD and HD content.  Dish does not produce any 118 only LNBF's for its systems, only the combo 118/119 by itself or as part of a single unit that also receives other Dish satellites.\n\n\nAnik G1[edit]\n\nThe launch of G1 was announced by Telesat on April 16, 2013.[21]\n\nAnik G1 is a multi-mission satellite with three different payloads that will provide direct-to-home (DTH) television service in Canada, as well as broadband, voice, data, and video services in South America where economic growth has driven high demand for satellite services. It is also the first commercial satellite with a substantial X-band payload for government communications over the Americas and the Pacific Ocean including Hawaii. The satellite will be positioned at 107.3 degrees West longitude where it will be co-located with Telesat's Anik F1 satellite, doubling both the C-band and Ku-band transponders serving South America from the 107.3 degrees West orbital location.[22]\n\n\nReferences[edit]\n\n\n\t^ \"CBC Archives\". cbc.ca. Archived from the original on 3 March 2016. Retrieved 2 April 2018.\n\n\t^ \"anik\". Asuilaak Living Dictionary. Retrieved 2007-02-16.\n[permanent dead link]\n\n\t^ Reuters (December 20, 1978). \"Canadian satellite set in orbit position\". Globe and Mail. p. 2.\n\n\n\t^ \"Archived copy\". Archived from the original on 2010-02-10. Retrieved 2010-04-27.CS1 maint: archived copy as title (link)\n?\n\n\t^ \"Anik A 1, 2, 3\". space.skyrocket.de. Retrieved 2019-05-04.\n\n\n\t^ \"Anik-1 Launch Successful\". Winnipeg Free Press. Canadian Press. November 10, 1972. pp. 1, 4.\n\n\n\t^ Carruthers, Jeff (November 10, 1972). \"Anik Draws Admirers\". Winnipeg Free Press. Canadian Press. p. 4.\n\n\n\t^ Clifford, Edward (May 31, 1980). \"Rockets may lift Telesat's Aniks\". Globe and Mail. p. B16.\n\n\n\t^ Immen, Wallace (September 10, 1982). \"Platform to give Anik a boost after ride on space shuttle\". Globe and Mail. p. E8.\n\n\n\t^ David Michael Harland and Ralph Lorenz (2005). Space systems failures: disasters and rescues of satellites, rockets and space probes. Springer. p. 296.\n\n\n\t^ \"Anik E ... Phone Home\". Broadcaster: 12. March 1994.\n\n\n\t^ Sten Odenwald (2002). The 23rd Cycle: Learning to Live with a Stormy Star. Columbia University Press. p. 65. ISBN 978-0-231-50593-2.\n\n\n\t^ \"Satellite problems ground Nunavut flights\". CBC News. October 7, 2011. Archived from the original on 6 October 2011. Retrieved 6 October 2011.\n\n\n\t^ \"Archived copy\". Archived from the original on 2014-03-08. Retrieved 2013-10-01.CS1 maint: archived copy as title (link)\n Canadian Satellite Malfunction Leaves Thousands Without Communications\n\n\t^ http://www.telesat.com/sites/default/files/telesat/files/news/anikf2_servicerestoredpressreleasefinal2.pdf[permanent dead link] SERVICES RESTORED ON TELESAT'S ANIK F2 SATELLITE AFTER ANOMALY\n\n\t^ \"Des dizaines de milliers de Canadiens touchés par la panne d'un satellite\". Radio-Canada. October 6, 2011. Archived from the original on 5 October 2016. Retrieved 2 October 2016.\n\n\n\t^ \"Satellites need protection as 'critical infrastructure,' military says\". CBC News. November 29, 2015. Archived from the original on 5 October 2016. Retrieved 2 October 2016.\n\n\n\t^ \"Interruption of Service on Telesat's Anik F2 Satellite\". Globe News Wire. October 2, 2016. Archived from the original on 3 October 2016. Retrieved 2 October 2016.\n\n\n\t^ \"Nunatsiaq News 2016-10-03: NEWS: Telesat satellite screw-up knocks out internet, LD phone service across northern Canada\". www.nunatsiaqonline.ca. Archived from the original on 11 January 2018. Retrieved 2 April 2018.\n\n\n\t^ \n\"Anik F3 Launch Successful\". SatNews Daily. Archived from the original on 2012-02-05.\n\n\n\t^ \"Telesat Successfully Launches Anik G1 Satellite - Telesat\". www.telesat.com. Archived from the original on 12 January 2018. Retrieved 2 April 2018.\n\n\n\t^ \"Archived copy\". Archived from the original on 2013-04-30. Retrieved 2013-05-01.CS1 maint: archived copy as title (link)\n\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Anik (satellite).\n\n\n\tTelesat's list of satellites\n\tThe list from the CSA's website\n\tCBC Digital Archives - Launching the Digital Age: Canadian Satellites\n\tAnik D series\n\tAnik F1\n\tAnik F2\n\tAnik F3 Channel List at Sathint\n\t1972 Anik A1 NWT Historical Timeline, Prince of Wales Northern Heritage Centre\n\tAnik F1  footprint(s) at SatBeams\n\tAnik F1R  footprint(s) at SatBeams\n\tAnik F2  footprint(s) at SatBeams\n\tAnik F3  footprint(s) at SatBeams\n\tAnik G1  footprint(s) at SatBeams\n\n\n\t\tv\n\tt\n\te\n\n\nTelecommunications\n\n\tHistory\t\n\tBeacon\n\tBroadcasting\n\tCable protection system\n\tCable TV\n\tCommunications satellite\n\tComputer network\n\tDrums\n\tElectrical telegraph\n\tFax\n\tHeliographs\n\tHydraulic telegraph\n\tInternet\n\tMass media\n\tMobile phone\n\tOptical telecommunication\n\tOptical telegraphy\n\tPager\n\tPhotophone\n\tPrepaid mobile phone\n\tRadio\n\tRadiotelephone\n\tSatellite communications\n\tSemaphore\n\tSmartphone\n\tSmoke signals\n\tTelecommunications history\n\tTelautograph\n\tTelegraphy\n\tTeleprinter (teletype)\n\tTelephone\n\tThe Telephone Cases\n\tTelevision\n\tUndersea telegraph line\n\tVideoconferencing\n\tVideophone\n\tVideotelephony\n\tWhistled language\n\n\n\n\t\n\n\tPioneers\t\n\tEdwin Howard Armstrong\n\tJohn Logie Baird\n\tPaul Baran\n\tAlexander Graham Bell\n\tTim Berners-Lee\n\tJagadish Chandra Bose\n\tVint Cerf\n\tClaude Chappe\n\tDonald Davies\n\tLee de Forest\n\tPhilo Farnsworth\n\tReginald Fessenden\n\tElisha Gray\n\tErna Schneider Hoover\n\tCharles K. Kao\n\tHedy Lamarr\n\tInnocenzo Manzetti\n\tGuglielmo Marconi\n\tAntonio Meucci\n\tRadia Perlman\n\tAlexander Stepanovich Popov\n\tJohann Philipp Reis\n\tHenry Sutton\n\tNikola Tesla\n\tCamille Tissot\n\tAlfred Vail\n\tCharles Wheatstone\n\tVladimir K. Zworykin\n\n\n\n\n\tTransmission\nmedia\t\n\tCoaxial cable\n\tFiber-optic communication\n\tOptical fiber\n\n\n\tFree-space optical communication\n\tMolecular communication\n\tRadio waves\n\tTransmission line\n\n\n\n\n\tNetwork topology\nand switching\t\n\tLinks\n\tNodes\n\tTerminal node\n\tNetwork switching (circuit\n\tpacket)\n\tTelephone exchange\n\n\n\n\n\tMultiplexing\t\n\tSpace-division\n\tFrequency-division\n\tTime-division\n\tPolarization-division\n\tOrbital angular-momentum\n\tCode-division\n\n\n\n\n\tNetworks\t\n\tARPANET\n\tBITNET\n\tCellular network\n\tComputer\n\tCYCLADES\n\tEthernet\n\tFidoNet\n\tInternet\n\tInternet2\n\tISDN\n\tLAN\n\tMobile\n\tNGN\n\tNPL network\n\tPublic Switched Telephone\n\tRadio\n\tTelecommunications equipment\n\tTelevision\n\tTelex\n\tWAN\n\tWireless network\n\tWorld Wide Web\n\n\n\n\n\t\n\t Category\n\t Outline\n\t Portal\n\t Commons\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n Canadian Space Agency\n\n\tCanadian astronauts\t\n\n\tActive\t\n\tJeremy Hansen\n\tDavid Saint-Jacques\n\tJennifer Sidey\n\tJoshua Kutryk\n\n\n\n\n\tRetired\t\n\tMarc Garneau\n\tRoberta Bondar\n\tSteven MacLean\n\tChris Hadfield\n\tRobert Thirsk\n\tBjarni Tryggvason\n\tDafydd Williams\n\tJulie Payette\n\tMichael McKay\n\tKen Money\n\n\n\n\n\tOther\t\n\tGuy Laliberté (space tourist)\n\n\n\n\n\n\n\n\tSatellites\t\n\tAlouette 1\n\tAlouette 2\n\tAnik series\n\tBRITE\n\tCASSIOPE\n\tHermes\n\tISIS 1\n\tISIS 2\n\tM3MSat\n\tMOST\n\tMSAT-1\n\tNEOSSat\n\tNimiq series\n\tRADARSAT-1\n\tRADARSAT-2\n\tRADARSAT Constellation\n\tSCISAT-1\n\tSapphire\n\n\n\n\n\tOther space technology\t\n\tBlack Brant rocket\n\tCanadarm\n\tCanadarm2\n\tDextre\n\tFGS/NIRISS\n\tMOPITT\n\tOSIRIS\n\n\n\n\n\tFacilities\t\n\tJohn H. Chapman Space Centre\n\tDavid Florida Laboratory\n\tSaskatoon CSA Building\n\n\n\n\n\tContractors\t\n\tCOM DEV\n\tMacDonald, Dettwiler and Associates (MDA Space Missions/Spar Aerospace)\n\tMagellan Aerospace (Bristol Aerospace)\n\tTelesat\n\tUTIAS-SFL\n\n\n\n\n\tRelated institutions\t\n\tCanadian Geospace Monitoring\n\tCommunications Research Centre Canada\n\tDefence Research and Development Canada\n\tNational Research Council\n\n\n\n\n\tInternational partners\t\n\tESA\n\tNASA\n\tISRO\n\tJAXA\n\tSNSB\n\n\n\n\n\tOther\t\n\tBell TV\n\tChurchill Rocket Research Range\n\tInternational Space Station\n\tLunar Orbital Platform-Gateway\n\tShaw Direct\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Anik_(satellite)&oldid=915213032\"\n\n\t\t\n\t\tCategories: \tBroadcasting in Canada\n\tCommunications satellites of Canada\n\tHigh throughput satellites\n\tTelesat\n\n\nHidden categories: \tAll articles with dead external links\n\tArticles with dead external links from July 2017\n\tArticles with permanently dead external links\n\tCS1 maint: archived copy as title\n\tArticles with dead external links from September 2017\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from July 2012\n\tWikipedia articles needing clarification from July 2019\n\tCommons category link is on Wikidata\n\tUse Canadian English from January 2014\n\tAll Wikipedia articles written in Canadian English\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tDeutsch\n\tEspañol\n\tFrançais\n\tGalego\n\t日本語\n\tPortuguês\n\tРусский\n\tSlovenčina\n\tSuomi\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 11 September 2019, at 21:41 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "10", "dc:title": "Anik (satellite) - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Anik_B1_launch.jpg/1200px-Anik_B1_launch.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-anik_a1", "title": "Anik (satellite) - Wikipedia"}}