{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApollo (spacecraft) - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tApollo (spacecraft)\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nComplete Apollo spacecraft stack: launch escape system, command module, service module, Lunar Module, and spacecraft–LM adapter\n\n\n\n  \nThe Apollo 17 CSM seen in lunar orbit from the ascent stage of the lunar module\n\n\n \nThe Apollo spacecraft was composed of three parts designed to accomplish the American Apollo program's goal of landing astronauts on the Moon by the end of the 1960s and returning them safely to Earth.  The expendable (single-use) spacecraft consisted of a combined command and service module (CSM) and an Apollo Lunar Module (LM). Two additional components complemented the spacecraft stack for space vehicle assembly: a spacecraft–LM adapter (SLA) designed to shield the LM from the aerodynamic stress of launch and to connect the CSM to the Saturn launch vehicle; and a launch escape system (LES) to carry the crew in the command module safely away from the launch vehicle in the event of a launch emergency.\n\nThe design was based on the lunar orbit rendezvous approach: two docked spacecraft were sent to the Moon and went into lunar orbit. While the LM separated and landed, the CSM remained in orbit. After the lunar excursion, the two craft rendezvoused and docked in lunar orbit, and the CSM returned the crew to Earth. The command module was the only part of the space vehicle that returned with the crew to the Earth's surface.\n\nThe LES was jettisoned during launch upon reaching the point where it was no longer needed, and the SLA remained attached to the launch vehicle's upper stage. Two uncrewed CSMs, one uncrewed LM and one crewed CSM were carried into space by Saturn IB launch vehicles for low Earth orbit Apollo missions. Larger Saturn Vs launched two uncrewed CSM's on high Earth orbit test flights, the CSM on one crewed lunar mission, the complete spacecraft on one crewed low Earth orbit mission and eight crewed lunar missions. After conclusion of the Apollo program, four CSMs were launched on Saturn IBs for three Skylab Earth orbital missions and the Apollo-Soyuz Test Project.\n\n\nContents\n\n\n\t1 Command and service module\n\t1.1 Command module (CM)\n\t1.2 Service module (SM)\n\n\n\n\t2 Lunar Module (LM)\n\t3 Spacecraft–lunar module adapter (SLA)\n\t3.1 Specifications\n\n\n\n\t4 Launch escape system (LES)\n\t4.1 Major components\n\t4.2 Specifications\n\t4.3 Abort tests\n\n\n\n\t5 Current locations of spacecraft\n\t6 References\n\t7 External links\n\n\n\n\n\nCommand and service module[edit]\n\nMain article: Apollo command and service module\n\nThe major part of the Apollo spacecraft was a three-man vehicle designed for Earth orbital, translunar, and lunar orbital flight, and return to Earth. This consisted of a command module supported by a service module, built by North American Aviation (later North American Rockwell).\n\n\nCommand module (CM)[edit]\n\n  \nApollo Command Module and its position on top of Saturn V\n\n\n\nThe command module was the control center for the Apollo spacecraft and living quarters for the three crewmen. It contained the pressurized main crew cabin, crew couches, control and instrument panel, Primary Guidance, Navigation and Control System, communications systems, environmental control system, batteries, heat shield, reaction control system to provide attitude control, forward docking hatch, side hatch, five windows, and a parachute recovery system. It was the only part of the Apollo/Saturn space vehicle that returned to Earth intact.\n\n\nService module (SM)[edit]\n\n  \nApollo Service Module\n\n\n\nThe service module was unpressurized and contained a main service propulsion engine and hypergolic propellant to enter and leave lunar orbit, a reaction control system to provide attitude control and translational capability, fuel cells with hydrogen and oxygen reactants, radiators to dump waste heat into space, and a high gain antenna. The oxygen was also used for breathing, and the fuel cells produced water for drinking and environmental control. On Apollo 15, 16 and 17 it also carried a scientific instrument package, with a mapping camera and a small sub-satellite to study the Moon.\n\nA major portion of the service module was taken up by propellant and the main rocket engine. Capable of multiple restarts, this engine placed the Apollo spacecraft into and out of lunar orbit, and was used for mid-course corrections between the Earth and the Moon.\n\nThe service module remained attached to the command module throughout the mission. It was jettisoned just prior to reentry into the Earth's atmosphere.\n\n\nLunar Module (LM)[edit]\n\nMain article: Apollo Lunar Module\n\n  \nApollo Lunar Module\n\n\n\nThe Apollo Lunar Module was a separate vehicle designed to land on the Moon and return to lunar orbit, and was the first true \"spaceship\" since it flew solely in the vacuum of space. It consisted of a descent stage and an ascent stage. It supplied life support systems for two astronauts for up to four to five days on the Apollo 15, 16 and 17 missions. The spacecraft was designed and manufactured by the Grumman Aircraft Company.\n\nThe descent stage contained the landing gear, landing radar antenna, descent propulsion system, and fuel to land on the Moon. It also had several cargo compartments used to carry, among other things: the Apollo Lunar Surface Experiment Packages ALSEP, the modularized equipment transporter (MET) (a hand-pulled equipment cart used on Apollo 14), the Lunar Rover (Apollo 15, 16 and 17), a surface television camera, surface tools, and lunar sample collection boxes.\n\nThe ascent stage contained the crew cabin, instrument panels, overhead hatch/docking port, forward hatch, optical and electronic guidance systems, reaction control system, radar and communications antennas, ascent rocket engine and propellant to return to lunar orbit and rendezvous with the Apollo Command and Service Modules.\n\n\nSpacecraft–lunar module adapter (SLA)[edit]\n\n  \nApollo spacecraft-to-LM adapter\n\n\n\nThe spacecraft–LM adapter (SLA), built by North American Aviation (Rockwell), was a conical aluminum structure which supported the service module[1] above the Saturn S-IVB rocket stage. It protected the LM, the service propulsion system engine nozzle, and the launch vehicle to service module umbilical during launch and ascent through the atmosphere. \n\nThe SLA was composed of four fixed 7-foot (2.1 m) tall panels bolted to the Instrument Unit on top of the S-IVB stage, which were connected via hinges to four 21-foot-tall (6.4 m) panels which would open from the top similar to flower petals.\n\nThe SLA was made from 1.7-inch (43 mm) thick aluminum honeycomb material.[2] The exterior of the SLA was covered by a thin (0.03–0.2 inches or 0.76–5.08 millimetres) layer of cork and painted white to minimize thermal stresses during launch and ascent.[3]\n\nThe service module was bolted to a flange at the top of the longer panels, and power to the SLA multiply-redundant pyrotechnics was provided by an umbilical. Because a failure to separate from the S-IVB stage could leave the crew stranded in orbit, the separation system used multiple signal paths, multiple detonators and multiple explosive charges where the detonation of one charge would set off another even if the detonator on that charge failed to function.\n\n\n  \nOne of the SLA panels on Apollo 7 did not fully open to the designed 45 degrees.\n\n\n\nTransposition of CSM, docking and extraction of LM\n\n\nAdapter panels are jettisoned and the CSM is turned 180 degrees\n\n\nThe CSM docks with the LM and pulls it away from the  Saturn V third stage\n\n\n\n\n\nOnce in space, the astronauts pressed the 'CSM/LV Sep' button on the control panel to separate the CSM from the launch vehicle. Detonating cord was ignited around the flange between the SM and SLA, and along the joints between the four SLA panels, releasing the SM and blowing apart the connections between the panels. Dual-redundant pyrotechnic thrusters at the lower end of the SLA panels then fired to rotate them around the hinges at 30-60 degrees per second.\n\nOn all flights through Apollo 7, the SLA panels remained hinged to the S-IVB and opened to a 45-degree angle, as originally designed. But as the Apollo 7 crew practiced rendezvous with the S-IVB/SLA containing a dummy docking target, one panel did not open to the full 45 degrees, raising concern about the possibility of collision between the spacecraft and the SLA panels during docking and extraction of the LM in a lunar mission. This led to a redesign using a spring-loaded hinge release system which released the panels at the 45 degree angle and pushed them away from the S-IVB at a velocity of about 8 km/h (5 m.p.h.), putting them a safe distance away by the time the astronauts pulled the CSM away, rotated it through 180 degrees, and came back for docking.\n\nThe LM was connected to the SLA at four points around the lower panels. After the astronauts docked the CSM to the LM, they blew charges to separate those connections and a guillotine severed the LM-to-instrument-unit umbilical. After the charges fired, springs pushed the LM away from the S-IVB and the astronauts were free to continue their trip to the Moon.\n\n\nSpecifications[edit]\n\n\tHeight: 28 ft (8.5 m)\n\tApex diameter: 12 ft 10 in (3.9 m) Service module end\n\tBase diameter: 21 ft 8 in (6.6 m) S-IVB end\n\tWeight: 4,050 lb (1,840 kg)\n\tVolume: 6,700 cu ft (190 m3), 4,900 cu ft (140 m3) usable\n\n\nLaunch escape system (LES)[edit]\n\n  \nPad abort test (2), showing pitch motor and launch escape motor in operation\n\n\n\nSee also: Apollo abort modes\n\nThe Apollo launch escape system (LES) was built by the Lockheed Propulsion Company. Its purpose was to abort the mission by pulling the CM (the crew cabin) away from the launch vehicle in an emergency, such as a pad fire before launch, guidance failure, or launch vehicle failure likely to lead to an imminent explosion.\n\nThe LES included three wires that ran down the exterior of the launch vehicle. If the signals from any two of the wires were lost, the LES would activate automatically.[4] Alternatively, the Commander could activate the system manually using one of two translation controller handles, which were switched to a special abort mode for launch. When activated, the LES would fire a solid fuel escape rocket, and open a canard system to direct the CM away from, and off the path of, a launch vehicle in trouble. The LES would then jettison and the CM would land with its parachute recovery system.\n\nIf the emergency happened on the launch pad, the LES would lift the CM to a sufficient height to allow the recovery parachutes to deploy safely before coming in contact with the ground.\n\nIn the absence of an emergency, the LES was routinely jettisoned about 20 or 30 seconds after the launch vehicle's second-stage ignition, using a separate solid fuel rocket motor manufactured by the Thiokol Chemical Company. Abort modes after this point would be accomplished without the LES. The LES was carried but never used on four uncrewed Apollo flights, and fifteen crewed Apollo, Skylab, and Apollo-Soyuz Test Project flights.\n\n\nMajor components[edit]\n\n  \nApollo launch escape system components\n\n\n\n\tNose cone and Q-ball\n\tThe nose cone of the LES contained an array of 8 pressure-measuring pitot tubes in a structure known as the \"Q-ball\". These sensors were connected to the CM and Saturn launch vehicle guidance computers, allowing calculation of dynamic pressure (q) during atmospheric flight, and also the angle of attack in the event of an abort.[5]\n\tQ-ball cover\n\tA styrofoam cover, removed a few seconds before launch, protected the pitot tubes from being clogged by debris.[6]  The cover was split in half vertically and held together by a 2-inch (51 mm) rubber band. A razor blade was positioned behind the rubber band, pinched between the halves of the cover. A wire cable was connected to the top and bottom of the razor blade and to both halves of the cover. The cable was routed through a pulley on the hammerhead crane at the top of the launch umbilical tower (LUT) down to a tube on the right side of the 360-foot (110 m) level of the LUT. The cable was connected to a cylindrical weight inside a tube. The weight rested on a lever controlled by a pneumatic solenoid valve. When the valve was actuated from the Launch Control Center (LCC), the pneumatic pressure of 600 PSI GN2 (nitrogen gas) rotated the lever down allowing the weight to drop down the tube. The dropping weight pulled the cable, which pulled the blade cutting the rubber band, and the cable pulled the halves of the cover away from the launch vehicle. The apparent overengineering of this safety system was due to the fact that the launch escape system, which depended on the Q-ball data, was armed 5 minutes before launch, so retraction of the Q-ball cover was a life-critical part of a possible pad abort.\n\tCanard assembly and pitch motor\n\tThese worked in combination to direct the CM off a straight path and to the side during an emergency. This would direct the CM off the flight path of an exploding launch vehicle. It would also direct the CM to land off to the side of any launch pad fire and not in the middle of it.\n\tLaunch escape motor\n\tThe main solid fuel rocket motor inside a long tube, with four exhaust nozzles mounted under a conical fairing. This would pull the CM rapidly away from a launch emergency.\n\tTower jettison motor\n\tA smaller solid fuel motor with two exhaust nozzles, mounted in the tube, above the escape motor. This jettisoned the entire Launch Escape System after it was no longer needed, sometime after second stage ignition.\n\tLaunch escape tower\n\tA truss framework of tubes that attached the escape motor fairing to the CM.\n\tBoost protective cover\n\tA hollow conical fiberglass structure protecting the CM's parachute compartment and providing a smooth aerodynamic cover over the docking tunnel and probe. After erosion of the pilot's windows from the escape motor exhaust was discovered during early LES flight testing, an aft protective cover surrounding the CM's entire upper surface was added.\n\n\nSpecifications[edit]\n\n\tLength minus BPC: 32 ft 6 in (9.92 m)\n\tLength with BPC: 39 ft 5 in (12.02 m)\n\tDiameter: 2 ft 2 in (0.66 m)\n\tTotal mass: 9,200 pounds (4,200 kg)\n\tThrust, 36,000 ft: 147,000 pounds-force (650 kN)\n\tThrust, maximum: 200,000 pounds-force (890 kN)\n\tBurn time: 4.0 seconds\n\n\nAbort tests[edit]\n\n\tPad Abort Test 1 – LES abort test from launch pad with Apollo boilerplate BP-6\n\tPad Abort Test 2 – LES pad abort test of near Block-I CM with Apollo boilerplate B-23A\n\tLittle Joe II – Four in-flight LES abort tests.\n\n\nCurrent locations of spacecraft[edit]\n\nThe disposition of all command modules, and all unflown service modules is listed at Apollo command and service module#CSMs produced. (All flown service modules burned up in the Earth's atmosphere at termination of the missions.)\n\nThe disposition of all lunar modules is listed at Apollo Lunar Module#Lunar modules produced.\n\n\nReferences[edit]\n\n\n\t^ No CSM was carried on the Apollo 5 uncrewed LM flight, and an aerodynamic nose cone was fastened to the top of the SLA instead.\n\n\t^ https://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/19730010176_1973010176.pdf\n\n\t^ Launius, Roger D. \"Moonport, Ch20-3\". Retrieved 11 October 2016.\n\n\t^ \"Apollo Launch Abort System Test\" on YouTube\n\n\t^ \"Apollo 16 Flight Journal: Day 1 Part One\". Archived from the original on 2 July 2013. Retrieved 11 October 2016.\n\n\n\t^ http://www.hq.nasa.gov/office/pao/History/ap15fj/video/ap15_liftoff.mpg\n\n\n\n\n\n\tNorth American Rockwell, 'Apollo Command Module News Reference', 1968.\n\tNASA TN D-7083: Launch Escape Propulsion Subsystem\n\tApollo Operations Handbook Lunar Module Subsystems Data\n\n\nExternal links[edit]\n\n\tNASA report JSC-03600 Apollo/Skylab ASTP and Shuttle Orbiter Major End Items, Final Report, March 1978; NASA report listing dispositions of all rockets and spacecraft used in the Apollo, Skylab, Apollo-Soyez Test Project and early shuttle missions, as of 1978.\n\tApollo D-2 Proposal by General Electric, Encyclopedia Astronautica\n\n\n\t\tv\n\tt\n\te\n\n\nApollo program hardware\n\n\tLaunch vehicles\t\n\tLittle Joe II\n\tSaturn I\n\tSaturn IB\n\tSaturn V\n\n\n\n\t\n\n\tLaunch vehicle\ncomponents\t\n\tF-1 engine\n\tJ-2 engine\n\tInstrument unit\n\tSaturn Launch Vehicle Digital Computer\n\n\n\n\n\tSpacecraft\t\n\tApollo (spacecraft)\n\tApollo command and service module\n\tApollo Lunar Module\n\n\n\n\n\tSpacecraft\ncomponents\t\n\tApollo Abort Guidance System\n\tApollo Docking Mechanism\n\tApollo Guidance Computer\n\tPrimary guidance, navigation, and control system\n\tApollo Telescope Mount\n\tApollo TV camera\n\tDescent propulsion system\n\tAscent propulsion system\n\tScimitar antenna\n\n\n\n\n\tSpace suits\t\n\tApollo/Skylab A7L\n\tBeta cloth\n\n\n\n\n\tLunar surface\nequipment\t\n\tPortable Life Support System\n\tLunar Roving Vehicle\n\tLunar Laser Ranging experiment\n\tSolar Wind Composition Experiment\n\tApollo Lunar Surface Experiments Package\n\tApollo 12 Passive Seismic Experiment\n\tApollo 14 Passive Seismic Experiment\n\tCharged Particle Lunar Environment Experiment\n\n\n\tModular Equipment Transporter\n\n\n\n\n\tGround support\t\n\tMobile Launcher Platform\n\tLaunch umbilical tower\n\tCrawler-transporter\n\tLunar Landing Research Vehicle\n\tMobile quarantine facility\n\n\n\n\n\tCeremonial\t\n\tLunar plaque\n\tLunar Flag Assembly\n\tFallen Astronaut\n\tApollo 11 goodwill messages\n\n\n\n\n\tRelated\t\n\tLunar escape systems\n\n\n\n\n\t Category:Apollo program hardware\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nApollo program\n\n\t\n\tList of missions\n\tcanceled missions\n\tmission types\n\n\n\tList of Apollo astronauts\n\n\n\n\n\tLaunch vehicles\t\n\tLittle Joe II\n\tSaturn\n\tSaturn I\n\tSaturn IB\n\tSaturn V\n\n\n\n\n\n\t\n\n\tSpacecraft\t\n\tCommand and Service Module\n\tLunar Module\n\n\n\n\n\tRover\t\n\tLunar Roving Vehicle\n\n\n\n\n\tApollo flights\t\n\tUncrewed\t\n\tAS-101\n\tAS-102\n\tAS-201\n\tAS-202\n\tApollo 4\n\tApollo 5\n\tApollo 6†\n\n\n\n\n\tCrewed\t\n\tApollo 1 (AS-204)†\n\tApollo 7\n\tApollo 8\n\tApollo 9\n\tApollo 10\n\tApollo 11\n\tApollo 12\n\tApollo 13†\n\tApollo 14\n\tApollo 15\n\tApollo 16\n\tApollo 17\n\n\n\n\n\tFacilities\t\n\tMission Control Center\n\tCape Canaveral\n\tLC-34\n\tLC-37\n\n\n\tKennedy Space Center\n\tLC-39\n\n\n\n\n\n\n\tSaturn\ndevelopment\t\n\tSA-1\n\tSA-2\n\tSA-3\n\tSA-4\n\tSA-5\n\tAS-203\n\tApollo 4\n\tApollo 6†\n\n\n\n\n\tAbort tests\t\n\tQTV\n\tPad Abort Test-1\n\tA-001\n\tA-002\n\tA-003\n\tPad Abort Test-2\n\tA-004\n\n\n\n\n\tPegasus flights\t\n\tAS-103\n\tAS-104\n\tAS-105\n\n\n\n\n\n\n\n\t\n\tSymbol † indicates failure or partial failure\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNASA\n\n\tPolicy and history\t\n\tHistory\t\n\tNACA (1915)\n\tNational Aeronautics and Space Act (1958)\n\tSpace Task Group (1958)\n\tPaine (1986)\n\tRogers (1986)\n\tRide (1987)\n\tSpace Exploration Initiative (1989)\n\tAugustine (1990)\n\tU.S. National Space Policy (1996)\n\tCFUSAI (2002)\n\tCAIB (2003)\n\tVision for Space Exploration (2004)\n\tAldridge (2004)\n\tAugustine (2009)\n\n\n\n\n\tGeneral\t\n\tSpace Race\n\tAdministrator and Deputy Administrator\n\tChief Scientist\n\tAstronaut Corps\n\tRanks and positions\n\tChief\n\n\n\tBudget\n\tSpin-off technologies\n\tNASA TV\n\tNASA Social\n\tLaunch Services Program\n\tMercury Control Center\n\tKennedy Space Center\n\tVehicle Assembly Building\n\tLaunch Complex 39\n\tLaunch Control Center\n\tOperations and Checkout Building\n\n\n\tJohnson Space Center\n\tMission Control\n\tLunar Sample Laboratory\n\n\n\n\n\n\n\n\n\t\n\n\tRobotic programs\t\n\tPast\t\n\tHitchhiker\n\tMariner\n\tMariner Mark II\n\tMESUR\n\tMars Surveyor '98\n\tNew Millennium\n\tLunar Orbiter\n\tPioneer\n\tPlanetary Observer\n\tRanger\n\tSurveyor\n\tViking\n\tProject Prometheus\n\tMars Scout\n\tMars Exploration Rover\n\n\n\n\n\tCurrent\t\n\tLiving With a Star\n\tLunar Precursor Robotic Program\n\tEarth Observing System\n\tGreat Observatories program\n\tExplorer\n\tSmall explorer\n\tVoyager\n\tDiscovery\n\tNew Frontiers\n\tSolar Terrestrial Probes\n\tCommercial Lunar Payload Services\n\n\n\n\n\n\n\n\tHuman spaceflight\nprograms\t\n\tPast\t\n\tX-15 (suborbital)\n\tMercury\n\tGemini\n\tApollo\n\tApollo–Soyuz Test Project (with the Soviet space program)\n\tSkylab\n\tSpace Shuttle\n\tShuttle–Mir (with Roscosmos State Corporation)\n\tConstellation\n\n\n\n\n\tCurrent\t\n\tInternational Space Station\n\tCommercial Orbital Transportation Services\n\tCommercial Crew Development\n\tOrion\n\tArtemis\n\tLunar Gateway\n\n\n\n\n\n\n\n\tIndividual featured\n missions\n(human and robotic)\t\n\tPast\t\n\tCOBE\n\tMercury 3\n\tMercury-Atlas 6\n\tMagellan\n\tPioneer 10\n\tPioneer 11\n\tGalileo\n\tGALEX\n\tGRAIL\n\tWMAP\n\tSpace Shuttle\n\tSojourner rover\n\tSpirit rover\n\tLADEE\n\tMESSENGER\n\tAquarius\n\tCassini\n\tDawn\n\tKepler space telescope\n\tOpportunity rover\n\tRHESSI\n\tobserved\n\n\n\n\n\n\n\tCurrently\noperating\t\n\tMars Reconnaissance Orbiter\n\t2001 Mars Odyssey\n\tNew Horizons\n\tInternational Space Station\n\tHubble Space Telescope\n\tSpitzer\n\tSwift\n\tTHEMIS\n\tMars Exploration Rover\n\tCuriosity rover\n\ttimeline\n\n\n\tInSight\n\tGOES 14\n\tLunar Reconnaissance Orbiter\n\tGOES 15\n\tVan Allen Probes\n\tSolar Dynamics Observatory\n\tJuno\n\tMars Science Laboratory\n\ttimeline\n\n\n\tNuSTAR\n\tVoyager 1\n\tVoyager 2\n\tWISE\n\tMAVEN\n\tMMS\n\tOSIRIS-REx\n\tTransiting Exoplanet Survey Satellite\n\n\n\n\n\tFuture\t\n\tJoint Polar Satellite System\n\tJames Webb Space Telescope\n\tWide Field Infrared Survey Telescope\n\tMars 2020\n\tNISAR\n\tEuropa Clipper\n\n\n\n\n\n\n\n\tCommunications\nand navigation\t\n\tNear Earth Network\n\tSpace Network\n\tDeep Space Network (Goldstone\n\tMadrid\n\tCanberra\n\tSpace Flight Operations Facility)\n\tDeep Space Atomic Clock\n\n\n\n\n\tNASA lists\t\n\tAstronauts\n\tby name\n\tby year\n\tGemini astronauts\n\tApollo astronauts\n\n\n\tList of NASA aircraft\n\tList of NASA missions\n\tuncrewed missions\n\n\n\tList of NASA contractors\n\tList of United States rockets\n\tList of NASA cancellations\n\tList of Space Shuttle missions\n\tcrews\n\n\n\tList of NASA cameras on spacecraft\n\n\n\n\n\tNASA images\nand artwork\t\n\tEarthrise\n\tThe Blue Marble\n\tFamily Portrait\n\tPale Blue Dot\n\n\n\tPillars of Creation\n\tMystic Mountain\n\tSolar System Family Portrait\n\tThe Day the Earth Smiled\n\tFallen Astronaut\n\tLunar plaques\n\tPioneer plaques\n\tVoyager Golden Record\n\tApollo 11 goodwill messages\n\tNASA insignia\n\tGemini and Apollo medallions\n\tMission patches\n\n\n\n\n\tRelated\t\n\tApollo 15 postal covers incident\n\tSpace Mirror Memorial\n\tThe Astronaut Monument\n\tU.S. Astronaut Hall of Fame\n\tSpace program on U.S. stamps\n\tApollo 17 Moon mice\n\tOther primates in space\n\tNASA spinoff technologies\n\n\n\n\n\t\n\t Category\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nCrewed spacecraft\n\n\tCurrent\t\n\tChina\n\tShenzhou\n\n\n\tRussia\n\tSoyuz\n\n\n\tUnited States\n\tSpaceShipTwo\n\n\n\n\n\n\n\tIn development\t\n\tIndia\n\tGaganyaan\n\n\n\tRussia\n\tFederation\n\n\n\tUnited States\n\tDragon 2\n\tNew Shepard\n\tOrion\n\tStarliner\n\tStarship\n\n\n\n\n\n\n\tFormer\t\n\tSoviet Union\n\tVostok\n\tVoskhod\n\n\n\tUnited States\n\tMercury\n\tX-15\n\tGemini\n\tApollo\n\tCSM\n\tLM\n\n\n\tSpace Shuttle\n\tSpaceShipOne\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Apollo_(spacecraft)&oldid=915253587\"\n\n\t\t\n\t\tCategories: \tCrewed spacecraft\n\tApollo program hardware\n\tVehicles introduced in 1966\n\tSpacecraft launched by Saturn rockets\n\tSpacecraft that orbited the Moon\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tБългарски\n\tČeština\n\tDeutsch\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tҚазақша\n\tLëtzebuergesch\n\tMagyar\n\tBahasa Melayu\n\t日本語\n\tNorsk nynorsk\n\tPortuguês\n\tRomână\n\tРусский\n\tSlovenčina\n\tТоҷикӣ\n\tTürkçe\n\tУкраїнська\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 12 September 2019, at 03:20 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "11", "dc:title": "Apollo (spacecraft) - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/7/74/Apollo_Spacecraft_diagram.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-apollo_-spacecraft", "title": "Apollo (spacecraft) - Wikipedia"}}