{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nATS-6 - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tATS-6\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tATS-6\t\n\nATS-6 satellite.\n\n\t\n\tMission type\tCommunications\nTechnology\n\tOperator\tNASA\n\tCOSPAR ID\t1974-039A\n\tSATCAT no.\t07318\n\tMission duration\t5 years\n\t\n\n\t\n\tSpacecraft properties\n\tBus\tATS-6 Bus\n\tManufacturer\tFairchild Aircraft\n\tLaunch mass\t930.0 kilograms (2,050.3 lb)\n\tPower\t645 W\n\t\n\n\t\n\tStart of mission\n\tLaunch date\tMay 30, 1974, 23:37:00 (1974-05-30UTC23:37Z) UTC[1]\n\tRocket\tTitan-3(23)C\n\tLaunch site\tCape Canaveral LC-40\n\t\n\n\t\n\tEnd of mission\n\tDeactivated\tJune 30, 1979 (1979-07-01)\n\t\n\n\t\n\tOrbital parameters\n\tReference system\tGeocentric\n\tRegime\tGSO\n\tSemi-major axis\t41,691.1 kilometres (25,905.6 mi)\n\tPerigee altitude\t35,184 kilometers (21,862 mi)\n\tApogee altitude\t35,444 kilometers (22,024 mi)\n\tInclination\t13.1º\n\tPeriod\t1,412 minutes\n\t\n\n\t \n\n\n  \nATS-6 during radio-frequency tests.\n\n\n\nATS-6 (Applications Technology Satellite-6) [2] was a NASA experimental satellite, built by Fairchild Space and Electronics Division[3][4] It has been called the world's first educational satellite as well as world's first experimental Direct Broadcast Satellite as part of the Satellite Instructional Television Experiment between NASA and Indian Space Research Organisation (ISRO). It was launched May 30, 1974, and decommissioned July 1979. At the time of launch, it was the most powerful telecommunication satellite in orbit.[5] ATS-6 carried no fewer than 23 different experiments, and introduced several breakthroughs. It was the first 3-axis stabilized spacecraft in geostationary orbit. It was also the first to use experimentally with some success electric propulsion in geostationary orbit. It also carried several particle physics experiments, including the first heavy ion detector in geostationary orbit.\n\nDuring its five-year life, ATS-6 transmitted connection programming to various countries, including India, the United States and other regions. The vehicle also conducted air traffic control tests, was used to practice satellite-assisted search and rescue techniques, carried an experimental radiometer subsequently carried as a standard instrument aboard weather satellites, and pioneered direct broadcast TV.\n\nATS-6 was a precursor to many technologies still in use today on geostationary spacecraft: large deployable antenna, 3-axis attitude control with slewing capabilities, antenna pointing through RF sensing, electric propulsion, meteorological radiometer in geostationary orbit, and direct to home broadcasting. It is also possible that ATS-6 was a forerunner of the large ELINT satellites such as Mentor.\n\n\nContents\n\n\n\t1 Launch\n\t2 Structure, power subsystem and Antenna\n\t3 Three-axis stabilisation\n\t4 Radiometer\n\t5 Telecommunication experiments\n\t6 Electric propulsion\n\t7 Particle physics experiments\n\t8 Propagation experiments\n\t9 See also\n\t10 References\n\t11 External links\n\n\n\n\n\nLaunch[edit]\n\n  \nATS-6 Launch\n\n\n\nATS-6 was launched on May 30, 1974, by a Titan III-C launch vehicle. The spacecraft was inserted directly in the geosynchronous orbit. This reduced the on-board fuel requirements to less than 40 kg (for a total mass at launch of nearly 1400 kg). The highly accurate orbit insertion further lowered the amount of fuel required for final positioning to 9 kg. This enabled a life extension from the original 2 year to 5 years, even accounting for the premature failure of the electric propulsion subsystem (the station-keeping fuel requirement being around 1.6 kg/year).\n\n\n  \nATS-6 inside the Space Environment Simulation Laboratory at the Johnson Space Center (JSC) during antenna deployment tests\n\n\n\nStructure, power subsystem and Antenna[edit]\n\nOne of the major innovations of ATS-6 was an in-flight deployable antenna of more than 9 m in diameter. The antenna reflector was furled during launch under the launch vehicle fairing, and was deployed in orbit much like an umbrella. The antenna reflector was built from 48 aluminum ribs, supporting a metallized Dacron mesh. The antenna feeds (in C, S, L, UHF and VHF bands) were placed on the spacecraft body, facing the antenna reflector, and linked to the antenna and the solar panels masts by a carbon-fiber reinforced plastic (CFRP) truss. The solar panels were rigidly mounted on two deployable masts. They were of hemi-cylinder shape, thus providing a relatively constant power (595 W beginning of life). Electric power was supplied during eclipses by two Nickel cadmium batteries of 15-A·h capacity, powering a regulated 30.5-V bus. The satellite dimensions in orbit were 15.8-m width by 8.2-m height.\n\nThis deployable antenna parabola was designed and developed by Lockheed Missiles and Space Company (LMSC), now Lockheed Martin, under subcontract to Fairchild Aerospace, after several years of small study contracts at LMSC.  The program manager at LMSC was GKC (Colin) Campbell.  The deployment of the reflector was initiated by pyrotechnically operated SQUIB cable cutters.  Deployment time was on the order of 2.5 seconds producing 2500 Ft Lbs of torque at the spacecraft interface.  The reflector surface was designed for optimal operation at S-Band frequencies.[citation needed]  It weighed 182 lbs at launch and stowed into a toroidal volume (doughnut shaped) approximately 6 feet in diameter and 10 inches thick.  Three models were fabricated, the STM or structural test model, the F reflector and the G reflector.  The STM was destroyed by Fairchild shortly after the program was finished and the F model was launched with the spacecraft in 1972.  The G model sat unprotected in the Farchild parking lot for several years before it was donated to the Smithsonian.[citation needed]  Bill Wade, the assistant program manager and test manager on the program supported The Smithsonian in the restoration by providing a complete set of drawings and specifications and visited the Silver Hill facility to provide technical guidance.[citation needed]\n\nAt the time of launch it was the largest parabolic surface launched into orbit.[citation needed]\n\n\nThree-axis stabilisation[edit]\n\nATS-6 has been the first geostationary satellite with three-axis stabilization and pointing.,[6] This subsystem was capable of a highly accurate pointing (better than 0.1° through the inertial measurement units, down to 0.002° by using a radio-frequency interferometer.[7]). Furthermore, the satellite was able to follow low earth orbit satellites through slewing,[8] by tracking the low earth-orbit satellite through an S-band RF sensing. The system was also able to perform orbitography of the tracked satellite, and was a precursor to the operational system TDRSS.\nThis highly advanced (for the time) pointing subsystem used earth and sun sensors, a star tracker pointed to the pole star, Polaris, and three inertial sensors. The sensor measurements were fed to two digital computers (nominal and redundant), as well to a back-up analog computer. It was also possible to orient the satellite by using radio-frequency sensors.  Actuators were three momentum wheels, and hot gas (hydrazine mono-propellant) thrusters. One of the momentum wheels having failed in July 1975, an alternative scheme was developed, allowing station-keeping with the two remaining wheels and thrusters.\n\n\nRadiometer[edit]\n\nA radiometer was on board ATS-6, mounted on the earth-facing panel.[9] This instrument was (for the time) of very high resolution. It operated on two channels: infra-red (10.5 to 12.5 µm) and visible light (0.55 to 0.75 µm). Images taken with the radiometer covered the whole earth disk, with a resolution of 1,200 lines of 2,400 pixels each (11 km square pixel in infra-red, and 5.5 km square in visible light). The IR detector was passively cooled at 115K, and the visible light detector maintained at 300K. A complete image of earth's disk was transmitted to ground every 25 minutes. Several hundreds images were taken and transmitted, until a mechanical component of the radiometer failed, two and a half months after launch.\n\n\nTelecommunication experiments[edit]\n\n  \nZone covered by the SITE Experiment\n\n\n\nThe main mission of ATS-6 was to demonstrate the feasibility of direct-to-home (DTH) television broadcasting.[10] To this end, in addition to the high-gain antenna, the spacecraft payload was able to receive in any of the VHF, C, S and L-bands, and to transmit in S-band (2 GHz) through a 20-W solid state transmitter, in L-band (1650 MHz) at 40W, in UHF (860 MHz) at 80W (which was used for the Satellite Instructional Television Experiment (SITE)), and with a TWTA-based transmitter of 20 W in C-band (4 GHz). The antenna produced two spots on earth of 400,000 km² each, in which the TV broadcast could be received with 3 meters diameter antennas. This payload was first used over the United States for tele-education and tele-medicine experiments, from August 1974 to May 1975 as part of the HET, or Health, Education, Telecommunications experiment developed jointly by NASA and the US Department of Health, Education, & Welfare (now DHHS). The spacecraft was then moved over the geo-stationary arc from 94 °W to 35 °E, in collaboration with the Indian Space Agency (ISRO), who had deployed in India more than 2500 receive ground stations. A tele-education programme was started – Satellite Instructional Television Experiment or SITE[11] – and run for one year. During the experiment, a receive station was offered by the Indian Government to Arthur C. Clarke, who was living in Sri Lanka. This experiment was highly successful, and encouraged ISRO to start building an operational program, with the Indian spacecraft  INSAT IB (launched 1983). After the SITE experiment, the satellite was brought back over the United States, and served notably as a data-relay and tracking satellite for low-orbit spacecraft such as Nimbus 6, and for the Apollo-Soyuz flight.\n\n\nElectric propulsion[edit]\n\nATS-6 was equipped with two electric thrusters based on the acceleration of cesium ions, that were to be used for North-South Station Keeping.[12] This subsystem development followed earlier failed attempts on the previous ATS spacecraft. Each of the thrusters had a mass of 16 kg, used 150 W of electric power, and produced a thrust of 4 mN, with a specific impulse of 2500s. The on-board supply of cesium would have been sufficient for 4400 hours of thrust. Unfortunately, both thrusters failed prematurely, one after 1 hour of operation, one after 95 hours. However, some of the experiments objectives could be met, such as the measurement of the effective thrust, the absence of any interference with the radio-frequency payloads (from 150 MHz to 6 GHz), no cesium redeposition on the critical parts of the payload (such as the radiometer), and the correct neutralisation of the spacecraft versus its environment.\n\n\nParticle physics experiments[edit]\n\nSeveral particle physics experiments were on board ATS-6. The most significant measured low energy protons (from 25 keV to 3.6 MeV),[13] as well as detected heavy ions (up to 6 MeV). This latter experiment allowed to detect the first heavy ions (Z > 6) with an energy  E > 4 MeV, in geostationary orbit.\n\n\nPropagation experiments[edit]\n\nFinally, ATS-6 embarked several beacons,[14] which allowed to measure electromagnetic propagation properties of the atmosphere at 13, 18, 20 and 30 GHz.\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\t1974 in spaceflight\n\tApplications Technology Satellite\n\n\n\n\nReferences[edit]\n\n\n\t^ McDowell, Jonathan. \"Launch Log\". Jonathan's Space Page. Retrieved January 24, 2014.\n\n\t^ ATS-6 Significance, R.B. Marsten IEEE transactions on Aerospace & Electronic Systems vol.AES-11 N°6\n\n\t^ \"table4.156\". nasa.gov. Retrieved 22 March 2015.\n\n\n\t^ Glover, Daniel R. (1996). \"NASA Experimental Communications Satellites, 1958-1995\". Beyond the Ionosphere. NASA.\n\n\n\t^ http://hdl.handle.net/2060/19820008279 ATS-6 engineering performance report. Volume 6: Scientific experiments\n\n\t^ ATS-6 Spacecraft Attitude Precision Pointing & Slewing Adaptative Control Experiment, W.C. Isley; D.L. Endres IEEE transactions on Aerospace & Electronic Systems vol.AES-11 N°6\n\n\t^ ATS-6 Interferometer, W.C. Isley; D.L. Endres IEEE transactions on Aerospace & Electronic Systems vol.AES-11 N°6\n\n\t^ Orbit Determination Accuracies Using Satellite-to-Satellite Tracking, F.O. Vonbun; P.D. Argentiero; P.E. Schmid IEEE transactions on Aerospace & Electronic Systems vol.AES-14 N°6\n\n\t^ ATS-6 The Very High Resolution Radiometer, W.E. Shenk; C.C Stephanides; G.E. Sonnek; L.D. Howell IEEE transactions on Aerospace & Electronic Systems vol.AES-11 N°6\n\n\t^ A Dream Come True: Satellite Broadcasting, R. Marsten IEEE transactions on Aerospace & Electronic Systems vol.33 N°1\n\n\t^ ATS-6 Satellite Instructional Television Experiment J.E. Miller, IEEE transactions on Aerospace & Electronic Systems vol.AES-11 N°6\n\n\t^ ATS-6 Cesium Bombardment engine North South Station Keeping Experiment, R.M. Worlock; E. James; R.E. Hunter; R.O. Bartlett IEEE transactions on Aerospace & Electronic Systems vol.AES-11 N°6\n\n\t^ NOAA Low Energy Proton Experiment, T.A. Fritz; J.A. Cessna IEEE transactions on Aerospace & Electronic Systems vol.AES-11 N°6\n\n\t^ ATS-6 Millimeter Wave Propagation and Communication Experiments, L.I. Ippolito  IEEE transactions on Aerospace & Electronic Systems vol.AES-11 N°6\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to ATS-6.\n\n\n\tATS 6\n\tATS 6 Mission Information\n\tATS-6 Gunter's space page\n\tExperimental Satellites\n\tATS-6 engineering performance report. Volume 2: Orbit and attitude controls\n\tATS-6 engineering performance report. Volume 3: Telecommunications and power\n\tATS-6 engineering performance report. Volume 4: Television experiments\n\tATS-6 engineering performance report. Volume 5: Propagation experiments\n\tATS-6 engineering performance report. Volume 6: Scientific experiments\n\n\n\t\tv\n\tt\n\te\n\n\nApplications Technology Satellite Program\n\n\tFlown\t\n\tATS-1\n\tATS-2\n\tATS-3\n\tATS-4\n\tATS-5\n\tATS-6\n\n\n\n\n\tProposed\t\n\tATS-C2\n\tATS-G\n\tATS-H\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n← 1973  ·  Orbital launches in 1974  ·  1975 →\n\n\tKosmos 628 | Skynet 2A | Kosmos 629 | Kosmos 630 | Kosmos 631 | Sphinx ·  VDS | Kosmos 632 | OPS 6889 | Tansei 2 | San Marco 4 | Kosmos 633 | Meteor-M No.30 | Kosmos 634 | Miranda | Kosmos 635 ·  Nauka-17KS No.1L | OPS 8579 | Kosmos 636 | Kosmos 637 | Kosmos 638 | Kosmos 639 | OPS 6245 ·  OPS 4547 ·  OPS 3935 | Kosmos 640 | Unnamed | Westar 1 | Molniya-1-27 | Kosmos 641 ·  Kosmos 642 ·  Kosmos 643 ·  Kosmos 644 ·  Kosmos 645 ·  Kosmos 646 ·  Kosmos 647 ·  Kosmos 648 | Meteor-M No.22 | Molniya-2-9 | Kosmos 649 | Kosmos 650 | Kosmos 651 | Kosmos 652 | Kosmos 653 | Kosmos 654 | SMS-1 | Interkosmos 11 | Kosmos 655 | Yantar-2K No.1 | Kosmos 656 | Luna 22 | Kosmos 657 | ATS-6 | Explorer 52 | Kosmos 658 | OPS 1776 | Kosmos 659 | Kosmos 660 | Kosmos 661 | Salyut 3 | Kosmos 662 | Kosmos 663 | Kosmos 664 | Kosmos 665 | Soyuz 14 | Meteor-Priroda No.1 | DS-P1-Yu No.68 | Kosmos 666 | Unnamed | OPS 7518 | Aeros 2 | Molniya-2-10 | Kosmos 667 | Kosmos 668 | Kosmos 669 ·  Nauka-8KS No.3 | Molniya-1 No.38 | Kosmos 670 | Kosmos 671 | OPS 6983 | Kosmos 672 | OPS 3004 | Kosmos 673 | Soyuz 15 | Kosmos 674 | Kosmos 675 | Unnamed | ANS | Kosmos 676 | Kosmos 677 ·  Kosmos 678 ·  Kosmos 679 ·  Kosmos 680 ·  Kosmos 681 ·  Kosmos 682 ·  Kosmos 683 ·  Kosmos 684 | Kosmos 685 | Kosmos 686 | Westar 2 | Kosmos 687 | Ariel 5 | Kosmos 688 | Kosmos 689 | Kosmos 690 | Molniya-1 No.26 | Kosmos 691 | Meteor-M No.33 | Luna 23 | OPS 7122 ·  OPS 6239 ·  OPS 8452 | Interkosmos 12 | Kosmos 692 | Kosmos 693 | Fanhui Shi Weixing 1 | NOAA-4 ·  OSCAR-7 ·  INTASAT | Kosmos 694 | Kosmos 695 | Molniya-3 No.11 | Intelsat IV F-8 | Skynet 2B | Kosmos 696 | Soyuz 16 | Helios 1 | Kosmos 697 | Meteor-M No.32 | Kosmos 698 | Symphonie 1 | Molniya-2-11 | Kosmos 699 | Salyut 4 | Kosmos 700 | Kosmos 701\n\n\tPayloads are separated by bullets ( · ), launches by pipes ( | ). Manned flights are indicated in bold text. Uncatalogued launch failures are listed in italics. Payloads deployed from other spacecraft are denoted in (brackets).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=ATS-6&oldid=895243299\"\n\n\t\t\n\t\tCategories: \tCommunications satellites in geostationary orbit\n\tCommunications satellites\n\tWeather satellites of the United States\n\tSpacecraft launched in 1974\n\t1974 in spaceflight\n\n\nHidden categories: \tPages using deprecated image syntax\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from August 2011\n\tCommons category link is on Wikidata\n\tUse American English from January 2014\n\tAll Wikipedia articles written in American English\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tEspañol\n\tFrançais\n\tGalego\n\tMagyar\n\tNederlands\n\tPortuguês\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 2 May 2019, at 22:59 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "15", "dc:title": "ATS-6 - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Ats-6.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-ats-6", "title": "ATS-6 - Wikipedia"}}