{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOrientation (geometry) - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tOrientation (geometry)\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Attitude (geometry))\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about the orientation or attitude of an object as understood in the physical sciences. For orientation as usually understood in mathematics, see Orientation (vector space).\n\nNotion of pointing in a direction\n  \nChanging orientation of a rigid body is the same as rotating the axes of a reference frame attached to it.\n\n\n\nIn geometry the orientation, angular position, or attitude of an object such as a line, plane or rigid body is part of the description of how it is placed in the space it occupies.[1]  Namely, it is the imaginary rotation that is needed to move the object from a reference placement to its current placement. A rotation may not be enough to reach the current placement. It may be necessary to add an imaginary translation, called the object's location (or position, or linear position). The location and orientation together fully describe how the object is placed in space. The above-mentioned imaginary rotation and translation may be thought to occur in any order, as the orientation of an object does not change when it translates, and its location does not change when it rotates.\n\nEuler's rotation theorem shows that in three dimensions any orientation can be reached with a single rotation around a fixed axis. This gives one common way of representing the orientation using an axis–angle representation. Other widely used methods include rotation quaternions, Euler angles, or rotation matrices. More specialist uses include Miller indices in crystallography, strike and dip in geology and grade on maps and signs.\n\nTypically, the orientation is given relative to a frame of reference, usually specified by a Cartesian coordinate system.\n\n\nContents\n\n\n\t1 Mathematical representations\n\t1.1 Three dimensions\n\t1.2 Two dimensions\n\n\n\n\t2 Rigid body in three dimensions\n\t2.1 Euler angles\n\t2.1.1 Tait–Bryan angles\n\n\n\n\t2.2 Orientation vector\n\t2.3 Orientation matrix\n\t2.4 Orientation quaternion\n\n\n\n\t3 Plane in three dimensions\n\t3.1 Miller indices\n\t3.2 Strike and dip\n\n\n\n\t4 Usage examples\n\t4.1 Rigid body\n\n\n\n\t5 See also\n\t6 References\n\n\n\n\n\nMathematical representations[edit]\n\nThree dimensions[edit]\n\nIn general the position and orientation in space of a rigid body are defined as the position and orientation, relative to the main reference frame, of another reference frame, which is fixed relative to the body, and hence translates and rotates with it (the body's local reference frame, or local coordinate system). At least three independent values are needed to describe the orientation of this local frame. Three other values describe the position of a point on the object.\nAll the points of the body change their position during a rotation except for those lying on the rotation axis. If the rigid body has rotational symmetry not all orientations are distinguishable, except by observing how the orientation evolves in time from a known starting orientation.  For example, the orientation in space of a line, line segment, or vector can be specified with only two values, for example two direction cosines. Another example is the position of a point on the earth, often described using the orientation of a line joining it with the earth's center, measured using the two angles of longitude and latitude.  Likewise, the orientation of a plane can be described with two values as well, for instance by specifying the orientation of a line normal to that plane, or by using the strike and dip angles.\n\nFurther details about the mathematical methods to represent the orientation of rigid bodies and planes in three dimensions are given in the following sections.\n\n\nTwo dimensions[edit]\n\nIn two dimensions the orientation of any object (line, vector, or plane figure) is given by a single value: the angle through which it has rotated. There is only one degree of freedom and only one fixed point about which the rotation takes place.\n\n\nRigid body in three dimensions[edit]\n\nMain article: Rotation formalisms in three dimensions\n\nSeveral methods to describe orientations of a rigid body in three dimensions have been developed. They are summarized in the following sections.\n\n\nEuler angles[edit]\n\nMain article: Euler angles\n\n  \nEuler angles, one of the possible ways to describe an orientation\n\n\n\nThe first attempt to represent an orientation was owed to Leonhard Euler. He imagined three reference frames that could rotate one around the other, and realized that by starting with a fixed reference frame and performing three rotations, he could get any other reference frame in the space (using two rotations to fix the vertical axis and another to fix the other two axes). The values of these three rotations are called Euler angles.\n\n\nTait–Bryan angles[edit]\n\nMain article: Euler angles § Tait–Bryan angles\n\n  \nTait–Bryan angles. Other way for describing orientation\n\n\n\nThese are three angles, also known as yaw, pitch and roll, Navigation angles and Cardan angles. Mathematically they constitute a set of six possibilities inside the twelve possible sets of Euler angles, the ordering being the one best used for describing the orientation of a vehicle such as an airplane. In aerospace engineering they are usually referred to as Euler angles.\n\n\n  \nA rotation represented by an Euler axis and angle.\n\n\n\nOrientation vector [edit]\n\nMain article: Axis–angle representation\n\nEuler also realized that the composition of two rotations is equivalent to a single rotation about a different fixed axis (Euler's rotation theorem). Therefore, the composition of the former three angles has to be equal to only one rotation, whose axis was complicated to calculate until matrices were developed.\n\nBased on this fact he introduced a vectorial way to describe any rotation, with a vector on the rotation axis and module equal to the value of the angle. Therefore, any orientation can be represented by a rotation vector (also called Euler vector) that leads to it from the reference frame. When used to represent an orientation, the rotation vector is commonly called orientation vector, or attitude vector.\n\nA similar method, called axis–angle representation, describes a rotation or orientation using a unit vector aligned with the rotation axis, and a separate value to indicate the angle (see figure).\n\n\nOrientation matrix[edit]\n\nMain article: Rotation matrix\n\nWith the introduction of matrices, the Euler theorems were rewritten. The rotations were described by orthogonal matrices referred to as rotation matrices or direction cosine matrices. When used to represent an orientation, a rotation matrix is commonly called orientation matrix, or attitude matrix.\n\nThe above-mentioned Euler vector is the eigenvector of a rotation matrix (a rotation matrix has a unique real eigenvalue). \nThe product of two rotation matrices is the composition of rotations. Therefore, as before, the orientation can be given as the rotation from the initial frame to achieve the frame that we want to describe.\n\nThe configuration space of a non-symmetrical object in n-dimensional space is SO(n) × Rn. Orientation may be visualized by attaching a basis of tangent vectors to an object. The direction in which each vector points determines its orientation.\n\n\nOrientation quaternion[edit]\n\nMain article: Quaternions and spatial rotation\n\nAnother way to describe rotations is using rotation quaternions, also called versors. They are equivalent to rotation matrices and rotation vectors. With respect to rotation vectors, they can be more easily converted to and from matrices. When used to represent orientations, rotation quaternions are typically called orientation quaternions or attitude quaternions.\n\n\nPlane in three dimensions[edit]\n\nMiller indices[edit]\n\nMain article: Miller index\n\n  \nPlanes with different Miller indices in cubic crystals\n\n\n\nThe attitude of a lattice plane is the orientation of the line normal to the plane,[2] and is described by the plane's Miller indices. In three-space a family of planes (a series of parallel planes) can be denoted by its Miller indices (hkl),[3][4] so the family of planes has an attitude common to all its constituent planes.\n\n\nStrike and dip[edit]\n\nMain article: Strike and dip\n\n  \nStrike line and dip of a plane describing attitude relative to a horizontal plane and a vertical plane perpendicular to the strike line\n\n\n\nMany features observed in geology are planes or lines, and their orientation is commonly referred to as their attitude. These attitudes are specified with two angles.\n\nFor a line, these angles are called the trend and the plunge. The trend is the compass direction of the line, and the plunge is the downward angle it makes with a horizontal plane.[5]\n\nFor a plane, the two angles are called its strike (angle) and its dip (angle). A strike line is the intersection of a horizontal plane with the observed planar feature (and therefore a horizontal line), and the strike angle is the bearing of this line (that is, relative to geographic north or from magnetic north). The dip is the angle between a horizontal plane and the observed planar feature as observed in a third vertical plane perpendicular to the strike line.\n\n\nUsage examples[edit]\n\nRigid body[edit]\n\nMain article: Rigid body\n\n  \nThe orientation of a rigid body is determined by three angles\n\n\n\nThe attitude of a rigid body is its orientation as described, for example, by the orientation of a frame fixed in the body relative to a fixed reference frame. The attitude is described by attitude coordinates, and consists of at least three coordinates.[6]  One scheme for orienting a rigid body is based upon body-axes rotation; successive rotations three times about the axes of the body's fixed reference frame, thereby establishing the body's Euler angles.[7][8] Another is based upon roll, pitch and yaw,[9] although these terms also refer to incremental deviations from the nominal attitude\n\n\nSee also[edit]\n\n\tAttitude control\n\tPlane of rotation\n\tRotation formalisms in three dimensions\n\tTriad Method\n\n\nReferences[edit]\n\n\t^ \nRobert J. Twiss; Eldridge M. Moores (1992). \"§2.1 The orientation of structures\". Structural Geology (2nd ed.). Macmillan. p. 11. ISBN 0-7167-2252-6. ...the attitude of a plane or a line — that is, its orientation in space — is fundamental to the description of structures.\n\n\t^ \nWilliam Anthony Granville (1904). \"§178 Normal line to a surface\". Elements of the Differential and Integral Calculus. Ginn & Company. p. 275.\n\n\n\t^ \n\nAugustus Edward Hough Love (1892). A Treatise on the Mathematical Theory of Elasticity. 1. Cambridge University Press. p. 79 ff.\n\n\n\t^ \n\nMarcus Frederick Charles Ladd; Rex Alfred Palmer (2003). \"§2.3 Families of planes and interplanar spacings\". Structure Determination by X-Ray Crystallography (4th ed.). Springer. p. 62 ff. ISBN 0-306-47454-9.\n\n\n\t^ \n\nStephen Mark Rowland; Ernest M. Duebendorfer; Ilsa M. Schiefelbein (2007). \"Attitudes of lines and planes\". Structural Analysis and Synthesis: A Laboratory Course in Structural Geology (3rd ed.). Wiley-Blackwell. p. 1 ff. ISBN 1-4051-1652-8.\n\n\n\t^ \n\nHanspeter Schaub; John L. Junkins (2003). \"Rigid body kinematics\". Analytical Mechanics of Space Systems. American Institute of Aeronautics and Astronautics. p. 71. ISBN 1-56347-563-4.\n\n\n\t^ \n\nJack B. Kuipers (2002). \"Figure 4.7: Aircraft Euler angle sequence\". Quaternions and Rotation Sequences: A Primer with Applications to Orbits, Aerospace, and Virtual Reality. Princeton University Press. p. 85. ISBN 0-691-10298-8.\n\n\n\t^ Bong Wie (1998). \"§5.2 Euler angles\". Space Vehicle Dynamics and Control. American Institute of Aeronautics and Astronautics. p. 310. ISBN 1-56347-261-9.\n\n\n\t^ Lorenzo Sciavicco; Bruno Siciliano (2000). \"§2.4.2 Roll–pitch–yaw angles\". Modelling and Control of Robot Manipulators (2nd ed.). Springer. p. 32. ISBN 1-85233-221-2.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Orientation_(geometry)&oldid=892848787\"\n\n\t\t\n\t\tCategories: \tEuclidean geometry\n\tOrientation (geometry)\n\tRigid bodies\n\tRotation in three dimensions\n\n\nHidden categories: \tArticles with short description\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tEspañol\n\tEsperanto\n\tFrançais\n\tNederlands\n\tPolski\n\tRomână\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 17 April 2019, at 08:16 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "3", "dc:title": "Orientation (geometry) - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Change_of_axes.svg/1200px-Change_of_axes.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-attitude_-geometry", "title": "Orientation (geometry) - Wikipedia"}}