{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBeam-powered propulsion - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tBeam-powered propulsion\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tBeam-powered propulsion, also known as directed energy propulsion, is a class of aircraft or spacecraft propulsion that uses energy beamed to the spacecraft from a remote power plant to provide energy. The beam is typically either a microwave or a laser beam and it is either pulsed or continuous.  A continuous beam lends itself to thermal rockets, photonic thrusters and light sails, whereas a pulsed beam lends itself to ablative thrusters and pulse detonation engines.[1]\n\nThe rule of thumb that is usually quoted is that it takes a megawatt of power beamed to a vehicle per kg of payload while it is being accelerated to permit it to reach low earth orbit.[2]\n\nOther than launching to orbit, applications for moving around the world quickly have also been proposed.\n\n\nContents\n\n\n\t1 Background\n\t2 Laser propulsion\n\t3 Microwave propulsion\n\t4 Electric propulsion\n\t5 Direct impulse\n\t6 Proposed systems\n\t6.1 Lightcraft\n\t6.1.1 Testing\n\n\n\n\t6.2 Laser thermal rocket\n\t6.3 Microwave thermal rocket\n\n\n\n\t7 Economics\n\t7.1 Beam director cost\n\n\n\n\t8 Non-spacecraft applications\n\t9 See also\n\t10 References\n\t11 External links\n\n\n\n\n\nBackground[edit]\n\nRockets are momentum machines; they use mass ejected from the rocket to provide momentum to the rocket. Momentum is the product of mass and velocity, so rockets generally attempt to put as much velocity into their working mass as possible, thereby minimizing the amount of working mass that is needed. In order to accelerate the working mass, energy is required. In a conventional rocket, the fuel is chemically combined to provide the energy, and the resulting fuel products, the ash or exhaust, are used as the working mass.\n\nThere is no particular reason why the same fuel has to be used for both energy and momentum. In the jet engine, for instance, the fuel is used only to produce energy, the working mass is provided from the air that the jet aircraft flies through. In modern jet engines, the amount of air propelled is much greater than the amount of air used for energy. This is not a solution for the rocket, however, as they quickly climb to altitudes where the air is too thin to be useful as a source of working mass.\n\nRockets can, however, carry their working mass and use some other source of energy. The problem is finding an energy source with a power-to-weight ratio that competes with chemical fuels. Small nuclear reactors can compete in this regard, and considerable work on nuclear thermal propulsion was carried out in the 1960s, but environmental concerns and rising costs led to the ending of most of these programs.\n\nA further improvement can be made by removing the energy creation from the spacecraft. If the nuclear reactor is left on the ground and its energy transmitted to the spacecraft, the weight of the reactor is removed as well. The issue then is to get the energy into the spacecraft. This is the idea behind beamed power.\n\nWith beamed propulsion one can leave the power-source stationary on the ground, and directly (or via a heat exchanger) heat propellant on the spacecraft with a maser or a laser beam from a fixed installation.  This permits the spacecraft to leave its power-source at home, saving significant amounts of mass, greatly improving performance.\n\n\nLaser propulsion[edit]\n\nMain article: Laser propulsion\n\nSince a laser can heat propellant to extremely high temperatures, this potentially greatly improves the efficiency of a rocket, as exhaust velocity is proportional to the square root of the temperature. Normal chemical rockets have an exhaust speed limited by the fixed amount of energy in the propellants, but beamed propulsion systems have no particular theoretical limit (although in practice there are temperature limits).\n\n\nMicrowave propulsion[edit]\n\nIn microwave thermal propulsion, an external microwave beam is used to heat a refractory heat exchanger to >1,500 K, in turn heating a propellant such as hydrogen, methane or ammonia. This improves the specific impulse and thrust/weight ratio of the propulsion system relative to conventional rocket propulsion. For example, hydrogen can provide a specific impulse of 700–900 seconds and a thrust/weight ratio of 50-150.[3]\n\nA variation, developed by brothers James Benford and Gregory Benford, is to use thermal desorption of propellant trapped in the material of a very large microwave sail. This produces a very high acceleration compared to microwave pushed sails alone.\n\n\nElectric propulsion[edit]\n\nSome proposed spacecraft propulsion mechanisms use power in the form of electricity.  Usually these schemes assume either solar panels, or an on-board reactor. However, both power sources are heavy.\n\nBeamed propulsion in the form of laser can be used to send power to a photovoltaic panel, for Laser electric propulsion.  In this system, careful design of the panels is necessary as the extra power tends to cause a fall-off of the conversion efficiency due to heating effects.\n\nA microwave beam could be used to send power to a rectenna, for microwave electric propulsion.  Microwave broadcast power has been practically demonstrated several times (e.g. Goldstone, California in 1974), rectennas are potentially lightweight and can handle high power at high conversion efficiency.  However, rectennas tend to need to be very large for a significant amount of power to be captured.\n\n\nDirect impulse[edit]\n\nA beam could also be used to provide impulse by directly \"pushing\" on the sail.\n\nOne example of this would be using a solar sail to reflect a laser beam.  This concept, called a laser-pushed lightsail, was initially proposed by Marx[4] but first analyzed in detail, and elaborated on, by physicist Robert L. Forward in 1989[5] as a method of Interstellar travel that would avoid extremely high mass ratios by not carrying fuel.  Further analysis of the concept was done by Landis,[6][7] Mallove and Matloff,[8] Andrews[9] Lubin,[10] and others.\n\nIn a later paper, Forward proposed pushing a sail with a microwave beam.[11]  This has the advantage that the sail need not be a continuous surface.  Forward tagged his proposal for an ultralight sail \"Starwisp\".  A later analysis by Landis[12] suggested that the Starwisp concept as originally proposed by Forward would not work, but variations on the proposal might be implemented.\n\nThe beam has to have a large diameter so that only a small portion of the beam misses the sail due to diffraction and the laser or microwave antenna has to have a good pointing stability so that the craft can tilt its sails fast enough to follow the center of the beam. This gets more important when going from interplanetary travel to interstellar travel, and when going from a fly-by mission, to a landing mission, to a return mission. The laser or the microwave sender would probably be a large phased array of small devices, which get their energy directly from solar radiation. The size of the array negates the need for a lens or mirror.\n\nAnother beam-pushed concept would be to use a magnetic sail or MMPP sail to divert a beam of charged particles from a particle accelerator or plasma jet.[13]  Landis proposed a particle beam pushed sail in 1989,[6] and analyzed in more detail in a 2004 paper.[14]  Jordin Kare has proposed a variant to this whereby a \"beam\" of small laser accelerated light sails would transfer momentum to a magsail vehicle.[15]\n\nAnother beam-pushed concept uses pellets or projectiles of ordinary matter. A stream of pellets from a stationary mass-driver is \"reflected\" by the spacecraft, cf. mass driver.[16] The spacecraft neither needs energy nor reaction mass for propulsion of its own.\n\n\nProposed systems[edit]\n\nLightcraft[edit]\n\nMain article: lightcraft\n\nA lightcraft is a vehicle currently under development that uses an external pulsed source of laser or maser energy to provide power for producing thrust.\n\nThe laser shines on a parabolic reflector on the underside of the vehicle that concentrates the light to produce a region of extremely high temperature. The air in this region is heated and expands violently, producing thrust with each pulse of laser light. In space, a lightcraft would need to provide this gas itself from onboard tanks or from an ablative solid. By leaving the vehicle's power source on the ground and by using ambient atmosphere as reaction mass for much of its ascent, a lightcraft would be capable of delivering a very large percentage of its launch mass to orbit. It could also potentially be very cheap to manufacture.\n\n\nTesting[edit]\n\nEarly in the morning of 2 October 2000 at the High Energy Laser Systems Test Facility (HELSTF), Lightcraft Technologies, Inc. (LTI) with the help of Franklin B. Mead of the U.S. Air Force Research Laboratory and Leik Myrabo set a new world's altitude record of 233 feet (71 m) for its 4.8 inch (12.2 cm) diameter, 1.8-ounce (51 g), laser-boosted rocket in a flight lasting 12.7 seconds.[17] Although much of the 8:35 am flight was spent hovering at 230+ feet, the Lightcraft earned a world record for the longest ever laser-powered free flight and the greatest \"air time\" (i.e., launch-to-landing/recovery) from a light-propelled object. This is comparable to Robert Goddard's first test flight of his rocket design. Increasing the laser power to 100 kilowatts will enable flights up to a 30-kilometer altitude. Their goal is to accelerate a one-kilogram microsatellite into low Earth orbit using a custom-built, one megawatt ground-based laser. Such a system would use just about 20 dollars' worth of electricity, placing launch costs per kilogram to many times less than current launch costs (which are measured in thousands of dollars).[citation needed]\n\nMyrabo's \"lightcraft\" design is a reflective funnel-shaped craft that channels heat from the laser, towards the center, using a reflective parabolic surface causing the laser to literally explode the air underneath it, generating lift. Reflective surfaces in the craft focus the beam into a ring, where it heats air to a temperature nearly five times hotter than the surface of the sun, causing the air to expand explosively for thrust.\n\n\nLaser thermal rocket[edit]\n\nMain article: Thermal rocket\n\nA laser thermal rocket is a thermal rocket in which the propellant is heated by energy provided by an external laser beam.[18][19]  \nIn 1992, the late Jordin Kare proposed a simpler, nearer term concept which has a rocket containing liquid hydrogen.[20] The propellant is heated in a heat exchanger that the laser beam shines on before leaving the vehicle via a conventional nozzle. This concept can use continuous beam lasers, and the semiconductor lasers are now cost effective for this application.[21][22]\n\n\nMicrowave thermal rocket[edit]\n\nMain article: Thermal rocket\n\nIn 2002, Kevin L.G. Parkin proposed a similar system using microwaves.[3][23][24][25]  In May 2012, the DARPA/NASA Millimeter-wave Thermal Launch System (MTLS) Project[26] began the first steps toward implementing this idea.  The MTLS Project was the first to demonstrate a millimeter-wave absorbent refractory heat exchanger, subsequently integrating it into the propulsion system of a small rocket to produce the first millimeter-wave thermal rocket. Simultaneously, it developed the first high power cooperative target millimeter-wave beam director and used it to attempt the first millimeter-wave thermal rocket launch.  Several launches were attempted but problems with the beam director could not be resolved before funding ran out in March 2014.\n\n\nEconomics[edit]\n\nMotivation to develop beam-powered propulsion systems comes from the economic advantages that would be gained as a result of improved propulsion performance.  In the case of beam-powered launch vehicles, better propulsion performance enables some combination of increased payload fraction, increased structural margins and fewer stages.  JASON's 1977 study of laser propulsion,[27] authored by Freeman Dyson, succinctly articulates the promise of beam-powered launch: \n\"Laser propulsion as an idea that may produce a revolution in space technology.  A single laser facility on the ground can in theory launch single-stage vehicles into low or high earth orbit.  The payload can be 20% or 30% of the vehicle take-off weight.  It is far more economical in the use of mass and energy than chemical propulsion, and it is far more flexible in putting identical vehicles into a variety of orbits.\"\n\nThis promise was quantified in a 1978 Lockheed Study[28] conducted for NASA:\n\"The results of the study showed that, with advanced technology, laser rocket system with either a space- or ground-based laser transmitter could reduce the national budget allocated to space transportation by 10 to 345 billion dollars over a 10-year life cycle when compared to advanced chemical propulsion systems (LO2-LH2) of equal capability.\"\n\n\nBeam director cost[edit]\n\nThe 1970s-era studies and others since have cited beam director cost as a possible impediment to beam-powered launch systems.  A recent cost-benefit analysis[29] estimates that microwave (or laser) thermal rockets would be economical once beam director cost falls below 20 $/Watt.   The current cost of suitable lasers is <100 $/Watt and the current cost of suitable microwave sources is <$5/Watt.  Mass production has lowered the production cost of microwave oven magnetrons to <0.01 $/Watt and some medical lasers to <10 $/Watt, though these are thought to be unsuitable for use in beam directors.\n\n\nNon-spacecraft applications[edit]\n\nIn 1964 William C. Brown demonstrated a miniature helicopter equipped with a combination antenna and rectifier device called a rectenna. The rectenna converted microwave power into electricity, allowing the helicopter to fly.[30]\n\nIn 2002 a Japanese group propelled a tiny aluminium airplane by using a laser to vaporize a water droplet clinging to it, and in 2003 NASA researchers flew an 11-ounce (312 g) model airplane with a propeller powered with solar panels illuminated by a laser.[31] It is possible that such beam-powered propulsion could be useful for long-duration high altitude unmanned aircraft or balloons, perhaps designed to serve – like satellites do today – as communication relays, science platforms, or surveillance platforms.\n\nA \"laser broom\" has been proposed to sweep space debris from Earth orbit. This is another proposed use of beam-powered propulsion, used on objects that were not designed to be propelled by it, for example small pieces of scrap knocked off (\"spalled\") satellites. The technique works since the laser power ablates one side of the object, giving an impulse that changes the eccentricity of the object's orbit. The orbit would then intersect the atmosphere and burn up.\n\n\nSee also[edit]\n\n\tBeam Power Challenge – one of the NASA Centennial Challenges\n\tMagBeam\n\tThinned-array curse\n\tList of laser articles\n\tList of plasma (physics) articles\n\n\nReferences[edit]\n\n\n\t^ Breakthrough (2018-05-29), Progress in beamed energy propulsion | Kevin Parkin, retrieved 2018-06-07\n\n\t^ http://archived.thespaceshow.com/shows/1214-BWB-2009-08-28.mp3\n\n\t^ a b http://resolver.caltech.edu/CaltechETD:etd-06022006-160023 Kevin Parkin's PhD thesis on microwave/thermal propulsion \"The microwave thermal thruster and its application to the launch problem\"\n\n\t^ G. Marx, \"Interstellar Vehicle Propelled by Laser Beam,\" Nature, Vol. 211, July 1966, pp. 22-23.\n\n\t^ R. L. Forward, \"Roundtrip Interstellar Travel Using Laser-Pushed lightsails,\" J. Spacecraft and Rockets, Vol. 21, pp 187-195 (Mar-Apr. 1989)\n\n\t^ a b G. A. Landis, \"Optics and Materials Considerations for a Laser-Propelled Lightsail\",  paper IAA-89-664, the 40th International Astronautical Federation Congress, Málaga, Spain, Oct. 7-12, 1989 (abstract)(full paper)\n\n\t^ G. A. Landis, \"Small Laser-Pushed Lightsail Interstellar Probe: A Study of Parameter Variations\",  J. British Interplanetary Society, Vol. 50, No. 4, pp. 149-154 (1997); Paper IAA-95-4.1.1.02,\n\n\t^ Eugene Mallove & Gregory Matloff (1989). The Starflight Handbook. John Wiley & Sons, Inc. ISBN 978-0-471-61912-3.\n\n\n\t^ D. G. Andrews, \"Cost Considerations for Interstellar Missions,\" paper IAA-93-706\n\n\t^ P. Lubin,  et al, \"Directed Energy For Relativistic Propulsion and Interstellar Communications,\" J. British Interplanetary Soc., Vol. 68, No. 5/6, May, 2015, pp. 172.\n\n\t^ R. L. Forward, \"Starwisp: an Ultra-light Interstellar Probe,\" J. Spacecraft and Rockets, Vol. 21, pp. 345-350, May–June 1985)\n\n\t^ G. A. Landis, \"Microwave Pushed Interstellar Sail: Starwisp Revisited\", paper AIAA-2000-3337, 36th Joint Propulsion Conference, Huntsville AL, July 17–19, 2000. (\"Archived copy\". Archived from the original on 2007-02-17. Retrieved 2007-02-28.CS1 maint: archived copy as title (link)\n)\n\n\t^ P. Gilster, \"Interstellar Flight by Particle Beam Revisited\", April 18, 2005, Centauri Dreams.\n\n\t^ G. A. Landis, \"Interstellar Flight by Particle Beam,\" Acta Astronautica, Vol 55, No. 11, 931-934 (Dec. 2004).\n\n\t^ J. T. Kare, High-acceleration Micro-scale Laser Sails for Interstellar Propulsion, Final Report, NASA Institute for Advanced Concepts, 31 December 2001\n\n\t^ P. Gilster, \"‘Smart Pellets’ and Interstellar Propulsion\", Centauri Dreams, July 16, 2014.\n\n\t^ Myrabo (2007-06-27), LightCraft Launch Oct 2000 - laserbeam powered propulsion, retrieved 2016-12-08\n\n\n\t^ H. Krier and R. J. Glumb.  \"Concepts and status of laser-supported rocket propulsion\", Journal of Spacecraft and Rockets, Vol. 21, No. 1 (1984), pp. 70-79.\nhttps://dx.doi.org/10.2514/3.8610\n\n\t^ Leonard H. Caveny, \"Laser Thermal Propulsion\", Orbit-Raising and Maneuvering Propulsion: Research Status and Needs\", Progress in Astronautics and Aeronautics, American Institute of Aeronautics and Astronautics (1983) pp. 129-148.\n\n\t^ Kare, J. T. (1992). Development of Laser-Driven Heat Exchanger Rocket for Ground to-Orbit Launch. Washington, DC International Astronautical Federation Congress\n\n\t^ Jordin T. Kare (March 24, 2004). \"Modular Laser Launch Architecture: Analysis and Beam Module Design\" (PDF). niac.usra.edu. Retrieved July 19, 2016.\n\n\n\t^ \"HX Laser Launch: It's Steamship Time\" (PDF). Archived from the original (PDF) on July 24, 2011. Retrieved August 11, 2010.\n\n\n\t^ Parkin, K. L. G., et al. (2002). A Microwave-Thermal Thruster for Ultra Low-Cost Launch of Microsatellites, Jet Propulsion Center, California Institute of Technology.\n\n\t^ \"NASA Exploring Laser Beams to Zap Rockets Into Outer Space\". Fox News. 25 January 2011.\n\n\n\t^ \"Microwave-Powered Rockets Would Slash Cost of Reaching Orbit\". Scientific American. December 1, 2015.\n\n\n\t^ Parkin, Kevin (2017). Microwave Thermal Propulsion - Final Report. NASA. hdl:2060/20170009162.\n\n\n\t^ Dyson, Freeman; Perkins (1977). \"JASON Laser Propulsion Study\". Stanford Research Institute.\n\n\n\t^ Jones, W. (1979). \"Final Report. Laser Rocket System Analysis\". Lockheed Missiles and Space Company.\n\n\n\t^ Parkin, Kevin. \"Microwave Thermal Rockets\".\n\n\n\t^ EXPERIMENTAL AIRBORNE MICROWAVE SUPPORTED PLATFORM Archived March 2, 2010, at the Wayback Machine Descriptive Note : Final rept. Jun 64-Apr 65 \n\n\t^ \"NASA Armstrong Fact Sheet: Beamed Laser Power for UAVs\". 2015-03-31.\n\n\n\n\n\n\nExternal links[edit]\n\n\tNASA video on Laser Drive Propulsion on YouTube\n\tFine-Tuning the Interstellar Lightsail\n\tHow Stuff Works: light-propulsion\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft propulsion\n\n\tChemical\nrockets\t\n\tState\t\n\tLiquid-propellant rocket\n\tSolid-propellant rocket\n\tHybrid-propellant rocket\n\n\n\n\n\tPropellants\t\n\tLiquid propellant\n\tCryogenic\n\tHypergolic\n\n\n\tMonopropellant\n\tBipropellant\n\tStaged combustion cycle\n\tExpander cycle\n\tGas-generator cycle\n\tTap-off cycle\n\tPressure-fed engine\n\tPump-fed engine\n\tElectric-pump-fed engine\n\n\n\tTripropellant\n\n\n\n\n\n\n\n\tElectrical\nthrusters\t\n\tElectrostatic\t\n\tColloid thruster\n\tIon thruster\n\tGridded\n\tHall-effect thruster\n\tField-emission electric propulsion\n\n\n\n\n\n\n\tElectromagnetic\t\n\tPulsed inductive thruster\n\tMagnetoplasmadynamic thruster\n\tElectrodeless plasma thruster\n\n\n\n\n\tElectrothermal\t\n\tPulsed plasma thruster\n\tHelicon double-layer thruster\n\tArcjet rocket\n\tResistojet rocket\n\tVASIMR\n\n\n\n\n\tOther\t\n\tAtmosphere-breathing electric propulsion\n\tHigh Power Electric Propulsion\n\tMagBeam\n\tMass driver\n\n\n\n\n\n\n\n\tNuclear\npropulsion\t\n\tClosed system\t\n\tDirect Fusion Drive\n\tNuclear electric rocket\n\tNuclear thermal rocket\n\tRadioisotope\n\tSalt-water\n\tGas core\n\t\"Lightbulb\"\n\n\n\n\n\n\n\tOpen system\t\n\tNuclear pulse propulsion\n\tAntimatter-catalyzed\n\n\n\tPulsed nuclear thermal rocket‎\n\tFusion rocket\n\tBussard ramjet\n\n\n\tFission-fragment rocket\n\tFission sail\n\n\n\tNuclear photonic rocket\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tBeam-powered propulsion\n\tCold gas thruster\n\tGravity assist\n\tSolar sail\n\tElectric sail\n\tMagnetic sail\n\n\n\tSolar thermal rocket\n\tTethers\n\tSteam thruster\n\n\n\n\n\tSpaceflight portal\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nEmerging technologies\n\n\tFields\t\n\tAgriculture\t\n\tAgricultural robot\n\tCellular agriculture\n\tClosed ecological systems\n\tCultured meat\n\tGenetically modified food\n\tPrecision agriculture\n\tVertical farming\n\n\n\n\n\tArchitecture\t\n\tArcology\n\tBuilding printing\n\tContour crafting\n\n\n\tDomed city\n\n\n\n\n\tBiomedical\t\n\tArtificial uterus\n\tAmpakine\n\tBrain transplant\n\tCryonics\n\tCryoprotectant\n\tCryopreservation\n\tVitrification\n\tSuspended animation\n\n\n\tDe-extinction\n\tGenetic engineering\n\tGene therapy\n\n\n\tHead transplant\n\tIsolated brain\n\tLife extension\n\tStrategies for Engineered Negligible Senescence\n\n\n\tNanomedicine\n\tNanosensors\n\tOrgan printing\n\tPersonalized medicine\n\tRegenerative medicine\n\tStem-cell therapy\n\tTissue engineering\n\n\n\tRobot-assisted surgery\n\tSynthetic biology\n\tSynthetic genomics\n\n\n\tVirotherapy\n\tOncolytic virus\n\n\n\tTricorder\n\tWhole genome sequencing\n\n\n\n\n\tDisplays\t\n\tNext generation\t\n\tFED\n\tFLCD\n\tiMoD\n\tLaser\n\tLPD\n\tOLED\n\tOLET\n\tQD-LED\n\tSED\n\tTPD\n\tTDEL\n\tTMOS\n\tMicroLED\n\n\n\n\n\tScreenless\t\n\tBionic contact lens\n\tHead-mounted display\n\tHead-up display\n\tOptical head-mounted display\n\tVirtual retinal display\n\n\n\n\n\tOther\t\n\tAutostereoscopy\n\tFlexible display\n\tHolographic display\n\tComputer-generated holography\n\n\n\tMulti-primary color display\n\tUltra HD\n\tVolumetric display\n\n\n\n\n\n\n\n\tElectronics\t\n\tElectronic nose\n\tE-textiles\n\tFlexible electronics\n\tMolecular electronics\n\tNanoelectromechanical systems\n\tMemristor\n\tSpintronics\n\tThermal copper pillar bump\n\tTwistronics\n\n\n\n\n\tEnergy\t\n\tProduction\t\n\tAirborne wind turbine\n\tArtificial photosynthesis\n\tBiofuels\n\tCarbon-neutral fuel\n\tConcentrated solar power\n\tFusion power\n\tHome fuel cell\n\tHydrogen economy\n\tMethanol economy\n\tMolten salt reactor\n\tNantenna\n\tPhotovoltaic pavement\n\tSpace-based solar power\n\tVortex engine\n\n\n\n\n\tStorage\t\n\tBeltway battery\n\tCompressed air energy storage\n\tFlywheel energy storage\n\tGrid energy storage\n\tLithium–air battery\n\tMolten-salt battery\n\tNanowire battery\n\tResearch in lithium-ion batteries\n\tSilicon–air battery\n\tThermal energy storage\n\tUltracapacitor\n\n\n\n\n\tOther\t\n\tSmart grid\n\tWireless power\n\n\n\n\n\n\n\n\tInformation and\ncommunications\n\t\n\tAmbient intelligence\n\tInternet of things\n\n\n\tArtificial intelligence\n\tApplications of artificial intelligence\n\tProgress in artificial intelligence\n\tMachine translation\n\tMobile translation\n\tMachine vision\n\tSemantic Web\n\tSpeech recognition\n\n\n\tAtomtronics\n\tCarbon nanotube field-effect transistor\n\tCybermethodology\n\tFourth-generation optical discs\n\t3D optical data storage\n\tHolographic data storage\n\n\n\tGPGPU\n\tMemory\n\tCBRAM\n\tFRAM\n\tMillipede\n\tMRAM\n\tNRAM\n\tPRAM\n\tRacetrack memory\n\tRRAM\n\tSONOS\n\n\n\tOptical computing\n\tRFID\n\tChipless RFID\n\n\n\tSoftware-defined radio\n\tThree-dimensional integrated circuit\n\n\n\n\n\tManufacturing\t\n\t3D printing\n\tClaytronics\n\tMolecular assembler\n\tUtility fog\n\n\n\n\n\tMaterials science\t\n\tAerogel\n\tAmorphous metal\n\tArtificial muscle\n\tConductive polymer\n\tFemtotechnology\n\tFullerene\n\tGraphene\n\tHigh-temperature superconductivity\n\tHigh-temperature superfluidity\n\tLinear acetylenic carbon\n\tMetamaterials\n\tMetamaterial cloaking\n\n\n\tMetal foam\n\tMulti-function structures\n\tNanotechnology\n\tCarbon nanotubes\n\tMolecular nanotechnology\n\tNanomaterials\n\n\n\tPicotechnology\n\tProgrammable matter\n\tQuantum dots\n\tSilicene\n\tSuperalloy\n\tSynthetic diamond\n\n\n\n\n\tMilitary\t\n\tAntimatter weapon\n\tCaseless ammunition\n\tDirected-energy weapon\n\tLaser\n\tMaser\n\tParticle-beam weapon\n\tSonic weapon\n\tCoilgun\n\tRailgun\n\n\n\tPlasma weapon\n\tPure fusion weapon\n\tStealth technology\n\tVortex ring gun\n\n\n\n\n\tNeuroscience\t\n\tArtificial brain\n\tBrain–computer interface\n\tElectroencephalography\n\tMind uploading\n\tBrain-reading\n\tNeuroinformatics\n\n\n\tNeuroprosthetics\n\tBionic eye\n\tBrain implant\n\tExocortex\n\tRetinal implant\n\n\n\n\n\n\n\tQuantum\t\n\tQuantum algorithms\n\tQuantum amplifier\n\tQuantum bus\n\tQuantum channel\n\tQuantum circuit\n\tQuantum complexity theory\n\tQuantum computing\n\tQuantum cryptography\n\tQuantum dynamics\n\tQuantum electronics\n\tQuantum error correction\n\tQuantum imaging\n\tQuantum information\n\tQuantum key distribution\n\tQuantum logic\n\tQuantum logic gates\n\tQuantum machine\n\tQuantum machine learning\n\tQuantum metamaterial\n\tQuantum metrology\n\tQuantum network\n\tQuantum neural network\n\tQuantum optics\n\tQuantum programming\n\tQuantum sensing\n\tQuantum simulator\n\tQuantum teleportation\n\n\n\n\n\tRobotics\t\n\tDomotics\n\tNanorobotics\n\tPowered exoskeleton\n\tSelf-reconfiguring modular robot\n\tSwarm robotics\n\tUncrewed vehicle\n\n\n\n\n\tSpace science\t\n\tLaunch\t\n\tFusion rocket\n\tNon-rocket spacelaunch\n\tMass driver\n\tOrbital ring\n\tSkyhook\n\tSpace elevator\n\tSpace fountain\n\tSpace tether\n\n\n\tReusable launch system\n\n\n\n\n\tPropulsion\t\n\tBeam-powered propulsion\n\tIon thruster\n\tLaser propulsion\n\tPlasma propulsion engine\n\tHelicon thruster\n\tVASIMR\n\n\n\tNuclear pulse propulsion\n\tSolar sail\n\n\n\n\n\tOther\t\n\tInterstellar travel\n\tPropellant depot\n\tLaser communication in space\n\n\n\n\n\n\n\n\tTransport\t\n\tAerial\t\n\tAdaptive compliant wing\n\tBackpack helicopter\n\tDelivery drone\n\tFlying car\n\tHigh-altitude platform\n\tJet pack\n\tPulse detonation engine\n\tScramjet\n\tSpaceplane\n\tSupersonic transport\n\n\n\n\n\tLand\t\n\tAirless tire\n\tAlternative fuel vehicle\n\tHydrogen vehicle\n\n\n\tDriverless car\n\tGround effect train\n\tHyperloop\n\tMaglev train\n\tPersonal rapid transit\n\tTransit Elevated Bus\n\tVactrain\n\tVehicular communication systems\n\n\n\n\n\tPipeline\t\n\tPneumatic transport\n\tAutomated vacuum collection\n\n\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tCloak of invisibility\n\tDigital scent technology\n\tForce field\n\tPlasma window\n\n\n\tImmersive virtual reality\n\tMagnetic refrigeration\n\tPhased-array optics\n\n\n\n\n\n\n\n\tTopics\t\n\tCollingridge dilemma\n\tDifferential technological development\n\tDisruptive Innovation\n\tEphemeralization\n\tExploratory engineering\n\tFictional technology\n\tProactionary principle\n\tTechnological change\n\tTechnological unemployment\n\n\n\tTechnological convergence\n\tTechnological evolution\n\tTechnological paradigm\n\tTechnology forecasting\n\tAccelerating change\n\tMoore's law\n\tTechnological singularity\n\tTechnology scouting\n\n\n\tTechnology readiness level\n\tTechnology roadmap\n\tTranshumanism\n\n\n\n\n\t\n\t Category\n\t List\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Beam-powered_propulsion&oldid=915535257\"\n\n\t\t\n\t\tCategories: \tSpacecraft propulsion\n\tSpace access\n\tForce lasers\n\tEmerging technologies\n\n\nHidden categories: \tCS1 maint: archived copy as title\n\tWebarchive template wayback links\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from January 2014\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t日本語\n\tSuomi\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 13 September 2019, at 20:57 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "6", "dc:title": "Beam-powered propulsion - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-beam-powered_propulsion", "title": "Beam-powered propulsion - Wikipedia"}}