{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCircuit switching - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tCircuit switching\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\t\n\tThis article includes a list of references, related reading or external links, but its sources remain unclear because it lacks inline citations. Please help to improve this article by introducing more precise citations.  (June 2009) (Learn how and when to remove this template message)\n\n\n\nCircuit switching is a method of implementing a telecommunications network in which two network nodes establish a dedicated communications channel (circuit) through the network before the nodes may communicate. The circuit guarantees the full bandwidth of the channel and remains connected for the duration of the communication session. The circuit functions as if the nodes were physically connected as with an electrical circuit.\n\nThe defining example of a circuit-switched network is the early analog telephone network. When a call is made from one telephone to another, switches within the telephone exchanges create a continuous wire circuit between the two telephones, for as long as the call lasts.\n\nCircuit switching contrasts with packet switching, which divides the data to be transmitted into packets transmitted through the network independently. In packet switching, instead of being dedicated to one communication session at a time, network links are shared by packets from multiple competing communication sessions, resulting in the loss of the quality of service guarantees that are provided by circuit switching.\n\nIn circuit switching, the bit delay is constant during a connection, as opposed to packet switching, where packet queues may cause varying and potentially indefinitely long packet transfer delays. No circuit can be degraded by competing users because it is protected from use by other callers until the circuit is released and a new connection is set up. Even if no actual communication is taking place, the channel remains reserved and protected from competing users.\n\nVirtual circuit switching is a packet switching technology that emulates circuit switching, in the sense that the connection is established before any packets are transferred, and packets are delivered in order.\n\nWhile circuit switching is commonly used for connecting voice circuits, the concept of a dedicated path persisting between two communicating parties or nodes can be extended to signal content other than voice. The advantage of using circuit switching is that it provides for continuous transfer without the overhead associated with packets, making maximal use of available bandwidth for that communication. One disadvantage is that it can be relatively inefficient, because unused capacity guaranteed to a connection cannot be used by other connections on the same network.\n\n\n\tMultiplexing\n\t\n\t\nAnalog modulation\n\t\n\n\tAM\n\tFM\n\tPM\n\tQAM\n\tSM\n\tSSB\n\n\n\n\n\t\nCircuit mode\n(constant bandwidth)\n\n\t\n\n\tTDM\n\tFDM / WDM\n\tSDMA\n\tPolarization\n\tSpatial\n\tOAM\n\n\n\n\n\t\nStatistical multiplexing\n\n(variable bandwidth)\n\n\t\n\n\tPacket switching\n\tDynamic TDMA\n\tFHSS\n\tDSSS\n\tOFDMA\n\tSC-FDM\n\tMC-SS\n\n\n\n\n\t\nRelated topics\n\t\n\tChannel access methods\n\tMedia access control\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nContents\n\n\n\t1 The call\n\t2 Compared with datagram packet switching\n\t3 Examples of circuit-switched networks\n\t4 See also\n\t5 External links\n\n\n\n\n\nThe call[edit]\n\nFor call setup and control (and other administrative purposes), it is possible to use a separate dedicated signalling channel from the end node to the network. ISDN is one such service that uses a separate signalling channel while plain old telephone service (POTS) does not.\n\nThe method of establishing the connection and monitoring its progress and termination through the network may also utilize a separate control channel as in the case of links between telephone exchanges which use CCS7 packet-switched signalling protocol to communicate the call setup and control information and use TDM to transport the actual circuit data.\n\nEarly telephone exchanges were a suitable example of circuit switching. The subscriber would ask the operator to connect to another subscriber, whether on the same exchange or via an inter-exchange link and another operator. In any case, the end result was a physical electrical connection between the two subscribers' telephones for the duration of the call. The copper wire used for the connection could not be used to carry other calls at the same time, even if the subscribers were in fact not talking and the line was silent.\n\n\nCompared with datagram packet switching[edit]\n\nCircuit switching contrasts with packet switching which divides the data to be transmitted into small units, called packets, transmitted through the network independently.  Packet switching shares available network bandwidth between multiple communication sessions.\n\nMultiplexing multiple telecommunications connections over the same physical conductor has been possible for a long time, but nonetheless each channel on the multiplexed link was either dedicated to one call at a time, or it was idle between calls.\n\nIn circuit switching, a route and its associated bandwidth is reserved from source to destination, making circuit switching relatively inefficient since capacity is reserved whether or not the connection is in continuous use.\n\nIn contrast, packet switching is the process of segmenting data to be transmitted into several smaller packets.  Each packet is labeled with its destination and a sequence number for ordering related packets, precluding the need for a dedicated path to help the packet find its way to its destination.  Each packet is dispatched independently and each may be routed via a different path.  At the destination, the original message is reordered based on the packet number to reproduce the original message.  As a result, datagram packet switching networks do not require a circuit to be established and allow many pairs of nodes to communicate concurrently over the same channel.\n\n\nExamples of circuit-switched networks[edit]\n\n\tPublic switched telephone network (PSTN)\n\tB channel of ISDN\n\tCircuit Switched Data (CSD) and High-Speed Circuit-Switched Data (HSCSD) service in cellular systems such as GSM\n\tDatakit\n\tX.21 (Used in the German DATEX-L and Scandinavian DATEX circuit switched data network)\n\tOptical mesh network\n\n\nSee also[edit]\n\n\tClos network\n\tConnection-oriented communication\n\tMessage switching\n\tSwitching circuit theory\n\tTime-driven switching\n\n\nExternal links[edit]\n\n\tNetheads vs Bellheads by Steve Steinberg\n\tUniversity of Virginia\n\tRFC 3489 Some Internet Architectural Guidelines and Philopsophy\n\n\n\t\tv\n\tt\n\te\n\n\nChannel access methods and media access control\n\n\tChannel-based\t\n\tFDMA\t\n\tFDM\n\tOFDMA\n\tSC-FDMA\n\n\n\tWDM\n\tWDMA\n\n\n\n\n\n\n\tTDMA\t\n\tMF-TDMA\n\tSTDMA\n\n\n\n\n\tCDMA\t\n\tW-CDMA\n\tTD-CDMA\n\tTD-SCDMA\n\tDS-CDMA\n\tFH-CDMA\n\tMC-CDMA\n\n\n\n\n\tSDMA\t\n\tHC-SDMA\n\n\n\n\n\tPDMA\t\n\t\n\n\n\n\n\tPAMA\t\n\t\n\n\n\n\n\n\n\n\tPacket-based\t\n\tCollision recovery\t\n\tALOHA\n\tSlotted ALOHA\n\tR-ALOHA\n\tAX.25\n\tCSMA/CD\n\n\n\n\n\tCollision avoidance\t\n\tMACA\n\tMACAW\n\tCSMA\n\tCSMA/CA\n\tDCF\n\tPCF\n\tHCF\n\tCSMA/CARP\n\n\n\n\n\tCollision-free\t\n\tToken ring\n\tToken bus\n\tMS-ALOHA\n\n\n\n\n\tDelay and disruption tolerant\t\n\tMANET\n\tVANET\n\tDTN\n\tDynamic Source Routing\n\n\n\n\n\n\n\n\tDuplexing methods\t\n\tTDD\n\tFDD\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Circuit_switching&oldid=919062582\"\n\n\t\t\n\t\tCategories: \tChannel access methods\n\tTeletraffic\n\tNetwork architecture\n\tPhysical layer protocols\n\n\nHidden categories: \tArticles lacking in-text citations from June 2009\n\tAll articles lacking in-text citations\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tČeština\n\tDeutsch\n\tEspañol\n\tفارسی\n\tFrançais\n\t한국어\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tLatviešu\n\tМакедонски\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tNorsk\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSuomi\n\tSvenska\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 October 2019, at 16:54 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "3", "dc:title": "Circuit switching - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Multiplexing_diagram.svg/1200px-Multiplexing_diagram.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-circuit_switching", "title": "Circuit switching - Wikipedia"}}