{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrinted circuit board - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tPrinted circuit board\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Circuit board)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tBoard to support and connect electronic components\n\nNot to be confused with Printed electronics.\n\n\"Printed circuit\" redirects here. For the defunct company, see Printed Circuit Corporation.\n\n\t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Printed circuit board\" – news · newspapers · books · scholar · JSTOR  (October 2016) (Learn how and when to remove this template message)\n\n\n\n  \nPart of a 1984 Sinclair ZX Spectrum computer board, a PCB, showing the conductive traces, vias (the through-hole paths to the other surface), and some electronic components mounted using through-hole mounting.\n\n\n\nA printed circuit board (PCB) mechanically supports and electrically connects electronic components or electrical components using conductive tracks, pads and other features etched from one or more sheet layers of copper laminated onto and/or between sheet layers of a non-conductive substrate. Components are generally soldered onto the PCB to both electrically connect and mechanically fasten them to it.\n\nPrinted circuit boards are used in all but the simplest electronic products. They are also used in some electrical products, such as passive switch boxes.\n\nAlternatives to PCBs include wire wrap and point-to-point construction, both once popular but now rarely used. PCBs require additional design effort to lay out the circuit, but manufacturing and assembly can be automated. Specialized CAD software is available to do much of the work of layout. Mass-producing circuits with PCBs is cheaper and faster than with other wiring methods, as components are mounted and wired in one operation.  Large numbers of PCBs can be fabricated at the same time, and the layout only has to be done once.  PCBs can also be made manually in small quantities, with reduced benefits.\n\nPCBs can be single-sided (one copper layer), double-sided (two copper layers on both sides of one substrate layer), or multi-layer (outer and inner layers of copper, alternating with layers of substrate).  Multi-layer PCBs allow for much higher component density, because circuit traces on the inner layers would otherwise take up surface space between components.  The rise in popularity of multilayer PCBs with more than two, and especially with more than four, copper planes was concurrent with the adoption of surface mount technology.  However, multilayer PCBs make repair, analysis, and field modification of circuits much more difficult and usually impractical.\n\nThe world market for bare PCBs exceeded $60.2 billion in 2014.[1] In 2018, the Global Single Sided Printed Circuit Board Market Analysis Report estimated that the PCB market would reach $79 billion by 2024.[2][3]\n\n\nContents\n\n\n\t1 History\n\t2 Overview\n\t3 Characteristics\n\t3.1 Through-hole technology\n\t3.2 Surface-mount technology\n\t3.3 Circuit properties of the PCB\n\t3.4 Materials\n\t3.4.1 RoHS compliant PCB\n\t3.4.2 Laminates\n\t3.4.3 Key substrate parameters\n\t3.4.4 Common substrates\n\t3.4.5 Copper thickness\n\t3.4.6 Safety certification (US)\n\n\n\n\n\n\n\t4 Design\n\t5 Manufacturing\n\t5.1 PCB CAM\n\t5.2 Panelization\n\t5.3 Copper patterning\n\t5.3.1 Large volume\n\t5.3.2 Small volume\n\t5.3.3 Hobbyist\n\n\n\n\t5.4 Subtractive, additive and semi-additive processes\n\t5.5 Chemical etching\n\t5.6 Lamination\n\t5.7 Drilling\n\t5.8 Plating and coating\n\t5.9 Solder resist application\n\t5.10 Silkscreen printing\n\t5.11 Bare-board test\n\t5.12 Assembly\n\t5.13 Protection and packaging\n\n\n\n\t6 Cordwood construction\n\t7 Multiwire boards\n\t8 See also\n\t9 References\n\t10 External links\n\n\n\n\n\nHistory[edit]\n\nBefore the development of printed circuit boards electrical and electronic circuits were wired point-to-point on a chassis. Typically, the chassis was a sheet metal frame or pan, sometimes with a wooden bottom. Components were attached to the chassis, usually by insulators when the connecting point on the chassis was metal, and then their leads were connected directly or with jumper wires by soldering, or sometimes using crimp connectors, wire connector lugs on screw terminals, or other methods. Circuits were large, bulky, heavy, and relatively fragile (even discounting the breakable glass envelopes of the vacuum tubes that were often included in the circuits), and production was labor-intensive, so the products were expensive.\n\nDevelopment of the methods used in modern printed circuit boards started early in the 20th century. In 1903, a German inventor, Albert Hanson, described flat foil conductors laminated to an insulating board, in multiple layers. Thomas Edison experimented with chemical methods of plating conductors onto linen paper in 1904. Arthur Berry in 1913 patented a print-and-etch method in the UK, and in the United States Max Schoop obtained a patent[4] to flame-spray metal onto a board through a patterned mask. Charles Ducas in 1927 patented a method of electroplating circuit patterns.[5]\n\nThe Austrian engineer Paul Eisler invented the printed circuit as part of a radio set while working in the UK around 1936. In 1941 a multi-layer printed circuit was used in German magnetic influence naval mines. Around 1943 the USA began to use the technology on a large scale to make proximity fuses for use in World War II.[5] After the war, in 1948, the USA released the invention for commercial use. Printed circuits did not become commonplace in consumer electronics until the mid-1950s, after the Auto-Sembly process was developed by the United States Army. At around the same time in the UK work along similar lines was carried out by Geoffrey Dummer, then at the RRDE.\n\nEven as circuit boards became available, the point-to-point chassis construction method remained in common use in industry (such as TV and hi-fi sets) into at least the late 1960s. Printed circuit boards were introduced to  reduce the size, weight, and cost of parts of the circuitry. In 1960, a small consumer radio receiver might be built with all its circuitry on one circuit board, but a TV set would probably contain  one or more circuit boards.\n\n\n  \nAn example of hand-drawn etched traces on a PCB\n\n\n\nPredating the printed circuit invention, and similar in spirit, was John Sargrove's 1936–1947 Electronic Circuit Making Equipment (ECME) which sprayed metal onto a Bakelite plastic board. The ECME could produce three radio boards per minute.\n\nDuring World War II, the development of the anti-aircraft proximity fuse required an electronic circuit that could withstand being fired from a gun, and could be produced in quantity. The Centralab Division of Globe Union submitted a proposal which met the requirements: a ceramic plate would be screenprinted with metallic paint for conductors and carbon material for resistors, with ceramic disc capacitors and subminiature vacuum tubes soldered in place.[6] The technique proved viable, and the resulting patent on the process, which was classified by the U.S. Army, was assigned to Globe Union. It was not until 1984 that the Institute of Electrical and Electronics Engineers (IEEE) awarded Harry W. Rubinstein the Cledo Brunetti Award for early key contributions to the development of printed components and conductors on a common insulating substrate. Rubinstein was honored in 1984 by his alma mater, the University of Wisconsin-Madison, for his innovations in the technology of printed electronic circuits and the fabrication of capacitors.[7][8] This invention also represents a step in the development of integrated circuit technology, as not only wiring but also passive components were fabricated on the ceramic substrate.\n\n\n  \nA PCB as a design on a computer (left) and realized as a board assembly populated with components (right). The board is double sided, with through-hole plating, green solder resist and a white legend. Both surface mount and through-hole components have been used.\n\n\n\nOriginally, every electronic component had wire leads, and a PCB had holes drilled for each wire of each component. The component leads were then inserted through the holes and soldered to the copper PCB traces. This method of assembly is called through-hole construction. In 1949, Moe Abramson and Stanislaus F. Danko of the United States Army Signal Corps developed the Auto-Sembly process in which component leads were inserted into a copper foil interconnection pattern and dip soldered. The patent they obtained in 1956 was assigned to the U.S. Army.[9] With the development of board lamination and etching techniques, this concept evolved into the standard printed circuit board fabrication process in use today. Soldering could be done automatically by passing the board over a ripple, or wave, of molten solder in a wave-soldering machine. However, the wires and holes are inefficient since drilling holes is expensive and consumes drill bits and the protruding wires are cut off and discarded.\n\nFrom the 1980s onward, small surface mount parts have been used increasingly instead of through-hole components; this has led to smaller boards for a given functionality and lower production costs, but with some additional difficulty in servicing faulty boards.\n\nIn the 1990s the use of multilayer surface boards became more frequent. As a result, size was further minimized and both flexible and rigid PCBs were incorporated in different devices. In 1995 PCB manufacturers began using microvia technology to produce High-Density Interconnect (HDI) PCBs.[10][11]\n\nHDI technology allows for a denser design on the PCB and significantly smaller components. As a result, components can be closer and the paths between them shorter. HDIs use blind/buried vias, or a combination that includes microvias. With multi-layer HDI PCBs the interconnection of stacked vias is even stronger, thus enhancing reliability in all conditions. The most common applications for HDI technology are computer and mobile phone components as well as medical equipment and military communication equipment. A 4-layer HDI microvia PCB Cost is equivalent in quality to an 8-layer through-hole PCB. However, the cost is much lower.[12][13]\n\nRecent advances in 3D printing have meant that there are several new techniques in PCB creation. 3D printed electronics (PEs) can be utilized to print items layer by layer and subsequently the item can be printed with a liquid ink that contains electronic functionalities.\n\nManufacturers may not support component-level repair of printed circuit boards because of the relatively low cost to replace compared with the time and cost of troubleshooting to a component level. In board-level repair, the technician identifies the board (PCA) on which the fault resides and replaces it. This shift is economically efficient from a manufacturer's point of view but is also materially wasteful, as a circuit board with hundreds of good components may be discarded and replaced due to the failure of one minor and inexpensive part such as a resistor or capacitor. This practice is a significant contributor to the problem of e-waste.[citation needed]\n\n\nOverview[edit]\n\nA basic PCB consists of a flat sheet of insulating material and a layer of copper foil, laminated to the substrate. Chemical etching divides the copper into separate conducting lines called tracks or circuit traces, pads for connections, vias to pass connections between layers of copper, and features such as solid conductive areas for EM shielding or other purposes. The tracks function as wires fixed in place, and are insulated from each other by air and the board substrate material.  The surface of a PCB may have a coating that protects the copper from corrosion and reduces the chances of solder shorts between traces or undesired electrical contact with stray bare wires. For its function in helping to prevent solder shorts, the coating is called solder resist or solder mask.\n\nA printed circuit board can have multiple copper layers.  A two-layer board has copper on both sides; multi layer boards sandwich additional copper layers between layers of insulating material. Conductors on different layers are connected with vias, which are copper-plated holes that function as electrical tunnels through the insulating substrate. Through-hole component leads sometimes also effectively function as vias.  After two-layer PCBs, the next step up is usually four-layer. Often two layers are dedicated as power supply and ground planes, and the other two are used for signal wiring between components.\n\n\"Through hole\" components are mounted by their wire leads passing through the board and soldered to traces on the other side. \"Surface mount\" components are attached by their leads to copper traces on the same side of the board.  A board may use both methods for mounting components. PCBs with only through-hole mounted components are now uncommon. Surface mounting is used for transistors, diodes, IC chips, resistors and capacitors. Through-hole mounting may be used for some large components such as electrolytic capacitors and connectors.\n\nThe  pattern to be etched into each copper layer of a PCB is called the \"artwork\".  The etching is usually done using photoresist which is coated onto the PCB, then exposed to light projected in the pattern of the artwork. The resist material protects the copper from dissolution into the etching solution.  The etched board is then cleaned. A PCB design can be mass-reproduced in a way similar to the way photographs can be mass-duplicated from film negatives using a photographic printer.\n\nIn multi-layer boards, the layers of material are laminated together in an alternating sandwich: copper, substrate, copper, substrate, copper, etc.; each plane of copper is etched, and any internal vias (that will not extend to both outer surfaces of the finished multilayer board) are plated-through, before the layers are laminated together. Only the outer layers need be coated; the inner copper layers are protected by the adjacent substrate layers.\n\nFR-4 glass epoxy is the most common insulating substrate. Another substrate material is cotton paper impregnated with phenolic resin, often tan or brown.\n\nWhen a PCB has no components installed, it is less ambiguously called a printed wiring board (PWB) or etched wiring board. However, the term \"printed wiring board\" has fallen into disuse. A PCB populated with electronic components is called a printed circuit assembly (PCA), printed circuit board assembly or PCB assembly (PCBA). In informal usage, the term \"printed circuit board\" most commonly means \"printed circuit assembly\" (with components). The IPC preferred term for assembled boards is circuit card assembly (CCA),[14] and for assembled backplanes it is backplane assemblies. \"Card\" is another widely used informal term for a \"printed circuit assembly\".\nFor example, expansion card.\n\nA PCB may be \"silkscreen\" printed with a legend  identifying the components, test points, or identifying text. Originally, an actual silkscreen printing process was used for this purpose, but today other, finer quality printing methods are usually used instead.  Normally the screen printing is not significant to the function of the PCBA.\n\nA minimal PCB for a single component, used for prototyping, is called a breakout board. The purpose of a breakout board is to \"break out\" the leads of a component on separate terminals so that manual connections to them can be made easily. Breakout boards are especially used for surface-mount components or any components with fine lead pitch.\n\nAdvanced PCBs may contain components embedded in the substrate.[citation needed]\n\n\nCharacteristics[edit]\n\nThrough-hole technology[edit]\n\nMain article: Through-hole technology\n\n  \nThrough-hole (leaded) resistors\n\n\n\nThe first PCBs used through-hole technology, mounting electronic components by leads inserted through holes on one side of the board and soldered onto copper traces on the other side. Boards may be single-sided, with an unplated component side, or more compact double-sided boards, with components soldered on both sides.  Horizontal installation of through-hole parts with two axial leads (such as resistors, capacitors, and diodes) is done by bending the leads 90 degrees in the same direction, inserting the part in the board (often bending leads located on the back of the board in opposite directions to improve the part's mechanical strength), soldering the leads, and trimming off the ends. Leads may be soldered either manually or by a wave soldering machine.[15]\n\nThrough-hole manufacture adds to board cost by requiring many holes to be drilled accurately, and it limits the available routing area for signal traces on layers immediately below the top layer on multi-layer boards, since the holes must pass through all layers to the opposite side. Once surface-mounting came into use, small-sized SMD components were used where possible, with through-hole mounting only of components unsuitably large for surface-mounting due to power requirements or mechanical limitations, or subject to mechanical stress which might damage the PCB (e.g. by lifting the copper off the board surface).[citation needed]\n\n\n\t\n\t\t\t\n\n\n\t\t\t\nThrough-hole devices mounted on the circuit board of a mid-1980s Commodore 64 home computer\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nA box of drill bits used for making holes in printed circuit boards. While tungsten-carbide bits are very hard, they eventually wear out or break. Drilling is a considerable part of the cost of a through-hole printed circuit board.\n\n\n\t\t\t\n\n\t\t\n\n\n\n\n\n\nSurface-mount technology[edit]\n\nMain article: Surface-mount technology\n\n  \nSurface mount components, including resistors, transistors and an integrated circuit\n\n\n\nSurface-mount technology emerged in the 1960s, gained momentum in the early 1980s and became widely used by the mid-1990s.\nComponents were mechanically redesigned to have small metal tabs or end caps that could be soldered directly onto the PCB surface, instead of wire leads to pass through holes. Components became much smaller and component placement on both sides of the board became more common than with through-hole mounting, allowing much smaller PCB assemblies with much higher circuit densities.\nSurface mounting lends itself well to a high degree of automation, reducing labor costs and greatly increasing production rates compared with through-hole circuit boards.  Components can be supplied mounted on carrier tapes. Surface mount components can be about one-quarter to one-tenth of the size and weight of through-hole components, and passive components much cheaper.  However, prices of semiconductor surface mount devices (SMDs) are determined more by the chip itself than the package, with little price advantage over larger packages, and some wire-ended components, such as 1N4148 small-signal switch diodes, are actually significantly cheaper than SMD equivalents.\n\n\n  \nA PCB in a computer mouse: the component side (left) and the printed side (right)\n\n\n\nCircuit properties of the PCB[edit]\n\nEach trace consists of a flat, narrow part of the copper foil that remains after etching. Its resistance, determined by its width, thickness, and length, must be sufficiently low for the current the conductor will carry. Power and ground traces may need to be wider than signal traces. In a multi-layer board one entire layer may be mostly solid copper to act as a ground plane for shielding and power return. For microwave circuits, transmission lines can be laid out in a planar form such as stripline or microstrip with carefully controlled dimensions to assure a consistent impedance. In radio-frequency and fast switching circuits the inductance and capacitance of the printed circuit board conductors become significant circuit elements, usually undesired; conversely, they can be used as a deliberate part of the circuit design, as in distributed element filters, antennae, and fuses, obviating the need for additional discrete components.\n\n\nMaterials[edit]\n\nRoHS compliant PCB[edit]\n\nThe European Union bans the use of lead (among other heavy metals) in consumer items, a piece of legislature called the RoHS, for Restriction of Hazardous Substances, directive. PCBs to be sold in the EU must be RoHS-compliant, meaning that all manufacturing processes must not involve the use of lead, all solder used must be lead-free, and all components mounted on the board must be free of lead, mercury, cadmium, and other heavy metals.[16][17]\n\n\nLaminates[edit]\n\nLaminates are manufactured by curing under pressure and temperature layers of cloth or paper with thermoset resin to form an integral final piece of uniform thickness. The size can be up to 4 by 8 feet (1.2 by 2.4 m) in width and length.  Varying cloth weaves (threads per inch or cm), cloth thickness, and resin percentage are used to achieve the desired final thickness and dielectric characteristics. Available standard laminate thickness are listed in\nANSI/IPC-D-275.[18]\n\nThe cloth or fiber material used, resin material, and the cloth to resin ratio determine the laminate's type designation (FR-4, CEM-1, G-10, etc.) and therefore the characteristics of the laminate produced. Important characteristics are the level to which the laminate is fire retardant, the dielectric constant (er), the loss factor (tδ), the tensile strength, the shear strength, the glass transition temperature (Tg), and the Z-axis expansion coefficient (how much the thickness changes with temperature).\n\nThere are quite a few different dielectrics that can be chosen to provide different insulating values depending on the requirements of the circuit. Some of these dielectrics are polytetrafluoroethylene (Teflon), FR-4, FR-1, CEM-1 or CEM-3. Well known pre-preg materials used in the PCB industry are FR-2 (phenolic cotton paper), FR-3 (cotton paper and epoxy), FR-4 (woven glass and epoxy), FR-5 (woven glass and epoxy), FR-6 (matte glass and polyester), G-10 (woven glass and epoxy), CEM-1 (cotton paper and epoxy), CEM-2 (cotton paper and epoxy), CEM-3 (non-woven glass and epoxy), CEM-4 (woven glass and epoxy), CEM-5 (woven glass and polyester). Thermal expansion is an important consideration especially with ball grid array (BGA) and naked die technologies, and glass fiber offers the best dimensional stability.\n\nFR-4 is by far the most common material used today. The board stock with unetched copper on it is called \"copper-clad laminate\".\n\nWith decreasing size of board features and increasing frequencies, small nonhomogeneities like uneven distribution of fiberglass or other filler, thickness variations, and bubbles in the resin matrix, and the associated local variations in the dielectric constant, are gaining importance.\n\n\nKey substrate parameters[edit]\n\nThe circuitboard substrates are usually dielectric composite materials. The composites contain a matrix (usually an epoxy resin) and a reinforcement (usually a woven, sometimes nonwoven, glass fibers, sometimes even paper), and in some cases a filler is added to the resin (e.g. ceramics; titanate ceramics can be used to increase the dielectric constant).\n\nThe reinforcement type defines two major classes of materials: woven and non-woven. Woven reinforcements are cheaper, but the high dielectric constant of glass may not be favorable for many higher-frequency applications. The spatially nonhomogeneous structure also introduces local variations in electrical parameters, due to different resin/glass ratio at different areas of the weave pattern. Nonwoven reinforcements, or materials with low or no reinforcement, are more expensive but more suitable for some RF/analog applications.\n\nThe substrates are characterized by several key parameters, chiefly thermomechanical (glass transition temperature, tensile strength, shear strength, thermal expansion), electrical (dielectric constant, loss tangent, dielectric breakdown voltage, leakage current, tracking resistance...), and others (e.g. moisture absorption).\n\nAt the glass transition temperature the resin in the composite softens and significantly increases thermal expansion; exceeding Tg then exerts mechanical overload on the board components - e.g. the joints and the vias. Below Tg the thermal expansion of the resin roughly matches copper and glass, above it gets significantly higher. As the reinforcement and copper confine the board along the plane, virtually all volume expansion projects to the thickness and stresses the plated-through holes. Repeated soldering or other exposition to higher temperatures can cause failure of the plating, especially with thicker boards; thick boards therefore require a matrix with a high Tg.\n\nThe materials used determine the substrate's dielectric constant. This constant is also dependent on frequency, usually decreasing with frequency. As this constant determines the signal propagation speed, frequency dependence introduces phase distortion in wideband applications; as flat a dielectric constant vs frequency characteristics as is achievable is important here. The impedance of transmission lines decreases with frequency, therefore faster edges of signals reflect more than slower ones.\n\nDielectric breakdown voltage determines the maximum voltage gradient the material can be subjected to before suffering a breakdown (conduction, or arcing, through the dielectric).\n\nTracking resistance determines how the material resists high voltage electrical discharges creeping over the board surface.\n\nLoss tangent determines how much of the electromagnetic energy from the signals in the conductors is absorbed in the board material. This factor is important for high frequencies. Low-loss materials are more expensive. Choosing unnecessarily low-loss material is a common engineering error in high-frequency digital design; it increases the cost of the boards without a corresponding benefit. Signal degradation by loss tangent and dielectric constant can be easily assessed by an eye pattern.\n\nMoisture absorption occurs when the material is exposed to high humidity or water. Both the resin and the reinforcement may absorb water; water also may be soaked by capillary forces through voids in the materials and along the reinforcement. Epoxies of the FR-4 materials aren't too susceptible, with absorption of only 0.15%. Teflon has very low absorption of 0.01%. Polyimides and cyanate esters, on the other side, suffer from high water absorption. Absorbed water can lead to significant degradation of key parameters; it impairs tracking resistance, breakdown voltage, and dielectric parameters. Relative dielectric constant of water is about 73, compared to about 4 for common circuit board materials. Absorbed moisture can also vaporize on heating, as during soldering, and cause cracking and delamination,[19] the same effect responsible for \"popcorning\" damage on wet packaging of electronic parts. Careful baking of the substrates may be required to dry them prior to soldering.[20]\n\n\nCommon substrates[edit]\n\nOften encountered materials:\n\n\n\tFR-2, phenolic paper or phenolic cotton paper, paper impregnated with a phenol formaldehyde resin. Common in consumer electronics with single-sided boards. Electrical properties inferior to FR-4. Poor arc resistance. Generally rated to 105 °C.\n\tFR-4, a woven fiberglass cloth impregnated with an epoxy resin. Low water absorption (up to about 0.15%), good insulation properties, good arc resistance.  Very common. Several grades with somewhat different properties are available. Typically rated to 130 °C.\n\tAluminum, or metal core board or insulated metal substrate (IMS), clad with thermally conductive thin dielectric - used for parts requiring significant cooling - power switches, LEDs. Consists of usually single, sometimes double layer thin circuit board based on e.g. FR-4, laminated on aluminum sheet metal, commonly 0.8, 1, 1.5, 2 or 3 mm thick. The thicker laminates sometimes also come with thicker copper metalization.\n\tFlexible substrates - can be a standalone copper-clad foil or can be laminated to a thin stiffener, e.g. 50-130 µm\n\tKapton or UPILEX,[21] a polyimide foil. Used for flexible printed circuits, in this form common in small form-factor consumer electronics or for flexible interconnects. Resistant to high temperatures.\n\tPyralux, a polyimide-fluoropolymer composite foil.[22] Copper layer can delaminate during soldering.\n\n\n\n\nLess-often encountered materials:\n\n\n\tFR-1, like FR-2, typically specified to 105 °C, some grades rated to 130 °C. Room-temperature punchable. Similar to cardboard. Poor moisture resistance. Low arc resistance.\n\tFR-3, cotton paper impregnated with epoxy. Typically rated to 105 °C.\n\tFR-5, woven fiberglass and epoxy, high strength at higher temperatures, typically specified to 170 °C.\n\tFR-6, matte glass and polyester\n\tG-10, woven glass and epoxy - high insulation resistance, low moisture absorption, very high bond strength. Typically rated to 130 °C.\n\tG-11, woven glass and epoxy - high resistance to solvents, high flexural strength retention at high temperatures.[23] Typically rated to 170 °C.\n\tCEM-1, cotton paper and epoxy\n\tCEM-2, cotton paper and epoxy\n\tCEM-3, non-woven glass and epoxy\n\tCEM-4, woven glass and epoxy\n\tCEM-5, woven glass and polyester\n\tPTFE, (\"Teflon\") - expensive, low dielectric loss, for high frequency applications, very low moisture absorption (0.01%), mechanically soft. Difficult to laminate, rarely used in multilayer applications.\n\tPTFE, ceramic filled - expensive, low dielectric loss, for high frequency applications. Varying ceramics/PTFE ratio allows adjusting dielectric constant and thermal expansion.\n\tRF-35, fiberglass-reinforced ceramics-filled PTFE. Relatively less expensive, good mechanical properties, good high-frequency properties.[24][25]\n\tAlumina, a ceramic. Hard, brittle, very expensive, very high performance, good thermal conductivity.\n\tPolyimide, a high-temperature polymer. Expensive, high-performance. Higher water absorption (0.4%). Can be used from cryogenic temperatures to over 260 °C.\n\n\nCopper thickness[edit]\n\nCopper thickness of PCBs can be specified directly or as the weight of copper per area (in ounce per square foot) which is easier to measure. One ounce per square foot is 1.344 mils or 34 micrometers thickness. Heavy copper is a layer exceeding three ounces of copper per ft2, or approximately 0.0042 inches (4.2 mils, 105 μm) thick.  Heavy copper layers are used for high current or  to help dissipate heat.\n\nOn the common FR-4 substrates, 1 oz copper per ft2 (35 µm) is the most common thickness; 2 oz (70 µm) and 0.5 oz (18 µm) thickness is often an option. Less common are 12 and 105 µm, 9 µm is sometimes available on some substrates. Flexible substrates typically have thinner metalization. Metal-core boards for high power devices commonly use thicker copper; 35 µm is usual but also 140 and 400 µm can be encountered.\n\n\nSafety certification (US)[edit]\n\nSafety Standard UL 796 covers component safety requirements for printed wiring boards for use as components in devices or appliances. Testing analyzes characteristics such as flammability, maximum operating temperature, electrical tracking, heat deflection, and direct support of live electrical parts.\n\n\nDesign[edit]\n\n  \nA board designed in 1967; the sweeping curves in the traces are evidence of freehand design using adhesive tape\n\n\n\nInitially PCBs were designed manually by creating a photomask on a clear mylar sheet, usually at two or four times the true size. Starting from the schematic diagram the component pin pads were laid out on the mylar and then traces were routed to connect the pads. Rub-on dry transfers of common component footprints increased efficiency. Traces were made with self-adhesive tape. Pre-printed non-reproducing grids on the mylar assisted in layout. The finished photomask was photolithographically reproduced onto a photoresist coating on the blank copper-clad boards.\n\nModern PCBs are designed with dedicated layout software, generally in the following steps:[26]\n\n\n\tSchematic capture through an electronic design automation (EDA) tool.\n\tCard dimensions and template are decided based on required circuitry and case of the PCB.\n\tThe positions of the components and heat sinks are determined.\n\tLayer stack of the PCB is decided, with one to tens of layers depending on complexity. Ground and power planes are decided. A power plane is the counterpart to a ground plane and behaves as an AC signal ground while providing DC power to the circuits mounted on the PCB. Signal interconnections are traced on signal planes. Signal planes can be on the outer as well as inner layers. For optimal EMI performance high frequency signals are routed in internal layers between power or ground planes.[27]\n\tLine impedance is determined using dielectric layer thickness, routing copper thickness and trace-width. Trace separation is also taken into account in case of differential signals. Microstrip, stripline or dual stripline can be used to route signals.\n\tComponents are placed. Thermal considerations and geometry are taken into account. Vias and lands are marked.\n\tSignal traces are routed. Electronic design automation tools usually create clearances and connections in power and ground planes automatically.\n\tGerber files are generated for manufacturing.\n\n\nManufacturing[edit]\n\n\n\nPCB manufacturing consists of many steps.\n\n\nPCB CAM[edit]\n\nManufacturing starts from the fabrication data generated by computer aided design, and component information. The  fabrication data is read into the CAM (Computer Aided Manufacturing) software. CAM performs the following functions:\n\n\n\tInput of the fabrication data.\n\tVerification of the data\n\tCompensation for deviations in the manufacturing processes (e.g. scaling to compensate for distortions during lamination)\n\tPanelization\n\tOutput of the digital tools (copper patterns, drill files, inspection, and others)\n\n\nPanelization[edit]\n\nSeveral small printed circuit boards can be grouped together for processing as a panel. A panel consisting of a design duplicated n-times is also called an n-panel, whereas a multi-panel combines several different design onto a single panel. The outer tooling strip often includes tooling holes, a set of panel fiducials, a test coupon, and may include hatched copper pour or similar patterns for even copper distribution over the whole panel in order to avoid bending. The assemblers often mount components on panels rather than single PCBs because this is efficient. Panelization may also be necessary for boards with components placed near an edge of the board because otherwise the board could not be mounted during assembly. Most assembly shops require a free area of at least 10 mm around the board.\n\nThe panel is eventually broken into individual PCBs along perforations or grooves in the panel[28] through milling or cutting. For milled panels a common distance between the individual boards is 2 to 3 mm. Today depaneling is often done by lasers which cut the board with no contact. Laser depaneling reduces stress on the fragile circuits, improving the yield of defect-free units.\n\n\nCopper patterning[edit]\n\nThe first step is to replicate the pattern in the fabricator's CAM system on a protective mask on the copper foil PCB layers.  Subsequent etching removes the unwanted copper. (Alternatively, a conductive ink can be ink-jetted on a blank (non-conductive) board. This technique is also used in the manufacture of hybrid circuits.)\n\n\n\tSilk screen printing uses etch-resistant inks to create the protective mask.\n\tPhotoengraving uses a photomask and developer to selectively remove a UV-sensitive photoresist coating and thus create a photoresist mask. Direct imaging techniques are sometimes used for high-resolution requirements. Experiments were made with thermal resist.[29]\n\tPCB milling uses a two or three-axis mechanical milling system to mill away the copper foil from the substrate. A PCB milling machine (referred to as a 'PCB Prototyper') operates in a similar way to a plotter, receiving commands from the host software that control the position of the milling head in the x, y, and (if relevant) z axis.\n\tLaser resist ablation Spray black paint onto copper clad laminate, place into CNC laser plotter. The laser raster-scans the PCB and ablates (vaporizes) the paint where no resist is wanted. (Note: laser copper ablation is rarely used and is considered experimental.[clarification needed])\n\tLaser etching The copper may be removed directly by a CNC laser.  Like PCB milling above this is used mainly for prototyping.\n\n\nThe method chosen depends on the  number of boards to be produced and the required resolution.\n\n\nLarge volume[edit]\n\n\tSilk screen printing – Used for PCBs with bigger features\n\tPhotoengraving – Used when finer features are required\n\n\nSmall volume[edit]\n\n\tPrint onto transparent film and use as photo mask along with photo-sensitized boards, then etch. (Alternatively, use a film photoplotter)\n\tLaser resist ablation\n\tPCB milling\n\tLaser etching\n\n\nHobbyist[edit]\n\n\tLaser-printed resist: Laser-print onto toner transfer paper, heat-transfer with an iron or modified laminator onto bare laminate, soak in water bath, touch up with a marker, then etch.\n\tVinyl film and resist, non-washable marker, some other methods. Labor-intensive, only suitable for single boards.\n\n\nSubtractive, additive and semi-additive processes[edit]\n\n  \nThe two processing methods used to produce a double-sided PWB with plated-through holes\n\n\n\nSubtractive methods remove copper from an entirely copper-coated board to leave only the desired copper pattern.  In additive methods the pattern is electroplated onto a bare substrate using a complex process. The advantage of the additive method is that less material is needed and less waste is produced. In the full additive process the bare laminate is covered with a photosensitive film which is imaged (exposed to light through a mask and then developed which removes the unexposed film).  The exposed areas are sensitized in a chemical bath, usually containing palladium and similar to that used for through hole plating which makes the exposed area capable of bonding metal ions.  The laminate is then plated with copper in the sensitized areas.  When the mask is stripped, the PCB is finished.\n\nSemi-additive is the most common process: The unpatterned board has a thin layer of copper already on it. A reverse mask is then applied. (Unlike a subtractive process mask, this mask exposes those parts of the substrate that will eventually become the traces.) Additional copper is then plated onto the board in the unmasked areas; copper may be plated to any desired weight. Tin-lead or other surface platings are then applied. The mask is stripped away and a brief etching step removes the now-exposed bare original copper laminate from the board, isolating the individual traces.  Some single-sided boards which have plated-through holes are made in this way.  General Electric made consumer radio sets in the late 1960s using additive boards.\n\nThe (semi-)additive process is commonly used for multi-layer boards as it facilitates the plating-through of the holes to produce conductive vias in the circuit board.\n\n\n\nPCB copper electroplating line in the process of pattern plating copper\n\n\n\nPCBs in process of having copper pattern plated (note the blue dry film resist)\n\n\n\n\n\nChemical etching[edit]\n\nChemical etching is usually done with ammonium persulfate or ferric chloride. For PTH (plated-through holes), additional steps of electroless deposition are done after the holes are drilled, then copper is electroplated to build up the thickness, the boards are screened, and plated with tin/lead. The tin/lead becomes the resist leaving the bare copper to be etched away.[30]\n\nThe simplest method, used for small-scale production and often by hobbyists, is immersion etching, in which the board is submerged in etching solution such as ferric chloride. Compared with methods used for mass production, the etching time is long.  Heat and agitation can be applied to the bath to speed the etching rate. In bubble etching, air is passed through the etchant bath to agitate the solution and speed up etching. Splash etching uses a motor-driven paddle to splash boards with etchant; the process has become commercially obsolete since it is not as fast as spray etching. In spray etching, the etchant solution is distributed over the boards by nozzles, and recirculated by pumps. Adjustment of the nozzle pattern, flow rate, temperature, and etchant composition gives predictable control of etching rates and high production rates.[31]\n\nAs more copper is consumed from the boards, the etchant becomes saturated and less effective; different etchants have different capacities for copper, with some as high as 150 grams of copper per litre of solution. In commercial use, etchants can be regenerated to restore their activity, and the dissolved copper recovered and sold.  Small-scale etching requires attention to disposal of used etchant, which is corrosive and toxic due to its metal content.[32]\n\nThe etchant removes copper on all surfaces not protected by the resist.  \"Undercut\" occurs when etchant attacks the thin edge of copper under the resist; this can reduce conductor widths and cause open-circuits. Careful control of etch time is required to prevent undercut.  Where metallic plating is used as a resist, it can \"overhang\" which can cause short-circuits between adjacent traces when closely spaced. Overhang can be removed by wire-brushing the board after etching.[31]\n\n\nLamination[edit]\n\n  \nCut through a SDRAM-module, a multi-layer PCB. Note the via, visible as a bright copper-colored band running between the top and bottom layers of the board.\n\n\n\nMulti-layer printed circuit boards have trace layers inside the board. This is achieved by laminating a stack of materials in a press by applying pressure and heat for a period of time. This results in an inseparable one piece product. For example, a four-layer PCB can be fabricated by starting from a two-sided copper-clad laminate, etch the circuitry on both sides, then laminate to the top and bottom pre-preg and copper foil. It is then drilled, plated, and etched again to get traces on top and bottom layers.[33]\n\nThe inner layers are given a complete machine inspection before lamination because mistakes cannot be corrected afterwards. The automatic optical inspection system compares an image of the board with the digital image generated from the original design data. Automated Optical Shaping (AOS) machines can then add missing copper or remove excess copper using a laser, reducing the number of PCBs that have to be discarded. [34] PCB tracks can have a width of just 10 micrometers.\n\n\nDrilling[edit]\n\n  \nEyelets (hollow)\n\n\n\nHoles through a PCB are typically drilled with drill bits made of solid coated tungsten carbide. Coated tungsten carbide is used because board materials are abrasive.  High-speed-steel bits would dull quickly, tearing the copper and ruining the board. Drilling is done by computer-controlled drilling machines, using a drill file or Excellon file that describes the location and size of each drilled hole.\n\nHoles may be made conductive, by electroplating or inserting hollow metal eyelets, to connect board layers. Some conductive holes are intended for the insertion of through-hole-component leads. Others used to connect board layers, are called vias.\n\nWhen vias with a diameter smaller than 76.2 micrometers[35][36] are required, drilling with mechanical bits is impossible because of high rates of wear and breakage. In this case, the vias may be laser drilled—evaporated by lasers. Laser-drilled vias typically have an inferior surface finish inside the hole. These holes are called micro vias and can have diameters as small as 10 micrometers.[37][38]  It is also possible with controlled-depth drilling, laser drilling, or by pre-drilling the individual sheets of the PCB before lamination, to produce holes that connect only some of the copper layers, rather than passing through the entire board. These holes are called blind vias when they connect an internal copper layer to an outer layer, or buried vias when they connect two or more internal copper layers and no outer layers. Laser drilling machines can drill thousands of holes per second and can use either UV or CO2 lasers. [39] [40][41][42]\n\nThe hole walls for boards with two or more layers can be made conductive and then electroplated with copper to form plated-through holes. These holes electrically connect the conducting layers of the PCB. For multi-layer boards, those with three layers or more, drilling typically produces a smear of the high temperature decomposition products of bonding agent in the laminate system. Before the holes can be plated through, this smear must be removed by a chemical de-smear process, or by plasma-etch. The de-smear process ensures that a good connection is made to the copper layers when the hole is plated through. On high reliability boards a process called etch-back is performed chemically with a potassium permanganate based etchant or plasma. The etch-back removes resin and the glass fibers so that the copper layers extend into the hole and as the hole is plated become integral with the deposited copper.\n\n\nPlating and coating[edit]\n\nProper plating or surface finish selection can be critical to process yield, the amount of rework, field failure rate, and reliability.[43]\n\nPCBs are plated with solder, tin, or gold over nickel and a resist for etching away the unneeded underlying copper.[44][45]\n\nAfter PCBs are etched and then rinsed with water, the solder mask is applied, and then any exposed copper is coated with solder, nickel/gold, or some other anti-corrosion coating.[46]\n\nMatte solder is usually fused to provide a better bonding surface for bare copper. Treatments, such as benzimidazolethiol, prevent surface oxidation of bare copper. The places to which components will be mounted are typically plated, because untreated bare copper oxidizes quickly, and therefore is not readily solderable. Traditionally, any exposed copper was coated with solder by hot air solder levelling (HASL). The HASL finish prevents oxidation from the underlying copper, thereby guaranteeing a solderable surface. This solder was a tin-lead alloy, however new solder compounds are now used to achieve compliance with the RoHS directive in the EU, which restricts the use of lead. One of these lead-free compounds is SN100CL, made up of 99.3% tin, 0.7% copper, 0.05% nickel, and a nominal of 60 ppm germanium.[citation needed]\n\nIt is important to use solder compatible with both the PCB and the parts used. An example is ball grid array (BGA) using tin-lead solder balls for connections losing their balls on bare copper traces or using lead-free solder paste.\n\nOther platings used are OSP (organic surface protectant), immersion silver (IAg), immersion tin, electroless nickel with immersion gold coating (ENIG), electroless nickel electroless palladium immersion gold (ENEPIG) and direct gold plating (over nickel). Edge connectors, placed along one edge of some boards, are often nickel-plated then gold-plated. Another coating consideration is rapid diffusion of coating metal into tin solder. Tin forms intermetallics such as Cu6Sn5 and Ag3Cu that dissolve into the Tin liquidus or solidus (at 50 °C), stripping surface coating or leaving voids.\n\nElectrochemical migration (ECM) is the growth of conductive metal filaments on or in a printed circuit board (PCB) under the influence of a DC voltage bias.[47][48] Silver, zinc, and aluminum are known to grow whiskers under the influence of an electric field. Silver also grows conducting surface paths in the presence of halide and other ions, making it a poor choice for electronics use. Tin will grow \"whiskers\" due to tension in the plated surface. Tin-lead or solder plating also grows whiskers, only reduced by reducing the percentage of tin. Reflow to melt solder or tin plate to relieve surface stress lowers whisker incidence. Another coating issue is tin pest, the transformation of tin to a powdery  allotrope at low temperature.[49]\n\n\nSolder resist application[edit]\n\nAreas that should not be soldered may be covered with solder resist (solder mask). One of the most common solder resists used today is called \"LPI\" (liquid photoimageable solder mask).[50]  A photo-sensitive coating is applied to the surface of the PWB, then exposed to light through the solder mask image film, and finally developed where the unexposed areas are washed away.  Dry film solder mask is similar to the dry film used to image the PWB for plating or etching.  After being laminated to the PWB surface it is imaged and developed as LPI.  Once but no longer commonly used, because of its low accuracy and resolution, is to screen print epoxy ink. In addition to repelling solder, solder resist also provides protection from the environment to the copper that would otherwise be exposed.\n\n\nSilkscreen printing[edit]\n\nA legend is often printed on one or both sides of the PCB. It contains the component designators, switch settings, test points and other indications helpful in assembling, testing, servicing, and sometimes using the circuit board.\n\nThere are three methods to print the legend.\n\n\n\tSilk screen printing epoxy ink was the established method. It was so common that legend is often misnamed silk or silkscreen.\n\tLiquid photo imaging is a more accurate method than screen printing.\n\tInk jet printing is new but increasingly used. Ink jet can print variable data, unique to each PWB unit, such as text or a bar code with a serial number.\n\n\nBare-board test[edit]\n\nBoards with no components installed are usually bare-board tested for \"shorts\" and \"opens\". A short is a connection between two points that should not be connected. An open is a missing connection between points that should be connected. For high-volume production, a fixture or a rigid needle adapter makes contact with copper lands on the board. The fixture or adapter is a significant fixed cost and this method is only economical for high-volume or high-value production. For small or medium volume production flying probe testers are used where test probes are moved over the board by an XY drive to make contact with the copper lands. There is no need for a fixture and hence the fixed costs are much lower. The CAM system instructs the electrical tester to apply a voltage to each contact point as required and to check that this voltage appears on the appropriate contact points and only on these.\n\n\nAssembly[edit]\n\n  \nPCB with test connection pads\n\n\n\nIn assembly the bare board is populated (or \"stuffed\") with electronic components to form a functional printed circuit assembly (PCA), sometimes called a \"printed circuit board assembly\" (PCBA).[51][52] In through-hole technology, the component leads are inserted in holes surrounded by conductive pads; the holes keep the components in place. In surface-mount technology (SMT), the component is placed on the PCB so that the pins line up with the conductive pads or lands on the surfaces of the PCB; solder paste, which was previously applied to the pads, holds the components in place temporarily; if surface-mount components are applied to both sides of the board, the bottom-side components are glued to the board. In both through hole and surface mount, the components are then soldered; once cooled and solidified, the solder holds the components in place permanently and electrically connects them to the board.\n\nThere are a variety of soldering techniques used to attach components to a PCB. High volume production is usually done with a \"Pick and place machine\" or SMT placement machine and bulk wave soldering or reflow ovens, but skilled technicians are able to hand-solder very tiny parts (for instance 0201 packages which are 0.02 in. by 0.01 in.)[53] under a microscope, using tweezers and a fine-tip soldering iron, for small volume prototypes. Some SMT parts cannot be soldered by hand, such as BGA packages. All through-hole components can be hand soldered, making them favored for prototyping where size, weight, and the use of the exact components that would be used in high volume production are not concerns.\n\nOften, through-hole and surface-mount construction must be combined in a single assembly because some required components are available only in surface-mount packages, while others are available only in through-hole packages. Or, even if all components are available in through-hole packages, it might be desired to take advantage of the size, weight, and cost reductions obtainable by using some available surface-mount devices. Another reason to use both methods is that through-hole mounting can provide needed strength for components likely to endure physical stress (such as connectors that are frequently mated and demated or that connect to cables expected to impart substantial stress to the PCB-and-connector interface), while components that are expected to go untouched will take up less space using surface-mount techniques. For further comparison, see the SMT page.\n\nAfter the board has been populated it may be tested in a variety of ways:\n\n\n\tWhile the power is off, visual inspection, automated optical inspection. JEDEC guidelines for PCB component placement, soldering, and inspection are commonly used to maintain quality control in this stage of PCB manufacturing.\n\tWhile the power is off, analog signature analysis, power-off testing.\n\tWhile the power is on, in-circuit test, where physical measurements (for example, voltage) can be done.\n\tWhile the power is on, functional test, just checking if the PCB does what it had been designed to do.\n\n\nTo facilitate these tests, PCBs may be designed with extra pads to make temporary connections. Sometimes these pads must be isolated with resistors. The in-circuit test may also exercise boundary scan test features of some components. In-circuit test systems may also be used to program nonvolatile memory components on the board.\n\nIn boundary scan testing, test circuits integrated into various ICs on the board form temporary connections between the PCB traces to test that the ICs are mounted correctly. Boundary scan testing requires that all the ICs to be tested use a standard test configuration procedure, the most common one being the Joint Test Action Group (JTAG) standard. The JTAG test architecture provides a means to test interconnects between integrated circuits on a board without using physical test probes, by using circuitry in the ICs to employ the IC pins themselves as test probes. JTAG tool vendors provide various types of stimuli and sophisticated algorithms, not only to detect the failing nets, but also to isolate the faults to specific nets, devices, and pins.\n\nWhen boards fail the test, technicians may desolder and replace failed components, a task known as rework.\n\n\nProtection and packaging[edit]\n\nPCBs intended for extreme environments often have a conformal coating, which is applied by dipping or spraying after the components have been soldered. The coat prevents corrosion and leakage currents or shorting due to condensation. The earliest conformal coats were wax; modern conformal coats are usually dips of dilute solutions of silicone rubber, polyurethane, acrylic, or epoxy. Another technique for applying a conformal coating is for plastic to be sputtered onto the PCB in a vacuum chamber. The chief disadvantage of conformal coatings is that servicing of the board is rendered extremely difficult.[54]\n\nMany assembled PCBs are static sensitive, and therefore they must be placed in antistatic bags during transport. When handling these boards, the user must be grounded (earthed). Improper handling techniques might transmit an accumulated static charge through the board, damaging or destroying components. The damage might not immediately affect function but might lead to early failure later on, cause intermittent operating faults, or cause a narrowing of the range of environmental and electrical conditions under which the board functions properly. Even bare boards are sometimes static sensitive: traces have become so fine that it is possible to blow a trace (or change its characteristics) with a static discharge. This is especially true on non-traditional PCBs such as MCMs and microwave PCBs.\n\n\nCordwood construction[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Printed circuit board\" – news · newspapers · books · scholar · JSTOR  (December 2016) (Learn how and when to remove this template message)\n\n\n\n  \nA cordwood module\n\n\n\n  \nCordwood construction was used in proximity fuzes.\n\n\n\nCordwood construction can save significant space and was often used with wire-ended components in applications where space was at a premium (such as fuzes, missile guidance, and telemetry systems) and in high-speed computers, where short traces were important. In cordwood construction, axial-leaded components were mounted between two parallel planes. The components were either soldered together with jumper wire, or they were connected to other components by thin nickel ribbon welded at right angles onto the component leads.[55] To avoid shorting together different interconnection layers, thin insulating cards were placed between them. Perforations or holes in the cards allowed component leads to project through to the next interconnection layer. One disadvantage of this system was that special nickel-leaded components had to be used to allow reliable interconnecting welds to be made. Differential thermal expansion of the component could put pressure on the leads of the components and the PCB traces and cause mechanical damage (as was seen in several modules on the Apollo program). Additionally, components located in the interior are difficult to replace. Some versions of cordwood construction used soldered single-sided PCBs as the interconnection method (as pictured), allowing the use of normal-leaded components at the cost of being difficult to remove the boards or replace any component that is not at the edge.\n\nBefore the advent of integrated circuits, this method allowed the highest possible component packing density; because of this, it was used by a number of computer vendors including Control Data Corporation. The cordwood method of construction was used only rarely once PCBs became widespread, mainly in aerospace or other extremely high density electronics.\n\n\nMultiwire boards[edit]\n\nMultiwire is a patented technique of interconnection which uses machine-routed insulated wires embedded in a non-conducting matrix (often plastic resin). It was used during the 1980s and 1990s. (Kollmorgen Technologies Corp, U.S. Patent 4,175,816 filed 1978) As of 2010, Multiwire was still available through Hitachi.\n\nSince it was quite easy to stack interconnections (wires) inside the embedding matrix, the approach allowed designers to forget completely about the routing of wires (usually a time-consuming operation of PCB design): Anywhere the designer needs a connection, the machine will draw a wire in a straight line from one location/pin to another. This led to very short design times (no complex algorithms to use even for high density designs) as well as reduced crosstalk (which is worse when wires run parallel to each other—which almost never happens in Multiwire), though the cost is too high to compete with cheaper PCB technologies when large quantities are needed.\n\nCorrections can be made to a Multiwire board layout more easily than to a PCB layout.[56]\n\nThere are other competitive discrete wiring technologies that have been developed.\n\n\nSee also[edit]\n\n\n\tElectronics portal\n\n\n\n\tBreadboard\n\tC.I.D.+\n\tDesign for manufacturability (PCB)\n\tElectronic packaging\n\tElectronic waste\n\tMicrophonics\n\tMulti-chip module\n\tOccam process – another process for the manufacturing of PCBs\n\tPoint-to-point construction\n\tPrinted electronics – creation of components by printing\n\tPrinted circuit board milling\n\tPrinted Electronic Circuit – similar name, different part\n\tStamped circuit board\n\tStripboard\n\tVeroboard\n\tWire wrap\n\n\nPCB materials\n\n\n\tConductive ink\n\tLaminate materials:\n\tBT-Epoxy\n\tComposite epoxy material, CEM-1,5\n\tCyanate Ester\n\tFR-2\n\tFR-4, the most common PCB material\n\tPolyimide\n\tPTFE, Polytetrafluoroethylene (Teflon)\n\n\n\n\nPCB layout software\n\n\n\tList of EDA companies\n\tComparison of EDA software\n\n\nReferences[edit]\n\n\n\t^ \"iconnect007 :: Article\". www.iconnect007.com. Retrieved 2016-04-12.\n\n\t^ Research, Energias Market. \"Global Printed Circuit Board (PCB) Market to Witness a CAGR of 3.1% during 2018-2024\". GlobeNewswire News Room. Retrieved 2018-08-26.\n\n\n\t^ \"Global Single Sided Printed Circuit Board Market - Growth, Future Prospects and Competitive Analysis and Forecast 2018 - 2023 - The Industry Herald\". The Industry Herald. 2018-08-21. Retrieved 2018-08-26.\n\n\n\t^ US 1256599 \n\n\t^ a b Charles A. Harper, Electronic materials and processes handbook, McGraw-Hill,2003 \nISBN 0-07-140214-4, pages 7.3 and 7.4\n\n\t^ Brunetti, Cledo (22 November 1948). New Advances in Printed Circuits. Washington DC: National Bureau of Standards.\n\n\n\t^ Engineers' Day, 1984 Award Recipients, College of Engineering, University of Wisconsin-Madison\n\n\t^ \"IEEE CLEDO BRUNETTI AWARD RECIPIENTS\" (PDF). IEEE. Retrieved 2018-08-04.\n\n\n\t^ US 2756485  assigned to US Army. July 31, 1956.\n\n\t^ \"History of Circuit Boards Through the 20th Century\". Falconer Electronics. 2017-08-18. Retrieved 2018-08-26.\n\n\n\t^ US patent 5434751, Herbert S. Cole, Jr., Theresa A. Sitnik-Nieters, Robert J. Wojnarowski, John H. Lupinski, \"Reworkable high density interconnect structure incorporating a release layer\", issued 18 July 1995 \n\n\t^ \"The Rise of High Density Interconnect PCBs - HDI PCBs\". www.creativehitech.com. Retrieved 2018-08-26.\n\n\n\t^ \"4 New Technologies Changing The PCB Market\". Manufacturing.net. 2017-10-26. Retrieved 2018-08-26.\n\n\n\t^ IPC-14.38\n\n\t^ Electronic Packaging:Solder Mounting Technologies in K.H. Buschow et al (ed), Encyclopedia of Materials:Science and Technology, Elsevier, 2001 \nISBN 0-08-043152-6,  pages 2708–2709\n\n\t^ 1.\t“You Are HereDEQ Pollutants and Toxicants Environmental Lead (Pb).” DEQ - How Does Lead Affect Our Environment?, Agency: Environmental Quality, www.michigan.gov/deq/0,4561,7-135-3307_29693_30031-90418--,00.html. \n\n\t^ 2.\t“RoHS Guide.” RoHS Compliance Guide: FAQ on RoHS Compliance, www.rohsguide.com/rohs-faq.htm.\n\n\t^ \"Design Standard for Rigid Printed Boards and Rigid Printed Board Assemblies\". IPC. September 1991. IPC-4101. Cite journal requires |journal= (help)\n\n\n\t^ Sood, B. and Pecht, M. 2011. Printed Circuit Board Laminates. Wiley Encyclopedia of Composites. 1–11.\n\n\t^ By Lee W. Ritchey, Speeding Edge (November 1999). \"A SURVEY AND TUTORIAL OF DIELECTRIC MATERIALS USED IN THE MANUFACTURE OF PRINTED CIRCUIT BOARDS\" (PDF). Circuitree Magazine.\n\n\n\t^ \"Applications | UBE Heat Resistant Polyimide Materials\". UBE, upilex.jp.\n\n\n\t^ \"Pyralux® Flexible Circuit Materials - DuPont - DuPont USA\". DuPont.\n\n\n\t^ Carter, Bruce (19 March 2009). Op Amps for Everyone. Newnes. ISBN 9780080949482 – via Google Books.\n\n\n\t^ \"A High Performance, Economical RF/Microwave Substrate\". Microwavejournal.\n\n\n\t^ \"RF-35 datasheet\" (PDF). Taconic – via Multi-CB.\n\n\n\t^ \"Printed Circuit Board Design Flow Methodology\".\n\n\n\t^ \"See appendix D of IPC-2251\" (PDF).\n\n\n\t^ Kraig Mitzner, Complete PCB Design Using OrCad Capture and Layout, pages 443–446, Newnes, 2011 \nISBN 0080549209.\n\n\t^ Itshak Taff, Hai Benron. \"Liquid Photoresists for Thermal Direct Imaging\". The Board Authority, October 1999. Missing or empty |url= (help)CS1 maint: uses authors parameter (link)\n\n\n\t^ Riley, Frank; Production, Electronic Packaging and (2013-06-29). The Electronics Assembly Handbook. Springer Science & Business Media. p. 285. ISBN 9783662131619.\n\n\n\t^ a b R. S. Khandpur,Printed circuit boards: design, fabrication, assembly and testing, Tata-McGraw Hill, 2005 \nISBN 0-07-058814-7, pages 373–378\n\n\t^ Bosshart (1983-01-01). Printed Circuit Boards: Design and Technology. Tata McGraw-Hill Education. p. 298. ISBN 9780074515495.\n\n\n\t^ \"PCB Layout\". Retrieved 2018-05-17.\n\n\n\t^ \"Innovative AOS Solutions for PCB | Orbotech\". www.orbotech.com.\n\n\n\t^ \"The Advantages of Laser Drilling\". SPI Lasers. February 13, 2017.\n\n\n\t^ \"Non-Traditional Methods For Making Small Holes\". www.mmsonline.com.\n\n\n\t^ \"Laser drilling high-density printed circuit boards\". Industrial Laser Solutions. September 1, 2012.\n\n\n\t^ \"Schmoll Lasertechnologie »PCB\". www.schmoll-laser.de.\n\n\n\t^ \"Emerald™ 160 Series for Via Formation | Orbotech\". www.orbotech.com.\n\n\n\t^ \"Laser drilling machines GTW5 series (English) Videos | MITSUBISHI ELECTRIC FA\". www.mitsubishielectric.com.\n\n\n\t^ \"Introduction to Laser Micro Machining – PCB Drilling – NSI Laser\".\n\n\n\t^ \"GTW4-UVF20 series Laser drilling machine Laser processing machines MELLASER | MITSUBISHI ELECTRIC FA\". www.mitsubishielectric.com.\n\n\n\t^ \"Considerations for Selecting a PCB Surface Finish\" (PDF). 8 October 2013.\n\n\n\t^ Appendix F Sample Fabrication Sequence for a Standard Printed Circuit Board, Linkages: Manufacturing Trends in Electronics Interconnection Technology, National Academy of Sciences\n\n\t^ Production Methods and Materials 3.1 General Printed Wiring Board Project Report – Table of Contents, Design for the Environment (DfE), US EPA\n\n\t^ George Milad and Don Gudeczauskas. \"Solder Joint Reliability of Gold Surface Finishes (ENIG, ENEPIG and DIG) for PWB Assembled with Lead Free SAC Alloy.\"\n\n\t^ IPC Publication IPC-TR-476A, \"Electrochemical Migration: Electrically Induced Failures in Printed Wiring Assemblies,\" Northbrook, IL, May 1997.\n\n\t^ S.Zhan, M. H. Azarian and M. Pecht, \"Reliability Issues of No-Clean Flux Technology with Lead-free Solder Alloy for High Density Printed Circuit Boards\", 38th International Symposium on Microelectronics, pp. 367–375, Philadelphia, PA, September 25–29, 2005.\n\n\t^ Clyde F. Coombs Printed Circuits Handbook McGraw–Hill Professional, 2007 \nISBN 0-07-146734-3, pages 45–19\n\n\t^ \"liquid photoimageable solder masks\" (PDF). Coates Circuit Products. Retrieved 2 Sep 2012.\n\n\n\t^ Ayob, M.; Kendall, G. (2008). \"A Survey of Surface Mount Device Placement Machine Optidmisation: Machine Classification\". European Journal of Operational Research. 186 (3): 893–914. CiteSeerX 10.1.1.486.8305. doi:10.1016/j.ejor.2007.03.042.\n\n\n\t^ Ayob, M.; Kendall, G. (2005). \"A Triple Objective Function with a Chebychev Dynamic Pick-and-place Point Specification Approach to Optimise the Surface Mount Placement Machine\" (PDF). European Journal of Operational Research. 164 (3): 609–626. doi:10.1016/j.ejor.2003.09.034.\n\n\n\t^ Borkes, Tom. \"SMTA TechScan Compendium: 0201 Design, Assembly and Process\" (PDF). Surface Mount Technology Association. Retrieved 2010-01-11.\n\n\n\t^ Shibu. Intro To Embedded Systems 1E. Tata McGraw-Hill. p. 293. ISBN 978-0-07-014589-4.\n\n\n\t^ Wagner, G. Donald (1999). \"History of Electronic Packaging at APL: From the VT Fuze to the NEAR Spacecraft\" (PDF). Johns Hopkins APL Technical Digest. 20 (1). Retrieved 2016-12-19.\n\n\n\t^ David E. Weisberg.\n\"Chapter 14: Intergraph\".\n2008.\np. 14-8.\n\n\n\n\nExternal links[edit]\n\n\t\tThe Wikibook Practical Electronics has a page on the topic of: PCB Layout\n\n\n\t\tThe Wikibook Practical Electronics has a page on the topic of: hole sizes for through-hole parts\n\n\n\t\tWikimedia Commons has media related to Printed circuit boards.\n\n\n\n\n\n\tPCB Fabrication Data - A Guide\n\tThe Gerber Format Specification\n\n\n\tAuthority control \t\n\tGND: 4019627-6\n\tLCCN: sh85106738\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Printed_circuit_board&oldid=919221329\"\n\n\t\t\n\t\tCategories: \tElectrical engineering\n\tElectronics substrates\n\tElectronics manufacturing\n\tElectronic engineering\n\tPrinted circuit board manufacturing\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tPages using web citations with no URL\n\tCS1 maint: uses authors parameter\n\tArticles with short description\n\tArticles needing additional references from October 2016\n\tAll articles needing additional references\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from December 2017\n\tArticles with unsourced statements from May 2017\n\tWikipedia articles needing clarification from April 2012\n\tArticles with unsourced statements from October 2016\n\tArticles needing additional references from December 2016\n\tCommons category link is on Wikidata\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tБългарски\n\tBosanski\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tKiswahili\n\tКыргызча\n\tLatina\n\tLietuvių\n\tMagyar\n\tBahasa Melayu\n\tМонгол\n\tNederlands\n\tनेपाली\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tОлык марий\n\tOʻzbekcha/ўзбекча\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tSimple English\n\tSlovenčina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t吴语\n\tייִדיש\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 2 October 2019, at 13:55 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "10", "dc:title": "Printed circuit board - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/6/65/PCB_Spectrum.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-circuit_board", "title": "Printed circuit board - Wikipedia"}}