{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCombustion - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tCombustion\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\"Burning\" redirects here. For the type of injury, see Burn. For combustion without external ignition, see spontaneous combustion. For the vehicle engine, see internal combustion engine. For other uses, see Burning (disambiguation), Combustion (disambiguation), and Firing (disambiguation).\n\n  \nThe flames caused as a result of a fuel undergoing combustion (burning)\n\n\n\n  \nAir pollution abatement equipment provides combustion control for industrial processes.\n\n\n\nCombustion, or burning,[1] is a high-temperature exothermic redox chemical reaction between a fuel (the reductant) and an oxidant, usually atmospheric oxygen, that produces oxidized, often gaseous products, in a mixture termed as smoke. Combustion in a fire produces a flame, and the heat produced can make combustion self-sustaining. Combustion is often a complicated sequence of elementary radical reactions. Solid fuels, such as wood and coal, first undergo endothermic pyrolysis to produce gaseous fuels whose combustion then supplies the heat required to produce more of them. Combustion is often hot enough that incandescent light in the form of either glowing or a flame is produced. A simple example can be seen in the combustion of hydrogen and oxygen into water vapor, a reaction commonly used to fuel rocket engines. This reaction releases 242 kJ/mol of heat and reduces the enthalpy accordingly (at constant temperature and pressure):\n\n\n\t2H\n2(g) + O\n2(g) → 2H\n2O(g)\n\n\nCombustion of an organic fuel in air is always exothermic because the double bond in O2 is much weaker than other double bonds or pairs of single bonds, and therefore the formation of the stronger bonds in the combustion products CO\n2 and H\n2O results in the release of energy.[2] The bond energies in the fuel play only a minor role, since they are similar to those in the combustion products; e.g., the sum of the bond energies of CH4 is nearly the same as that of CO\n2. The heat of combustion is approximately -418 kJ per mole of O2 used up in the combustion reaction, and can be estimated from the elemental composition of the fuel.[2]\n\nUncatalyzed combustion in air requires fairly high temperatures. Complete combustion is stoichiometric with respect to the fuel, where there is no remaining fuel, and ideally, no remaining oxidant. Thermodynamically, the chemical equilibrium of combustion in air is overwhelmingly on the side of the products. However, complete combustion is almost impossible to achieve, since the chemical equilibrium is not necessarily reached, or may contain unburnt products such as carbon monoxide, hydrogen and even carbon (soot or ash). Thus, the produced smoke is usually toxic and contains unburned or partially oxidized products. Any combustion at high temperatures in atmospheric air, which is 78 percent nitrogen, will also create small amounts of several nitrogen oxides, commonly referred to as NO\n x , since the combustion of nitrogen is thermodynamically favored at high, but not low temperatures. Since combustion is rarely clean, flue gas cleaning or catalytic converters may be required by law.\n\nFires occur naturally, ignited by lightning strikes or by volcanic products. Combustion (fire) was the first controlled chemical reaction discovered by humans, in the form of campfires and bonfires, and continues to be the main method to produce energy for humanity. Usually, the fuel is carbon, hydrocarbons or more complicated mixtures such as wood that contains partially oxidized hydrocarbons. The thermal energy produced from combustion of either fossil fuels such as coal or oil, or from renewable fuels such as firewood, is harvested for diverse uses such as cooking, production of electricity or industrial or domestic heating. Combustion is also currently the only reaction used to power rockets. Combustion is also used to destroy (incinerate) waste, both nonhazardous and hazardous.\n\nOxidants for combustion have high oxidation potential and include atmospheric or pure oxygen, chlorine, fluorine, chlorine trifluoride, nitrous oxide and nitric acid. For instance, hydrogen burns in chlorine to form hydrogen chloride with the liberation of heat and light characteristic of combustion. Although usually not catalyzed, combustion can be catalyzed by platinum or vanadium, as in the contact process.\n\n\nContents\n\n\n\t1 Types\n\t1.1 Complete and incomplete\n\t1.1.1 Complete\n\t1.1.2 Incomplete\n\t1.1.2.1 Incomplete combustion produced carbon monoxide\n\t1.1.2.2 Problems associated with incomplete combustion\n\n\n\n\n\n\n\t1.2 Smouldering\n\t1.3 Rapid\n\t1.4 Spontaneous\n\t1.5 Turbulent\n\t1.6 Micro-gravity\n\t1.7 Micro-combustion\n\n\n\n\t2 Chemical equations\n\t2.1 Stoichiometric combustion of a hydrocarbon in oxygen\n\t2.2 Stoichiometric combustion of a hydrocarbon in air\n\t2.3 Trace combustion products\n\t2.4 Incomplete combustion of a hydrocarbon in oxygen\n\n\n\n\t3 Fuels\n\t3.1 Liquid fuels\n\t3.2 Gaseous fuels\n\t3.3 Solid fuels\n\n\n\n\t4 Combustion management\n\t5 Reaction mechanism\n\t5.1 Kinetic modelling\n\n\n\n\t6 Temperature\n\t7 Instabilities\n\t8 See also\n\t9 References\n\t10 Further reading\n\n\n\n\n\nTypes[edit]\n\nComplete and incomplete[edit]\n\nSee also: pyrolysis\n\nComplete[edit]\n\n  \nThe combustion of methane, a hydrocarbon.\n\n\n\nIn complete combustion, the reactant burns in oxygen, and produces a limited number of products. When a hydrocarbon burns in oxygen, the reaction will primarily yield carbon dioxide and water.  When elements are burned, the products are primarily the most common oxides. Carbon will yield carbon dioxide, sulfur will yield sulfur dioxide, and iron will yield iron(III) oxide. Nitrogen is not considered to be a combustible substance when oxygen is the oxidant, but small amounts of various nitrogen oxides (commonly designated NO\nx species) form when the air is the oxidant.\n\nCombustion is not necessarily favorable to the maximum degree of oxidation, and it can be temperature-dependent. For example, sulfur trioxide is not produced quantitatively by the combustion of sulfur. NOx species appear in significant amounts above about 2,800 °F (1,540 °C), and more is produced at higher temperatures. The amount of NOx is also a function of oxygen excess.[3]\n\nIn most industrial applications and in fires, air is the source of oxygen (O\n2).  In the air, each mole of oxygen is mixed with approximately 3.71 mol of nitrogen.  Nitrogen does not take part in combustion, but at high temperatures some nitrogen will be converted to NO\nx (mostly NO, with much smaller amounts of NO\n2). On the other hand, when there is insufficient oxygen to completely combust the fuel, some fuel carbon is converted to carbon monoxide and some of the hydrogen remains unreacted. A more complete set of equations for the combustion of a hydrocarbon in the air, therefore, requires an additional calculation for the distribution of oxygen between the carbon and hydrogen in the fuel.\n\nThe amount of air required for complete combustion to take place is known as theoretical air. However, in practice, the air used is 2-3x that of theoretical air.\n\n\nIncomplete[edit]\n\nSee also: Charring\n\nIncomplete combustion will occur when there is not enough oxygen to allow the fuel to react completely to produce carbon dioxide and water. It also happens when the combustion is quenched by a heat sink, such as a solid surface or flame trap. As is the case with complete combustion, water is produced by incomplete combustion; however, carbon, carbon monoxide, and/or hydroxide are produced instead of carbon dioxide.\n\nFor most fuels, such as diesel oil, coal or wood, pyrolysis occurs before combustion. In incomplete combustion, products of pyrolysis remain unburnt and contaminate the smoke with noxious particulate matter and gases. Partially oxidized compounds are also a concern; partial oxidation of ethanol can produce harmful acetaldehyde, and carbon can produce toxic carbon monoxide.\n\nThe quality of combustion can be improved by the designs of combustion devices, such as burners and internal combustion engines. Further improvements are achievable by catalytic after-burning devices (such as catalytic converters) or by the simple partial return of the exhaust gases into the combustion process. Such devices are required by environmental legislation for cars in most countries and may be necessary to enable large combustion devices, such as thermal power stations, to reach legal emission standards.\n\nThe degree of combustion can be measured and analyzed with test equipment. HVAC contractors, firemen and engineers use combustion analyzers to test the efficiency of a burner during the combustion process. In addition, the efficiency of an internal combustion engine can be measured in this way, and some U.S. states and local municipalities use combustion analysis to define and rate the efficiency of vehicles on the road today.\n\n\nIncomplete combustion produced carbon monoxide[edit]\n\nCarbon monoxide is one of the products from incomplete combustion.[4] Carbon is released in the normal incomplete combustion reaction, forming soot and dust. Since carbon monoxide is considered as a poisonous gas, complete combustion is preferable, as carbon monoxide may also lead to respiratory troubles when breathed since it takes the place of oxygen and combines with hemoglobin.[5]\n\n\nProblems associated with incomplete combustion[edit]\n\n\tEnvironmental problems:[6]\n\n\nThese oxides combine with water and oxygen in the atmosphere, creating nitric acid and sulfuric acids, which return to Earth's surface as acid deposition, or \"acid rain.\" Acid deposition harms aquatic organisms and kills trees. Due to its formation of certain nutrients which are less available to plants such as calcium and phosphorus, it reduces the productivity of ecosystem and farms. An additional problem associated with nitrogen oxides is that they, along with hydrocarbon pollutants, contribute to the formation of tropospheric ozone, a major component of smog.\n\n\n\tHuman health problems:[6]\n\n\nBreathing carbon monoxide causes headache, dizziness, vomiting, and nausea. If carbon monoxide levels are high enough, humans become unconscious or die. Exposure to moderate and high levels of carbon monoxide over long periods of time are positively correlated with risk of heart disease. People who survive severe CO poisoning may suffer long-term health problems.[7] Carbon monoxide from air is absorbed in the lungs which then binds with hemoglobin in human's red blood cells. This would reduce the capacity of red blood cells to carry oxygen throughout the body.\n\n\nSmouldering[edit]\n\nSmouldering is the slow, low-temperature, flameless form of combustion, sustained by the heat evolved when oxygen directly attacks the surface of a condensed-phase fuel. It is a typically incomplete combustion reaction. Solid materials that can sustain a smouldering reaction include coal, cellulose, wood, cotton, tobacco, peat, duff, humus, synthetic foams, charring polymers (including polyurethane foam) and dust. Common examples of smoldering phenomena are the initiation of residential fires on upholstered furniture by weak heat sources (e.g., a cigarette, a short-circuited wire) and the persistent combustion of biomass behind the flaming fronts of wildfires.\n\n\nRapid[edit]\n\n\t\n\tThis section's factual accuracy is disputed. Relevant discussion may be found on Talk:Combustion. Please help to ensure that disputed statements are reliably sourced.  (July 2016) (Learn how and when to remove this template message)\n\n\n\nPlay media\n  \nAn experiment that demonstrates the large amount of energy released on combustion of ethanol. A mixture of alcohol (in this case, ethanol) vapour and air in a large plastic bottle with a small neck is ignited, resulting in a large blue flame and a 'whoosh' sound.\n\n\n\nRapid combustion is a form of combustion, otherwise known as a fire, in which large amounts of heat and light energy are released, which often results in a flame. This is used in a form of machinery such as internal combustion engines and in thermobaric weapons. Such a combustion is frequently called an explosion, though for an internal combustion engine this is inaccurate.[disputed  – discuss] An internal combustion engine nominally operates on a controlled rapid burn. When the fuel-air mixture in an internal combustion engine explodes, that is known as detonation.[disputed  – discuss]\n\n\nSpontaneous[edit]\n\nSpontaneous combustion is a type of combustion which occurs by self-heating (increase in temperature due to exothermic internal reactions), followed by thermal runaway (self-heating which rapidly accelerates to high temperatures) and finally, ignition.\nFor example, phosphorus self-ignites at room temperature without the application of heat.  Organic materials undergoing bacterial composting can generate enough heat to reach the point of combustion.[8]\n\n\nTurbulent[edit]\n\nCombustion resulting in a turbulent flame is the most used for industrial application (e.g. gas turbines, gasoline engines, etc.) because the turbulence helps the mixing process between the fuel and oxidizer.\n\n\nMicro-gravity[edit]\n\n  \nColourized gray-scale composite image of the individual frames from a video of a backlit fuel droplet burning in microgravity.\n\n\n\nThe term 'micro' gravity refers to a gravitational state that is 'low' (i.e., 'micro' in the sense of 'small' and not necessarily a millionth of Earth's normal gravity) such that the influence of buoyancy on physical processes may be considered small relative to other flow processes that would be present at normal gravity.  In such an environment, the thermal and flow transport dynamics can behave quite differently than in normal gravity conditions (e.g., a candle's flame takes the shape of a sphere.[9]). Microgravity combustion research contributes to the understanding of a wide variety of aspects that are relevant to both the environment of a spacecraft (e.g., fire dynamics relevant to crew safety on the International Space Station) and terrestrial (Earth-based) conditions (e.g., droplet combustion dynamics to assist developing new fuel blends for improved combustion, materials fabrication processes, thermal management of electronic systems, multiphase flow boiling dynamics, and many others).\n\n\nMicro-combustion[edit]\n\nCombustion processes which happen in very small volumes are considered micro-combustion. The high surface-to-volume ratio increases specific heat loss. Quenching distance plays a vital role in stabilizing the flame in such combustion chambers.\n\n\nChemical equations[edit]\n\nStoichiometric combustion of a hydrocarbon in oxygen[edit]\n\nGenerally, the chemical equation for stoichiometric combustion of a hydrocarbon in oxygen is:\n\n\n\t\n  \n    \n      \n        \n          \n            C\n            \n              \n                x\n              \n            \n            \n              \n            \n          \n          \n            H\n            \n              \n                y\n              \n            \n            \n              \n            \n          \n          \n\n          \n          +\n          \n            \n              z\n            \n          \n          \n            O\n            \n              2\n            \n            \n              \n            \n          \n          ⟶\n          \n            \n              x\n            \n          \n          \n            CO\n            \n              2\n            \n            \n              \n            \n          \n          \n\n          \n          +\n          \n            \n              \n                y\n              \n              \n                2\n                \n              \n            \n          \n          \n            H\n            \n              2\n            \n            \n              \n            \n          \n          O\n        \n      \n    \n    {\\displaystyle {\\ce {C_{\\mathit {x}}H_{\\mathit {y}}{}+{\\mathit {z}}O2->{\\mathit {x}}CO2{}+{\\frac {\\mathit {y}}{2}}H2O}}}\n  \n\n\n\nwhere \n  \n    \n      \n        z\n        =\n        x\n        +\n        \n          \n            y\n            4\n          \n        \n      \n    \n    {\\displaystyle z=x+{\\frac {y}{4}}}\n  \n.\n\nFor example, the stoichiometric burning of propane in oxygen is:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  C\n                  \n                    3\n                  \n                  \n                    \n                  \n                \n                \n                  H\n                  \n                    8\n                  \n                  \n                    \n                  \n                \n              \n              \n                propane\n                \n                  (\n                  fuel\n                  )\n                \n              \n            \n          \n          +\n          \n            \n              \n                5\n                \n                \n                  O\n                  \n                    2\n                  \n                  \n                    \n                  \n                \n              \n              oxygen\n            \n          \n          ⟶\n          \n            \n              \n                3\n                \n                \n                  CO\n                  \n                    2\n                  \n                  \n                    \n                  \n                \n              \n              \n                carbon\n                 \n                dioxide\n              \n            \n          \n          +\n          \n            \n              \n                4\n                \n                \n                  H\n                  \n                    2\n                  \n                  \n                    \n                  \n                \n                O\n              \n              water\n            \n          \n        \n      \n    \n    {\\displaystyle {\\ce {{\\underset {propane \\atop (fuel)}{C3H8}}+{\\underset {oxygen}{5O2}}->{\\underset {carbon\\ dioxide}{3CO2}}+{\\underset {water}{4H2O}}}}}\n  \n\n\n\nStoichiometric combustion of a hydrocarbon in air[edit]\n\nIf the stoichiometric combustion takes place using air as the oxygen source, the nitrogen present in the air (Atmosphere of Earth) can be added to the equation (although it does not react) to show the stoichiometric composition of the fuel in air and the composition of the resultant flue gas. Note that treating all non-oxygen components in air as nitrogen gives a 'nitrogen' to oxygen ratio of 3.77, i.e. (100% - O2%) / O2% where O2% is 20.95% vol:\n\n\n\t\n  \n    \n      \n        \n          \n            C\n          \n          \n            x\n          \n        \n        \n          \n            H\n          \n          \n            y\n          \n        \n        +\n        z\n        \n          \n            O\n            \n              2\n            \n            \n              \n            \n          \n        \n        +\n        3.77\n        z\n        \n          \n            N\n            \n              2\n            \n            \n              \n            \n          \n          ⟶\n        \n         \n        x\n        \n          \n            CO\n            \n              2\n            \n            \n              \n            \n          \n        \n        +\n        \n          \n            y\n            2\n          \n        \n        \n          \n            H\n            \n              2\n            \n            \n              \n            \n          \n          O\n        \n        +\n        3.77\n        z\n        \n          \n            N\n            \n              2\n            \n            \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\ce {C}}_{x}{\\ce {H}}_{y}+z{\\ce {O2}}+3.77z{\\ce {N2 ->}}\\ x{\\ce {CO2}}+{\\frac {y}{2}}{\\ce {H2O}}+3.77z{\\ce {N2}}}\n  \n\n\n\nwhere \n  \n    \n      \n        z\n        =\n        x\n        +\n        \n          \n            1\n            4\n          \n        \n        y\n      \n    \n    {\\displaystyle z=x+{\\frac {1}{4}}y}\n  \n.\n\nFor example, the stoichiometric combustion of propane (\n  \n    \n      \n        \n          \n            \n              C\n              \n                3\n              \n              \n                \n              \n            \n            \n              H\n              \n                8\n              \n              \n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {{\\ce {C3H8}}}}\n  \n) in air is:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  C\n                  \n                    3\n                  \n                  \n                    \n                  \n                \n                \n                  H\n                  \n                    8\n                  \n                  \n                    \n                  \n                \n              \n              fuel\n            \n          \n          +\n          \n            \n              \n                5\n                \n                \n                  O\n                  \n                    2\n                  \n                  \n                    \n                  \n                \n              \n              oxygen\n            \n          \n        \n        +\n        \n          \n            \n              18.87\n              \n                \n                  N\n                  \n                    2\n                  \n                  \n                    \n                  \n                \n              \n            \n            nitrogen\n          \n        \n        \n          ⟶\n          \n            \n              \n                3\n                \n                \n                  CO\n                  \n                    2\n                  \n                  \n                    \n                  \n                \n              \n              \n                carbon\n                 \n                dioxide\n              \n            \n          \n          +\n          \n            \n              \n                4\n                \n                \n                  H\n                  \n                    2\n                  \n                  \n                    \n                  \n                \n                O\n              \n              water\n            \n          \n        \n        +\n        \n          \n            \n              18.87\n              \n                \n                  N\n                  \n                    2\n                  \n                  \n                    \n                  \n                \n              \n            \n            nitrogen\n          \n        \n      \n    \n    {\\displaystyle {\\ce {{\\underset {fuel}{C3H8}}+{\\underset {oxygen}{5O2}}}}+{\\underset {\\ce {nitrogen}}{18.87{\\ce {N2}}}}{\\ce {->{\\underset {carbon\\ dioxide}{3CO2}}+{\\underset {water}{4H2O}}}}+{\\underset {\\ce {nitrogen}}{18.87{\\ce {N2}}}}}\n  \n\n\n\nThe stoichiometric composition of propane in air is 1 / (1 + 5 + 18.87) = 4.02% vol\n\n\nTrace combustion products[edit]\n\nVarious other substances begin to appear in significant amounts in combustion products when the flame temperature is above about 1600 K. When excess air is used, nitrogen may oxidize to NO and, to a much lesser extent, to NO\n2. CO forms by disproportionation of CO\n2, and H\n2 and OH form by disproportionation of H\n2O.\n\nFor example, when 1 mol of propane is burned with 28.6 mol of air (120% of the stoichiometric amount), the combustion products contain 3.3% O\n2. At 1400 K, the equilibrium combustion products contain 0.03% NO and 0.002% OH. At 1800 K, the combustion products contain 0.17% NO, 0.05% OH, 0.01% CO, and 0.004% H\n2.[10]\n\nDiesel engines are run with an excess of oxygen to combust small particles that tend to form with only a stoichiometric amount of oxygen, necessarily producing nitrogen oxide emissions. Both the United States and European Union enforce limits to vehicle nitrogen oxide emissions, which necessitate the use of special catalytic converters or treatment of the exhaust with urea (see Diesel exhaust fluid).\n\n\nIncomplete combustion of a hydrocarbon in oxygen[edit]\n\nThe incomplete (partial) combustion of a hydrocarbon with oxygen produces a gas mixture containing mainly CO\n2, CO, H\n2O, and H\n2. Such gas mixtures are commonly prepared for use as protective atmospheres for the heat-treatment of metals and for gas carburizing.[11] The general reaction equation for incomplete combustion of one mole of a hydrocarbon in oxygen is:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  C\n                  \n                    \n                      x\n                    \n                  \n                  \n                    \n                  \n                \n                \n                  H\n                  \n                    \n                      y\n                    \n                  \n                  \n                    \n                  \n                \n              \n              fuel\n            \n          \n          +\n          \n            \n              \n                \n                  \n                    z\n                  \n                \n                \n                  O\n                  \n                    2\n                  \n                  \n                    \n                  \n                \n              \n              oxygen\n            \n          \n          ⟶\n          \n            \n              \n                \n                  \n                    a\n                  \n                \n                \n                  CO\n                  \n                    2\n                  \n                  \n                    \n                  \n                \n              \n              \n                carbon\n                 \n                dioxide\n              \n            \n          \n          +\n          \n            \n              \n                \n                  \n                    b\n                  \n                \n                CO\n              \n              \n                carbon\n                 \n                monoxide\n              \n            \n          \n          +\n          \n            \n              \n                \n                  \n                    c\n                  \n                \n                \n                  H\n                  \n                    2\n                  \n                  \n                    \n                  \n                \n                O\n              \n              water\n            \n          \n          +\n          \n            \n              \n                \n                  \n                    d\n                  \n                \n                \n                  H\n                  \n                    2\n                  \n                  \n                    \n                  \n                \n              \n              hydrogen\n            \n          \n        \n      \n    \n    {\\displaystyle {\\ce {{\\underset {fuel}{C_{\\mathit {x}}H_{\\mathit {y}}}}+{\\underset {oxygen}{{\\mathit {z}}O2}}->{\\underset {carbon\\ dioxide}{{\\mathit {a}}CO2}}+{\\underset {carbon\\ monoxide}{{\\mathit {b}}CO}}+{\\underset {water}{{\\mathit {c}}H2O}}+{\\underset {hydrogen}{{\\mathit {d}}H2}}}}}\n  \n\n\n\nWhen z falls below roughly 50% of the stoichiometric value, CH\n4 can become an important combustion product; when z falls below roughly 35% of the stoichiometric value, elemental carbon may become stable.\n\nThe products of incomplete combustion can be calculated with the aid of a material balance, together with the assumption that the combustion products reach equilibrium.[12][13] For example, in the combustion of one mole of propane (C\n3H\n8) with four moles of O\n2, seven moles of combustion gas are formed, and z is 80% of the stoichiometric value. The three elemental balance equations are:\n\n\n\tCarbon: \n  \n    \n      \n        a\n        +\n        b\n        =\n        3\n      \n    \n    {\\displaystyle a+b=3}\n  \n\n\tHydrogen: \n  \n    \n      \n        2\n        c\n        +\n        2\n        d\n        =\n        8\n      \n    \n    {\\displaystyle 2c+2d=8}\n  \n\n\tOxygen: \n  \n    \n      \n        2\n        a\n        +\n        b\n        +\n        c\n        =\n        8\n      \n    \n    {\\displaystyle 2a+b+c=8}\n  \n\n\n\nThese three equations are insufficient in themselves to calculate the combustion gas composition.\nHowever, at the equilibrium position, the water-gas shift reaction gives another equation:\n\n\n\t\n  \n    \n      \n        \n          CO\n          +\n          \n            H\n            \n              2\n            \n            \n              \n            \n          \n          O\n          ⟶\n          \n            CO\n            \n              2\n            \n            \n              \n            \n          \n          +\n          \n            H\n            \n              2\n            \n            \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\ce {CO + H2O -> CO2 + H2}}}\n  \n; \n  \n    \n      \n        \n          K\n          \n            e\n            q\n          \n        \n        =\n        \n          \n            \n              a\n              ×\n              d\n            \n            \n              b\n              ×\n              c\n            \n          \n        \n      \n    \n    {\\displaystyle K_{eq}={\\frac {a\\times d}{b\\times c}}}\n  \n\n\n\nFor example, at 1200 K the value of Keq is 0.728.[14] Solving, the combustion gas consists of 42.4% H\n2O, 29.0% CO\n2, 14.7% H\n2, and 13.9% CO. Carbon becomes a stable phase at 1200 K and 1 atm pressure when z is less than 30% of the stoichiometric value, at which point the combustion products contain more than 98% H\n2 and CO and about 0.5% CH\n4.\n\n\nFuels[edit]\n\nSubstances or materials which undergo combustion are called fuels. The most common examples are natural gas, propane, kerosene, diesel, petrol, charcoal, coal, wood, etc.\n\n\nLiquid fuels[edit]\n\nCombustion of a liquid fuel in an oxidizing atmosphere actually happens in the gas phase. It is the vapor that burns, not the liquid. Therefore, a liquid will normally catch fire only above a certain temperature: its flash point. The flash point of a liquid fuel is the lowest temperature at which it can form an ignitable mix with air. It is the minimum temperature at which there is enough evaporated fuel in the air to start combustion.\n\n\nGaseous fuels[edit]\n\nCombustion of gaseous fuels may occur through one of four distinctive types of burning: diffusion flame, premixed flame, autoignitive reaction front, or as a detonation.[15] The type of burning that actually occurs depends on the degree to which the fuel and oxidizer are mixed prior to heating: for example, a diffusion flame is formed if the fuel and oxidizer are separated initially, whereas a premixed flame is formed otherwise. Similarly, the type of burning also depends on the pressure: a detonation, for example, is an autoignitive reaction front coupled to a strong shock wave giving it its characteristic high-pressure peak and high detonation velocity.[15]\n\n\nSolid fuels[edit]\n\n  \nA general scheme of polymer combustion\n\n\n\nThe act of combustion consists of three relatively distinct but overlapping phases:\n\n\n\tPreheating phase, when the unburned fuel is heated up to its flash point and then fire point. Flammable gases start being evolved in a process similar to dry distillation.\n\tDistillation phase or gaseous phase, when the mix of evolved flammable gases with oxygen is ignited. Energy is produced in the form of heat and light. Flames are often visible. Heat transfer from the combustion to the solid maintains the evolution of flammable vapours.\n\tCharcoal phase or solid phase, when the output of flammable gases from the material is too low for persistent presence of flame and the charred fuel does not burn rapidly and just glows and later only smoulders.\n\n\nCombustion management[edit]\n\nEfficient process heating requires recovery of the largest possible part of a fuel’s heat of combustion into the material being processed.[16][17] There are many avenues of loss in the operation of a heating process. Typically, the dominant loss is sensible heat leaving with the offgas (i.e., the flue gas). The temperature and quantity of offgas indicates its heat content (enthalpy), so keeping its quantity low minimizes heat loss.\n\nIn a perfect furnace, the combustion air flow would be matched to the fuel flow to give each fuel molecule the exact amount of oxygen needed to cause complete combustion. However, in the real world, combustion does not proceed in a perfect manner. Unburned fuel (usually CO and H\n2) discharged from the system represents a heating value loss (as well as a safety hazard). Since combustibles are undesirable in the offgas, while the presence of unreacted oxygen there presents minimal safety and environmental concerns, the first principle of combustion management is to provide more oxygen than is theoretically needed to ensure that all the fuel burns. For methane (CH\n4) combustion, for example, slightly more than two molecules of oxygen are required.\n\nThe second principle of combustion management, however, is to not use too much oxygen. The correct amount of oxygen requires three types of measurement: first, active control of air and fuel flow; second, offgas oxygen measurement; and third, measurement of offgas combustibles. For each heating process, there exists an optimum condition of minimal offgas heat loss with acceptable levels of combustibles concentration. Minimizing excess oxygen pays an additional benefit: for a given offgas temperature, the NOx level is lowest when excess oxygen is kept lowest.[3]\n\nAdherence to these two principles is furthered by making material and heat balances on the combustion process.[18][19][20][21] The material balance directly relates the air/fuel ratio to the percentage of O\n2 in the combustion gas. The heat balance relates the heat available for the charge to the overall net heat produced by fuel combustion.[22][23] Additional material and heat balances can be made to quantify the thermal advantage from preheating the combustion air,[24][25] or enriching it in oxygen.[26][27]\n\n\nReaction mechanism[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Combustion\" – news · newspapers · books · scholar · JSTOR  (January 2017) (Learn how and when to remove this template message)\n\n\n\nCombustion in oxygen is a chain reaction in which many distinct radical intermediates participate. The high energy required for initiation is explained by the unusual structure of the dioxygen molecule. The lowest-energy configuration of the dioxygen molecule is a stable, relatively unreactive diradical in a triplet spin state. Bonding can be described with three bonding electron pairs and two antibonding electrons, with spins aligned, such that the molecule has nonzero total angular momentum. Most fuels, on the other hand, are in a singlet state, with paired spins and zero total angular momentum. Interaction between the two is quantum mechanically a \"forbidden transition\", i.e. possible with a very low probability. To initiate combustion, energy is required to force dioxygen into a spin-paired state, or singlet oxygen. This intermediate is extremely reactive. The energy is supplied as heat, and the reaction then produces additional heat, which allows it to continue.\n\nCombustion of hydrocarbons is thought to be initiated by hydrogen atom abstraction (not proton abstraction) from the fuel to oxygen, to give a hydroperoxide radical (HOO). This reacts further to give hydroperoxides, which break up to give hydroxyl radicals. There are a great variety of these processes that produce fuel radicals and oxidizing radicals. Oxidizing species include singlet oxygen, hydroxyl, monatomic oxygen, and hydroperoxyl. Such intermediates are short-lived and cannot be isolated. However, non-radical intermediates are stable and are produced in incomplete combustion. An example is acetaldehyde produced in the combustion of ethanol. An intermediate in the combustion of carbon and hydrocarbons, carbon monoxide, is of special importance because it is a poisonous gas, but also economically useful for the production of syngas.\n\nSolid and heavy liquid fuels also undergo a great number of pyrolysis reactions that give more easily oxidized, gaseous fuels. These reactions are endothermic and require constant energy input from the ongoing combustion reactions. A lack of oxygen or other improperly designed conditions result in these noxious and carcinogenic pyrolysis products being emitted as thick, black smoke.\n\nThe rate of combustion is the amount of a material that undergoes combustion over a period of time. It can be expressed in grams per second (g/s) or kilograms per second (kg/s).\n\nDetailed descriptions of combustion processes, from the chemical kinetics perspective, requires the formulation of large and intricate webs of elementary reactions.[28] For instance, combustion of hydrocarbon fuels typically involve hundreds of chemical species reacting according to thousands of reactions.\n\nInclusion of such mechanisms within computational flow solvers still represents a pretty challenging task mainly in two aspects. First, the number of degrees of freedom (proportional to the number of chemical species) can be dramatically large; second, the source term due to reactions introduces a disparate number of time scales which makes the whole dynamical system stiff. As a result, the direct numerical simulation of turbulent reactive flows with heavy fuels soon becomes intractable even for modern supercomputers.[29]\n\nTherefore, a plethora of methodologies has been devised for reducing the complexity of combustion mechanisms without resorting to high detail level. Examples are provided by:\n\n\n\tThe Relaxation Redistribution Method (RRM)[30][31][32][33]\n\tThe Intrinsic Low-Dimensional Manifold (ILDM) approach and further developments[34][35][36]\n\tThe invariant constrained equilibrium edge preimage curve method.[37]\n\tA few variational approaches[38][39]\n\tThe Computational Singular perturbation (CSP) method and further developments.[40][41]\n\tThe Rate Controlled Constrained Equilibrium (RCCE) and Quasi Equilibrium Manifold (QEM) approach.[42][43]\n\tThe G-Scheme.[44]\n\tThe Method of Invariant Grids (MIG).[45][46][47]\n\n\nKinetic modelling[edit]\n\nThe kinetic modelling may be explored for insight into the reaction mechanisms of thermal decomposition in the combustion of different materials by using for instance Thermogravimetric analysis.[48]\n\n\nTemperature[edit]\n\n  \nAntoine Lavoisier conducting an experiment related to combustion generated by amplified sun light.\n\n\n\nAssuming perfect combustion conditions, such as complete combustion under adiabatic conditions (i.e., no heat loss or gain), the adiabatic combustion temperature can be determined. The formula that yields this temperature is based on the first law of thermodynamics and takes note of the fact that the heat of combustion is used entirely for heating the fuel, the combustion air or oxygen, and the combustion product gases (commonly referred to as the flue gas).\n\nIn the case of fossil fuels burnt in air, the combustion temperature depends on all of the following:\n\n\n\tthe heating value;\n\tthe stoichiometric air to fuel ratio \n  \n    \n      \n        \n          λ\n        \n      \n    \n    {\\displaystyle {\\lambda }}\n  \n;\n\tthe specific heat capacity of fuel and air;\n\tthe air and fuel inlet temperatures.\n\n\nThe adiabatic combustion temperature (also known as the adiabatic flame temperature) increases for higher heating values and inlet air and fuel temperatures and for stoichiometric air ratios approaching one.\n\nMost commonly, the adiabatic combustion temperatures for coals are around 2,200 °C (3,992 °F) (for inlet air and fuel at ambient temperatures and for \n  \n    \n      \n        λ\n        =\n        1.0\n      \n    \n    {\\displaystyle \\lambda =1.0}\n  \n), around 2,150 °C (3,902 °F) for oil and 2,000 °C (3,632 °F) for natural gas.[49][50]\n\nIn industrial fired heaters, power station steam generators, and large gas-fired turbines, the more common way of expressing the usage of more than the stoichiometric combustion air is percent excess combustion air. For example, excess combustion air of 15 percent means that 15 percent more than the required stoichiometric air is being used.\n\n\nInstabilities[edit]\n\nCombustion instabilities are typically violent pressure oscillations in a combustion chamber. These pressure oscillations can be as high as 180 dB, and long-term exposure to these cyclic pressure and thermal loads reduce the life of engine components. In rockets, such as the F1 used in the Saturn V program, instabilities led to massive damage to the combustion chamber and surrounding components. This problem was solved by re-designing the fuel injector. In liquid jet engines, the droplet size and distribution can be used to attenuate the instabilities. Combustion instabilities are a major concern in ground-based gas turbine engines because of NOx emissions. The tendency is to run lean, an equivalence ratio less than 1, to reduce the combustion temperature and thus reduce the NOx emissions; however, running the combustion lean makes it very susceptible to combustion instability.\n\nThe Rayleigh Criterion is the basis for analysis of thermoacoustic combustion instability and is evaluated using the Rayleigh Index over one cycle of instability[51]\n\n\n\n  \n    \n      \n        G\n        (\n        x\n        )\n        =\n        \n          \n            1\n            T\n          \n        \n        \n          ∫\n          \n            T\n          \n        \n        \n          q\n          ′\n        \n        (\n        x\n        ,\n        t\n        )\n        \n          p\n          ′\n        \n        (\n        x\n        ,\n        t\n        )\n        d\n        t\n      \n    \n    {\\displaystyle G(x)={\\frac {1}{T}}\\int _{T}q'(x,t)p'(x,t)dt}\n  \n\n\nwhere q' is the heat release rate perturbation and p' is the pressure fluctuation.[52][53]\nWhen the heat release oscillations are in phase with the pressure oscillations, the Rayleigh Index is positive and the magnitude of the thermo acoustic instability is maximised. On the other hand, if the Rayleigh Index is negative, then thermoacoustic damping occurs. The Rayleigh Criterion implies that a thermoacoustic instability can be optimally controlled by having heat release oscillations 180 degrees out of phase with pressure oscillations at the same frequency.[54][55] This minimizes the Rayleigh Index.\n\n\nSee also[edit]\n\n\n\n \n\t\n\tRelated concepts\n\n\n\tAir–fuel ratio\n\tAutoignition temperature\n\tChemical looping combustion\n\tDeflagration\n\tDetonation\n\tExplosion\n\tFire\n\tFlame\n\tHeterogeneous combustion\n\tMarkstein number\n\tPhlogiston theory (historical)\n\tSpontaneous combustion\n\n\n \n\n\n\t\n\tMachines and equipment\n\n\n\tBoiler\n\tBunsen burner\n\tExternal combustion engine\n\tFurnace\n\tGas turbine\n\tInternal combustion engine\n\tRocket engine\n\n\n\tScientific and engineering societies\n\n\n\tInternational Flame Research Foundation\n\tThe Combustion Institute\n\n\n\tOther\n\n\n\tList of light sources\n\n\n \n\n\n\n\n\n\nReferences[edit]\n\n\n\t^ colloquial meaning of burning is combustion accompanied by flames\n\n\t^ a b Schmidt-Rohr, K (2015). \"Why Combustions Are Always Exothermic, Yielding About 418 kJ per Mole of O2\". J. Chem. Educ. 92 (12): 2094–2099. Bibcode:2015JChEd..92.2094S. doi:10.1021/acs.jchemed.5b00333.\n\n\t^ a b The formation of NOx. Alentecinc.com. Retrieved on 2010-09-28.\n\n\t^ \"Incomplete combustion process\".\n\n\n\t^ \"Burning showing incomplete combustion\".\n\n\n\t^ a b \"Environmental Problems associated with incomplete combustion\".\n\n\n\t^ \"Carbon Monoxide Poisoning\".\n\n\n\t^ \"A Perfect Storm: Mulch Fire Dynamics and Prevention\". Soilandmulchproducernews.com. Retrieved 2018-07-12.\n\n\n\t^ Shuttle-Mir History/Science/Microgravity/Candle Flame in Microgravity (CFM) – MGBX.  Spaceflight.nasa.gov (1999-07-16). Retrieved on 2010-09-28.\n\n\t^ [1] Equilib-Web\n\n\t^ ASM Committee on Furnace Atmospheres, Furnace atmospheres and carbon control, Metals Park, OH [1964].\n\n\t^ \"Exothermic atmospheres\". Industrial Heating: 22. June 2013. Retrieved 5 July 2013.\n\n\n\t^ [2] ExoCalc\n\n\t^ \"Reaction-Web\". Crct.polymtl.ca. Retrieved 2018-07-12.\n\n\n\t^ a b Bradley, D (2009-06-25). \"Combustion and the design of future engine fuels\". Proceedings of the Institution of Mechanical Engineers, Part C: Journal of Mechanical Engineering Science. 223 (12): 2751–2765. doi:10.1243/09544062jmes1519.\n\n\n\t^ \"Calculating the heat of combustion for natural gas\". Industrial Heating: 28. September 2012. Retrieved 5 July 2013.\n\n\n\t^ [3] HeatCalc\n\n\t^ \"Making a material balance\". Industrial Heating: 20. November 2012. Retrieved 5 July 2013.\n\n\n\t^ [4] MatBalCalc\n\n\t^ \"Making a heat balance\". Industrial Heating: 22. December 2012. Retrieved 5 July 2013.\n\n\n\t^ [5] HeatBalCalc\n\n\t^ \"Available combustion heat\". Industrial Heating: 22. April 2013. Retrieved 5 July 2013.\n\n\n\t^ [6] AvailHeatCalc\n\n\t^ \"Making a system balance (Part 2)\". Industrial Heating: 24. March 2012. Retrieved 5 July 2013.\n\n\n\t^ [7] SysBalCalc2\n\n\t^ \"Making a system balance (Part 1)\". Industrial Heating: 22. February 2012. Retrieved 5 July 2013.\n\n\n\t^ [8] SysBalCalc\n\n\t^ Law, C.K. (2006). Combustion Physics. Cambridge, UK: Cambridge University Press. ISBN 9780521154215.\n\n\n\t^ Goussis, D.; Maas, U. (2011). Turbulent Combustion Modeling. Springer Science. pp. 193–220.\n\n\n\t^ Chiavazzo, Eliodoro; Karlin, Ilya (2011). \"Adaptive simplification of complex multiscale systems\". Phys. Rev. E. 83 (3): 036706. arXiv:1011.1618. Bibcode:2011PhRvE..83c6706C. doi:10.1103/PhysRevE.83.036706. PMID 21517624.\n\n\n\t^ Chiavazzo, Eliodoro; Asinari, Pietro; Visconti, Filippo (2011). \"Fast computation of multi-scale combustion systems\". Phil. Trans. Roy. Soc. A. 369 (1945): 2396–2404. arXiv:1011.3828. Bibcode:2011RSPTA.369.2396C. doi:10.1098/rsta.2011.0026. PMID 21576153.\n\n\n\t^ Chiavazzo, Eliodoro (2012). \"Approximation of slow and fast dynamics in multiscale dynamical systems by the linearized Relaxation Redistribution Method\". Journal of Computational Physics. 231 (4): 1751–1765. arXiv:1102.0730. Bibcode:2012JCoPh.231.1751C. doi:10.1016/j.jcp.2011.11.007.\n\n\n\t^ Kooshkbaghi, Mahdi; Frouzakis, E. Christos; Chiavazzo, Eliodoro; Boulouchos, Konstantinos; Karlin, Ilya (2014). \"The global relaxation redistribution method for reduction of combustion kinetics\" (PDF). The Journal of Chemical Physics. 141 (4): 044102. Bibcode:2014JChPh.141d4102K. doi:10.1063/1.4890368.\n\n\n\t^ Maas, U.; Pope, S.B. (1992). \"Simplifying chemical kinetics: intrinsic low-dimensional manifolds in composition space\". Combust. Flame. 88 (3–4): 239–264. doi:10.1016/0010-2180(92)90034-m.\n\n\n\t^ Bykov, V.; Maas, U (2007). \"The extension of the ILDM concept to reaction–diffusion manifolds\". Combust. Theory Model. 11 (6): 839–862. Bibcode:2007CTM....11..839B. doi:10.1080/13647830701242531.\n\n\n\t^ Nafe, J.; Maas, U. (2002). \"A general algorithm for improving ILDMs\". Combust. Theory Model. 6 (4): 697–709. Bibcode:2002CTM.....6..697N. doi:10.1088/1364-7830/6/4/308.\n\n\n\t^ Ren, Z.; Pope, S.B.; Vladimirsky, A.; Guckenheimer, J.M. (2006). \"The invariant constrained equilibrium edge preimage curve method for the dimension reduction of chemical kinetics\". J. Chem. Phys. 124 (11): 114111. Bibcode:2006JChPh.124k4111R. doi:10.1063/1.2177243.\n\n\n\t^ Lebiedz, D (2010). \"Entropy-related extremum principles for model reduction of dissipative dynamical systems\". Entropy. 12 (4): 706–719. Bibcode:2010Entrp..12..706L. doi:10.3390/e12040706.\n\n\n\t^ Reinhardt, V.; Winckler, M.; Lebiedz, D. (112). \"Approximation of slow attracting manifolds in chemical kinetics by tra trjectory-based optimization approaches\" (PDF). J. Phys. Chem. A. 112 (8): 1712–1718. Bibcode:2008JPCA..112.1712R. doi:10.1021/jp0739925.\n\n\n\t^ Lam, S.H.; Goussis, D. (1991). Conventional Asymptotic and Computational Singular Perturbation for Symplified Kinetics Modelling. Berlin: Springer.\n\n\n\t^ Valorani, M.; Goussis, D.; Najm, H.N. (2005). \"Higher order corrections in the approximation of low-dimensional manifolds and the construction of simplified problems with the csp method\". J. Comput. Phys. 209 (2): 754–786. Bibcode:2005JCoPh.209..754V. doi:10.1016/j.jcp.2005.03.033.\n\n\n\t^ Keck, J.C.; Gillespie, D. (1971). \"Rate-controlled partial-equilibrium method for treating reacting gas mixtures\". Combust. Flame. 17.\n\n\n\t^ Chiavazzo, Eliodoro; Karlin, Ilya (2008). \"Quasi-equilibrium grid algorithm: geometric construction for model reduction\". J. Comput. Phys. 227 (11): 5535–5560. arXiv:0704.2317. Bibcode:2008JCoPh.227.5535C. doi:10.1016/j.jcp.2008.02.006.\n\n\n\t^ Valorani, M.; Paolucci, S. (2009). \"The G-Scheme: a framework for multi-scale adaptive model reduction\". J. Comput. Phys. 228 (13): 4665–4701. Bibcode:2009JCoPh.228.4665V. doi:10.1016/j.jcp.2009.03.011.\n\n\n\t^ Chiavazzo, Eliodoro; Karlin, Ilya; Gorban, Alexander (2010). \"The role of thermodynamics in model reduction when using invariant grids\" (PDF). Commun. Comput. Phys. 8: 701–734. CiteSeerX 10.1.1.302.9316. doi:10.4208/cicp.030709.210110a.\n\n\n\t^ Chiavazzo, Eliodoro; Karlin, Ilya; Frouzakis, Christos E.; Boulouchos, Konstantinos (2009). \"Method of invariant grid for model reduction of hydrogen combustion\". Proceedings of the Combustion Institute. 32: 519–526. arXiv:0712.2386. doi:10.1016/j.proci.2008.05.014.\n\n\n\t^ Chiavazzo, Eliodoro; Karlin, Ilya; Gorban, Alexander; Boulouchos, Konstantinos (2010). \"Coupling of the model reduction technique with the lattice Boltzmann method for combustion simulations\". Combust. Flame. 157 (10): 1833–1849. doi:10.1016/j.combustflame.2010.06.009.\n\n\n\t^ Reyes, J.A.; Conesa, J.A.; Marcilla, A. (2001). \"Pyrolysis and combustion of polycoated cartons recycling. kinetic model and ms analysis\". Journal of Analytical and Applied Pyrolysis. 58-59: 747–763. doi:10.1016/S0165-2370(00)00123-6.\n\n\n\t^ \"Adiabatic flame temperature\". Industrial Heating: 20. May 2013. Retrieved 5 July 2013.\n\n\n\t^ [9] AFTCalc\n\n\t^ John William Strutt, 3rd Baron Rayleigh, Sc.D., F.R.S., Honorary Fellow of Trinity College, Cambridge; \"The Theory of Sound\", §322h, 1878:\n\n\t^ A. A. Putnam and W. C. Dennis (1953) \"Organ-pipe oscillations in a flame-filled tube,\" Fourth Symposium (International) on Combustion, The Combustion Institute, pp. 566–574.\n\n\t^ E. C. Fernandes and M. V. Heitor, \"Unsteady flames and the Rayleigh criterion\" in F. Culick,  M. V. Heitor, and J. H. Whitelaw, ed.s, Unsteady Combustion (Dordrecht, the Netherlands:  Kluwer Academic Publishers, 1996), p. 4\n\n\t^ Dowling, A. P. (2000a). \"Vortices, sound and flame – a damaging combination\". The Aeronautical Journal of the RaeS\n\n\t^ Chrystie, Robin S. M.; Burns, Iain S.; Kaminski, Clemens F. (2013). \"Temperature Response of an Acoustically Forced Turbulent Lean Premixed Flame: A Quantitative Experimental Determination\". Combustion Science and Technology. 185: 180–199. doi:10.1080/00102202.2012.714020.\n\n\n\n\n\nFurther reading[edit]\n\n\t\tLook up combustion in Wiktionary, the free dictionary.\n\n\n\tPoinsot, Thierry; Veynante, Denis (2012). Theoretical and Numerical Combustion (3rd ed.). European Centre for Research and Advanced Training in Scientific Computation.\n\n\tLackner, Maximilian; Winter, Franz; Agarwal, Avinash K., eds. (2010). Handbook of Combustion, 5 volume set. Wiley-VCH. ISBN 978-3-527-32449-1.\n\n\tBaukal, Charles E., ed. (1998). Oxygen-Enhanced Combustion. CRC Press.\n\n\tGlassman, Irvin; Yetter, Richard. Combustion (Fourth ed.).\n\n\tTurns, Stephen (2011). An Introduction to Combustion: Concepts and Applications.\n\n\tRagland, Kenneth W; Bryden, Kenneth M. (2011). Combustion Engineering (Second ed.).\n\n\tBaukal, Charles E. Jr, ed. (2013). \"Industrial Combustion\". The John Zink Hamworthy Combustion Handbook: Three-Volume Set (Second ed.).\n\n\tGardiner, W. C. Jr (2000). Gas-Phase Combustion Chemistry (Revised ed.).\n\n\n\n\t\tv\n\tt\n\te\n\n\nFirelighting\n\n\t\n\tCampfire\n\tBonfire\n\tGlossary\n\n\n\n\n\tComponents\t\n\tEmber\n\tFire triangle\n\tFirewood\n\tSpark\n\tTinder\n\tWood ash\n\tWood fuel\n\n\n\n\n\tTopics\t\n\tAutoignition temperature\n\tCombustion\n\tFriction fire\n\tMinimum ignition energy\n\tSmouldering\n\n\n\n\n\tEarly starters\t\n\tBurning glass (Solar Spark Lighter)\n\tFire piston\n\tFire plough\n\tFire-saw\n\tFire striker\n\tFlint\n\tHand drill\n\tBow drill\n\tPump drill\n\n\n\n\n\n\n\tModern starters\t\n\tMatch\n\tChisquero\n\tBlack match\n\tElectric match\n\tFerrocerium\n\tLighter\n\tBlowtorch\n\n\n\n\n\tOther equipment\t\n\tChar cloth\n\tFeather stick\n\tFire pan\n\tFire pit\n\tFire ring\n\tMatchbook\n\tMatchbox\n\tPunk\n\tTinderbox\n\tTorch\n\tChuckmuck\n\n\n\n\n\tRelated articles\t\n\tArson\n\tControl of fire by early humans\n\tNative American use of fire in ecosystems\n\tOutdoor cooking\n\tFirem'n Chit\n\tPyrolysis\n\tPyromania\n\tSurvival skills\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nFire\n\n\tHistory\t\n\tControl of fire by early humans\n\tHistoric fires\n\tNative American use of fire in ecosystems\n\n\n\n\t\n\n\tScience\t\n\tChain reaction\n\tCombustion\n\tFire ecology\n\tFlash point\n\tPyrolysis\n\n\n\n\n\tComponents\t\n\tFuel\n\tOxygen\n\tHeat\n\tFlame\n\tSmoke\n\n\n\n\n\tIndividual fires\t\n\tBy type\n\tBy country\n\tBy year\n\n\n\n\n\tCrime\t\n\tArson\n\tDeath by burning\n\n\n\n\n\tPeople\t\n\tPyromania\n\tFirefighter\n\tArsonist\n\n\n\n\n\tCulture\t\n\tCremation\n\tFire worship\n\tTerra preta\n\n\n\n\n\tOrganizations\t\n\tInternational Flame Research Foundation\n\tThe Combustion Institute\n\n\n\n\n\tOther\t\n\tWildfires\n\tList of wildfires\n\n\n\tBackdraft\n\tFirestorm\n\tFire whirl\n\tSlash-and-burn\n\n\n\n\n\t\n\t  Category\n\t  Commons\n\t  Wiktionary\n\n\n\n\n\n\n\n\tAuthority control \t\n\tNDL: 00568101\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Combustion&oldid=918419481\"\n\n\t\t\n\t\tCategories: \tCombustion\n\tChemical reactions\n\n\nHidden categories: \tCS1: long volume value\n\tAccuracy disputes from July 2016\n\tAll accuracy disputes\n\tArticles with disputed statements from July 2016\n\tArticles needing additional references from January 2017\n\tAll articles needing additional references\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tBân-lâm-gú\n\tБеларуская\n\tБългарски\n\tBosanski\n\tCatalà\n\tЧӑвашла\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tქართული\n\tKreyòl ayisyen\n\tКыргызча\n\tLatviešu\n\tLietuvių\n\tLimburgs\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tਪੰਜਾਬੀ\n\tPolski\n\tPortuguês\n\tRomână\n\tRuna Simi\n\tРусский\n\tScots\n\tShqip\n\tSicilianu\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tTaqbaylit\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t文言\n\tWinaray\n\tWolof\n\tייִדיש\n\tYorùbá\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 28 September 2019, at 15:40 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "10", "dc:title": "Combustion - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Et_baal.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-combustion", "title": "Combustion - Wikipedia"}}