{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMomentum - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tMomentum\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Conservation of momentum)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about linear momentum. It is not to be confused with angular momentum.\n\nThis article is about momentum in physics. For other uses, see Momentum (disambiguation).\n\n\n\n\n\tMomentum\n\tMomentum of a pool cue ball is transferred to the racked balls after collision.\n\n\tCommon symbols\n\tp, p\n\tSI unit\tkilogram meter per second kg⋅m/s\n\tOther units\n\tslug⋅ft/s\n\tConserved?\tYes\n\tDimension\tMLT−1\n\n\n\tPart of a series of articles about\n\tClassical mechanics\n\t\n  \n    \n      \n        \n          \n            \n              F\n              →\n            \n          \n        \n        =\n        m\n        \n          \n            \n              a\n              →\n            \n          \n        \n      \n    \n    {\\displaystyle {\\vec {F}}=m{\\vec {a}}}\n  \nSecond law of motion\n\n\t\n\n\tHistory\n\tTimeline\n\n\n\n\n\t\nBranches\n\n\tApplied\n\tCelestial\n\tContinuum\n\tDynamics\n\tKinematics\n\tKinetics\n\tStatics\n\tStatistical\n\n\n\n\n\n\n\t\nFundamentals\n\n\tAcceleration\n\tAngular momentum\n\tCouple\n\tD'Alembert's principle\n\tEnergy\n\tkinetic\n\tpotential\n\n\n\tForce\n\tFrame of reference\n\tInertial frame of reference\n\tImpulse\n\tInertia / Moment of inertia\n\tMass\n\t\nMechanical power\n\tMechanical work\n\t\nMoment\n\tMomentum\n\tSpace\n\tSpeed\n\tTime\n\tTorque\n\tVelocity\n\tVirtual work\n\n\n\n\n\n\n\t\nFormulations\n\n\tNewton's laws of motion\n\n\tAnalytical mechanics \tLagrangian mechanics\n\tHamiltonian mechanics\n\tRouthian mechanics\n\tHamilton–Jacobi equation\n\tAppell's equation of motion\n\tUdwadia–Kalaba equation\n\tKoopman–von Neumann mechanics\n\n\n\n\n\n\n\n\n\t\nCore topics\n\n\tDamping (ratio)\n\tDisplacement\n\tEquations of motion\n\tEuler's laws of motion\n\tFictitious force\n\tFriction\n\tHarmonic oscillator\n\n\n\n\n\tInertial / Non-inertial reference frame\n\tMechanics of planar particle motion\n\n\n\n\tMotion (linear)\n\tNewton's law of universal gravitation\n\tNewton's laws of motion\n\tRelative velocity\n\tRigid body\n\tdynamics\n\tEuler's equations\n\n\n\tSimple harmonic motion\n\tVibration\n\n\n\n\n\n\n\t\nRotation\n\n\tCircular motion\n\tRotating reference frame\n\tCentripetal force\n\tCentrifugal force\n\treactive\n\n\n\tCoriolis force\n\tPendulum\n\tTangential speed\n\tRotational speed\n\n\n\n\n\tAngular acceleration / displacement / frequency / velocity\n\n\n\n\n\t\nScientists\n\n\tGalileo\n\tHuygens\n\tNewton\n\tKepler\n\tHorrocks\n\tHalley\n\tEuler\n\td'Alembert\n\tClairaut\n\tLagrange\n\tLaplace\n\tHamilton\n\tPoisson\n\tDaniel Bernoulli\n\tJohann Bernoulli\n\tCauchy\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nIn Newtonian mechanics, linear momentum, translational momentum, or simply momentum (pl. momenta) is the product of the mass and velocity of an object. It is a vector quantity, possessing a magnitude and a direction in three-dimensional space. If m is an object's mass and v is the velocity (also a vector quantity), then the momentum is\n\n\n\t\n  \n    \n      \n        \n          p\n        \n        =\n        m\n        \n          v\n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {p} =m\\mathbf {v} ,}\n  \n\n\n\nIn SI units, it is measured in kilogram meters per second (kg⋅m/s). Newton's second law of motion states that a body's rate of change in momentum is equal to the net force acting on it.\n\nMomentum depends on the frame of reference, but in any inertial frame it is a conserved quantity, meaning that if a closed system is not affected by external forces, its total linear momentum does not change. Momentum is also conserved in special relativity (with a modified formula) and, in a modified form,  in electrodynamics, quantum mechanics, quantum field theory, and general relativity. It is an expression of one of the fundamental symmetries of space and time: translational symmetry.\n\nAdvanced formulations of classical mechanics, Lagrangian and Hamiltonian mechanics, allow one to choose coordinate systems that incorporate symmetries and constraints. In these systems the conserved quantity is  generalized momentum, and in general this is different from the kinetic momentum defined above. The concept of generalized momentum is carried over into quantum mechanics, where it becomes an operator on a wave function. The momentum and position operators are related by the Heisenberg uncertainty principle.\n\nIn continuous systems such as electromagnetic fields, fluids and deformable bodies, a momentum density can be defined, and a continuum version of the conservation of momentum leads to equations such as the Navier–Stokes equations for fluids or the Cauchy momentum equation for deformable solids or fluids.\n\n\nContents\n\n\n\t1 Newtonian\n\t1.1 Single particle\n\t1.2 Many particles\n\t1.3 Relation to force\n\t1.4 Conservation\n\t1.5 Dependence on reference frame\n\t1.6 Application to collisions\n\t1.6.1 Elastic collisions\n\t1.6.2 Inelastic collisions\n\n\n\n\t1.7 Multiple dimensions\n\t1.8 Objects of variable mass\n\n\n\n\t2 Relativistic\n\t2.1 Lorentz invariance\n\t2.2 Four-vector formulation\n\n\n\n\t3 Generalized\n\t3.1 Lagrangian mechanics\n\t3.2 Hamiltonian mechanics\n\t3.3 Symmetry and conservation\n\n\n\n\t4 Electromagnetic\n\t4.1 Particle in a field\n\t4.2 Conservation\n\t4.2.1 Vacuum\n\t4.2.2 Media\n\n\n\n\n\n\n\t5 Quantum mechanical\n\t6 In deformable bodies and fluids\n\t6.1 Conservation in a continuum\n\t6.2 Acoustic waves\n\n\n\n\t7 History of the concept\n\t8 See also\n\t9 References\n\t10 Bibliography\n\t11 External links\n\n\n\n\n\n\nNewtonian[edit]\n\nMomentum is a vector quantity: it has both magnitude and direction. Since momentum has a direction, it can be used to predict the resulting direction and speed of motion of objects after they collide. Below, the basic properties of momentum are described in one dimension. The vector equations are almost identical to the scalar equations (see multiple dimensions).\n\n\nSingle particle[edit]\n\nThe momentum of a particle is conventionally represented by the letter p. It is the product of two quantities, the particle's mass (represented by the letter m) and its velocity (v):[1]\n\n\n\t\n  \n    \n      \n        p\n        =\n        m\n        v\n        .\n      \n    \n    {\\displaystyle p=mv.}\n  \n\n\n\nThe unit of momentum is the product of the units of mass and velocity. In SI units, if the mass is in kilograms and the velocity is in meters per second then the momentum is in kilogram meters per second (kg⋅m/s). In cgs units, if the mass is in grams and the velocity in centimeters per second, then the momentum is in gram centimeters per second (g⋅cm/s).\n\nBeing a vector, momentum has magnitude and direction. For example, a 1 kg model airplane, traveling due north at 1 m/s in straight and level flight, has a momentum of 1 kg⋅m/s due north measured with reference to the ground.\n\n\nMany particles[edit]\n\nThe momentum of a system of particles is the vector sum of their momenta. If two particles have respective masses m1 and m2, and velocities v1 and v2, the total momentum is\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                p\n              \n              \n                \n                =\n                \n                  p\n                  \n                    1\n                  \n                \n                +\n                \n                  p\n                  \n                    2\n                  \n                \n              \n            \n            \n              \n              \n                \n                =\n                \n                  m\n                  \n                    1\n                  \n                \n                \n                  v\n                  \n                    1\n                  \n                \n                +\n                \n                  m\n                  \n                    2\n                  \n                \n                \n                  v\n                  \n                    2\n                  \n                \n                \n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}p&=p_{1}+p_{2}\\\\&=m_{1}v_{1}+m_{2}v_{2}\\,.\\end{aligned}}}\n  \n\n\n\nThe momenta of more than two particles can be added more generally with the following:\n\n\n\t\n  \n    \n      \n        p\n        =\n        \n          ∑\n          \n            i\n          \n        \n        \n          m\n          \n            i\n          \n        \n        \n          v\n          \n            i\n          \n        \n        .\n      \n    \n    {\\displaystyle p=\\sum _{i}m_{i}v_{i}.}\n  \n\n\n\nA system of particles has a center of mass, a point determined by the weighted sum of their positions:\n\n\n\t\n  \n    \n      \n        \n          r\n          \n            cm\n          \n        \n        =\n        \n          \n            \n              \n                m\n                \n                  1\n                \n              \n              \n                r\n                \n                  1\n                \n              \n              +\n              \n                m\n                \n                  2\n                \n              \n              \n                r\n                \n                  2\n                \n              \n              +\n              ⋯\n            \n            \n              \n                m\n                \n                  1\n                \n              \n              +\n              \n                m\n                \n                  2\n                \n              \n              +\n              ⋯\n            \n          \n        \n        =\n        \n          \n            \n              \n                ∑\n                \n                  i\n                \n              \n              \n                m\n                \n                  i\n                \n              \n              \n                r\n                \n                  i\n                \n              \n            \n            \n              \n                ∑\n                \n                  i\n                \n              \n              \n                m\n                \n                  i\n                \n              \n            \n          \n        \n        .\n      \n    \n    {\\displaystyle r_{\\text{cm}}={\\frac {m_{1}r_{1}+m_{2}r_{2}+\\cdots }{m_{1}+m_{2}+\\cdots }}={\\frac {\\sum \\limits _{i}m_{i}r_{i}}{\\sum \\limits _{i}m_{i}}}.}\n  \n\n\n\nIf one or more of the particles is moving, the center of mass of the system will generally be moving as well (unless the system is in pure rotation around it). If the total mass of the particles is \n  \n    \n      \n        m\n      \n    \n    {\\displaystyle m}\n  \n, and the center of mass is moving at velocity vcm, the momentum of the system is:\n\n\n\t\n  \n    \n      \n        p\n        =\n        m\n        \n          v\n          \n            cm\n          \n        \n        .\n      \n    \n    {\\displaystyle p=mv_{\\text{cm}}.}\n  \n\n\n\nThis is known as Euler's first law.[2][3]\n\n\nRelation to force[edit]\n\nIf the net force F applied to a particle is constant, and is applied for a time interval Δt, the momentum of the particle changes by an amount\n\n\n\t\n  \n    \n      \n        Δ\n        p\n        =\n        F\n        Δ\n        t\n        \n        .\n      \n    \n    {\\displaystyle \\Delta p=F\\Delta t\\,.}\n  \n\n\n\nIn differential form, this is Newton's second law; the rate of change of the momentum of a particle is equal to the instantaneous force F acting on it,[1]\n\n\n\t\n  \n    \n      \n        F\n        =\n        \n          \n            \n              d\n              p\n            \n            \n              d\n              t\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle F={\\frac {dp}{dt}}.}\n  \n\n\n\nIf the net force experienced by a particle changes as a function of time, F(t), the change in momentum (or impulse J ) between times t1 and t2  is\n\n\n\t\n  \n    \n      \n        Δ\n        p\n        =\n        J\n        =\n        \n          ∫\n          \n            \n              t\n              \n                1\n              \n            \n          \n          \n            \n              t\n              \n                2\n              \n            \n          \n        \n        F\n        (\n        t\n        )\n        \n        d\n        t\n        \n        .\n      \n    \n    {\\displaystyle \\Delta p=J=\\int _{t_{1}}^{t_{2}}F(t)\\,dt\\,.}\n  \n\n\n\nImpulse is measured in the derived units of the newton second (1 N⋅s = 1 kg⋅m/s) or dyne second (1 dyne⋅s = 1 g⋅cm/s)\n\nUnder the assumption of constant mass m, it is equivalent to write\n\n\n\t\n  \n    \n      \n        F\n        =\n        \n          \n            \n              d\n              (\n              m\n              v\n              )\n            \n            \n              d\n              t\n            \n          \n        \n        =\n        m\n        \n          \n            \n              d\n              v\n            \n            \n              d\n              t\n            \n          \n        \n        =\n        m\n        a\n        ,\n      \n    \n    {\\displaystyle F={\\frac {d(mv)}{dt}}=m{\\frac {dv}{dt}}=ma,}\n  \n\n\n\nhence the net force is equal to the mass of the particle times its acceleration.[1]\n\nExample: A model airplane of mass 1 kg accelerates from rest to a velocity of 6 m/s due north in 2 s. The net force required to produce this acceleration is 3 newtons due north. The change in momentum is 6 kg⋅m/s due north. The rate of change of momentum is 3 (kg⋅m/s)/s due north which is numerically equivalent to 3 newtons.\n\n\nConservation[edit]\n\nIn a closed system (one that does not exchange any matter with its surroundings and is not acted on by external forces) the total momentum is constant. This fact, known as the law of conservation of momentum, is implied by Newton's laws of motion.[4][5] Suppose, for example, that two particles interact. Because of the third law, the forces between them are equal and opposite. If the particles are numbered 1 and 2, the second law states that F1 = dp1/dt and F2 = dp2/dt. Therefore,\n\n\n\t\n  \n    \n      \n        \n          \n            \n              d\n              \n                p\n                \n                  1\n                \n              \n            \n            \n              d\n              t\n            \n          \n        \n        =\n        −\n        \n          \n            \n              d\n              \n                p\n                \n                  2\n                \n              \n            \n            \n              d\n              t\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle {\\frac {dp_{1}}{dt}}=-{\\frac {dp_{2}}{dt}},}\n  \n\n\n\nwith the negative sign indicating that the forces oppose. Equivalently,\n\n\n\t\n  \n    \n      \n        \n          \n            d\n            \n              d\n              t\n            \n          \n        \n        \n          (\n          \n            \n              p\n              \n                1\n              \n            \n            +\n            \n              p\n              \n                2\n              \n            \n          \n          )\n        \n        =\n        0.\n      \n    \n    {\\displaystyle {\\frac {d}{dt}}\\left(p_{1}+p_{2}\\right)=0.}\n  \n\n\n\nIf the velocities of the particles are u1 and u2 before the interaction, and afterwards they are v1 and v2, then\n\n\n\t\n  \n    \n      \n        \n          m\n          \n            1\n          \n        \n        \n          u\n          \n            1\n          \n        \n        +\n        \n          m\n          \n            2\n          \n        \n        \n          u\n          \n            2\n          \n        \n        =\n        \n          m\n          \n            1\n          \n        \n        \n          v\n          \n            1\n          \n        \n        +\n        \n          m\n          \n            2\n          \n        \n        \n          v\n          \n            2\n          \n        \n        .\n      \n    \n    {\\displaystyle m_{1}u_{1}+m_{2}u_{2}=m_{1}v_{1}+m_{2}v_{2}.}\n  \n\n\n\nThis law holds no matter how complicated the force is between particles. Similarly, if there are several particles, the momentum exchanged between each pair of particles adds up to zero, so the total change in momentum is zero. This conservation law applies to all interactions, including collisions and separations caused by explosive forces.[4] It can also be generalized to situations where Newton's laws do not hold, for example in the theory of relativity and in electrodynamics.[6]\n\n\nDependence on reference frame[edit]\n\n  \nNewton's apple in Einstein's elevator. In person A's frame of reference, the apple has non-zero velocity and momentum. In the elevator's and person B's frames of reference, it has zero velocity and momentum.\n\n\n\nMomentum is a measurable quantity, and the measurement depends on the motion of the observer. For example: if an apple is sitting in a glass elevator that is descending, an outside observer, looking into the elevator, sees the apple moving, so, to that observer, the apple has a non-zero momentum. To someone inside the elevator, the apple does not move, so, it has zero momentum. The two observers each have a frame of reference, in which, they observe motions, and, if the elevator is descending steadily, they will see behavior that is consistent with those same physical laws.\n\nSuppose a particle has position x in a stationary frame of reference. From the point of view of another frame of reference, moving at a uniform speed u, the position (represented by a primed coordinate) changes with time as\n\n\n\t\n  \n    \n      \n        \n          x\n          ′\n        \n        =\n        x\n        −\n        u\n        t\n        \n        .\n      \n    \n    {\\displaystyle x'=x-ut\\,.}\n  \n\n\n\nThis is called a Galilean transformation. If the particle is moving at speed dx/dt = v in the first frame of reference, in the second, it is moving at speed\n\n\n\t\n  \n    \n      \n        \n          v\n          ′\n        \n        =\n        \n          \n            \n              d\n              \n                x\n                ′\n              \n            \n            \n              d\n              t\n            \n          \n        \n        =\n        v\n        −\n        u\n        \n        .\n      \n    \n    {\\displaystyle v'={\\frac {dx'}{dt}}=v-u\\,.}\n  \n\n\n\nSince u does not change, the accelerations are the same:\n\n\n\t\n  \n    \n      \n        \n          a\n          ′\n        \n        =\n        \n          \n            \n              d\n              \n                v\n                ′\n              \n            \n            \n              d\n              t\n            \n          \n        \n        =\n        a\n        \n        .\n      \n    \n    {\\displaystyle a'={\\frac {dv'}{dt}}=a\\,.}\n  \n\n\n\nThus, momentum is conserved in both reference frames. Moreover, as long as the force has the same form, in both frames, Newton's second law is unchanged. Forces such as Newtonian gravity, which depend only on the scalar distance between objects, satisfy this criterion. This independence of reference frame is called Newtonian relativity or Galilean invariance.[7]\n\nA change of reference frame, can, often, simplify calculations of motion. For example, in a collision of two particles, a reference frame can be chosen, where, one particle begins at rest. Another, commonly used reference frame, is the center of mass frame – one that is moving with the center of mass. In this frame,\nthe total momentum is zero.\n\n\nApplication to collisions[edit]\n\nBy itself, the law of conservation of momentum is not enough to determine the motion of particles after a collision. Another property of the motion, kinetic energy, must be known. This is not necessarily conserved. If it is conserved, the collision is called an elastic collision; if not, it is an inelastic collision.\n\n\nElastic collisions[edit]\n\nMain article: Elastic collision\n\n  \nElastic collision of equal masses\n\n\n\n  \nElastic collision of unequal masses\n\n\n\nAn elastic collision is one in which no kinetic energy is absorbed in the collision. Perfectly elastic \"collisions\" can occur when the objects do not touch each other, as for example in atomic or nuclear scattering where electric repulsion keeps them apart. A slingshot maneuver of a satellite around a planet can also be viewed as a perfectly elastic collision. A collision between two pool balls is a good example of an almost totally elastic collision, due to their high rigidity, but when bodies come in contact there is always some dissipation.[8]\n\nA head-on elastic collision between two bodies can be represented by velocities in one dimension, along a line passing through the bodies. If the velocities are u1 and u2 before the collision and v1 and v2 after, the equations expressing conservation of momentum and kinetic energy are:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  m\n                  \n                    1\n                  \n                \n                \n                  u\n                  \n                    1\n                  \n                \n                +\n                \n                  m\n                  \n                    2\n                  \n                \n                \n                  u\n                  \n                    2\n                  \n                \n              \n              \n                \n                =\n                \n                  m\n                  \n                    1\n                  \n                \n                \n                  v\n                  \n                    1\n                  \n                \n                +\n                \n                  m\n                  \n                    2\n                  \n                \n                \n                  v\n                  \n                    2\n                  \n                \n              \n            \n            \n              \n                \n                  \n                    \n                      1\n                      2\n                    \n                  \n                \n                \n                  m\n                  \n                    1\n                  \n                \n                \n                  u\n                  \n                    1\n                  \n                  \n                    2\n                  \n                \n                +\n                \n                  \n                    \n                      1\n                      2\n                    \n                  \n                \n                \n                  m\n                  \n                    2\n                  \n                \n                \n                  u\n                  \n                    2\n                  \n                  \n                    2\n                  \n                \n              \n              \n                \n                =\n                \n                  \n                    \n                      1\n                      2\n                    \n                  \n                \n                \n                  m\n                  \n                    1\n                  \n                \n                \n                  v\n                  \n                    1\n                  \n                  \n                    2\n                  \n                \n                +\n                \n                  \n                    \n                      1\n                      2\n                    \n                  \n                \n                \n                  m\n                  \n                    2\n                  \n                \n                \n                  v\n                  \n                    2\n                  \n                  \n                    2\n                  \n                \n                \n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}m_{1}u_{1}+m_{2}u_{2}&=m_{1}v_{1}+m_{2}v_{2}\\\\{\\tfrac {1}{2}}m_{1}u_{1}^{2}+{\\tfrac {1}{2}}m_{2}u_{2}^{2}&={\\tfrac {1}{2}}m_{1}v_{1}^{2}+{\\tfrac {1}{2}}m_{2}v_{2}^{2}\\,.\\end{aligned}}}\n  \n\n\n\nA change of reference frame can simplify analysis of a collision. For example, suppose there are two bodies of equal mass m, one stationary and one approaching the other at a speed v (as in the figure). The center of mass is moving at speed v/2 and both bodies are moving towards it at speed v/2. Because of the symmetry, after the collision both must be moving away from the center of mass at the same speed. Adding the speed of the center of mass to both, we find that the body that was moving is now stopped and the other is moving away at speed v. The bodies have exchanged their velocities. Regardless of the velocities of the bodies, a switch to the center of mass frame leads us to the same conclusion. Therefore, the final velocities are given by[4]\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  v\n                  \n                    1\n                  \n                \n              \n              \n                \n                =\n                \n                  u\n                  \n                    2\n                  \n                \n              \n            \n            \n              \n                \n                  v\n                  \n                    2\n                  \n                \n              \n              \n                \n                =\n                \n                  u\n                  \n                    1\n                  \n                \n                \n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}v_{1}&=u_{2}\\\\v_{2}&=u_{1}\\,.\\end{aligned}}}\n  \n\n\n\nIn general, when the initial velocities are known, the final velocities are given by[9]\n\n\n\t\n  \n    \n      \n        \n          v\n          \n            1\n          \n        \n        =\n        \n          (\n          \n            \n              \n                \n                  m\n                  \n                    1\n                  \n                \n                −\n                \n                  m\n                  \n                    2\n                  \n                \n              \n              \n                \n                  m\n                  \n                    1\n                  \n                \n                +\n                \n                  m\n                  \n                    2\n                  \n                \n              \n            \n          \n          )\n        \n        \n          u\n          \n            1\n          \n        \n        +\n        \n          (\n          \n            \n              \n                2\n                \n                  m\n                  \n                    2\n                  \n                \n              \n              \n                \n                  m\n                  \n                    1\n                  \n                \n                +\n                \n                  m\n                  \n                    2\n                  \n                \n              \n            \n          \n          )\n        \n        \n          u\n          \n            2\n          \n        \n        \n      \n    \n    {\\displaystyle v_{1}=\\left({\\frac {m_{1}-m_{2}}{m_{1}+m_{2}}}\\right)u_{1}+\\left({\\frac {2m_{2}}{m_{1}+m_{2}}}\\right)u_{2}\\,}\n  \n\n\t\n  \n    \n      \n        \n          v\n          \n            2\n          \n        \n        =\n        \n          (\n          \n            \n              \n                \n                  m\n                  \n                    2\n                  \n                \n                −\n                \n                  m\n                  \n                    1\n                  \n                \n              \n              \n                \n                  m\n                  \n                    1\n                  \n                \n                +\n                \n                  m\n                  \n                    2\n                  \n                \n              \n            \n          \n          )\n        \n        \n          u\n          \n            2\n          \n        \n        +\n        \n          (\n          \n            \n              \n                2\n                \n                  m\n                  \n                    1\n                  \n                \n              \n              \n                \n                  m\n                  \n                    1\n                  \n                \n                +\n                \n                  m\n                  \n                    2\n                  \n                \n              \n            \n          \n          )\n        \n        \n          u\n          \n            1\n          \n        \n        \n        .\n      \n    \n    {\\displaystyle v_{2}=\\left({\\frac {m_{2}-m_{1}}{m_{1}+m_{2}}}\\right)u_{2}+\\left({\\frac {2m_{1}}{m_{1}+m_{2}}}\\right)u_{1}\\,.}\n  \n\n\n\nIf one body has much greater mass than the other, its velocity will be little affected by a collision while the other body will experience a large change.\n\n\nInelastic collisions[edit]\n\nMain article: Inelastic collision\n\n  \na perfectly inelastic collision between equal masses\n\n\n\nIn an inelastic collision, some of the kinetic energy of the colliding bodies is converted into other forms of energy (such as heat or sound). Examples include traffic collisions,[10] in which the effect of loss of kinetic energy can be seen in the damage to the vehicles; electrons losing some of their energy to atoms (as in the Franck–Hertz experiment);[11] and particle accelerators in which the kinetic energy is converted into mass in the form of new particles.\n\nIn a perfectly inelastic collision (such as a bug hitting a windshield), both bodies have the same motion afterwards. If one body is motionless to begin with, the equation for conservation of momentum is\n\n\n\t\n  \n    \n      \n        \n          m\n          \n            1\n          \n        \n        \n          u\n          \n            1\n          \n        \n        =\n        \n          (\n          \n            \n              m\n              \n                1\n              \n            \n            +\n            \n              m\n              \n                2\n              \n            \n          \n          )\n        \n        v\n        \n        ,\n      \n    \n    {\\displaystyle m_{1}u_{1}=\\left(m_{1}+m_{2}\\right)v\\,,}\n  \n\n\n\nso\n\n\n\t\n  \n    \n      \n        v\n        =\n        \n          \n            \n              m\n              \n                1\n              \n            \n            \n              \n                m\n                \n                  1\n                \n              \n              +\n              \n                m\n                \n                  2\n                \n              \n            \n          \n        \n        \n          u\n          \n            1\n          \n        \n        \n        .\n      \n    \n    {\\displaystyle v={\\frac {m_{1}}{m_{1}+m_{2}}}u_{1}\\,.}\n  \n\n\n\nIn a frame of reference moving at the speed v), the objects are brought to rest by the collision and 100% of the kinetic energy is converted to other forms of energy.\n\nOne measure of the inelasticity of the collision is the coefficient of restitution CR, defined as the ratio of relative velocity of separation to relative velocity of approach. In applying this measure to a ball bouncing from a solid surface, this can be easily measured using the following formula:[12]\n\n\n\t\n  \n    \n      \n        \n          C\n          \n            R\n          \n        \n        =\n        \n          \n            \n              bounce height\n              drop height\n            \n          \n        \n        \n        .\n      \n    \n    {\\displaystyle C_{\\text{R}}={\\sqrt {\\frac {\\text{bounce height}}{\\text{drop height}}}}\\,.}\n  \n\n\n\nThe momentum and energy equations also apply to the motions of objects that begin together and then move apart. For example, an explosion is the result of a chain reaction that transforms potential energy stored in chemical, mechanical, or nuclear form into kinetic energy, acoustic energy, and electromagnetic radiation. Rockets also make use of conservation of momentum: propellant is thrust outward, gaining momentum, and an equal and opposite momentum is imparted to the rocket.[13]\n\n\nMultiple dimensions[edit]\n\n  \nTwo-dimensional elastic collision. There is no motion perpendicular to the image, so only two components are needed to represent the velocities and momenta. The two blue vectors represent velocities after the collision and add vectorially to get the initial (red) velocity.\n\n\n\nReal motion has both direction and velocity and must be represented by a vector. In a coordinate system with x, y, z axes, velocity has components vx in the x-direction, vy in the y-direction, vz in the z-direction. The vector is represented by a boldface symbol:[14]\n\n\n\t\n  \n    \n      \n        \n          v\n        \n        =\n        \n          (\n          \n            \n              v\n              \n                x\n              \n            \n            ,\n            \n              v\n              \n                y\n              \n            \n            ,\n            \n              v\n              \n                z\n              \n            \n          \n          )\n        \n        .\n      \n    \n    {\\displaystyle \\mathbf {v} =\\left(v_{x},v_{y},v_{z}\\right).}\n  \n\n\n\nSimilarly, the momentum is a vector quantity and is represented by a boldface symbol:\n\n\n\t\n  \n    \n      \n        \n          p\n        \n        =\n        \n          (\n          \n            \n              p\n              \n                x\n              \n            \n            ,\n            \n              p\n              \n                y\n              \n            \n            ,\n            \n              p\n              \n                z\n              \n            \n          \n          )\n        \n        .\n      \n    \n    {\\displaystyle \\mathbf {p} =\\left(p_{x},p_{y},p_{z}\\right).}\n  \n\n\n\nThe equations in the previous sections, work in vector form if the scalars p and v are replaced by vectors p and v. Each vector equation represents three scalar equations. For example,\n\n\n\t\n  \n    \n      \n        \n          p\n        \n        =\n        m\n        \n          v\n        \n      \n    \n    {\\displaystyle \\mathbf {p} =m\\mathbf {v} }\n  \n\n\n\nrepresents three equations:[14]\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  p\n                  \n                    x\n                  \n                \n              \n              \n                \n                =\n                m\n                \n                  v\n                  \n                    x\n                  \n                \n              \n            \n            \n              \n                \n                  p\n                  \n                    y\n                  \n                \n              \n              \n                \n                =\n                m\n                \n                  v\n                  \n                    y\n                  \n                \n              \n            \n            \n              \n                \n                  p\n                  \n                    z\n                  \n                \n              \n              \n                \n                =\n                m\n                \n                  v\n                  \n                    z\n                  \n                \n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}p_{x}&=mv_{x}\\\\p_{y}&=mv_{y}\\\\p_{z}&=mv_{z}.\\end{aligned}}}\n  \n\n\n\nThe kinetic energy equations are exceptions to the above replacement rule. The equations are still one-dimensional, but each scalar represents the magnitude of the vector, for example,\n\n\n\t\n  \n    \n      \n        \n          v\n          \n            2\n          \n        \n        =\n        \n          v\n          \n            x\n          \n          \n            2\n          \n        \n        +\n        \n          v\n          \n            y\n          \n          \n            2\n          \n        \n        +\n        \n          v\n          \n            z\n          \n          \n            2\n          \n        \n        \n        .\n      \n    \n    {\\displaystyle v^{2}=v_{x}^{2}+v_{y}^{2}+v_{z}^{2}\\,.}\n  \n\n\n\nEach vector equation represents three scalar equations. Often coordinates can be chosen so that only two components are needed, as in the figure. Each component can be obtained separately and the results combined to produce a vector result.[14]\n\nA simple construction involving the center of mass frame can be used to show that if a stationary elastic sphere is struck by a moving sphere, the two will head off at right angles after the collision (as in the figure).[15]\n\n\nObjects of variable mass[edit]\n\nSee also: Variable-mass system\n\nThe concept of momentum plays a fundamental role in explaining the behavior of variable-mass objects such as a rocket ejecting fuel or a star accreting gas. In analyzing such an object, one treats the object's mass as a function that varies with time: m(t). The momentum of the object at time t is therefore p(t) = m(t)v(t). One might then try to invoke Newton's second law of motion by saying that the external force F on the object is related to its momentum p(t) by F = dp/dt, but this is incorrect, as is the related expression found by applying the product rule to d(mv)/dt:[16]\n\n\n\t\n  \n    \n      \n        F\n        =\n        m\n        (\n        t\n        )\n        \n          \n            \n              d\n              v\n            \n            \n              d\n              t\n            \n          \n        \n        +\n        v\n        (\n        t\n        )\n        \n          \n            \n              d\n              m\n            \n            \n              d\n              t\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle F=m(t){\\frac {dv}{dt}}+v(t){\\frac {dm}{dt}}.}\n  \n (incorrect)[why?]\n\n\nThis equation does not correctly describe the motion of variable-mass objects. The correct equation is\n\n\n\t\n  \n    \n      \n        F\n        =\n        m\n        (\n        t\n        )\n        \n          \n            \n              d\n              v\n            \n            \n              d\n              t\n            \n          \n        \n        −\n        u\n        \n          \n            \n              d\n              m\n            \n            \n              d\n              t\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle F=m(t){\\frac {dv}{dt}}-u{\\frac {dm}{dt}},}\n  \n\n\n\nwhere u is the velocity of the ejected/accreted mass as seen in the object's rest frame.[16] This is distinct from v, which is the velocity of the object itself as seen in an inertial frame.\n\nThis equation is derived by keeping track of both the momentum of the object as well as the momentum of the ejected/accreted mass (dm). When considered together, the object and the mass (dm) constitute a closed system in which total momentum is conserved.\n\n\n\t\n  \n    \n      \n        P\n        (\n        t\n        +\n        d\n        t\n        )\n        =\n        (\n        m\n        −\n        d\n        m\n        )\n        (\n        v\n        +\n        d\n        v\n        )\n        +\n        d\n        m\n        (\n        v\n        −\n        u\n        )\n        =\n        m\n        v\n        +\n        m\n        d\n        v\n        −\n        u\n        d\n        m\n        =\n        P\n        (\n        t\n        )\n        +\n        m\n        d\n        v\n        −\n        u\n        d\n        m\n      \n    \n    {\\displaystyle P(t+dt)=(m-dm)(v+dv)+dm(v-u)=mv+mdv-udm=P(t)+mdv-udm}\n  \n\n\n\nRelativistic[edit]\n\nSee also: Mass in special relativity and Tests of relativistic energy and momentum\n\nLorentz invariance[edit]\n\nNewtonian physics assumes that absolute time and space exist outside of any observer; this gives rise to Galilean invariance. It also results in a prediction that the speed of light can vary from one reference frame to another. This is contrary to observation. In the special theory of relativity, Einstein keeps the postulate that the equations of motion do not depend on the reference frame, but assumes that the speed of light c is invariant. As a result, position and time in two reference frames are related by the Lorentz transformation instead of the Galilean transformation.[17]\n\nConsider, for example, a reference frame moving relative to another at velocity v in the x direction. The Galilean transformation gives the coordinates of the moving frame as\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  t\n                  ′\n                \n              \n              \n                \n                =\n                t\n              \n            \n            \n              \n                \n                  x\n                  ′\n                \n              \n              \n                \n                =\n                x\n                −\n                v\n                t\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}t'&=t\\\\x'&=x-vt\\end{aligned}}}\n  \n\n\n\nwhile the Lorentz transformation gives[18]\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  t\n                  ′\n                \n              \n              \n                \n                =\n                γ\n                \n                  (\n                  \n                    t\n                    −\n                    \n                      \n                        \n                          v\n                          x\n                        \n                        \n                          c\n                          \n                            2\n                          \n                        \n                      \n                    \n                  \n                  )\n                \n              \n            \n            \n              \n                \n                  x\n                  ′\n                \n              \n              \n                \n                =\n                γ\n                \n                  (\n                  \n                    x\n                    −\n                    v\n                    t\n                  \n                  )\n                \n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}t'&=\\gamma \\left(t-{\\frac {vx}{c^{2}}}\\right)\\\\x'&=\\gamma \\left(x-vt\\right)\\,\\end{aligned}}}\n  \n\n\n\nwhere γ is the Lorentz factor:\n\n\n\t\n  \n    \n      \n        γ\n        =\n        \n          \n            1\n            \n              1\n              −\n              \n                v\n                \n                  2\n                \n              \n              \n                /\n              \n              \n                c\n                \n                  2\n                \n              \n            \n          \n        \n        .\n      \n    \n    {\\displaystyle \\gamma ={\\frac {1}{\\sqrt {1-v^{2}/c^{2}}}}.}\n  \n\n\n\nNewton's second law, with mass fixed, is not invariant under a Lorentz transformation. However, it can be made invariant by making the inertial mass m of an object a function of velocity:\n\n\n\t\n  \n    \n      \n        m\n        =\n        γ\n        \n          m\n          \n            0\n          \n        \n        \n        ;\n      \n    \n    {\\displaystyle m=\\gamma m_{0}\\,;}\n  \n\n\n\nm0 is the object's invariant mass.[19]\n\nThe modified momentum,\n\n\n\t\n  \n    \n      \n        \n          p\n        \n        =\n        γ\n        \n          m\n          \n            0\n          \n        \n        \n          v\n        \n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {p} =\\gamma m_{0}\\mathbf {v} \\,,}\n  \n\n\n\nobeys Newton's second law:\n\n\n\t\n  \n    \n      \n        \n          F\n        \n        =\n        \n          \n            \n              d\n              \n                p\n              \n            \n            \n              d\n              t\n            \n          \n        \n        \n        .\n      \n    \n    {\\displaystyle \\mathbf {F} ={\\frac {d\\mathbf {p} }{dt}}\\,.}\n  \n\n\n\nWithin the domain of classical mechanics, relativistic momentum closely approximates Newtonian momentum: at low velocity, γm0v is approximately equal to m0v, the Newtonian expression for momentum.\n\n\nFour-vector formulation[edit]\n\nMain article: Four-momentum\n\nIn the theory of special relativity, physical quantities are expressed in terms of four-vectors that include time as a fourth coordinate along with the three space coordinates. These vectors are generally represented by capital letters, for example R for position. The expression for the four-momentum depends on how the coordinates are expressed. Time may be given in its normal units or multiplied by the speed of light so that all the components of the four-vector have dimensions of length. If the latter scaling is used, an interval of proper time, τ, defined by[20]\n\n\n\t\n  \n    \n      \n        \n          c\n          \n            2\n          \n        \n        d\n        \n          τ\n          \n            2\n          \n        \n        =\n        \n          c\n          \n            2\n          \n        \n        d\n        \n          t\n          \n            2\n          \n        \n        −\n        d\n        \n          x\n          \n            2\n          \n        \n        −\n        d\n        \n          y\n          \n            2\n          \n        \n        −\n        d\n        \n          z\n          \n            2\n          \n        \n        \n        ,\n      \n    \n    {\\displaystyle c^{2}d\\tau ^{2}=c^{2}dt^{2}-dx^{2}-dy^{2}-dz^{2}\\,,}\n  \n\n\n\nis invariant under Lorentz transformations (in this expression and in what follows the (+ − − −) metric signature has been used, different authors use different conventions). Mathematically this invariance can be ensured in one of two ways: by treating the four-vectors as Euclidean vectors and multiplying time by √−1; or by keeping time a real quantity and embedding the vectors in a Minkowski space.[21] In a Minkowski space, the scalar product of two four-vectors U = (U0,U1,U2,U3) and V = (V0,V1,V2,V3) is defined as\n\n\n\t\n  \n    \n      \n        \n          U\n        \n        ⋅\n        \n          V\n        \n        =\n        \n          U\n          \n            0\n          \n        \n        \n          V\n          \n            0\n          \n        \n        −\n        \n          U\n          \n            1\n          \n        \n        \n          V\n          \n            1\n          \n        \n        −\n        \n          U\n          \n            2\n          \n        \n        \n          V\n          \n            2\n          \n        \n        −\n        \n          U\n          \n            3\n          \n        \n        \n          V\n          \n            3\n          \n        \n        \n        .\n      \n    \n    {\\displaystyle \\mathbf {U} \\cdot \\mathbf {V} =U_{0}V_{0}-U_{1}V_{1}-U_{2}V_{2}-U_{3}V_{3}\\,.}\n  \n\n\n\nIn all the coordinate systems, the (contravariant) relativistic four-velocity is defined by\n\n\n\t\n  \n    \n      \n        \n          U\n        \n        ≡\n        \n          \n            \n              d\n              \n                R\n              \n            \n            \n              d\n              τ\n            \n          \n        \n        =\n        γ\n        \n          \n            \n              d\n              \n                R\n              \n            \n            \n              d\n              t\n            \n          \n        \n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {U} \\equiv {\\frac {d\\mathbf {R} }{d\\tau }}=\\gamma {\\frac {d\\mathbf {R} }{dt}}\\,,}\n  \n\n\n\nand the (contravariant) four-momentum is\n\n\n\t\n  \n    \n      \n        \n          P\n        \n        =\n        \n          m\n          \n            0\n          \n        \n        \n          U\n        \n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {P} =m_{0}\\mathbf {U} \\,,}\n  \n\n\n\nwhere m0 is the invariant mass. If R = (ct,x,y,z) (in Minkowski space), then\n\n\n\t\n  \n    \n      \n        \n          P\n        \n        =\n        γ\n        \n          m\n          \n            0\n          \n        \n        \n          (\n          \n            c\n            ,\n            \n              v\n            \n          \n          )\n        \n        =\n        (\n        m\n        c\n        ,\n        \n          p\n        \n        )\n        \n        .\n      \n    \n    {\\displaystyle \\mathbf {P} =\\gamma m_{0}\\left(c,\\mathbf {v} \\right)=(mc,\\mathbf {p} )\\,.}\n  \n\n\n\nUsing Einstein's mass-energy equivalence, E = mc2, this can be rewritten as\n\n\n\t\n  \n    \n      \n        \n          P\n        \n        =\n        \n          (\n          \n            \n              \n                E\n                c\n              \n            \n            ,\n            \n              p\n            \n          \n          )\n        \n        \n        .\n      \n    \n    {\\displaystyle \\mathbf {P} =\\left({\\frac {E}{c}},\\mathbf {p} \\right)\\,.}\n  \n\n\n\nThus, conservation of four-momentum is Lorentz-invariant and implies conservation of both mass and energy.\n\nThe magnitude of the momentum four-vector is equal to m0c:\n\n\n\t\n  \n    \n      \n        \n          |\n        \n        \n          |\n        \n        \n          P\n        \n        \n          |\n        \n        \n          \n            |\n          \n          \n            2\n          \n        \n        =\n        \n          P\n        \n        ⋅\n        \n          P\n        \n        =\n        \n          γ\n          \n            2\n          \n        \n        \n          m\n          \n            0\n          \n          \n            2\n          \n        \n        (\n        \n          c\n          \n            2\n          \n        \n        −\n        \n          v\n          \n            2\n          \n        \n        )\n        =\n        (\n        \n          m\n          \n            0\n          \n        \n        c\n        \n          )\n          \n            2\n          \n        \n        \n        ,\n      \n    \n    {\\displaystyle ||\\mathbf {P} ||^{2}=\\mathbf {P} \\cdot \\mathbf {P} =\\gamma ^{2}m_{0}^{2}(c^{2}-v^{2})=(m_{0}c)^{2}\\,,}\n  \n\n\n\nand is invariant across all reference frames.\n\nThe relativistic energy–momentum relationship holds even for massless particles such as photons; by setting m0 = 0 it follows that\n\n\n\t\n  \n    \n      \n        E\n        =\n        p\n        c\n        \n        .\n      \n    \n    {\\displaystyle E=pc\\,.}\n  \n\n\n\nIn a game of relativistic \"billiards\", if a stationary particle is hit by a moving particle in an elastic collision, the paths formed by the two afterwards will form an acute angle. This is unlike the non-relativistic case where they travel at right angles.[22]\n\nThe four-momentum of a planar wave can be related to a wave four-vector[23]\n\n\n\t\n  \n    \n      \n        \n          P\n        \n        =\n        \n          (\n          \n            \n              \n                E\n                c\n              \n            \n            ,\n            \n              \n                \n                  \n                    p\n                  \n                  →\n                \n              \n            \n          \n          )\n        \n        =\n        ℏ\n        \n          K\n        \n        =\n        ℏ\n        \n          (\n          \n            \n              \n                ω\n                c\n              \n            \n            ,\n            \n              \n                \n                  \n                    k\n                  \n                  →\n                \n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle \\mathbf {P} =\\left({\\frac {E}{c}},{\\vec {\\mathbf {p} }}\\right)=\\hbar \\mathbf {K} =\\hbar \\left({\\frac {\\omega }{c}},{\\vec {\\mathbf {k} }}\\right)}\n  \n\n\n\nFor a particle, the relationship between temporal components,  E = ħ ω, is the Planck–Einstein relation, and the relation between spatial components, p= ħ k, describes a de Broglie matter wave.\n\n\nGeneralized[edit]\n\nSee also: Analytical mechanics\n\nNewton's laws can be difficult to apply to many kinds of motion because the motion is limited by constraints. For example, a bead on an abacus is constrained to move along its wire and a pendulum bob is constrained to swing at a fixed distance from the pivot. Many such constraints can be incorporated by changing the normal Cartesian coordinates to a set of generalized coordinates that may be fewer in number.[24] Refined mathematical methods have been developed for solving mechanics problems in generalized coordinates. They introduce a generalized momentum, also known as the canonical or conjugate momentum, that extends the concepts of both linear momentum and angular momentum. To distinguish it from generalized momentum, the product of mass and velocity is also referred to as mechanical, kinetic or kinematic momentum.[6][25][26] The two main methods are described below.\n\n\nLagrangian mechanics[edit]\n\nIn Lagrangian mechanics, a Lagrangian is defined as the difference between the kinetic energy T and the potential energy V:\n\n\n\t\n  \n    \n      \n        \n          \n            L\n          \n        \n        =\n        T\n        −\n        V\n        \n        .\n      \n    \n    {\\displaystyle {\\mathcal {L}}=T-V\\,.}\n  \n\n\n\nIf the generalized coordinates are represented as a vector q = (q1, q2, ... , qN)  and time differentiation is represented by a dot over the variable, then the equations of motion (known as the Lagrange or Euler–Lagrange equations) are a set of N equations:[27]\n\n\n\t\n  \n    \n      \n        \n          \n            d\n            \n              d\n              t\n            \n          \n        \n        \n          (\n          \n            \n              \n                ∂\n                \n                  \n                    L\n                  \n                \n              \n              \n                ∂\n                \n                  \n                    \n                      \n                        q\n                        ˙\n                      \n                    \n                  \n                  \n                    j\n                  \n                \n              \n            \n          \n          )\n        \n        −\n        \n          \n            \n              ∂\n              \n                \n                  L\n                \n              \n            \n            \n              ∂\n              \n                q\n                \n                  j\n                \n              \n            \n          \n        \n        =\n        0\n        \n        .\n      \n    \n    {\\displaystyle {\\frac {d}{dt}}\\left({\\frac {\\partial {\\mathcal {L}}}{\\partial {\\dot {q}}_{j}}}\\right)-{\\frac {\\partial {\\mathcal {L}}}{\\partial q_{j}}}=0\\,.}\n  \n\n\n\nIf a coordinate qi is not a Cartesian coordinate, the associated generalized momentum component pi does not necessarily have the dimensions of linear momentum. Even if qi is a Cartesian coordinate, pi will not be the same as the mechanical momentum if the potential depends on velocity.[6]  Some sources represent the kinematic momentum by the symbol Π.[28]\n\nIn this mathematical framework, a generalized momentum is associated with the generalized coordinates. Its components are defined as\n\n\n\t\n  \n    \n      \n        \n          p\n          \n            j\n          \n        \n        =\n        \n          \n            \n              ∂\n              \n                \n                  L\n                \n              \n            \n            \n              ∂\n              \n                \n                  \n                    \n                      q\n                      ˙\n                    \n                  \n                \n                \n                  j\n                \n              \n            \n          \n        \n        \n        .\n      \n    \n    {\\displaystyle p_{j}={\\frac {\\partial {\\mathcal {L}}}{\\partial {\\dot {q}}_{j}}}\\,.}\n  \n\n\n\nEach component pj is said to be the conjugate momentum for the coordinate qj.\n\nNow if a given coordinate qi does not appear in the Lagrangian (although its time derivative might appear), then\n\n\n\t\n  \n    \n      \n        \n          p\n          \n            j\n          \n        \n        =\n        \n          constant\n        \n        \n        .\n      \n    \n    {\\displaystyle p_{j}={\\text{constant}}\\,.}\n  \n\n\n\nThis is the generalization of the conservation of momentum.[6]\n\nEven if the generalized coordinates are just the ordinary spatial coordinates, the conjugate momenta are not necessarily the ordinary momentum coordinates. An example is found in the section on electromagnetism.\n\n\nHamiltonian mechanics[edit]\n\nIn Hamiltonian mechanics, the Lagrangian (a function of generalized coordinates and their derivatives) is replaced by a Hamiltonian that is a function of generalized coordinates and momentum. The Hamiltonian is defined as\n\n\n\t\n  \n    \n      \n        \n          \n            H\n          \n        \n        \n          (\n          \n            \n              q\n            \n            ,\n            \n              p\n            \n            ,\n            t\n          \n          )\n        \n        =\n        \n          p\n        \n        ⋅\n        \n          \n            \n              \n                q\n              \n              ˙\n            \n          \n        \n        −\n        \n          \n            L\n          \n        \n        \n          (\n          \n            \n              q\n            \n            ,\n            \n              \n                \n                  \n                    q\n                  \n                  ˙\n                \n              \n            \n            ,\n            t\n          \n          )\n        \n        \n        ,\n      \n    \n    {\\displaystyle {\\mathcal {H}}\\left(\\mathbf {q} ,\\mathbf {p} ,t\\right)=\\mathbf {p} \\cdot {\\dot {\\mathbf {q} }}-{\\mathcal {L}}\\left(\\mathbf {q} ,{\\dot {\\mathbf {q} }},t\\right)\\,,}\n  \n\n\n\nwhere the momentum is obtained by differentiating the Lagrangian as above. The Hamiltonian equations of motion are[29]\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  \n                    \n                      \n                        q\n                        ˙\n                      \n                    \n                  \n                  \n                    i\n                  \n                \n              \n              \n                \n                =\n                \n                  \n                    \n                      ∂\n                      \n                        \n                          H\n                        \n                      \n                    \n                    \n                      ∂\n                      \n                        p\n                        \n                          i\n                        \n                      \n                    \n                  \n                \n              \n            \n            \n              \n                −\n                \n                  \n                    \n                      \n                        p\n                        ˙\n                      \n                    \n                  \n                  \n                    i\n                  \n                \n              \n              \n                \n                =\n                \n                  \n                    \n                      ∂\n                      \n                        \n                          H\n                        \n                      \n                    \n                    \n                      ∂\n                      \n                        q\n                        \n                          i\n                        \n                      \n                    \n                  \n                \n              \n            \n            \n              \n                −\n                \n                  \n                    \n                      ∂\n                      \n                        \n                          L\n                        \n                      \n                    \n                    \n                      ∂\n                      t\n                    \n                  \n                \n              \n              \n                \n                =\n                \n                  \n                    \n                      d\n                      \n                        \n                          H\n                        \n                      \n                    \n                    \n                      d\n                      t\n                    \n                  \n                \n                \n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}{\\dot {q}}_{i}&={\\frac {\\partial {\\mathcal {H}}}{\\partial p_{i}}}\\\\-{\\dot {p}}_{i}&={\\frac {\\partial {\\mathcal {H}}}{\\partial q_{i}}}\\\\-{\\frac {\\partial {\\mathcal {L}}}{\\partial t}}&={\\frac {d{\\mathcal {H}}}{dt}}\\,.\\end{aligned}}}\n  \n\n\n\nAs in Lagrangian mechanics, if a generalized coordinate does not appear in the Hamiltonian, its conjugate momentum component is conserved.[30]\n\n\nSymmetry and conservation[edit]\n\nConservation of momentum is a mathematical consequence of the homogeneity (shift symmetry) of space (position in space is the canonical conjugate quantity to momentum). That is, conservation of momentum is a consequence of the fact that the laws of physics do not depend on position; this is a special case of Noether's theorem.[31]\n\n\nElectromagnetic[edit]\n\nParticle in a field[edit]\n\nIn Maxwell's equations, the forces between particles are mediated by electric and magnetic fields. The electromagnetic force (Lorentz force) on a particle with charge q due to a combination of electric field E and magnetic field B is\n\n\n\t\n  \n    \n      \n        \n          F\n        \n        =\n        q\n        (\n        \n          E\n        \n        +\n        \n          v\n        \n        ×\n        \n          B\n        \n        )\n        .\n      \n    \n    {\\displaystyle \\mathbf {F} =q(\\mathbf {E} +\\mathbf {v} \\times \\mathbf {B} ).}\n  \n\n\n\n(in SI units).[32]:2\nIt has an electric potential φ(r, t) and magnetic vector potential A(r, t).[28]\nIn the non-relativistic regime, its generalized momentum is\n\n\n\t\n  \n    \n      \n        \n          P\n        \n        =\n        m\n        \n          \n            v\n          \n        \n        +\n        q\n        \n          A\n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {P} =m\\mathbf {\\mathbf {v} } +q\\mathbf {A} ,}\n  \n\n\n\nwhile in relativistic mechanics this becomes\n\n\n\t\n  \n    \n      \n        \n          P\n        \n        =\n        γ\n        m\n        \n          \n            v\n          \n        \n        +\n        q\n        \n          A\n        \n        .\n      \n    \n    {\\displaystyle \\mathbf {P} =\\gamma m\\mathbf {\\mathbf {v} } +q\\mathbf {A} .}\n  \n\n\n\nConservation[edit]\n\nIn Newtonian mechanics, the law of conservation of momentum can be derived from the law of action and reaction, which states that every force has a reciprocating equal and opposite force. Under some circumstances, moving charged particles can exert forces on each other in non-opposite directions.[33] Nevertheless, the combined momentum of the particles and the electromagnetic field is conserved.\n\n\nVacuum[edit]\n\nThe Lorentz force imparts a momentum to the particle, so by Newton's second law the particle must impart a momentum to the electromagnetic fields.[34]\n\nIn a vacuum, the momentum per unit volume is\n\n\n\t\n  \n    \n      \n        \n          g\n        \n        =\n        \n          \n            1\n            \n              \n                μ\n                \n                  0\n                \n              \n              \n                c\n                \n                  2\n                \n              \n            \n          \n        \n        \n          E\n        \n        ×\n        \n          B\n        \n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {g} ={\\frac {1}{\\mu _{0}c^{2}}}\\mathbf {E} \\times \\mathbf {B} \\,,}\n  \n\n\n\nwhere μ0 is the vacuum permeability and c is the speed of light. The momentum density is proportional to the Poynting vector S which gives the directional rate of energy transfer per unit area:[34][35]\n\n\n\t\n  \n    \n      \n        \n          g\n        \n        =\n        \n          \n            \n              S\n            \n            \n              c\n              \n                2\n              \n            \n          \n        \n        \n        .\n      \n    \n    {\\displaystyle \\mathbf {g} ={\\frac {\\mathbf {S} }{c^{2}}}\\,.}\n  \n\n\n\nIf momentum is to be conserved over the volume V over a region Q, changes in the momentum of matter through the Lorentz force must be balanced by changes in the momentum of the electromagnetic field and outflow of momentum. If Pmech is the momentum of all the particles in Q, and the particles are treated as a continuum, then Newton's second law gives\n\n\n\t\n  \n    \n      \n        \n          \n            \n              d\n              \n                \n                  P\n                \n                \n                  mech\n                \n              \n            \n            \n              d\n              t\n            \n          \n        \n        =\n        \n          ∭\n          \n            Q\n          \n        \n        \n          (\n          \n            ρ\n            \n              E\n            \n            +\n            \n              J\n            \n            ×\n            \n              B\n            \n          \n          )\n        \n        d\n        V\n        \n        .\n      \n    \n    {\\displaystyle {\\frac {d\\mathbf {P} _{\\text{mech}}}{dt}}=\\iiint \\limits _{Q}\\left(\\rho \\mathbf {E} +\\mathbf {J} \\times \\mathbf {B} \\right)dV\\,.}\n  \n\n\n\nThe electromagnetic momentum is\n\n\n\t\n  \n    \n      \n        \n          \n            P\n          \n          \n            field\n          \n        \n        =\n        \n          \n            1\n            \n              \n                μ\n                \n                  0\n                \n              \n              \n                c\n                \n                  2\n                \n              \n            \n          \n        \n        \n          ∭\n          \n            Q\n          \n        \n        \n          E\n        \n        ×\n        \n          B\n        \n        \n        d\n        V\n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {P} _{\\text{field}}={\\frac {1}{\\mu _{0}c^{2}}}\\iiint \\limits _{Q}\\mathbf {E} \\times \\mathbf {B} \\,dV\\,,}\n  \n\n\n\nand the equation for conservation of each component i of the momentum is\n\n\n\t\n  \n    \n      \n        \n          \n            d\n            \n              d\n              t\n            \n          \n        \n        \n          \n            (\n            \n              \n                \n                  P\n                \n                \n                  mech\n                \n              \n              +\n              \n                \n                  P\n                \n                \n                  field\n                \n              \n            \n            )\n          \n          \n            i\n          \n        \n        =\n        \n          ∬\n          \n            σ\n          \n        \n        \n          (\n          \n            \n              ∑\n              \n                j\n              \n            \n            \n              T\n              \n                i\n                j\n              \n            \n            \n              n\n              \n                j\n              \n            \n          \n          )\n        \n        d\n        Σ\n        \n        .\n      \n    \n    {\\displaystyle {\\frac {d}{dt}}\\left(\\mathbf {P} _{\\text{mech}}+\\mathbf {P} _{\\text{field}}\\right)_{i}=\\iint \\limits _{\\sigma }\\left(\\sum \\limits _{j}T_{ij}n_{j}\\right)d\\Sigma \\,.}\n  \n\n\n\nThe term on the right is an integral over the surface area Σ of the surface σ representing momentum flow into and out of the volume, and nj is a component of the surface normal of S. The quantity Tij is called the Maxwell stress tensor, defined as\n\n\n\t\n  \n    \n      \n        \n          T\n          \n            i\n            j\n          \n        \n        ≡\n        \n          ϵ\n          \n            0\n          \n        \n        \n          (\n          \n            \n              E\n              \n                i\n              \n            \n            \n              E\n              \n                j\n              \n            \n            −\n            \n              \n                1\n                2\n              \n            \n            \n              δ\n              \n                i\n                j\n              \n            \n            \n              E\n              \n                2\n              \n            \n          \n          )\n        \n        +\n        \n          \n            1\n            \n              μ\n              \n                0\n              \n            \n          \n        \n        \n          (\n          \n            \n              B\n              \n                i\n              \n            \n            \n              B\n              \n                j\n              \n            \n            −\n            \n              \n                1\n                2\n              \n            \n            \n              δ\n              \n                i\n                j\n              \n            \n            \n              B\n              \n                2\n              \n            \n          \n          )\n        \n        \n        .\n      \n    \n    {\\displaystyle T_{ij}\\equiv \\epsilon _{0}\\left(E_{i}E_{j}-{\\frac {1}{2}}\\delta _{ij}E^{2}\\right)+{\\frac {1}{\\mu _{0}}}\\left(B_{i}B_{j}-{\\frac {1}{2}}\\delta _{ij}B^{2}\\right)\\,.}\n  \n[34]\n\n\nMedia[edit]\n\nThe above results are for the microscopic Maxwell equations, applicable to electromagnetic forces in a vacuum (or on a very small scale in media). It is more difficult to define momentum density in media because the division into electromagnetic and mechanical is arbitrary. The definition of electromagnetic momentum density is modified to\n\n\n\t\n  \n    \n      \n        \n          g\n        \n        =\n        \n          \n            1\n            \n              c\n              \n                2\n              \n            \n          \n        \n        \n          E\n        \n        ×\n        \n          H\n        \n        =\n        \n          \n            \n              S\n            \n            \n              c\n              \n                2\n              \n            \n          \n        \n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {g} ={\\frac {1}{c^{2}}}\\mathbf {E} \\times \\mathbf {H} ={\\frac {\\mathbf {S} }{c^{2}}}\\,,}\n  \n\n\n\nwhere the H-field H is related to the B-field and the magnetization M by\n\n\n\t\n  \n    \n      \n        \n          B\n        \n        =\n        \n          μ\n          \n            0\n          \n        \n        \n          (\n          \n            \n              H\n            \n            +\n            \n              M\n            \n          \n          )\n        \n        \n        .\n      \n    \n    {\\displaystyle \\mathbf {B} =\\mu _{0}\\left(\\mathbf {H} +\\mathbf {M} \\right)\\,.}\n  \n\n\n\nThe electromagnetic stress tensor depends on the properties of the media.[34]\n\n\nQuantum mechanical[edit]\n\nFurther information: Momentum operator\n\nIn quantum mechanics, momentum is defined as a self-adjoint operator on the wave function. The Heisenberg uncertainty principle defines limits on how accurately the momentum and position of a single observable system can be known at once. In quantum mechanics, position and momentum are conjugate variables.\n\nFor a single particle described in the position basis the momentum operator can be written as\n\n\n\t\n  \n    \n      \n        \n          p\n        \n        =\n        \n          \n            ℏ\n            i\n          \n        \n        ∇\n        =\n        −\n        i\n        ℏ\n        ∇\n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {p} ={\\hbar  \\over i}\\nabla =-i\\hbar \\nabla \\,,}\n  \n\n\n\nwhere ∇ is the gradient operator, ħ is the reduced Planck constant, and i is the imaginary unit. This is a commonly encountered form of the momentum operator, though the momentum operator in other bases can take other forms. For example, in momentum space the momentum operator is represented as\n\n\n\t\n  \n    \n      \n        \n          p\n        \n        ψ\n        (\n        p\n        )\n        =\n        p\n        ψ\n        (\n        p\n        )\n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {p} \\psi (p)=p\\psi (p)\\,,}\n  \n\n\n\nwhere the operator p acting on a wave function ψ(p) yields that wave function multiplied by the value p, in an analogous fashion to the way that the position operator acting on a wave function ψ(x) yields that wave function multiplied by the value x.\n\nFor both massive and massless objects, relativistic momentum is related to the phase constant  \n  \n    \n      \n        β\n      \n    \n    {\\displaystyle \\beta }\n  \n  by[36]\n\n\n\t\n  \n    \n      \n        p\n        =\n        ℏ\n        β\n      \n    \n    {\\displaystyle p=\\hbar \\beta }\n  \n\n\n\nElectromagnetic radiation (including visible light, ultraviolet light, and radio waves) is carried by photons. Even though photons (the particle aspect of light) have no mass, they still carry momentum. This leads to applications such as the solar sail. The calculation of the momentum of light within dielectric media is somewhat controversial (see Abraham–Minkowski controversy).[37][38]\n\n\nIn deformable bodies and fluids[edit]\n\nConservation in a continuum[edit]\n\nMain article: Cauchy momentum equation\n\n  \nMotion of a material body\n\n\n\nIn fields such as fluid dynamics and solid mechanics, it is not feasible to follow the motion of individual atoms or molecules. Instead, the materials must be approximated by a continuum in which there is a particle or fluid parcel at each point that is assigned the average of the properties of atoms in a small region nearby. In particular, it has a density ρ and velocity v that depend on time t and position r. The momentum per unit volume is ρv.[39]\n\nConsider a column of water in hydrostatic equilibrium. All the forces on the water are in balance and the water is motionless. On any given drop of water, two forces are balanced. The first is gravity, which acts directly on each atom and molecule inside. The gravitational force per unit volume is ρg, where g is the gravitational acceleration. The second force is the sum of all the forces exerted on its surface by the surrounding water. The force from below is greater than the force from above by just the amount needed to balance gravity. The normal force per unit area is the pressure p. The average force per unit volume inside the droplet is the gradient of the pressure, so the force balance equation is[40]\n\n\n\t\n  \n    \n      \n        −\n        ∇\n        p\n        +\n        ρ\n        \n          g\n        \n        =\n        0\n        \n        .\n      \n    \n    {\\displaystyle -\\nabla p+\\rho \\mathbf {g} =0\\,.}\n  \n\n\n\nIf the forces are not balanced, the droplet accelerates. This acceleration is not simply the partial derivative ∂v/∂t because the fluid in a given volume changes with time. Instead, the material derivative is needed:[41]\n\n\n\t\n  \n    \n      \n        \n          \n            D\n            \n              D\n              t\n            \n          \n        \n        ≡\n        \n          \n            ∂\n            \n              ∂\n              t\n            \n          \n        \n        +\n        \n          v\n        \n        ⋅\n        \n          ∇\n        \n        \n        .\n      \n    \n    {\\displaystyle {\\frac {D}{Dt}}\\equiv {\\frac {\\partial }{\\partial t}}+\\mathbf {v} \\cdot {\\boldsymbol {\\nabla }}\\,.}\n  \n\n\n\nApplied to any physical quantity, the material derivative includes the rate of change at a point and the changes due to advection as fluid is carried past the point. Per unit volume, the rate of change in momentum is equal to ρDv/Dt. This is equal to the net force on the droplet.\n\nForces that can change the momentum of a droplet include the gradient of the pressure and gravity, as above. In addition, surface forces can deform the droplet. In the simplest case, a shear stress τ, exerted by a force parallel to the surface of the droplet, is proportional to the rate of deformation or strain rate. Such a shear stress occurs if the fluid has a velocity gradient because the fluid is moving faster on one side than another. If the speed in the x direction varies with z, the  tangential force in direction x per unit area normal to the z direction is\n\n\n\t\n  \n    \n      \n        \n          σ\n          \n            zx\n          \n        \n        =\n        −\n        μ\n        \n          \n            \n              ∂\n              \n                v\n                \n                  x\n                \n              \n            \n            \n              ∂\n              z\n            \n          \n        \n        \n        ,\n      \n    \n    {\\displaystyle \\sigma _{\\text{zx}}=-\\mu {\\frac {\\partial v_{x}}{\\partial z}}\\,,}\n  \n\n\n\nwhere μ is the viscosity. This is also a flux, or flow per unit area, of x-momentum through the surface.[42]\n\nIncluding the effect of viscosity, the momentum balance equations for the incompressible flow of a Newtonian fluid are\n\n\n\t\n  \n    \n      \n        ρ\n        \n          \n            \n              D\n              \n                v\n              \n            \n            \n              D\n              t\n            \n          \n        \n        =\n        −\n        \n          ∇\n        \n        p\n        +\n        μ\n        \n          ∇\n          \n            2\n          \n        \n        \n          v\n        \n        +\n        ρ\n        \n          g\n        \n        .\n        \n      \n    \n    {\\displaystyle \\rho {\\frac {D\\mathbf {v} }{Dt}}=-{\\boldsymbol {\\nabla }}p+\\mu \\nabla ^{2}\\mathbf {v} +\\rho \\mathbf {g} .\\,}\n  \n\n\n\nThese are known as the Navier–Stokes equations.[43]\n\nThe momentum balance equations can be extended to more general materials, including solids. For each surface with normal in direction i and force in direction j, there is a stress component σij. The nine components make up the Cauchy stress tensor σ, which includes both pressure and shear. The local conservation of momentum is expressed by the Cauchy momentum equation:\n\n\n\t\n  \n    \n      \n        ρ\n        \n          \n            \n              D\n              \n                v\n              \n            \n            \n              D\n              t\n            \n          \n        \n        =\n        \n          ∇\n        \n        ⋅\n        \n          σ\n        \n        +\n        \n          f\n        \n        \n        ,\n      \n    \n    {\\displaystyle \\rho {\\frac {D\\mathbf {v} }{Dt}}={\\boldsymbol {\\nabla }}\\cdot {\\boldsymbol {\\sigma }}+\\mathbf {f} \\,,}\n  \n\n\n\nwhere f is the body force.[44]\n\nThe Cauchy momentum equation is broadly applicable to deformations of solids and liquids. The relationship between the stresses and the strain rate depends on the properties of the material (see Types of viscosity).\n\n\nAcoustic waves[edit]\n\nA disturbance in a medium gives rise to oscillations, or waves, that propagate away from their source. In a fluid, small changes in pressure p can often be described by the acoustic wave equation:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                ∂\n                \n                  2\n                \n              \n              p\n            \n            \n              ∂\n              \n                t\n                \n                  2\n                \n              \n            \n          \n        \n        =\n        \n          c\n          \n            2\n          \n        \n        \n          ∇\n          \n            2\n          \n        \n        p\n        \n        ,\n      \n    \n    {\\displaystyle {\\frac {\\partial ^{2}p}{\\partial t^{2}}}=c^{2}\\nabla ^{2}p\\,,}\n  \n\n\n\nwhere c is the speed of sound. In a solid, similar equations can be obtained for propagation of pressure (P-waves) and shear (S-waves).[45]\n\nThe flux, or transport per unit area, of a momentum component ρvj by a velocity vi is equal to ρ vjvj. In the linear approximation that leads to the above acoustic equation, the time average of this flux is zero. However, nonlinear effects can give rise to a nonzero average.[46] It is possible for momentum flux to occur even though the wave itself does not have a mean momentum.[47]\n\n\nHistory of the concept[edit]\n\nSee also: Theory of impetus\n\nIn about 530 AD, working in Alexandria, Byzantine philosopher John Philoponus developed a concept of momentum in his commentary to Aristotle's Physics. Aristotle claimed that everything that is moving must be kept moving by something. For example, a thrown ball must be kept moving by motions of the air.  Most writers continued to accept Aristotle's theory until the time of Galileo, but a few were skeptical. Philoponus pointed out the absurdity in Aristotle's claim that motion of an object is promoted by the same air that is resisting its passage. He proposed instead that an impetus was imparted to the object in the act of throwing it.[48] Ibn Sīnā (also known by his Latinized name Avicenna) read Philoponus and published his own theory of motion in The Book of Healing in 1020. He agreed that an impetus is imparted to a projectile by the thrower; but unlike Philoponus, who believed that it was a temporary virtue that would decline even in a vacuum, he viewed it as a persistent, requiring external forces such as air resistance to dissipate it.[49][50][51]\nThe work of Philoponus, and possibly that of Ibn Sīnā,[51] was read and refined by the European philosophers Peter Olivi and Jean Buridan. Buridan, who in about 1350 was made rector of the University of Paris, referred to impetus being proportional to the weight times the speed. Moreover, Buridan's theory was different from his predecessor's in that he did not consider impetus to be self-dissipating, asserting that a body would be arrested by the forces of air resistance and gravity which might be opposing its impetus.[52][53]\n\nRené Descartes believed that the total \"quantity of motion\" (Latin: quantitas motus) in the universe is conserved,[54] where the quantity of motion is understood as the product of size and speed. This should not be read as a statement of the modern law of momentum, since he had no concept of mass as distinct from weight and size, and more importantly he believed that it is speed rather than velocity that is conserved. So for Descartes if a moving object were to bounce off a surface, changing its direction but not its speed, there would be no change in its quantity of motion.[55][56]  Galileo, in his Two New Sciences, used the Italian word impeto to similarly describe Descartes' quantity of motion.\n\nLeibniz, in his \"Discourse on Metaphysics\", gave an argument against Descartes' construction of the conservation of the \"quantity of motion\" using an example of dropping blocks of different sizes different distances.  He points out that force is conserved but quantity of motion, construed as the product of size and speed of an object, is not conserved.[57]\n\nThe first correct statement of the law of conservation of momentum was by English mathematician John Wallis in his 1670 work, Mechanica sive De Motu, Tractatus Geometricus: \"the initial state of the body, either of rest or of motion, will persist\" and \"If the force is greater than the resistance, motion will result\".[58] Wallis uses momentum and vis for force. Newton's Philosophiæ Naturalis Principia Mathematica, when it was first published in 1687, showed a similar casting around for words to use for the mathematical momentum. His Definition II defines quantitas motus, \"quantity of motion\", as \"arising from the velocity and quantity of matter conjointly\", which identifies it as momentum.[59] Thus when in Law II he refers to mutatio motus, \"change of motion\", being proportional to the force impressed, he is generally taken to mean momentum and not motion.[60] It remained only to assign a standard term to the quantity of motion. The first use of \"momentum\" in its proper mathematical sense is not clear but by the time of Jenning's Miscellanea in 1721, five years before the final edition of Newton's Principia Mathematica, momentum M or \"quantity of motion\" was being defined for students as \"a rectangle\", the product of Q and V, where Q is \"quantity of material\" and V is \"velocity\", s/t.[61]\n\n\nSee also[edit]\n\n\n\tPhysics portal\n\n\n\n\n\tCrystal momentum\n\tGalilean cannon\n\tMomentum transfer\n\tNewton's cradle\n\tPlanck momentum\n\tPosition and momentum space\n\n\n\n\nReferences[edit]\n\n\n\t^ a b c Feynman Vol. 1, Chapter 9\n\n\t^ Euler's Laws of Motion. Archived from the original on 2009-07-10. Retrieved 2009-03-30.\n\n\t^ McGill and King (1995). Engineering Mechanics, An Introduction to Dynamics (3rd ed.). PWS Publishing Company. ISBN 978-0-534-93399-9.\n\n\n\t^ a b c Feynman Vol. 1, Chapter 10\n\n\t^ Ho-Kim, Quang; Kumar, Narendra; Lam, Harry C.S. (2004). Invitation to Contemporary Physics (illustrated ed.). World Scientific. p. 19. ISBN 978-981-238-303-7.\n\n\n\t^ a b c d Goldstein 1980, pp. 54–56\n\n\t^ Goldstein 1980, p. 276\n\n\t^ Carl Nave (2010). \"Elastic and inelastic collisions\". Hyperphysics. Archived from the original on 18 August 2012. Retrieved 2 August 2012.\n\n\n\t^ Serway, Raymond A.; John W. Jewett, Jr (2012). Principles of physics : a calculus-based text (5th ed.). Boston, MA: Brooks/Cole, Cengage Learning. p. 245. ISBN 9781133104261.\n\n\n\t^ Carl Nave (2010). \"Forces in car crashes\". Hyperphysics. Archived from the original on 22 August 2012. Retrieved 2 August 2012.\n\n\n\t^ Carl Nave (2010). \"The Franck-Hertz Experiment\". Hyperphysics. Archived from the original on 16 July 2012. Retrieved 2 August 2012.\n\n\n\t^ McGinnis, Peter M. (2005). Biomechanics of sport and exercise (2nd ed.). Champaign, IL [u.a.]: Human Kinetics. p. 85. ISBN 9780736051019. Archived from the original on 2016-08-19.\n\n\n\t^ Sutton, George (2001), \"1\", Rocket Propulsion Elements (7th ed.), Chichester: John Wiley & Sons, ISBN 978-0-471-32642-7\n\n\n\t^ a b c Feynman Vol. 1, Chapter 11\n\n\t^ Rindler 1986, pp. 26–27\n\n\t^ a b Kleppner; Kolenkow. An Introduction to Mechanics. pp. 135–39.\n\n\n\t^ Rindler 1986, Chapter 2\n\n\t^ Feynman Vol. 1, Chapter 15-2\n\n\t^ Rindler 1986, pp. 77–81\n\n\t^ Rindler 1986, p. 66\n\n\t^ Misner, Charles W.; Kip S. Thorne; John Archibald Wheeler (1973). Gravitation. 24th printing. New York: W.H. Freeman. p. 51. ISBN 9780716703440.\n\n\n\t^ Rindler 1986, pp. 86–87\n\n\t^ Rindler, Wolfgang (1991). Introduction to Special Relativity (2nd ed.). Oxford Science Publications. pp. 82–84. ISBN 978-0-19-853952-0.\n\n\n\t^ Goldstein 1980, pp. 11–13\n\n\t^ Jackson 1975, p. 574\n\n\t^ Feynman Vol. 3, Chapter 21-3\n\n\t^ Goldstein 1980, pp. 20–21\n\n\t^ a b Lerner, Rita G.; Trigg, George L., eds. (2005). Encyclopedia of physics (3rd ed.). Weinheim: Wiley-VCH-Verl. ISBN 978-3527405541.\n\n\n\t^ Goldstein 1980, pp. 341–342\n\n\t^ Goldstein 1980, p. 348\n\n\t^ Hand, Louis N.; Finch, Janet D. (1998). Analytical mechanics (7th print ed.). Cambridge: Cambridge University Press. Chapter 4. ISBN 9780521575720.\n\n\n\t^ Jackson 1975\n\n\t^ Griffiths, David J. (2013). Introduction to electrodynamics (Fourth ed.). Boston: Pearson. p. 361. ISBN 978-0321856562.\n\n\n\t^ a b c d Jackson 1975, pp. 238–241 Expressions, given in Gaussian units in the text, were converted to SI units using Table 3 in the Appendix.\n\n\t^ Feynman Vol. 1, Chapter 27-6\n\n\t^ Z.Y.Wang (2016). \"Generalized momentum equation of quantum mechanics\". Optical and Quantum Electronics. 48 (2): 1–9. doi:10.1007/s11082-015-0261-8.\n\n\n\t^ Barnett, Stephen M. (2010). \"Resolution of the Abraham-Minkowski Dilemma\" (PDF). Physical Review Letters. 104 (7): 070401. Bibcode:2010PhRvL.104g0401B. doi:10.1103/PhysRevLett.104.070401. PMID 20366861.\n\n\n\t^ Wang Zhong-Yue; Wang Pin-Yu; Xu Yan-Rong (2011). \"Crucial experiment to resolve Abraham-Minkowski Controversy\". Optik. 122 (22): 1994–1996. arXiv:1103.3559. Bibcode:2011Optik.122.1994W. doi:10.1016/j.ijleo.2010.12.018.\n\n\n\t^ Tritton 2006, pp. 48–51\n\n\t^ Feynman Vol. 2, Chapter 40\n\n\t^ Tritton 2006, pp. 54\n\n\t^ Bird, R. Byron; Warren Stewart; Edwin N. Lightfoot (2007). Transport phenomena (2nd ed.). New York: Wiley. p. 13. ISBN 9780470115398.\n\n\n\t^ Tritton 2006, p. 58\n\n\t^ Acheson, D.J. (1990). Elementary Fluid Dynamics. Oxford University Press. p. 205. ISBN 978-0-19-859679-0.\n\n\n\t^ Gubbins, David (1992). Seismology and plate tectonics (Repr. (with corr.) ed.). Cambridge [England]: Cambridge University Press. p. 59. ISBN 978-0521379953.\n\n\n\t^ LeBlond, Paul H.; Mysak, Lawrence A. (1980). Waves in the ocean (2. impr. ed.). Amsterdam [u.a.]: Elsevier. p. 258. ISBN 9780444419262.\n\n\n\t^ McIntyre, M.E. (1981). \"On the 'wave momentum' myth\". J. Fluid Mech. 106: 331–347. Bibcode:1981JFM...106..331M. doi:10.1017/s0022112081001626.\n\n\n\t^ \"John Philoponus\". Stanford Encyclopedia of Philosophy. 8 June 2007. Retrieved 26 July 2012.\n\n\n\t^ Espinoza, Fernando (2005). \"An analysis of the historical development of ideas about motion and its implications for teaching\". Physics Education. 40 (2): 141. Bibcode:2005PhyEd..40..139E. doi:10.1088/0031-9120/40/2/002.\n\n\n\t^ Seyyed Hossein Nasr & Mehdi Amin Razavi (1996). The Islamic intellectual tradition in Persia. Routledge. p. 72. ISBN 978-0-7007-0314-2.\n\n\n\t^ a b Aydin Sayili (1987). \"Ibn Sīnā and Buridan on the Motion of the Projectile\". Annals of the New York Academy of Sciences. 500 (1): 477–482. Bibcode:1987NYASA.500..477S. doi:10.1111/j.1749-6632.1987.tb37219.x.\n\n\n\t^ T.F. Glick; S.J. Livesay; F. Wallis. \"Buridian, John\". Medieval Science, Technology and Medicine:an Encyclopedia. p. 107.\n\n\n\t^ Park, David (1990). The how and the why : an essay on the origins and development of physical theory. With drawings by Robin Brickman (3rd print ed.). Princeton, NJ: Princeton University Press. pp. 139–141. ISBN 9780691025087.\n\n\n\t^ Alexander Afriat, \"Cartesian and Lagrangian Momentum\" Archived 2017-03-09 at the Wayback Machine (2004).\n\n\t^ Daniel Garber (1992). \"Descartes' Physics\".  In John Cottingham (ed.). The Cambridge Companion to Descartes. Cambridge: Cambridge University Press. pp. 310–319. ISBN 978-0-521-36696-0.\n\n\n\t^ Rothman, Milton A. (1989). Discovering the natural laws : the experimental basis of physics (2nd ed.). New York: Dover Publications. pp. 83–88. ISBN 9780486261782.\n\n\n\t^ G.W. Leibniz (1989). \"Discourse on Metaphysics\".  In Roger Ariew; Daniel Garber (eds.). Philosophical Essays. Indianapolis, IN: Hackett Publishing Company, Inc. pp. 49–51. ISBN 978-0-87220-062-3.\n\n\n\t^ Scott, J.F. (1981). The Mathematical Work of John Wallis, D.D., F.R.S. Chelsea Publishing Company. p. 111. ISBN 978-0-8284-0314-6.\n\n\n\t^ Grimsehl, Ernst (1932). A Textbook of Physics. Translated by Leonard Ary Woodward. London & Glasgow: Blackie & Son limited. p. 78.\n\n\n\t^ Rescigno, Aldo (2003). Foundation of Pharmacokinetics. New York: Kluwer Academic/Plenum Publishers. p. 19. ISBN 978-0306477041.\n\n\n\t^ Jennings, John (1721). Miscellanea in Usum Juventutis Academicae. Northampton: R. Aikes & G. Dicey. p. 67.\n\n\n\n\n\n\nBibliography[edit]\n\n\n\tHalliday, David; Resnick, Robert. Fundamentals of Physics. John Wiley & Sons. Chapter 9.\n\n\tDugas, René (1988). A history of mechanics. Translated into English by J.R. Maddox (Dover ed.). New York: Dover Publications. ISBN 9780486656328.\n\n\tFeynman, Richard P.; Leighton, Robert B.; Sands, Matthew (2005). The Feynman lectures on physics, Volume 1: Mainly Mechanics, Radiation, and Heat (Definitive ed.). San Francisco: Pearson Addison-Wesley. ISBN 978-0805390469.\n\n\tFeynman, Richard P.; Leighton, Robert B.; Sands, Matthew (2006). The Feynman lectures on physics (Definitive ed.). San Francisco: Pearson Addison-Wesley. ISBN 978-0805390476.\n\n\tFeynman, Richard P.; Leighton, Robert B.; Sands, Matthew (2005). The Feynman lectures on physics, Volume III: Quantum Mechanics (Definitive ed.). New York: BasicBooks. ISBN 978-0805390490.\n\n\tGoldstein, Herbert (1980). Classical mechanics (2nd ed.). Reading, MA: Addison-Wesley Pub. Co. ISBN 978-0201029185.\n\n\tHand, Louis N.; Finch, Janet D. Analytical Mechanics. Cambridge University Press. Chapter 4.\n\n\tJackson, John David (1975). Classical electrodynamics (2nd ed.). New York: Wiley. ISBN 978-0471431329.\n\n\tJammer, Max (1999). Concepts of force : a study in the foundations of dynamics (Facsim ed.). Mineola, New York: Dover Publications. ISBN 9780486406893.\n\n\tLandau, L.D.; Lifshitz, E.M. (2000). The classical theory of fields. English edition, reprinted with corrections; translated from the Russian by Morton Hamermesh (4th ed.). Oxford: Butterworth Heinemann. ISBN 9780750627689.\n\n\tRindler, Wolfgang (1986). Essential Relativity : Special, general and cosmological (2nd ed.). New York: Springer. ISBN 978-0387100906.\n\n\tSerway, Raymond; Jewett, John (2003). Physics for Scientists and Engineers (6th ed.). Brooks Cole. ISBN 978-0-534-40842-8.\n\n\tStenger, Victor J. (2000). Timeless Reality: Symmetry, Simplicity, and Multiple Universes. Prometheus Books. pp. Chapter 12 in particular.\n\n\tTipler, Paul (1998). Physics for Scientists and Engineers: Vol. 1: Mechanics, Oscillations and Waves, Thermodynamics (4th ed.). W.H. Freeman. ISBN 978-1-57259-492-0.\n\n\tTritton, D.J. (2006). Physical fluid dynamics (2nd ed.). Oxford: Claredon Press. p. 58. ISBN 978-0198544937.\n\n\n\n\n\nExternal links[edit]\n\n\t\tLook up momentum in Wiktionary, the free dictionary.\n\n\n\tConservation of momentum – A chapter from an online textbook\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Momentum&oldid=916115331#Conservation\"\n\n\t\t\n\t\tCategories: \tPhysical quantities\n\tMechanics\n\tConservation laws\n\tMotion (physics)\n\tSI derived units\n\n\nHidden categories: \tWebarchive template wayback links\n\tUse American English from August 2016\n\tAll Wikipedia articles written in American English\n\tPages using deprecated image syntax\n\tWikipedia articles needing clarification from May 2019\n\tArticles containing Latin-language text\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tالعربية\n\tঅসমীয়া\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBosanski\n\tБуряад\n\tCatalà\n\tЧӑвашла\n\tČeština\n\tChiShona\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tFrysk\n\tGaeilge\n\tGalego\n\tગુજરાતી\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tJawa\n\tಕನ್ನಡ\n\tქართული\n\tҚазақша\n\tKreyòl ayisyen\n\tLatviešu\n\tLietuvių\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tМонгол\n\tမြန်မာဘာသာ\n\tNederlands\n\tनेपाली\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tPiemontèis\n\tPlattdüütsch\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tShqip\n\tසිංහල\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tТатарча/tatarça\n\tతెలుగు\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t文言\n\t吴语\n\tייִדיש\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 17 September 2019, at 03:08 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "12", "dc:title": "Momentum - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Billard.JPG/1200px-Billard.JPG", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-conservation_of_momentum", "title": "Momentum - Wikipedia"}}