{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCosmic ray - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tCosmic ray\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Cosmic radiation)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\"Cosmic radiation\" redirects here. For some other types of cosmic radiation, see Cosmic background radiation and Cosmic background (disambiguation). For the film, see Cosmic Ray (film).\n\nHigh-energy particle, mainly originating outside the Solar system\n\n\n\n\n  \nCosmic flux versus particle energy\n\n\n\nCosmic rays are high-energy protons and atomic nuclei which move through space at nearly the speed of light. They originate from the sun, from outside of the solar system,[1] or even from distant galaxies.[2] Upon impact with the Earth's atmosphere, cosmic rays can produce showers of secondary particles that sometimes reach the surface. Data from the Fermi Space Telescope (2013)[3] have been interpreted as evidence that a significant fraction of primary cosmic rays originate from the supernova explosions of stars.[4] Active galactic nuclei also appear to produce cosmic rays, based on observations of neutrinos and gamma rays from blazar TXS 0506+056 in 2018.[5][6]\n\n\nContents\n\n\n\t1 Etymology\n\t2 Composition\n\t3 Energy\n\t4 History\n\t4.1 Discovery\n\t4.2 Identification\n\t4.3 Energy distribution\n\n\n\n\t5 Sources\n\t6 Types\n\t6.1 Primary cosmic rays\n\t6.1.1 Primary cosmic ray antimatter\n\n\n\n\t6.2 Secondary cosmic rays\n\t6.3 Cosmic-ray flux\n\n\n\n\t7 Detection methods\n\t7.1 Direct detection\n\t7.2 Indirect detection\n\n\n\n\t8 Effects\n\t8.1 Changes in atmospheric chemistry\n\t8.2 Role in ambient radiation\n\t8.3 Effect on electronics\n\t8.4 Significance to aerospace travel\n\t8.5 Role in lightning\n\t8.6 Postulated role in climate change\n\t8.7 Possible mass extinction factor\n\n\n\n\t9 Research and experiments\n\t9.1 Ground-based\n\t9.2 Satellite\n\t9.3 Balloon-borne\n\n\n\n\t10 See also\n\t11 References\n\t12 Further references\n\t13 External links\n\n\n\n\n\nEtymology[edit]\n\nThe term ray is somewhat of a misnomer due to a historical accident, as cosmic rays were at first, and wrongly, thought to be mostly electromagnetic radiation. In common scientific usage,[7] high-energy particles with intrinsic mass are known as \"cosmic\" rays, while photons, which are quanta of electromagnetic radiation (and so have no intrinsic mass) are known by their common names, such as gamma rays or X-rays, depending on their photon energy.\n\n\nComposition[edit]\n\nOf primary cosmic rays, which originate outside of Earth's atmosphere, about 99% are the nuclei of well-known atoms (stripped of their electron shells), and about 1% are solitary electrons (similar to beta particles). Of the nuclei, about 90% are simple protons (i.e., hydrogen nuclei); 9% are alpha particles, identical to helium nuclei; and 1% are the nuclei of heavier elements, called HZE ions.[8] These fractions vary highly over the energy range of cosmic rays.[9] A very small fraction are stable particles of antimatter, such as positrons or antiprotons. The precise nature of this remaining fraction is an area of active research. An active search from Earth orbit for anti-alpha particles has failed to detect them.[10]\n\n\nEnergy[edit]\n\nCosmic rays attract great interest practically, due to the damage they inflict on microelectronics and life outside the protection of an atmosphere and magnetic field, and scientifically, because the energies of the most energetic ultra-high-energy cosmic rays (UHECRs) have been observed to approach 3 × 1020 eV,[11] about 40 million times the energy of particles accelerated by the Large Hadron Collider.[12] One can show that such enormous energies might be achieved by means of the centrifugal mechanism of acceleration in active galactic nuclei. At 50 J,[13] the highest-energy ultra-high-energy cosmic rays (such as the Oh-My-God particle recorded in 1991) have energies comparable to the kinetic energy of a 90-kilometre-per-hour (56 mph) baseball. As a result of these discoveries, there has been interest in investigating cosmic rays of even greater energies.[14] Most cosmic rays, however, do not have such extreme energies; the energy distribution of cosmic rays peaks on 0.3 gigaelectronvolts (4.8×10−11 J).[15]\n\n\nHistory[edit]\n\nAfter the discovery of radioactivity by Henri Becquerel in 1896, it was generally believed that atmospheric electricity, ionization of the air, was caused only by radiation from radioactive elements in the ground or the radioactive gases or isotopes of radon they produce.[16] Measurements of increasing ionization rates at increasing heights above the ground during the decade from 1900 to 1910 could be explained as due to absorption of the ionizing radiation by the intervening air.[17]\n\n\nDiscovery[edit]\n\nIn 1909, Theodor Wulf developed an electrometer, a device to measure the rate of ion production inside a hermetically sealed container, and used it to show higher levels of radiation at the top of the Eiffel Tower than at its base. However, his paper published in Physikalische Zeitschrift was not widely accepted. In 1911, Domenico Pacini observed simultaneous variations of the rate of ionization over a lake, over the sea, and at a depth of 3 metres from the surface. Pacini concluded from the decrease of radioactivity underwater that a certain part of the ionization must be due to sources other than the radioactivity of the Earth.[18] \n  \nPacini makes a measurement in 1910.\n\n\n\nIn 1912, Victor Hess carried three enhanced-accuracy Wulf electrometers[19] to an altitude of 5,300 metres in a free balloon flight. He found the ionization rate increased approximately fourfold over the rate at ground level.[19] Hess ruled out the Sun as the radiation's source by making a balloon ascent during a near-total eclipse. With the moon blocking much of the Sun's visible radiation, Hess still measured rising radiation at rising altitudes.[19] He concluded that \"The results of the observations seem most likely to be explained by the assumption that radiation of very high penetrating power enters from above into our atmosphere.\"[20] In 1913–1914, Werner Kolhörster confirmed Victor Hess's earlier results by measuring the increased ionization enthalpy rate at an altitude of 9 km.\n  \nIncrease of ionization with altitude as measured by Hess in 1912 (left) and by Kolhörster (right)\n\n\n Hess received the Nobel Prize in Physics in 1936 for his discovery.[21][22]\n\nThe Hess balloon flight took place on 7 August 1912. By sheer coincidence, exactly 100 years later on 7 August 2012, the Mars Science Laboratory rover used its Radiation Assessment Detector (RAD) instrument to begin measuring the radiation levels on another planet for the first time. On 31 May 2013, NASA scientists reported that a possible manned mission to Mars may involve a greater radiation risk than previously believed, based on the amount of energetic particle radiation detected by the RAD on the Mars Science Laboratory while traveling from the Earth to Mars in 2011–2012.[23][24][25]\n\n\n  \nHess lands after his balloon flight in 1912.\n\n\n\nIdentification[edit]\n\nBruno Rossi wrote that:\n\n\nIn the late 1920s and early 1930s the technique of self-recording electroscopes carried by balloons into the highest layers of the atmosphere or sunk to great depths under water was brought to an unprecedented degree of perfection by the German physicist Erich Regener and his group. To these scientists we owe some of the most accurate measurements ever made of cosmic-ray ionization as a function of altitude and depth.[26]\n\n\nErnest Rutherford stated in 1931 that \"thanks to the fine experiments of Professor Millikan and the even more far-reaching experiments of Professor Regener, we have now got for the first time, a curve of absorption of these radiations in water which we may safely rely upon\".[27]\n\nIn the 1920s, the term cosmic rays was coined by Robert Millikan who made measurements of ionization due to cosmic rays from deep under water to high altitudes and around the globe. Millikan believed that his measurements proved that the primary cosmic rays were gamma rays; i.e., energetic photons. And he proposed a theory that they were produced in interstellar space as by-products of the fusion of hydrogen atoms into the heavier elements, and that secondary electrons were produced in the atmosphere by Compton scattering of gamma rays. But then, sailing from Java to the Netherlands in 1927, Jacob Clay found evidence,[28] later confirmed in many experiments, that cosmic ray intensity increases from the tropics to mid-latitudes, which indicated that the primary cosmic rays are deflected by the geomagnetic field and must therefore be charged particles, not photons. In 1929, Bothe and Kolhörster discovered charged cosmic-ray particles that could penetrate 4.1 cm of gold.[29] Charged particles of such high energy could not possibly be produced by photons from Millikan's proposed interstellar fusion process.[citation needed]\n\nIn 1930, Bruno Rossi predicted a difference between the intensities of cosmic rays arriving from the east and the west that depends upon the charge of the primary particles—the so-called \"east-west effect.\"[30] Three independent experiments[31][32][33] found that the intensity is, in fact, greater from the west, proving that most primaries are positive. During the years from 1930 to 1945, a wide variety of investigations confirmed that the primary cosmic rays are mostly protons, and the secondary radiation produced in the atmosphere is primarily electrons, photons and muons. In 1948, observations with nuclear emulsions carried by balloons to near the top of the atmosphere showed that approximately 10% of the primaries are helium nuclei (alpha particles) and 1% are heavier nuclei of the elements such as carbon, iron, and lead.[34][35]\n\nDuring a test of his equipment for measuring the east-west effect, Rossi observed that the rate of near-simultaneous discharges of two widely separated Geiger counters was larger than the expected accidental rate. In his report on the experiment, Rossi wrote \"... it seems that once in a while the recording equipment is struck by very extensive showers of particles, which causes coincidences between the counters, even placed at large distances from one another.\"[36] In 1937 Pierre Auger, unaware of Rossi's earlier report, detected the same phenomenon and investigated it in some detail. He concluded that high-energy primary cosmic-ray particles interact with air nuclei high in the atmosphere, initiating a cascade of secondary interactions that ultimately yield a shower of electrons, and photons that reach ground level.[37]\n\nSoviet physicist Sergey Vernov was the first to use radiosondes to perform cosmic ray readings with an instrument carried to high altitude by a balloon. On 1 April 1935, he took measurements at heights up to 13.6 kilometres using a pair of Geiger counters in an anti-coincidence circuit to avoid counting secondary ray showers.[38][39]\n\nHomi J. Bhabha derived an expression for the probability of scattering positrons by electrons, a process now known as Bhabha scattering. His classic paper, jointly with Walter Heitler, published in 1937 described how primary cosmic rays from space interact with the upper atmosphere to produce particles observed at the ground level. Bhabha and Heitler explained the cosmic ray shower formation by the cascade production of gamma rays and positive and negative electron pairs.[40][citation needed][41]\n\n\nEnergy distribution[edit]\n\nMeasurements of the energy and arrival directions of the ultra-high-energy primary cosmic rays by the techniques of density sampling and fast timing of extensive air showers were first carried out in 1954 by members of the Rossi Cosmic Ray Group at the Massachusetts Institute of Technology.[42] The experiment employed eleven scintillation detectors arranged within a circle 460 metres in diameter on the grounds of the Agassiz Station of the Harvard College Observatory. From that work, and from many other experiments carried out all over the world, the energy spectrum of the primary cosmic rays is now known to extend beyond 1020 eV. A huge air shower experiment called the Auger Project is currently operated at a site on the pampas of Argentina by an international consortium of physicists. The project was first led by James Cronin, winner of the 1980 Nobel Prize in Physics from the University of Chicago, and Alan Watson of the University of Leeds, and later by other scientists of the international Pierre Auger Collaboration. Their aim is to explore the properties and arrival directions of the very highest-energy primary cosmic rays.[43] The results are expected to have important implications for particle physics and cosmology, due to a theoretical Greisen–Zatsepin–Kuzmin limit to the energies of cosmic rays from long distances (about 160 million light years) which occurs above 1020 eV because of interactions with the remnant photons from the Big Bang origin of the universe. Currently the Pierre Auger Observatory undergoes an upgrade to improve its accuracy and find evidence for the yet unconfirmed origin of the most energetic cosmic rays.\n\nHigh-energy gamma rays (>50 MeV photons) were finally discovered in the primary cosmic radiation by an MIT experiment carried on the OSO-3 satellite in 1967.[44] Components of both galactic and extra-galactic origins were separately identified at intensities much less than 1% of the primary charged particles. Since then, numerous satellite gamma-ray observatories have mapped the gamma-ray sky. The most recent is the Fermi Observatory, which has produced a map showing a narrow band of gamma ray intensity produced in discrete and diffuse sources in our galaxy, and numerous point-like extra-galactic sources distributed over the celestial sphere.\n\n\nSources[edit]\n\nEarly speculation on the sources of cosmic rays included a 1934 proposal by Baade and Zwicky suggesting cosmic rays originated from supernovae.[45] A 1948 proposal by Horace W. Babcock suggested that magnetic variable stars could be a source of cosmic rays.[46] Subsequently, in 1951, Y. Sekido et al. identified the Crab Nebula as a source of cosmic rays.[47] Since then, a wide variety of potential sources for cosmic rays began to surface, including supernovae, active galactic nuclei, quasars, and gamma-ray bursts.[48]\n\n\n  \nSources of ionizing radiation in interplanetary space.\n\n\n\n  \nShock front acceleration (theoretical model for supernovae and active galactic nuclei): Incident proton gets accelerated between two shock fronts up to energies of the high-energy component of cosmic rays.\n\n\n\nLater experiments have helped to identify the sources of cosmic rays with greater certainty. In 2009, a paper presented at the International Cosmic Ray Conference (ICRC) by scientists at the Pierre Auger Observatory showed ultra-high energy cosmic rays (UHECRs) originating from a location in the sky very close to the radio galaxy Centaurus A, although the authors specifically stated that further investigation would be required to confirm Cen A as a source of cosmic rays.[49] However, no correlation was found between the incidence of gamma-ray bursts and cosmic rays, causing the authors to set upper limits as low as 3.4 × 10−6 erg·cm−2 on the flux of 1 GeV – 1 TeV cosmic rays from gamma-ray bursts.[50]\n\nIn 2009, supernovae were said to have been \"pinned down\" as a source of cosmic rays, a discovery made by a group using data from the Very Large Telescope.[51] This analysis, however, was disputed in 2011 with data from PAMELA, which revealed that \"spectral shapes of [hydrogen and helium nuclei] are different and cannot be described well by a single power law\", suggesting a more complex process of cosmic ray formation.[52] In February 2013, though, research analyzing data from Fermi revealed through an observation of neutral pion decay that supernovae were indeed a source of cosmic rays, with each explosion producing roughly 3 × 1042 – 3 × 1043 J of cosmic rays.[3][4] However, supernovae do not produce all cosmic rays, and the proportion of cosmic rays that they do produce is a question which cannot be answered without further study.[53] As an explanation of the acceleration in supernovae and active galactic nuclei the model of shock front acceleration is used.\n\nIn 2017, the Pierre Auger Collaboration published the observation of a weak anisotropy in the arrival directions of the highest energy cosmic rays.[54] Since the Galactic Center is in the deficit region, this anisotropy can be interpreted as evidence for the extragalactic origin of cosmic rays at the highest energies. This implies that there must be a transition energy from galactic to extragalactic sources, and there may be different types of cosmic-ray sources contributing to different energy ranges.\n\n\nTypes[edit]\n\nCosmic rays can be divided into two types, galactic cosmic rays (GCR) and extragalactic cosmic rays, i.e., high-energy particles originating outside the solar system, and solar energetic particles, high-energy particles (predominantly protons) emitted by the sun, primarily in solar particle events. However, the term \"cosmic ray\" is often used to refer to only the extrasolar flux.\n\n\n  \nPrimary cosmic particle collides with a molecule of atmosphere.\n\n\n\nCosmic rays originate as primary cosmic rays, which are those originally produced in various astrophysical processes. Primary cosmic rays are composed primarily of protons and alpha particles (99%), with a small amount of heavier nuclei (≈1%) and an extremely minute proportion of positrons and antiprotons.[8] Secondary cosmic rays, caused by a decay of primary cosmic rays as they impact an atmosphere, include photons, leptons, and hadrons, such as electrons, positrons, muons, and pions. The latter three of these were first detected in cosmic rays.\n\n\nPrimary cosmic rays[edit]\n\nPrimary cosmic rays primarily originate from outside the Solar System and sometimes even the Milky Way. When they interact with Earth's atmosphere, they are converted to secondary particles. The mass ratio of helium to hydrogen nuclei, 28%, is similar to the primordial elemental abundance ratio of these elements, 24%.[55] The remaining fraction is made up of the other heavier nuclei that are typical nucleosynthesis end products, primarily lithium, beryllium, and boron. These nuclei appear in cosmic rays in much greater abundance (≈1%) than in the solar atmosphere, where they are only about 10−11 as abundant as helium. Cosmic rays made up of charged nuclei heavier than helium are called HZE ions. Due to the high charge and heavy nature of HZE ions, their contribution to an astronaut's radiation dose in space is significant even though they are relatively scarce.\n\nThis abundance difference is a result of the way secondary cosmic rays are formed. Carbon and oxygen nuclei collide with interstellar matter to form lithium, beryllium and boron in a process termed cosmic ray spallation. Spallation is also responsible for the abundances of scandium, titanium, vanadium, and manganese ions in cosmic rays produced by collisions of iron and nickel nuclei with interstellar matter.[56]\n\nAt high energies the composition changes and heavier nuclei have larger abundances in some energy ranges. Current experiments aim at more accurate measurements of the composition at high energies.\n\n\nPrimary cosmic ray antimatter[edit]\n\nSee also: Alpha Magnetic Spectrometer\n\nSatellite experiments have found evidence of positrons and a few antiprotons in primary cosmic rays, amounting to less than 1% of the particles in primary cosmic rays. These do not appear to be the products of large amounts of antimatter from the Big Bang, or indeed complex antimatter in the universe. Rather, they appear to consist of only these two elementary particles, newly made in energetic processes.\n\nPreliminary results from the presently operating Alpha Magnetic Spectrometer (AMS-02) on board the International Space Station show that positrons in the cosmic rays arrive with no directionality. In September 2014, new results with almost twice as much data were presented in a talk at CERN and published in Physical Review Letters.[57][58] A new measurement of positron fraction up to 500 GeV was reported, showing that positron fraction peaks at a maximum of about 16% of total electron+positron events, around an energy of 275±32 GeV. At higher energies, up to 500 GeV, the ratio of positrons to electrons begins to fall again. The absolute flux of positrons also begins to fall before 500 GeV, but peaks at energies far higher than electron energies, which peak about 10 GeV.[59] These results on interpretation have been suggested to be due to positron production in annihilation events of massive dark matter particles.[60]\n\nCosmic ray antiprotons also have a much higher average energy than their normal-matter counterparts (protons). They arrive at Earth with a characteristic energy maximum of 2 GeV, indicating their production in a fundamentally different process from cosmic ray protons, which on average have only one-sixth of the energy.[61]\n\nThere is no evidence of complex antimatter atomic nuclei, such as antihelium nuclei (i.e., anti-alpha particles), in cosmic rays. These are actively being searched for. A prototype of the AMS-02 designated AMS-01, was flown into space aboard the Space Shuttle Discovery on STS-91 in June 1998. By not detecting any antihelium at all, the AMS-01 established an upper limit of 1.1 × 10−6 for the antihelium to helium flux ratio.[62]\n\n\nThe moon in cosmic rays\n\n\nThe Moon's cosmic ray shadow, as seen in secondary muons detected 700 m below ground, at the Soudan 2 detector\n\n\n\nThe Moon as seen by the Compton Gamma Ray Observatory, in gamma rays with energies greater than 20 MeV. These are produced by cosmic ray bombardment on its surface.[63]\n\n\n\n\n\nSecondary cosmic rays[edit]\n\nWhen cosmic rays enter the Earth's atmosphere they collide with atoms and molecules, mainly oxygen and nitrogen. The interaction produces a cascade of lighter particles, a so-called air shower secondary radiation that rains down, including x-rays, muons, protons, alpha particles, pions, electrons, and neutrons.[64] All of the produced particles stay within about one degree of the primary particle's path.\n\nTypical particles produced in such collisions are neutrons and charged mesons such as positive or negative pions and kaons. Some of these subsequently decay into muons and neutrinos, which are able to reach the surface of the Earth. Some high-energy muons even penetrate for some distance into shallow mines, and most neutrinos traverse the Earth without further interaction. Others decay into photon, subsequently producing electromagnetic cascades. Hence, next to photons electrons and positrons usually dominate in air showers. These particles as well as muons can be easily detected by many types of particle detectors, such as cloud chambers, bubble chambers, water-Cherenkov or scintillation detectors. The observation of a secondary shower of particles in multiple detectors at the same time is an indication that all of the particles came from that event.\n\nCosmic rays impacting other planetary bodies in the Solar System are detected indirectly by observing high-energy gamma ray emissions by gamma-ray telescope. These are distinguished from radioactive decay processes by their higher energies above about 10 MeV.\n\n\nCosmic-ray flux[edit]\n\n  \nAn overview of the space environment shows the relationship between the solar activity and galactic cosmic rays.[65]\n\n\n\nThe flux of incoming cosmic rays at the upper atmosphere is dependent on the solar wind, the Earth's magnetic field, and the energy of the cosmic rays. At distances of ≈94 AU from the Sun, the solar wind undergoes a transition, called the termination shock, from supersonic to subsonic speeds. The region between the termination shock and the heliopause acts as a barrier to cosmic rays, decreasing the flux at lower energies (≤ 1 GeV) by about 90%. However, the strength of the solar wind is not constant, and hence it has been observed that cosmic ray flux is correlated with solar activity.\n\nIn addition, the Earth's magnetic field acts to deflect cosmic rays from its surface, giving rise to the observation that the flux is apparently dependent on latitude, longitude, and azimuth angle.\n\nThe combined effects of all of the factors mentioned contribute to the flux of cosmic rays at Earth's surface. The following table of participial frequencies reach the planet[66] and are inferred from lower energy radiation reaching the ground.[67]\n\n\n\tParticle energy (eV)\n\tParticle rate (m−2s−1)\n\n\t1×109 (GeV)\n\t1×104\n\n\t1×1012 (TeV)\n\t1\n\n\t1×1016 (10 PeV)\n\t1×10−7 (a few times a year)\n\n\t1×1020 (100 EeV)\n\t1×10−15 (once a century)\n\n\n\nIn the past, it was believed that the cosmic ray flux remained fairly constant over time. However, recent research suggests one-and-a-half- to two-fold millennium-timescale changes in the cosmic ray flux in the past forty thousand years.[68]\n\nThe magnitude of the energy of cosmic ray flux in interstellar space is very comparable to that of other deep space energies: cosmic ray energy density averages about one electron-volt per cubic centimetre of interstellar space, or ≈1 eV/cm3, which is comparable to the energy density of visible starlight at 0.3 eV/cm3, the galactic magnetic field energy density (assumed 3 microgauss) which is ≈0.25 eV/cm3, or the cosmic microwave background (CMB) radiation energy density at ≈0.25 eV/cm3.[69]\n\n\nDetection methods[edit]\n\n  \nThe VERITAS array of air Cherenkov telescopes.\n\n\n\nThere are two main classes of detection methods. First, the direct detection of the primary cosmic rays in space or at high altitude by balloon-borne instruments. Second, the indirect detection of secondary particle, i.e., extensive air showers at higher energies. While there have been proposals and prototypes for space and ballon-borne detection of air showers, currently operating experiments for high-energy cosmic rays are ground based. Generally direct detection is more accurate than indirect detection. However the flux of cosmic rays decreases with energy, which hampers direct detection for the energy range above 1 PeV. Both, direct and indirect detection, is realized by several techniques.\n\n\nDirect detection[edit]\n\nDirect detection is possible by all kind of particle detectors at the ISS, on satellites, or high-altitude balloons. However, there are constraints in weight and size limiting the choices of detectors.\n\nAn example for the direct detection technique is a method developed by Robert Fleischer, P. Buford Price, and Robert M. Walker for use in high-altitude balloons.[70] In this method, sheets of clear plastic, like 0.25 mm Lexan polycarbonate, are stacked together and exposed directly to cosmic rays in space or high altitude. The nuclear charge causes chemical bond breaking or ionization in the plastic. At the top of the plastic stack the ionization is less, due to the high cosmic ray speed. As the cosmic ray speed decreases due to deceleration in the stack, the ionization increases along the path. The resulting plastic sheets are \"etched\" or slowly dissolved in warm caustic sodium hydroxide solution, that removes the surface material at a slow, known rate. The caustic sodium hydroxide dissolves the plastic at a faster rate along the path of the ionized plastic. The net result is a conical etch pit in the plastic. The etch pits are measured under a high-power microscope (typically 1600× oil-immersion), and the etch rate is plotted as a function of the depth in the stacked plastic.\n\nThis technique yields a unique curve for each atomic nucleus from 1 to 92, allowing identification of both the charge and energy of the cosmic ray that traverses the plastic stack. The more extensive the ionization along the path, the higher the charge. In addition to its uses for cosmic-ray detection, the technique is also used to detect nuclei created as products of nuclear fission.\n\n\nIndirect detection[edit]\n\nThere are several ground-based methods of detecting cosmic rays currently in use, which can be divided in two main categories: the detection of secondary particles forming extensive air showers (EAS) by various types of particle detectors, and the detection of electromagnetic radiation emitted by EAS in the atmosphere.\n\nExtensive air shower arrays made of particle detectors measure the charged particles which pass through them. EAS arrays can observe a broad area of the sky and can be active more than 90% of the time. However, they are less able to segregate background effects from cosmic rays than can air Cherenkov telescopes. Most state-of-the-art EAS arrays employ plastic scintillators. Also water (liquid or frozen) is used as a detection medium through which particles pass and produce Cherenkov radiation to make them detectable.[71] Therefore, several arrays use water/ice-Cherenkov detectors as alternative or in addition to scintillators.\nBy the combination of several detectors, some EAS arrays have the capability to distinguish muons from lighter secondary particles (photons, electrons, positrons). The fraction of muons among the secondary particles in one traditional way to estimate the mass composition of the primary cosmic rays.\n\nA historic method of secondary particle detection still used for demonstration purposes involves the use of cloud chambers[72] to detect the secondary muons created when a pion decays. Cloud chambers in particular can be built from widely available materials and can be constructed even in a high-school laboratory. A fifth method, involving bubble chambers, can be used to detect cosmic ray particles.[73]\n\nMore recently, the CMOS devices in pervasive smartphone cameras have been proposed as a practical distributed network to detect air showers from ultra-high-energy cosmic rays (UHECRs).[74] The first app, to exploit this proposition was the CRAYFIS (Cosmic RAYs Found in Smartphones) experiment.[75][76] Then, in 2017, the CREDO (Cosmic Ray Extremely Distributed Observatory) Collaboration[77] released the first version of its completely open source app for Android devices. Since then the collaboration has attracted the interest and support of many scientific institutions, educational institutions and members of the public around the world.[78] Future research has to show in what aspects this new technique can compete with dedicated EAS arrays.\n\nThe first detection method in the second category is called the air Cherenkov telescope, designed to detect low-energy (<200 GeV) cosmic rays by means of analyzing their Cherenkov radiation, which for cosmic rays are gamma rays emitted as they travel faster than the speed of light in their medium, the atmosphere.[79] While these telescopes are extremely good at distinguishing between background radiation and that of cosmic-ray origin, they can only function well on clear nights without the Moon shining, and have very small fields of view and are only active for a few percent of the time.\n\nA second method detects the light from nitrogen fluorescence caused by the excitation of nitrogen in the atmosphere by the shower of particles moving through the atmosphere. This method is the most accurate for cosmic rays at highest energies, in particular when combined with EAS arrays of particle detectors.[80] As the detection of Cherenkov-light, this method is restricted to clear nights.\n\nAnother method detects radio waves emitted by air showers. This technique has a high duty cycle similar to that of particle detectors. The accuracy of this technique was improved in the last years as shown by various prototype experiments, and may become an alternative to the detection of atmospheric Cherenkov-light and fluorescence light, at least at high energies.\n\n\nEffects[edit]\n\nChanges in atmospheric chemistry[edit]\n\nCosmic rays ionize the nitrogen and oxygen molecules in the atmosphere, which leads to a number of chemical reactions. Cosmic rays are also responsible for the continuous production of a number of unstable isotopes in the Earth's atmosphere, such as carbon-14, via the reaction:\n\n\n\tn + 14N → p + 14C\n\n\nCosmic rays kept the level of carbon-14[81] in the atmosphere roughly constant (70 tons) for at least the past 100,000 years,[citation needed] until the beginning of above-ground nuclear weapons testing in the early 1950s. This is an important fact used in radiocarbon dating used in archaeology.\n\n\n\tReaction products of primary cosmic rays, radioisotope half-lifetime, and production reaction[82]\n\n\n\n\tTritium (12.3 years): 14N(n, 3H)12C (spallation)\n\tBeryllium-7 (53.3 days)\n\tBeryllium-10 (1.39 million years): 14N(n,p α)10Be (spallation)\n\tCarbon-14 (5730 years): 14N(n, p)14C (neutron activation)\n\tSodium-22 (2.6 years)\n\tSodium-24 (15 hours)\n\tMagnesium-28 (20.9 hours)\n\tSilicon-31 (2.6 hours)\n\tSilicon-32 (101 years)\n\tPhosphorus-32 (14.3 days)\n\tSulfur-35 (87.5 days)\n\tSulfur-38 (2.84 hours)\n\tChlorine-34 m (32 minutes)\n\tChlorine-36 (300,000 years)\n\tChlorine-38 (37.2 minutes)\n\tChlorine-39 (56 minutes)\n\tArgon-39 (269 years)\n\tKrypton-85 (10.7 years)\n\n\n\n\nRole in ambient radiation[edit]\n\nCosmic rays constitute a fraction of the annual radiation exposure of human beings on the Earth, averaging 0.39 mSv out of a total of 3 mSv per year (13% of total background) for the Earth's population. However, the background radiation from cosmic rays increases with altitude, from 0.3 mSv per year for sea-level areas to 1.0 mSv per year for higher-altitude cities, raising cosmic radiation exposure to a quarter of total background radiation exposure for populations of said cities. Airline crews flying long distance high-altitude routes can be exposed to 2.2 mSv of extra radiation each year due to cosmic rays, nearly doubling their total exposure to ionizing radiation.\n\n\nAverage annual radiation exposure (millisieverts)\n\tRadiation\n\tUNSCEAR[83][84]\n\tPrinceton[85]\n\tWa State[86]\n\tMEXT[87]\n\tRemark\n\n\tType\tSource\tWorld\n average\tTypical range\tUSA\tUSA\tJapan\n\n\tNatural\tAir\t1.26\t0.2–10.0a\t2.29\t2.00\t0.40\tPrimarily from radon, (a)depends on indoor accumulation of radon gas.\n\n\tInternal\t0.29\t0.2–1.0b\t0.16\t0.40\t0.40\tMainly from radioisotopes in food (40K, 14C, etc.) (b)depends on diet.\n\n\tTerrestrial\t0.48\t0.3–1.0c\t0.19\t0.29\t0.40\t(c)Depends on soil composition and building material of structures.\n\n\tCosmic\t0.39\t0.3–1.0d\t0.31\t0.26\t0.30\t(d)Generally increases with elevation.\n\n\tSubtotal\t2.40\t1.0–13.0\t2.95\t2.95\t1.50\t\n\n\tArtificial\tMedical\t0.60\t0.03–2.0\t3.00\t0.53\t2.30\t\n\n\tFallout\t0.007\t0 – 1+\t–\t–\t0.01\tPeaked in 1963 with a spike in 1986; still high near nuclear test and accident sites.\nFor the United States, fallout is incorporated into other categories.\n\n\tOthers\t0.0052\t0–20\t0.25\t0.13\t0.001\tAverage annual occupational exposure is 0.7 mSv; mining workers have higher exposure. \nPopulations near nuclear plants have an additional ≈0.02 mSv of exposure annually.\n\n\tSubtotal\t0.6\t0 to tens\t3.25\t0.66\t2.311\t\n\n\tTotal\t3.00\t0 to tens\t6.20\t3.61\t3.81\t\n\n\n\n\tFigures are for the time before the Fukushima Daiichi nuclear disaster. Human-made values by UNSCEAR are from the Japanese National Institute of Radiological Sciences, which summarized the UNSCEAR data.\n\n\nEffect on electronics[edit]\n\nCosmic rays have sufficient energy to alter the states of circuit components in electronic integrated circuits, causing transient errors to occur (such as corrupted data in electronic memory devices or incorrect performance of CPUs) often referred to as \"soft errors.\" This has been a problem in electronics at extremely high-altitude, such as in satellites, but with transistors becoming smaller and smaller, this is becoming an increasing concern in ground-level electronics as well.[88] Studies by IBM in the 1990s suggest that computers typically experience about one cosmic-ray-induced error per 256 megabytes of RAM per month.[89] To alleviate this problem, the Intel Corporation has proposed a cosmic ray detector that could be integrated into future high-density microprocessors, allowing the processor to repeat the last command following a cosmic-ray event.[90]\n\nIn 2008, data corruption in a flight control system caused an Airbus A330 airliner to twice plunge hundreds of feet, resulting in injuries to multiple passengers and crew members. Cosmic rays were investigated among other possible causes of the data corruption, but were ultimately ruled out as being very unlikely.[91]\n\nA high-profile recall in 2009–2010 involving Toyota vehicles with throttles that became stuck in the open position may have been caused by cosmic rays.[92] The connection was discussed on the \"Bit Flip\" episode of the podcast Radiolab[93]\n\n\nSee also: Radiation hardening\n\nSignificance to aerospace travel[edit]\n\nMain article: Health threat from cosmic rays\n\nGalactic cosmic rays are one of the most important barriers standing in the way of plans for interplanetary travel by crewed spacecraft. Cosmic rays also pose a threat to electronics placed aboard outgoing probes. In 2010, a malfunction aboard the Voyager 2 space probe was credited to a single flipped bit, probably caused by a cosmic ray. Strategies such as physical or magnetic shielding for spacecraft have been considered in order to minimize the damage to electronics and human beings caused by cosmic rays.[94][95]\n\n\n  \nComparison of radiation doses, including the amount detected on the trip from Earth to Mars by the RAD on the MSL (2011–2013).[23][24][25]\n\n\n\nFlying 12 kilometres (39,000 ft) high, passengers and crews of jet airliners are exposed to at least 10 times the cosmic ray dose that people at sea level receive. Aircraft flying polar routes near the geomagnetic poles are at particular risk.[96][97][98]\n\n\nRole in lightning[edit]\n\nCosmic rays have been implicated in the triggering of electrical breakdown in lightning. It has been proposed that essentially all lightning is triggered through a relativistic process, \"runaway breakdown\", seeded by cosmic ray secondaries. Subsequent development of the lightning discharge then occurs through \"conventional breakdown\" mechanisms.[99]\n\n\nPostulated role in climate change[edit]\n\nA role for cosmic rays in climate was suggested by Edward P. Ney in 1959[100] and by Robert E. Dickinson in 1975.[101] It has been postulated that cosmic rays may have been responsible for major climatic change and mass-extinction in the past. According to Adrian Mellott and Mikhail Medvedev, 62-million-year cycles in biological marine populations correlate with the motion of the Earth relative to the galactic plane and increases in exposure to cosmic rays.[102] The researchers suggest that this and gamma ray bombardments deriving from local supernovae could have affected cancer and mutation rates, and might be linked to decisive alterations in the Earth's climate, and to the mass-extinctions of the Ordovician.[103][104]\n\nDanish physicist Henrik Svensmark has controversially argued that because solar variation modulates the cosmic ray flux on Earth, they would consequently affect the rate of cloud formation and hence be an indirect cause of global warming.[105][106] Svensmark is one of several scientists outspokenly opposed to the mainstream scientific assessment of global warming, leading to concerns that the proposition that cosmic rays are connected to global warming could be ideologically biased rather than scientifically based.[107] Other scientists have vigorously criticized Svensmark for sloppy and inconsistent work: one example is adjustment of cloud data that understates error in lower cloud data, but not in high cloud data;[108] another example is \"incorrect handling of the physical data\" resulting in graphs that do not show the correlations they claim to show.[109] Despite Svensmark's assertions, galactic cosmic rays have shown no statistically significant influence on changes in cloud cover,[110] and demonstrated to have no causal relationship to changes in global temperature.[111]\n\n\nPossible mass extinction factor[edit]\n\nA handful of studies conclude that a nearby supernova or series of supernovas caused the Pliocene marine megafauna extinction event by substantially increasing radiation levels to hazardous amounts for large seafaring animals.[112][113][114]\n\n\nResearch and experiments[edit]\n\nSee also: Cosmic-ray observatory\n\nThere are a number of cosmic-ray research initiatives, listed below.\n\n\nGround-based[edit]\n\n\n\tAkeno Giant Air Shower Array\n\tChicago Air Shower Array\n\tCHICOS\n\tCLOUD\n\tGAMMA\n\tGRAPES-3\n\tHAWC\n\tHigh Energy Stereoscopic System\n\tHigh Resolution Fly's Eye Cosmic Ray Detector\n\tHEGRA\n\tIceCube\n\tKASCADE\n\tMAGIC\n\tMARIACHI\n\tMilagro\n\tCRIPT\n\tNMDB\n\tPierre Auger Observatory\n\tQuarkNet\n\tSpaceship Earth\n\tTelescope Array Project\n\tTunka experiment\n\tVERITAS\n\tWashington Large Area Time Coincidence Array\n\n\n\n\nSatellite[edit]\n\n\n\tPAMELA\n\tAlpha Magnetic Spectrometer\n\tACE (Advanced Composition Explorer)\n\tVoyager 1 and Voyager 2\n\tCassini–Huygens\n\tHEAO 1, HEAO 2, HEAO 3\n\tFermi Gamma-ray Space Telescope\n\tSolar and Heliospheric Observatory\n\tInterstellar Boundary Explorer\n\tLangton Ultimate Cosmic-Ray Intensity Detector\n\n\n\n\nBalloon-borne[edit]\n\n\n\tBESS\n\tAdvanced Thin Ionization Calorimeter\n\tTRACER (cosmic ray detector)\n\tTIGER\n\tCosmic Ray Energetics and Mass (CREAM)\n\tPERDaix\n\tHEAT (High Energy Antimatter Telescope)\n\n\n\n\nSee also[edit]\n\n\tCentral nervous system effects from radiation exposure during spaceflight\n\tCosmic ray visual phenomena\n\tEnvironmental radioactivity\n\tExtragalactic cosmic ray\n\tForbush decrease\n\tGilbert Jerome Perlow\n\tHealth threat from cosmic rays\n\tOh-My-God particle – An unexpectedly ultra-high-energy cosmic ray\n\tSolar energetic particles\n\tTrack Imaging Cherenkov Experiment\n\tUltra-high-energy cosmic ray (UHECR) – A cosmic-ray particle with a kinetic energy greater than 1×1018 eV\n\n\nReferences[edit]\n\n\n\t^ Sharma (2008). Atomic And Nuclear Physics. Pearson Education India. p. 478. ISBN 978-81-317-1924-4.\n\n\t^ \"Detecting cosmic rays from a galaxy far, far away\". Science Daily. 21 September 2017. Retrieved 26 December 2017.\n\n\n\t^ a b Ackermann, M.; Ajello, M.; Allafort, A.; Baldini, L.; Ballet, J.; Barbiellini, G.; Baring, M. G.; Bastieri, D.; Bechtol, K.; Bellazzini, R.; Blandford, R. D.; Bloom, E.D.; Bonamente, E.; Borgland, A. W.; Bottacini, E.; Brandt, T. J.; Bregeon, J.; Brigida, M.; Bruel, P.; Buehler, R.; Busetto, G.; Buson, S.; Caliandro, G. A.; Cameron, R. A.; Caraveo, P. A.; Casandjian, J. M.; Cecchi, C.; Celik, O.; Charles, E.;  et al. (15 February 2013). \"Detection of the Characteristic Pion-Decay Signature in Supernova Remnants\". Science. 339 (6424): 807–811. arXiv:1302.3307. Bibcode:2013Sci...339..807A. doi:10.1126/science.1231160. PMID 23413352.\n\n\n\t^ a b Ginger Pinholster (13 February 2013). \"Evidence Shows that Cosmic Rays Come from Exploding Stars\".\n\n\n\t^ HESS collaboration (2016). \"Acceleration of petaelectronvolt protons in the Galactic Centre\". Nature. 531 (7595): 476–479. arXiv:1603.07730. Bibcode:2016Natur.531..476H. doi:10.1038/nature17147. PMID 26982725.\n\n\n\t^ Collaboration, IceCube (12 July 2018). \"Neutrino emission from the direction of the blazar TXS 0506+056 prior to the IceCube-170922A alert\". Science. 361 (6398): 147–151. arXiv:1807.08794. Bibcode:2018Sci...361..147I. doi:10.1126/science.aat2890. ISSN 0036-8075. PMID 30002248.\n\n\n\t^ Eric Christian. \"Are Cosmic Rays Electromagnetic radiation?\". NASA. Retrieved 11 December 2012.\n\n\n\t^ a b \"What are cosmic rays?\". NASA, Goddard Space Flight Center. Archived from the original on 28 October 2012. Retrieved 31 October 2012.\n copy\n\n\t^ H. Dembinski;  et al. (2018). \"Data-driven model of the cosmic-ray flux and mass composition from 10 GeV to 10^11 GeV\". Proceedings of Science. ICRC2017: 533. arXiv:1711.11432. doi:10.22323/1.301.0533.\n\n\n\t^ \"Cosmic Rays\". National Aeronautics and Space Administration. Nasa. Retrieved 23 March 2019.\n\n\n\t^ Nerlich, Steve (12 June 2011). \"Astronomy Without A Telescope – Oh-My-God Particles\". Universe Today. Universe Today. Retrieved 17 February 2013.\n\n\n\t^ \"Facts and figures\". The LHC. European Organization for Nuclear Research. 2008. Retrieved 17 February 2013.\n\n\n\t^ Gaensler, Brian (November 2011). \"Extreme speed\". COSMOS (41). Archived from the original on 7 April 2013.\n\n\n\t^ \nL. Anchordoqui; T. Paul; S. Reucroft; J. Swain (2003). \"Ultrahigh Energy Cosmic Rays: The state of the art before the Auger Observatory\". International Journal of Modern Physics A. 18 (13): 2229–2366. arXiv:hep-ph/0206072. Bibcode:2003IJMPA..18.2229A. doi:10.1142/S0217751X03013879.\n\n\n\t^ Nave, Carl R. \"Cosmic rays\". HyperPhysics Concepts. Georgia State University. Retrieved 17 February 2013.\n\n\n\t^ Malley, Marjorie C. (25 August 2011), Radioactivity: A History of a Mysterious Science, Oxford University Press, pp. 78–79, ISBN 9780199766413.\n\n\n\t^ North, John (15 July 2008), Cosmos: An Illustrated History of Astronomy and Cosmology, University of Chicago Press, p. 686, ISBN 9780226594415.\n\n\n\t^ \nD. Pacini (1912). \"La radiazione penetrante alla superficie ed in seno alle acque\". Il Nuovo Cimento. 3 (1): 93–100. arXiv:1002.1810. Bibcode:1912NCim....3...93P. doi:10.1007/BF02957440.\n\n\tTranslated and commented in A. de Angelis (2010). \"Penetrating Radiation at the Surface of and in Water\". Il Nuovo Cimento. 3: 93–100. arXiv:1002.1810. Bibcode:1912NCim....3...93P. doi:10.1007/BF02957440.\n\n\n\n\n\t^ a b c \"Nobel Prize in Physics 1936 – Presentation Speech\". Nobelprize.org. 10 December 1936. Retrieved 27 February 2013.\n\n\n\t^ \nV. F. Hess (1912). \"Über Beobachtungen der durchdringenden Strahlung bei sieben Freiballonfahrten (English translation)\". Physikalische Zeitschrift. 13: 1084–1091. arXiv:1808.02927.\n\n\n\t^ \nV.F. Hess (1936). \"The Nobel Prize in Physics 1936\". The Nobel Foundation. Retrieved 11 February 2010.\n\n\n\t^ \nV.F. Hess (1936). \"Unsolved Problems in Physics: Tasks for the Immediate Future in Cosmic Ray Studies\". Nobel Lectures. The Nobel Foundation. Retrieved 11 February 2010.\n\n\n\t^ a b Kerr, Richard (31 May 2013). \"Radiation Will Make Astronauts' Trip to Mars Even Riskier\". Science. 340 (6136): 1031. Bibcode:2013Sci...340.1031K. doi:10.1126/science.340.6136.1031. PMID 23723213.\n\n\n\t^ a b Zeitlin, C.; Hassler, D. M.; Cucinotta, F. A.; Ehresmann, B.; Wimmer-Schweingruber, R. F.; Brinza, D. E.; Kang, S.; Weigle, G.;  et al. (31 May 2013). \"Measurements of Energetic Particle Radiation in Transit to Mars on the Mars Science Laboratory\". Science. 340 (6136): 1080–1084. Bibcode:2013Sci...340.1080Z. doi:10.1126/science.1235989. PMID 23723233.\n\n\n\t^ a b Chang, Kenneth (30 May 2013). \"Data Point to Radiation Risk for Travelers to Mars\". The New York Times. Retrieved 31 May 2013.\n\n\n\t^ Rossi, Bruno Benedetto (1964). Cosmic Rays. New York: McGraw-Hill. ISBN 978-0-07-053890-0.\n\n\n\t^ Geiger, H.; Rutherford, Lord; Regener, E.; Lindemann, F. A.; Wilson, C. T. R.; Chadwick, J.; Gray, L. H.; Tarrant, G. T. P.;  et al. (1931). \"Discussion on Ultra-Penetrating Rays\". Proceedings of the Royal Society of London A. 132 (819): 331. Bibcode:1931RSPSA.132..331G. doi:10.1098/rspa.1931.0104.\n\n\n\t^ Clay, J. (1927). \"Penetrating Radiation\" (PDF). Proceedings of the Section of Sciences, Koninklijke Akademie van Wetenschappen Te Amsterdam. 30 (9–10): 1115–1127.\n\n\n\t^ Bothe, Walther; Werner Kolhörster (November 1929). \"Das Wesen der Höhenstrahlung\". Zeitschrift für Physik. 56 (11–12): 751–777. Bibcode:1929ZPhy...56..751B. doi:10.1007/BF01340137.\n\n\n\t^ Rossi, Bruno (August 1930). \"On the Magnetic Deflection of Cosmic Rays\". Physical Review. 36 (3): 606. Bibcode:1930PhRv...36..606R. doi:10.1103/PhysRev.36.606.\n\n\n\t^ Johnson, Thomas H. (May 1933). \"The Azimuthal Asymmetry of the Cosmic Radiation\". Physical Review. 43 (10): 834–835. Bibcode:1933PhRv...43..834J. doi:10.1103/PhysRev.43.834.\n\n\n\t^ Alvarez, Luis; Compton, Arthur Holly (May 1933). \"A Positively Charged Component of Cosmic Rays\". Physical Review. 43 (10): 835–836. Bibcode:1933PhRv...43..835A. doi:10.1103/PhysRev.43.835.\n\n\n\t^ Rossi, Bruno (May 1934). \"Directional Measurements on the Cosmic Rays Near the Geomagnetic Equator\". Physical Review. 45 (3): 212–214. Bibcode:1934PhRv...45..212R. doi:10.1103/PhysRev.45.212.\n\n\n\t^ Freier, Phyllis; Lofgren, E.; Ney, E.; Oppenheimer, F.; Bradt, H.; Peters, B.;  et al. (July 1948). \"Evidence for Heavy Nuclei in the Primary Cosmic radiation\". Physical Review. 74 (2): 213–217. Bibcode:1948PhRv...74..213F. doi:10.1103/PhysRev.74.213.\n\n\n\t^ Freier, Phyllis; Peters, B.;  et al. (December 1948). \"Investigation of the Primary Cosmic Radiation with Nuclear Photographic Emulsions\". Physical Review. 74 (12): 1828–1837. Bibcode:1948PhRv...74.1828B. doi:10.1103/PhysRev.74.1828.\n\n\n\t^ Rossi, Bruno (1934). \"Misure sulla distribuzione angolare di intensita della radiazione penetrante all'Asmara\". Ricerca Scientifica. 5 (1): 579–589.\n\n\n\t^ Auger, P.;  et al. (July 1939), \"Extensive Cosmic-Ray Showers\", Reviews of Modern Physics, 11 (3–4): 288–291, Bibcode:1939RvMP...11..288A, doi:10.1103/RevModPhys.11.288.\n\n\n\t^ \nJ.L. DuBois; R.P. Multhauf; C.A. Ziegler (2002). The Invention and Development of the Radiosonde (PDF). Smithsonian Studies in History and Technology. 53. Smithsonian Institution Press.\n\n\n\t^ \nS. Vernoff (1935). \"Radio-Transmission of Cosmic Ray Data from the Stratosphere\". Nature. 135 (3426): 1072–1073. Bibcode:1935Natur.135.1072V. doi:10.1038/1351072c0.\n\n\n\t^ Bhabha, H. J.; Heitler, W. (1937). \"The Passage of Fast Electrons and the Theory of Cosmic Showers\" (PDF). Proceedings of the Royal Society A: Mathematical, Physical and Engineering Sciences. 159 (898): 432–458. Bibcode:1937RSPSA.159..432B. doi:10.1098/rspa.1937.0082. ISSN 1364-5021.\n\n\n\t^ Braunschweig, W.;  et al. (1988). \"A study of Bhabha scattering at PETRA energies\". Zeitschrift für Physik C Particles and Fields. 37 (2): 171–177. doi:10.1007/BF01579904.\n\n\n\t^ Clark, G.; Earl, J.; Kraushaar, W.; Linsley, J.; Rossi, B.; Scherb, F.; Scott, D. (1961). \"Cosmic-Ray Air Showers at Sea Level\". Physical Review. 122 (2): 637–654. Bibcode:1961PhRv..122..637C. doi:10.1103/PhysRev.122.637.\n\n\n\t^ \"The Pierre Auger Observatory\". Auger Project. Archived from the original on 13 September 2018.\n\n\n\t^ Kraushaar, W. L.;  et al. (1972). \"Title unknown\". The Astrophysical Journal. 177: 341. Bibcode:1972ApJ...177..341K. doi:10.1086/151713.\n\n\n\t^ Baade, W.; Zwicky, F. (1934). \"Cosmic Rays from Super-novae\". Proceedings of the National Academy of Sciences of the United States of America. 20 (5): 259–263. Bibcode:1934PNAS...20..259B. doi:10.1073/pnas.20.5.259. JSTOR 86841. PMC 1076396. PMID 16587882.\n\n\n\t^ Babcock, H. (1948). \"Magnetic Variable Stars as Sources of Cosmic Rays\". Physical Review. 74 (4): 489. Bibcode:1948PhRv...74..489B. doi:10.1103/PhysRev.74.489.\n\n\n\t^ Sekido, Y.; Masuda, T.; Yoshida, S.; Wada, M. (1951). \"The Crab Nebula as an Observed Point Source of Cosmic Rays\". Physical Review. 83 (3): 658–659. Bibcode:1951PhRv...83..658S. doi:10.1103/PhysRev.83.658.2.\n\n\n\t^ Gibb, Meredith (3 February 2010). \"Cosmic Rays\". Imagine the Universe. NASA Goddard Space Flight Center. Retrieved 17 March 2013.\n\n\n\t^ Hague, J. D. (July 2009). \"Correlation of the Highest Energy Cosmic Rays with Nearby Extragalactic Objects in Pierre Auger Observatory Data\" (PDF). Proceedings of the 31st ICRC, Łódź 2009. International Cosmic Ray Conference. Łódź, Poland. pp. 6–9. Archived from the original (PDF) on 28 May 2013. Retrieved 17 March 2013.\n\n\n\t^ Hague, J. D. (July 2009). \"Correlation of the Highest Energy Cosmic Rays with Nearby Extragalactic Objects in Pierre Auger Observatory Data\" (PDF). Proceedings of the 31st ICRC, Łódź, Poland 2009 – International Cosmic Ray Conference: 36–39. Archived from the original (PDF) on 28 May 2013. Retrieved 17 March 2013.\n\n\n\t^ Moskowitz, Clara (25 June 2009). \"Source of Cosmic Rays Pinned Down\". Space.com. TechMediaNetwork. Retrieved 20 March 2013.\n\n\n\t^ Adriani, O.; Barbarino, G. C.; Bazilevskaya, G. A.; Bellotti, R.; Boezio, M.; Bogomolov, E. A.; Bonechi, L.; Bongi, M.; Bonvicini, V.; Borisov, S.; Bottai, S.; Bruno, A.; Cafagna, F.; Campana, D.; Carbone, R.; Carlson, P.; Casolino, M.; Castellini, G.; Consiglio, L.; De Pascale, M. P.; De Santis, C.; De Simone, N.; Di Felice, V.; Galper, A. M.; Gillard, W.; Grishantseva, L.; Jerse, G.; Karelin, A. V.; Koldashov, S. V.;  et al. (2011). \"PAMELA Measurements of Cosmic-Ray Proton and Helium Spectra\". Science. 332 (6025): 69–72. arXiv:1103.4055. Bibcode:2011Sci...332...69A. doi:10.1126/science.1199172. hdl:2108/55474. PMID 21385721.\n\n\n\t^ Jha, Alok (14 February 2013). \"Cosmic ray mystery solved\". The Guardian. Guardian News and Media Limited. Retrieved 21 March 2013.\n\n\n\t^ The Pierre Auger Collaboration (2017). \"Observation of a Large-scale Anisotropy in the Arrival Directions of Cosmic Rays above 8×10^18 eV\". Science. 357 (6357): 1266–1270. arXiv:1709.07321. doi:10.1126/science.aan4338. PMID 28935800.\n\n\n\t^ Mewaldt, Richard A. (1996). \"Cosmic Rays\". California Institute of Technology.\n\n\n\t^ Koch, L.; Engelmann, J. J.; Goret, P.; Juliusson, E.; Petrou, N.; Rio, Y.; Soutoul, A.; Byrnak, B.; Lund, N.; Peters, B. (October 1981). \"The relative abundances of the elements scandium to manganese in relativistic cosmic rays and the possible radioactive decay of manganese 54\". Astronomy and Astrophysics. 102 (11): L9. Bibcode:1981A&A...102L...9K.\n\n\n\t^ L. Accardo (AMS Collaboration);  et al. (18 September 2014). \"High Statistics Measurement of the Positron Fraction in Primary Cosmic Rays of 0.5–500 GeV with the Alpha Magnetic Spectrometer on the International Space Station\" (PDF). Physical Review Letters. 113 (12): 121101. Bibcode:2014PhRvL.113l1101A. doi:10.1103/PhysRevLett.113.121101. PMID 25279616.\n\n\n\t^ Schirber, Michael (2014). \"Synopsis: More Dark Matter Hints from Cosmic Rays?\". Physical Review Letters. 113 (12): 121102. arXiv:1701.07305. Bibcode:2014PhRvL.113l1102A. doi:10.1103/PhysRevLett.113.121102. hdl:1721.1/90426. PMID 25279617.\n\n\n\t^ \"New results from the Alpha Magnetic$Spectrometer on the International Space Station\" (PDF). AMS-02 at NASA. Retrieved 21 September 2014.\n\n\n\t^ Aguilar, M.; Alberti, G.; Alpat, B.; Alvino, A.; Ambrosi, G.; Andeen, K.; Anderhub, H.; Arruda, L.; Azzarello, P.; Bachlechner, A.; Barao, F.; Baret, B.; Barrau, A.; Barrin, L.; Bartoloni, A.; Basara, L.; Basili, A.; Batalha, L.; Bates, J.; Battiston, R.; Bazo, J.; Becker, R.; Becker, U.; Behlmann, M.; Beischer, B.; Berdugo, J.; Berges, P.; Bertucci, B.; Bigongiari, G.;  et al. (2013). \"First Result from the Alpha Magnetic Spectrometer on the International Space Station: Precision Measurement of the Positron Fraction in Primary Cosmic Rays of 0.5–350 GeV\" (PDF). Physical Review Letters. 110 (14): 141102. Bibcode:2013PhRvL.110n1102A. doi:10.1103/PhysRevLett.110.141102. PMID 25166975.\n\n\n\t^ Moskalenko, I. V.; Strong, A. W.; Ormes, J. F.; Potgieter, M. S. (January 2002). \"Secondary antiprotons and propagation of cosmic rays in the Galaxy and heliosphere\". The Astrophysical Journal. 565 (1): 280–296. arXiv:astro-ph/0106567. Bibcode:2002ApJ...565..280M. doi:10.1086/324402.\n\n\n\t^ AMS Collaboration; Aguilar, M.; Alcaraz, J.; Allaby, J.; Alpat, B.; Ambrosi, G.; Anderhub, H.; Ao, L.;  et al. (August 2002). \"The Alpha Magnetic Spectrometer (AMS) on the International Space Station: Part I – results from the test flight on the space shuttle\". Physics Reports. 366 (6): 331–405. Bibcode:2002PhR...366..331A. doi:10.1016/S0370-1573(02)00013-3. hdl:2078.1/72661.\n\n\n\t^ \"EGRET Detection of Gamma Rays from the Moon\". NASA/GSFC. 1 August 2005. Retrieved 11 February 2010.\n\n\n\t^ Morison, Ian (2008). Introduction to Astronomy and Cosmology. John Wiley & Sons. p. 198. Bibcode:2008iac..book.....M. ISBN 978-0-470-03333-3.\n\n\n\t^ \"Extreme Space Weather Events\". National Geophysical Data Center.\n\n\n\t^ \"Pierre Auger Observatory\". Auger.org. Archived from the original on 12 October 2012. Retrieved 17 August 2012.\n\n\n\t^ \"The Mystery of High-Energy Cosmic Rays\". Pierre Auger Observatory. Auger.org.\n\n\n\t^ \nD. Lal; A.J.T. Jull; D. Pollard; L. Vacher (2005). \"Evidence for large century time-scale changes in solar activity in the past 32 Kyr, based on in-situ cosmogenic 14C in ice at Summit, Greenland\". Earth and Planetary Science Letters. 234 (3–4): 335–349. Bibcode:2005E&PSL.234..335L. doi:10.1016/j.epsl.2005.02.011.\n\n\n\t^ Castellina, Antonella; Donato, Fiorenza (2012).  Oswalt, T.D.; McLean, I.S.; Bond, H.E.; French, L.; Kalas, P.; Barstow, M.; Gilmore, G.F.; Keel, W. (eds.). Planets, Stars, and Stellar Systems (1 ed.). Springer. ISBN 978-90-481-8817-8.\n\n\n\t^ \nR.L. Fleischer; P.B. Price; R.M. Walker (1975). Nuclear tracks in solids: Principles and applications. University of California Press.\n\n\n\t^ \"What are cosmic rays?\" (PDF). Michigan State University National Superconducting Cyclotron Laboratory. Archived from the original (PDF) on 12 July 2012. Retrieved 23 February 2013.\n\n\n\t^ \"Cloud Chambers and Cosmic Rays: A Lesson Plan and Laboratory Activity for the High School Science Classroom\" (PDF). Cornell University Laboratory for Elementary-Particle Physics. 2006. Retrieved 23 February 2013.\n\n\n\t^ Chu, W.; Kim, Y.; Beam, W.; Kwak, N. (1970). \"Evidence of a Quark in a High-Energy Cosmic-Ray Bubble-Chamber Picture\". Physical Review Letters. 24 (16): 917–923. Bibcode:1970PhRvL..24..917C. doi:10.1103/PhysRevLett.24.917.\n\n\n\t^ Timmer, John (13 October 2014). \"Cosmic ray particle shower? There's an app for that\". Ars Technica.\n\n\n\t^ Collaboration website Archived 14 October 2014 at the Wayback Machine\n\n\t^ CRAYFIS detector array paper.  Archived 14 October 2014 at the Wayback Machine\n\n\t^ \"CREDO\". credo.science.\n\n\n\t^ \"CREDO's first light: The global particle detector begins its collection of scientific data\". EurekAlert!.\n\n\n\t^ \"The Detection of Cosmic Rays\". Milagro Gamma-Ray Observatory. Los Alamos National Laboratory. 3 April 2002. Archived from the original on 5 March 2013. Retrieved 22 February 2013.\n\n\n\t^ Letessier-Selvon, Antoine; Stanev, Todor (2011). \"Ultrahigh energy cosmic rays\". Reviews of Modern Physics. 83 (3): 907–942. arXiv:1103.0031. Bibcode:2011RvMP...83..907L. doi:10.1103/RevModPhys.83.907.\n\n\n\t^ Trumbore, Susan (2000).  Noller, J. S.; J. M. Sowers; W. R. Lettis (eds.). Quaternary Geochronology: Methods and Applications. Washington, D.C.: American Geophysical Union. pp. 41–59. ISBN 978-0-87590-950-9.\n\n\n\t^ \n\"Natürliche, durch kosmische Strahlung laufend erzeugte Radionuklide\" (PDF) (in German). Retrieved 11 February 2010.\n\n\n\t^ UNSCEAR \"Sources and Effects of Ionizing Radiation\" page 339 retrieved 29 June 2011\n\n\t^ Japan NIRS UNSCEAR 2008 report page 8 retrieved 29 June 2011\n\n\t^ Princeton.edu \"Background radiation\" Archived 9 June 2011 at the Wayback Machine retrieved 29 June 2011\n\n\t^ Washington state Dept. of Health \"Background radiation\" Archived 2 May 2012 at the Wayback Machine retrieved 29 June 2011\n\n\t^ Ministry of Education, Culture, Sports, Science, and Technology of Japan \"Radiation in environment\" retrieved 29 June 2011\n\n\t^ IBM experiments in soft fails in computer electronics (1978–1994), from Terrestrial cosmic rays and soft errors, IBM Journal of Research and Development, Vol. 40, No. 1, 1996. Retrieved 16 April 2008.\n\n\t^ Scientific American (21 July 2008). \"Solar Storms: Fast Facts\". Nature Publishing Group.\n\n\n\t^ Intel plans to tackle cosmic ray threat, BBC News Online, 8 April 2008. Retrieved 16 April 2008.\n\n\t^ In-flight upset, 154 km west of Learmonth, Western Australia, 7 October 2008, VH-QPA, Airbus A330-303. (2011). Australian Transport Safety Bureau.\n\n\t^ https://cars.usnews.com/cars-trucks/daily-news/100317-cosmic-rays-may-be-causing-unintended-acceleration-in-toyotas\n\n\t^ \"Bit Flip | Radiolab\". WNYC Studios.\n\n\n\t^ Globus, Al (10 July 2002). \"Appendix E: Mass Shielding\". Space Settlements: A Design Study. NASA. Retrieved 24 February 2013.\n\n\n\t^ Atkinson, Nancy (24 January 2005). \"Magnetic shielding for spacecraft\". The Space Review. Retrieved 24 February 2013.\n\n\n\t^ Phillips, Tony (25 October 2013). \"The Effects of Space Weather on Aviation\". Science News. NASA.\n\n\n\t^  \"Converting Cosmic Rays to Sound During a Transatlantic Flight to Zurich\"  on YouTube\n\n\t^ \"NAIRAS Real-time radiation Dose\". sol.spacenvironment.net.\n\n\n\t^ Runaway Breakdown and the Mysteries of Lightning, Physics Today, May 2005.\n\n\t^ Ney, Edward P. (14 February 1959). \"Cosmic Radiation and the Weather\". Nature. 183 (4659): 451–452. Bibcode:1959Natur.183..451N. doi:10.1038/183451a0.\n\n\n\t^ Dickinson, Robert E. (December 1975). \"Solar Variability and the Lower Atmosphere\". Bulletin of the American Meteorological Society. 56 (12): 1240–1248. Bibcode:1975BAMS...56.1240D. doi:10.1175/1520-0477(1975)056<1240:SVATLA>2.0.CO;2.\n\n\n\t^ \"\"Ancient Mass Extinctions Caused by Cosmic Radiation, Scientists Say\" – National Geographic (2007)\".\n\n\n\t^ Melott, A.L.; Thomas, B.C. (2009). \"Late Ordovician geographic patterns of extinction compared with simulations of astrophysical ionizing radiation damage\". Paleobiology. 35 (3): 311–320. arXiv:0809.0899. doi:10.1666/0094-8373-35.3.311.\n\n\n\t^ \"Did Supernova Explosion Contribute to Earth Mass Extinction?\". Space.com.\n\n\n\t^ Long, Marion (25 June 2007). \"Sun's Shifts May Cause Global Warming\". Discover. Retrieved 7 July 2013.\n\n\n\t^ Henrik Svensmark (1998). \"Influence of Cosmic Rays on Earth's Climate\" (PDF). Physical Review Letters. 81 (22): 5027–5030. Bibcode:1998PhRvL..81.5027S. CiteSeerX 10.1.1.522.585. doi:10.1103/PhysRevLett.81.5027.\n\n\n\t^ Plait, Phil (31 August 2011). \"No, a new study does not show cosmic-rays are connected to global warming\". Discover. Kalmbach Publishing. Retrieved 11 January 2018.\n\n\n\t^ Benestad, Rasmus E. \"'Cosmoclimatology' – tired old arguments in new clothes\". Retrieved 13 November 2013.\n\n\n\t^ Peter Laut, \"Solar activity and terrestrial climate: an analysis of some purported correlations\", Journal of Atmospheric and Solar-Terrestrial Physics 65 (2003) 801- 812\n\n\t^ Lockwood, Mike (16 May 2012). \"Solar Influence on Global and Regional Climates\". Surveys in Geophysics. 33 (3–4): 503–534. Bibcode:2012SGeo...33..503L. doi:10.1007/s10712-012-9181-3.\n\n\n\t^ Sloan, T.; Wolfendale, A.W. (7 November 2013). \"Cosmic rays, solar activity and the climate\". Environmental Research Letters. 8 (4): 045022. Bibcode:2013ERL.....8d5022S. doi:10.1088/1748-9326/8/4/045022.\n\n\n\t^ Melott, Adrian L.; F. Marinho; L. Paulucci (2019). \"Muon Radiation Dose and Marine Megafaunal Extinction at the end-Pliocene Supernova\". Astrobiology. 19 (6): 825–830. arXiv:1712.09367. doi:10.1089/ast.2018.1902. PMID 30481053.\n\n\n\t^ Benitez, Narciso;  et al. (2002). \"Evidence for Nearby Supernova Explosions\". Phys. Rev. Lett. 88 (8): 081101. arXiv:astro-ph/0201018. Bibcode:2002PhRvL..88h1101B. doi:10.1103/PhysRevLett.88.081101. PMID 11863949.\n\n\n\t^ Fimiani, L.; Cook, D.L.; Faestermann, T.; Gómez-Guzmán, J.M.; Hain, K.; Herzog, G.; Knie, K.; Korschinek, G.; Ludwig, P.; Park, J.; Reedy, R.C.; Rugel, G. (2016). \"Interstellar 60Fe on the Surface of the Moon\". Phys. Rev. Lett. 116 (15): 151104. doi:10.1103/PhysRevLett.116.151104. PMID 27127953.\n\n\n\n\n\n\nFurther references[edit]\n\n\n\tDe Angelis, Alessandro; Pimenta, Mario (2018). Introduction to particle and astroparticle physics (multimessenger astronomy and its particle physics foundations). Springer. doi:10.1007/978-3-319-78181-5. ISBN 978-3-319-78181-5.\n\n\tR.G. Harrison and D.B. Stephenson, Detection of a galactic cosmic ray influence on clouds, Geophysical Research Abstracts, Vol. 8, 07661, 2006 SRef-ID: 1607-7962/gra/EGU06-A-07661\n\tAnderson, C. D.; Neddermeyer, S. H. (1936). \"Cloud Chamber Observations of Cosmic Rays at 4300 Meters Elevation and Near Sea-Level\" (PDF). Phys. Rev. (Submitted manuscript). 50 (4): 263–271. Bibcode:1936PhRv...50..263A. doi:10.1103/physrev.50.263.\n\n\tBoezio, M.;  et al. (2000). \"Measurement of the flux of atmospheric muons with the CAPRICE94 apparatus\". Phys. Rev. D. 62 (3): 032007. arXiv:hep-ex/0004014. Bibcode:2000PhRvD..62c2007B. doi:10.1103/physrevd.62.032007.\n\n\tR. Clay and B. Dawson, Cosmic Bullets, Allen & Unwin, 1997. \nISBN 1-86448-204-4\n\tT. K. Gaisser, Cosmic Rays and Particle Physics, Cambridge University Press, 1990. \nISBN 0-521-32667-2\n\tP. K. F. Grieder, Cosmic Rays at Earth: Researcher's Reference Manual and Data Book, Elsevier, 2001. \nISBN 0-444-50710-8\n\tA. M. Hillas, Cosmic Rays, Pergamon Press, Oxford, 1972 \nISBN 0-08-016724-1\n\tKremer, J.;  et al. (1999). \"Measurement of Ground-Level Muons at Two Geomagnetic Locations\". Phys. Rev. Lett. 83 (21): 4241–4244. Bibcode:1999PhRvL..83.4241K. doi:10.1103/physrevlett.83.4241.\n\n\tNeddermeyer, S. H.; Anderson, C. D. (1937). \"Note on the Nature of Cosmic-Ray Particles\" (PDF). Phys. Rev. (Submitted manuscript). 51 (10): 884–886. Bibcode:1937PhRv...51..884N. doi:10.1103/physrev.51.884.\n\n\tM. D. Ngobeni and M. S. Potgieter, Cosmic ray anisotropies in the outer heliosphere, Advances in Space Research, 2007.\n\tM. D. Ngobeni, Aspects of the modulation of cosmic rays in the outer heliosphere, MSc Dissertation, Northwest University (Potchefstroom campus) South Africa 2006.\n\tD. Perkins, Particle Astrophysics, Oxford University Press, 2003. \nISBN 0-19-850951-0\n\tC. E. Rolfs and S. R. William, Cauldrons in the Cosmos, The University of Chicago Press, 1988. \nISBN 0-226-72456-5\n\tB. B. Rossi, Cosmic Rays, McGraw-Hill, New York, 1964.\n\tMartin Walt, Introduction to Geomagnetically Trapped Radiation, 1994. \nISBN 0-521-43143-3\n\tTaylor, M.; Molla, M. (2010). \"Towards a unified source-propagation model of cosmic rays\". Publ. Astron. Soc. Pac. 424: 98. Bibcode:2010ASPC..424...98T.\n\n\tZiegler, J. F. (1981). \"The Background in Detectors Caused By Sea Level Cosmic Rays\". Nuclear Instruments and Methods. 191 (1): 419–424. Bibcode:1981NIMPR.191..419Z. doi:10.1016/0029-554x(81)91039-9.\n\n\tTRACER Long Duration Balloon Project: the largest cosmic ray detector launched on balloons.\n\tCarlson, Per; De Angelis, Alessandro (2011). \"Nationalism and internationalism in science: the case of the discovery of cosmic rays\". European Physical Journal H. 35 (4): 309–329. arXiv:1012.5068. Bibcode:2010EPJH...35..309C. doi:10.1140/epjh/e2011-10033-6.\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Cosmic rays.\n\n\n\tAspera European network portal\n\tAnimation about cosmic rays on astroparticle.org\n\tHelmholtz Alliance for Astroparticle Physics\n\tParticle Data Group review of Cosmic Rays by C. Amsler et al., Physics Letters B667, 1 (2008).\n\tIntroduction to Cosmic Ray Showers by Konrad Bernlöhr.\n\tBBC news, Cosmic rays find uranium, 2003.\n\tBBC news, Rays to nab nuclear smugglers, 2005.\n\tBBC news, Physicists probe ancient pyramid (using cosmic rays), 2004.\n\tShielding Space Travelers by Eugene Parker.\n\tAnomalous cosmic ray hydrogen spectra from Voyager 1 and 2\n\tAnomalous Cosmic Rays (From NASA's Cosmicopia)\n\tReview of Cosmic Rays\n\t\"Who's Afraid of a Solar Flare? Solar activity can be surprisingly good for astronauts.\" 7 October 2005, at Science@NASA\n\tvideo of Muon detector in use at Smithsonian Air and Space Museum\n\tDr. Lothar Frey \"Cosmic rays and electronic devices\" (YouTube Video) SpaceUp Stuttgart 2012\n\tARMAS, Real-time cosmic-ray radiation measurements at aviation altitudes.\n\tPadilla, Antonio (Tony). \"Where do Cosmic Rays come from?\". Sixty Symbols. Brady Haran for the University of Nottingham.\n\n\n\n\t\tv\n\tt\n\te\n\n\nRadiation (physics and health)\n\n\tMain articles\t\n\tNon-ionizing radiation\t\n\tAcoustic radiation force\n\tInfrared\n\tLight\n\tStarlight\n\tSunlight\n\tMicrowave\n\tRadio waves\n\tUltraviolet\n\n\n\n\n\tIonizing radiation\t\n\tRadioactive decay\n\tCluster decay\n\tBackground radiation\n\tAlpha particle\n\tBeta particle\n\tGamma ray\n\tCosmic ray\n\tNeutron radiation\n\tNuclear fission\n\tNuclear fusion\n\tNuclear reactors\n\tNuclear weapons\n\tParticle accelerators\n\tRadioactive materials\n\tX-ray\n\n\n\n\n\t\n\tEarth's energy budget\n\tElectromagnetic radiation\n\tSynchrotron radiation\n\tThermal radiation\n\tBlack-body radiation\n\tParticle radiation\n\tGravitational Radiation\n\tCosmic background radiation\n\tCherenkov radiation\n\tAskaryan radiation\n\tBremsstrahlung\n\tUnruh radiation\n\tDark radiation\n\n\n\n\n\n\n\n\tRadiation \nand health\t\n\tRadiation syndrome\n\tacute\n\tchronic\n\n\n\tHealth physics\n\tDosimetry\n\tElectromagnetic radiation and health\n\tLaser safety\n\tLasers and aviation safety\n\tMedical radiography\n\tMobile phone radiation and health\n\tRadiation protection\n\tRadiation therapy\n\tRadioactivity in the life sciences\n\tRadioactive contamination\n\tRadiobiology\n\tBiological dose units and quantities\n\tWireless electronic devices and health\n\tRadiation Heat-transfer\n\n\n\n\n\tRelated articles\t\n\tHalf-life\n\tNuclear physics\n\tRadioactive source\n\tRadiation hardening\n\tList of civilian radiation accidents\n\t1996 Costa Rica accident\n\t1987 Goiânia accident\n\t1984 Moroccan accident\n\t1990 Zaragoza accident\n\n\n\n\n\tSee also: the categories Radiation effects, Radioactivity, Radiobiology, and Radiation protection.\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nMolecules detected in outer space\n\n\tMolecules\t\n\tDiatomic\t\n\tAluminium monochloride\n\tAluminium monofluoride\n\tAluminium monoxide\n\tArgonium\n\tCarbon monophosphide\n\tCarbon monosulfide\n\tCarbon monoxide\n\tCarborundum\n\tCyanogen radical\n\tDiatomic carbon\n\tFluoromethylidynium\n\tHelium hydride ion\n\tHydrogen chloride\n\tHydrogen fluoride\n\tHydrogen (molecular)\n\tHydroxyl radical\n\tIron(II) oxide\n\tMagnesium monohydride cation\n\tMethylidyne radical\n\tNitric oxide\n\tNitrogen (molecular)\n\tNitrogen monohydride\n\tNitrogen sulfide\n\tOxygen (molecular)\n\tPhosphorus monoxide\n\tPhosphorus mononitride\n\tPotassium chloride\n\tSilicon carbide\n\tSilicon mononitride\n\tSilicon monoxide\n\tSilicon monosulfide\n\tSodium chloride\n\tSodium iodide\n\tSulfur monohydride\n\tSulfur monoxide\n\tTitanium oxide\n\n\n\n\t \n\n\n\n  \n\n\n\n \n\n\tTriatomic\t\n\tAluminium hydroxide\n\tAluminium isocyanide\n\tAmino radical\n\tCarbon dioxide\n\tCarbonyl sulfide\n\tCCP radical\n\tChloronium\n\tDiazenylium\n\tDicarbon monoxide\n\tDisilicon carbide\n\tEthynyl radical\n\tFormyl radical\n\tHydrogen cyanide (HCN)\n\tHydrogen isocyanide (HNC)\n\tHydrogen sulfide\n\tHydroperoxyl\n\tIron cyanide\n\tIsoformyl\n\tMagnesium cyanide\n\tMagnesium isocyanide\n\tMethylene radical\n\tN2H+\n\tNitrous oxide\n\tNitroxyl\n\tOzone\n\tPhosphaethyne\n\tPotassium cyanide\n\tProtonated molecular hydrogen\n\tSodium cyanide\n\tSodium hydroxide\n\tSilicon carbonitride\n\tc-Silicon dicarbide\n\tSiNC\n\tSulfur dioxide\n\tThioformyl\n\tThioxoethenylidene\n\tTitanium dioxide\n\tTricarbon\n\tWater\n\n\n\n\n\tFour\natoms\t\n\tAcetylene\n\tAmmonia\n\tCyanic acid\n\tCyanoethynyl\n\tCyclopropynylidyne\n\tFormaldehyde\n\tFulminic acid\n\tHCCN\n\tHydrogen peroxide\n\tHydromagnesium isocyanide\n\tIsocyanic acid\n\tIsothiocyanic acid\n\tKetenyl\n\tMethylene amidogen\n\tMethyl radical\n\tPropynylidyne\n\tProtonated carbon dioxide\n\tProtonated hydrogen cyanide\n\tSilicon tricarbide\n\tThioformaldehyde\n\tTricarbon monoxide\n\tTricarbon sulfide\n\tThiocyanic acid\n\n\n\n\n\tFive\natoms\t\n\tAmmonium ion\n\tButadiynyl\n\tCarbodiimide\n\tCyanamide\n\tCyanoacetylene\n\tCyanoformaldehyde\n\tCyanomethyl\n\tCyclopropenylidene\n\tFormic acid\n\tIsocyanoacetylene\n\tKetene\n\tMethane\n\tMethoxy radical\n\tMethylenimine\n\tPropadienylidene\n\tProtonated formaldehyde\n\tProtonated formaldehyde\n\tSilane\n\tSilicon-carbide cluster\n\n\n\n\n\tSix\natoms\t\n\tAcetonitrile\n\tCyanobutadiynyl radical\n\tE-Cyanomethanimine\n\tCyclopropenone\n\tDiacetylene\n\tEthylene\n\tFormamide\n\tHC4N\n\tKetenimine\n\tMethanethiol\n\tMethanol\n\tMethyl isocyanide\n\tPentynylidyne\n\tPropynal\n\tProtonated cyanoacetylene\n\n\n\n\n\tSeven\natoms\t\n\tAcetaldehyde\n\tAcrylonitrile\n\tVinyl cyanide\n\n\n\tCyanodiacetylene\n\tEthylene oxide\n\tGlycolonitrile\n\tHexatriynyl radical\n\tMethylacetylene\n\tMethylamine\n\tMethyl isocyanate\n\tVinyl alcohol\n\n\n\n\n\tEight\natoms\t\n\tAcetic acid\n\tAminoacetonitrile\n\tCyanoallene\n\tEthanimine\n\tGlycolaldehyde\n\tHeptatrienyl radical\n\tHexapentaenylidene\n\tMethylcyanoacetylene\n\tMethyl formate\n\tPropenal\n\n\n\n\n\tNine\natoms\t\n\tAcetamide\n\tCyanohexatriyne\n\tCyanotriacetylene\n\tDimethyl ether\n\tEthanol\n\tMethyldiacetylene\n\tOctatetraynyl radical\n\tPropene\n\tPropionitrile\n\n\n\n\n\tTen\natoms\nor more\t\n\tAcetone\n\tBenzene\n\tBenzonitrile\n\tBuckminsterfullerene (C60, C60+, fullerene, buckyball)\n\tC70 fullerene\n\tCyanodecapentayne\n\tCyanopentaacetylene\n\tCyanotetra-acetylene\n\tEthylene glycol\n\tEthyl formate\n\tMethyl acetate\n\tMethyl-cyano-diacetylene\n\tMethyltriacetylene\n\tPropanal\n\tn-Propyl cyanide\n\tPyrimidine\n\n\n\n\n\n\n\n\tDeuterated\nmolecules\t\n\tAmmonia\n\tAmmonium ion\n\tFormaldehyde\n\tFormyl radical\n\tHeavy water\n\tHydrogen cyanide\n\tHydrogen deuteride\n\tHydrogen isocyanide\n\tMethylacetylene\n\tN2D+\n\tTrihydrogen cation\n\n\n\n\n\tUnconfirmed\t\n\tAnthracene\n\tDihydroxyacetone\n\tEthyl methyl ether\n\tGlycine\n\tGraphene\n\tH2NCO+\n\tLinear C5\n\tNaphthalene cation\n\tPhosphine\n\tPyrene\n\tSilylidine\n\n\n\n\n\tRelated\t\n\tAbiogenesis\n\tAstrobiology\n\tAstrochemistry\n\tAtomic and molecular astrophysics\n\tChemical formula\n\tCircumstellar envelope\n\tCosmic dust\n\tCosmic ray\n\tCosmochemistry\n\tDiffuse interstellar band\n\tEarliest known life forms\n\tExtraterrestrial life\n\tExtraterrestrial liquid water\n\tForbidden mechanism\n\tHomochirality\n\tIntergalactic dust\n\tInterplanetary medium\n\tInterstellar medium\n\tPhotodissociation region\n\tIron–sulfur world theory\n\tKerogen\n\tMolecules in stars\n\tNexus for Exoplanet System Science\n\tOrganic compound\n\tOuter space\n\tPAH world hypothesis\n\tPanspermia\n\tPolycyclic aromatic hydrocarbon (PAH)\n\tRNA world hypothesis\n\tSpectroscopy\n\tTholin\n\n\n\n\n\t\n\t Category:Astrochemistry\n\t Astronomy portal\n\t Biology portal\n\t Chemistry portal\n\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4165371-3\n\tNDL: 00574086\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Cosmic_ray&oldid=916982406\"\n\n\t\t\n\t\tCategories: \tCosmic rays\n\tAstroparticle physics\n\tIonizing radiation\n\tStellar phenomena\n\tSolar phenomena\n\n\nHidden categories: \tCS1: long volume value\n\tWebarchive template wayback links\n\tCS1 German-language sources (de)\n\tArticles with short description\n\tUse dmy dates from September 2019\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from April 2015\n\tArticles with unsourced statements from July 2017\n\tCommons category link is on Wikidata\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tБеларуская\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEmiliàn e rumagnòl\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tҚазақша\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tLimburgs\n\tLumbaart\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tNovial\n\tOccitan\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tپښتو\n\tPiemontèis\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tසිංහල\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 21 September 2019, at 17:59 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "12", "dc:title": "Cosmic ray - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Cosmic_ray_flux_versus_particle_energy.svg/1200px-Cosmic_ray_flux_versus_particle_energy.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-cosmic_radiation", "title": "Cosmic ray - Wikipedia"}}