{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDynamic random-access memory - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tDynamic random-access memory\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Dynamic random access memory)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\"DRAM\" redirects here. For other uses, see DRAM (disambiguation).\n\n\t\n\tThis article has an unclear citation style. The references used may be made clearer with a different or consistent style of citation and footnoting.  (April 2019) (Learn how and when to remove this template message)\n\n\n\n\tComputer memory types\n\t\nVolatile\n\t\nRAM\n\t\n\tDRAM\n\tSDRAM\n\n\n\tSRAM\n\n\n\t\nHistorical\n\t\n\tWilliams–Kilburn tube (1946–47)\n\tDelay line memory (1947)\n\tMellon optical memory (1951)\n\tSelectron tube (1952)\n\tDekatron\n\tT-RAM (2009)\n\tZ-RAM (2002–2010)\n\n\n\t\nNon-volatile\n\t\nROM\n\t\n\tMask ROM\n\tPROM\n\tEPROM\n\tEEPROM\n\tFlash memory\n\n\n\t\nNVRAM\n\t\n\tReRAM\n\n\n\t\nEarly stage NVRAM\n\t\n\tFeRAM\n\tMRAM\n\tPCM\n\tFeFET memory\n\n\n\t\nMagnetic\n\t\n\tMagnetic tape\n\tHard disk drive\n\n\n\t\nOptical\n\t\n\tOptical disc\n\n\n\t\nIn development\n\t\n\tCBRAM\n\tRacetrack memory\n\tNRAM\n\tMillipede memory\n\tFJG RAM\n\n\n\t\nHistorical\n\t\n\tPaper data storage (1725)\n\tDrum memory (1932)\n\tMagnetic-core memory (1949)\n\tPlated wire memory (1957)\n\tCore rope memory (1960s)\n\tThin-film memory (1962)\n\tDisk pack (1962)\n\tTwistor memory (~1968)\n\tBubble memory (~1970)\n\tFloppy disk (1971)\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\n  \nA die photograph of the Micron Technology MT4C1024 DRAM integrated circuit. It has a capacity of 1 megabit equivalent of \n  \n    \n      \n        \n          2\n          \n            20\n          \n        \n      \n    \n    {\\displaystyle 2^{20}}\n  \nbits or 128 KB. [1]\n\n\n\nDynamic random-access memory (DRAM) is a type of  random access semiconductor memory that stores each bit of data in a memory cell consisting of a tiny capacitor and a transistor, both typically based on metal-oxide-semiconductor (MOS) technology. The capacitor can either be charged or discharged; these two states are taken to represent the two values of a bit, conventionally called 0 and 1.  The electric charge on the capacitors slowly leaks off, so without intervention the data on the chip would soon be lost.  To prevent this, DRAM requires an external memory refresh circuit which periodically rewrites the data in the capacitors, restoring them to their original charge. This refresh process is the defining characteristic of dynamic random-access memory, in contrast to static random-access memory (SRAM) which does not require data to be refreshed. Unlike flash memory, DRAM is volatile memory (vs. non-volatile memory), since it loses its data quickly when power is removed. However, DRAM does exhibit limited data remanence.\n\nDRAM typically takes the form of an integrated circuit chip, which can consist of dozens to billions of DRAM memory cells. DRAM chips are widely used in digital electronics where low-cost and high-capacity computer memory is required. One of the largest applications for DRAM is the main memory (colloquially called the \"RAM\") in modern computers and graphics cards (where the \"main memory\" is called the graphics memory).  It is also used in many portable devices and video game consoles.  In contrast, SRAM, which is faster and more expensive than DRAM, is typically used where speed is of greater concern than cost and size, such as the cache memories in processors.\n\nDue to its need of a system to perform refreshing, DRAM has more complicated circuitry and timing requirements than SRAM, but it is much more widely used.  The advantage of DRAM is the structural simplicity of its memory cells: only one transistor and a capacitor are required per bit, compared to four or six transistors in SRAM. This allows DRAM to reach very high densities, making DRAM much cheaper per bit. The transistors and capacitors used are extremely small; billions can fit on a single memory chip. Due to the dynamic nature of its memory cells, DRAM consumes relatively large amounts of power, with different ways for managing the power consumption.[2]\n\nDRAM had a 47% increase in the price-per-bit in 2017, the largest jump in 30 years since the 45% percent jump in 1988, while in recent years the price has been going down.[3]\n\n\nContents\n\n\n\t1 History\n\t2 Principles of operation\n\t2.1 Operations to read a data bit from a DRAM storage cell\n\t2.2 To write to memory\n\t2.3 Refresh rate\n\t2.4 Memory timing\n\t2.4.1 Timing abbreviations\n\n\n\n\n\n\n\t3 Memory cell design\n\t3.1 Capacitor design\n\t3.2 Historical cell designs\n\t3.3 Proposed cell designs\n\n\n\n\t4 Array structures\n\t4.1 Bitline architecture\n\t4.1.1 Open bitline arrays\n\t4.1.2 Folded bitline arrays\n\t4.1.3 Future array architectures\n\n\n\n\t4.2 Row and column redundancy\n\n\n\n\t5 Error detection and correction\n\t6 Security\n\t6.1 Data remanence\n\t6.2 Memory corruption\n\n\n\n\t7 Packaging\n\t7.1 Memory module\n\t7.2 Embedded\n\n\n\n\t8 Versions\n\t8.1 Asynchronous DRAM\n\t8.1.1 Principles of operation\n\t8.1.1.1 RAS Only Refresh (ROR)\n\t8.1.1.2 CAS before RAS refresh (CBR)\n\t8.1.1.3 Hidden refresh\n\n\n\n\t8.1.2 Page mode DRAM\n\t8.1.2.1 Extended data out DRAM (EDO DRAM)\n\n\n\n\t8.1.3 Burst EDO DRAM (BEDO DRAM)\n\n\n\n\t8.2 Synchronous dynamic RAM (SDRAM)\n\t8.2.1 Single data rate synchronous DRAM (SDR SDRAM)\n\t8.2.2 Double data rate synchronous DRAM (DDR SDRAM)\n\t8.2.3 Direct Rambus DRAM (DRDRAM)\n\t8.2.4 Reduced Latency DRAM (RLDRAM)\n\n\n\n\t8.3 Graphics RAM\n\t8.3.1 Video DRAM (VRAM)\n\t8.3.2 Window DRAM (WRAM)\n\t8.3.3 Multibank DRAM (MDRAM)\n\t8.3.4 Synchronous graphics RAM (SGRAM)\n\t8.3.5 Graphics double data rate SDRAM (GDDR SDRAM)\n\n\n\n\t8.4 Pseudostatic RAM (PSRAM)\n\n\n\n\t9 See also\n\t10 References\n\t11 Further reading\n\t12 External links\n\n\n\n\n\nHistory[edit]\n\n  \nA schematic drawing depicting the cross-section of the original one-transistor, one-capacitor NMOS DRAM cell. It was patented in 1968.\n\n\n\nThe cryptanalytic machine code-named \"Aquarius\" used at Bletchley Park during World War II incorporated a hard-wired dynamic memory. Paper tape was read and the characters on it \"were remembered in a dynamic store. ... The store used a large bank of capacitors, which were either charged or not, a charged capacitor representing cross (1) and an uncharged capacitor dot (0). Since the charge gradually leaked away, a periodic pulse was applied to top up those still charged (hence the term 'dynamic')\".[4]\n\nThe Toshiba \"Toscal\" BC-1411 electronic calculator, which was introduced in November 1965,[5][6] used a form of capacitive DRAM (180 bit) built from discrete bipolar memory cells.[5][7] The same year,[8] Arnold Farber and Eugene Schlig, working for IBM, created a hard-wired memory cell, using a transistor gate and tunnel diode latch. They replaced the latch with two transistors and two resistors, a configuration that became known as the Farber-Schlig cell.  In 1965, Benjamin Agusta and his team at IBM created a 16-bit silicon memory chip based on the Farber-Schlig cell, with 80 transistors, 64 resistors, and 4 diodes.\n\nThe earliest forms of DRAM mentioned above used bipolar transistors. While it offered improved performance over magnetic-core memory, bipolar DRAM could not compete with the lower price of the then dominant magnetic-core memory.[9] Capacitors had also been used for earlier memory schemes, such as the drum of the Atanasoff–Berry Computer, the Williams tube and the Selectron tube.\n\nThe invention of the MOSFET (metal-oxide-semiconductor field-effect transistor), also known as the MOS transistor, by Mohamed Atalla and Dawon Kahng at Bell Labs in 1959,[10] led to the development of metal-oxide-semiconductor (MOS) DRAM. In 1966, Dr. Robert Dennard at the IBM Thomas J. Watson Research Center was working on MOS memory, and was trying to create an alternative to SRAM which required six MOS transistors for each bit of data. While examining the characteristics of MOS technology, he found it was capable of building capacitors, and that storing a charge or no charge on the MOS capacitor could represent the 1 and 0 of a bit, while the MOS transistor could control writing the charge to the capacitor. This led to his development of the single-transistor MOS DRAM memory cell.[11] He filed a patent in 1967, and was granted U.S. patent number 3,387,286 in 1968.[12] MOS memory offered higher performance, was cheaper, and consumed less power, than magnetic-core memory.[13]\n\nMOS DRAM chips were commercialized in 1969 by Advanced Memory system, Inc of Sunnyvale, CA. This 1000 bit chip was sold to Honeywell, Raytheon, Wang Computer, and others.\nThe same year, Honeywell asked Intel to make a DRAM using a three-transistor cell that they had developed. This became the Intel 1102 in early 1970.[14] However, the 1102 had many problems, prompting Intel to begin work on their own improved design, in secrecy to avoid conflict with Honeywell. This became the first commercially available DRAM, the Intel 1103, in October 1970, despite initial problems with low yield until the fifth revision of the masks. The 1103 was designed by Joel Karp and laid out by Pat Earhart. The masks were cut by Barbara Maness and Judy Garcia.[15][original research?] MOS memory overtook magnetic-core memory as the dominant memory technology in the early 1970s.[13]\n\nThe first DRAM with multiplexed row and column address lines was the Mostek MK4096 4 Kbit DRAM designed by Robert Proebsting and introduced in 1973. This addressing scheme uses the same address pins to receive the low half and the high half of the address of the memory cell being referenced, switching between the two halves on alternating bus cycles. This was a radical advance, effectively halving the number of address lines required, which enabled it to fit into packages with fewer pins, a cost advantage that grew with every jump in memory size. The MK4096 proved to be a very robust design for customer applications. At the 16 Kbit density, the cost advantage increased; the 16 Kbit Mostek MK4116 DRAM, introduced in 1976, achieved greater than 75% worldwide DRAM market share. However, as density increased to 64 Kbit in the early 1980s, Mostek and other US manufacturers were overtaken by Japanese DRAM manufacturers, which dominated the US and worldwide markets during the 1980s and 1990s.\n\nSynchronous dynamic random-access memory (SDRAM) was developed by Samsung. The first commercial SDRAM chip was the Samsung KM48SL2000, which had a capacity of 16 Mb,[16] and was introduced in 1992.[17] The first commercial DDR SDRAM (double data rate SDRAM) memory chip was Samsung's 64 Mb DDR SDRAM chip, released in 1998.[18]\n\n\nPrinciples of operation[edit]\n\n  \nThe principles of operation for reading a simple 4 \n  \n    \n      \n        ×\n      \n    \n    {\\displaystyle \\times }\n  \n4 DRAM array\n\n\n\n  \nBasic structure of a DRAM cell array\n\n\n\nDRAM is usually arranged in a rectangular array of charge storage cells consisting of one capacitor and transistor per data bit. The figure to the right shows a simple example with a four-by-four cell matrix. Some DRAM matrices are many thousands of cells in height and width.[19][20]\n\nThe long horizontal lines connecting each row are known as word-lines. Each column of cells is composed of two bit-lines, each connected to every other storage cell in the column (the illustration to the right does not include this important detail). They are generally known as the \"+\" and \"−\" bit lines.\n\nA sense amplifier is essentially a pair of cross-connected inverters between the bit-lines. The first inverter is connected with input from the + bit-line and output to the − bit-line. The second inverter's input is from the − bit-line with output to the + bit-line. This results in positive feedback which stabilizes after one bit-line is fully at its highest voltage and the other bit-line is at the lowest possible voltage.\n\n\nOperations to read a data bit from a DRAM storage cell[edit]\n\n\tThe sense amplifiers are disconnected.[21]\n\tThe bit-lines are precharged to exactly equal voltages that are in between high and low logic levels (e.g., 0.5 V if the two levels are 0 and 1 V). The bit-lines are physically symmetrical to keep the capacitance equal, and therefore at this time their voltages are equal.[21]\n\tThe precharge circuit is switched off. Because the bit-lines are relatively long, they have enough capacitance to maintain the precharged voltage for a brief time. This is an example of dynamic logic.[21]\n\tThe desired row's word-line is then driven high to connect a cell's storage capacitor to its bit-line. This causes the transistor to conduct, transferring charge from the storage cell to the connected bit-line (if the stored value is 1) or from the connected bit-line to the storage cell (if the stored value is 0). Since the capacitance of the bit-line is typically much higher than the capacitance of the storage cell, the voltage on the bit-line increases very slightly if the storage cell's capacitor is discharged and decreases very slightly if the storage cell is charged (e.g., 0.54 and 0.45 V in the two cases). As the other bit-line holds 0.50 V there is a small voltage difference between the two twisted bit-lines.[21]\n\tThe sense amplifiers are now connected to the bit-lines pairs. Positive feedback then occurs from the cross-connected inverters, thereby amplifying the small voltage difference between the odd and even row bit-lines of a particular column until one bit line is fully at the lowest voltage and the other is at the maximum high voltage. Once this has happened, the row is \"open\" (the desired cell data is available).[21]\n\tAll storage cells in the open row are sensed simultaneously, and the sense amplifier outputs latched. A column address then selects which latch bit to connect to the external data bus. Reads of different columns in the same row can be performed without a row opening delay because, for the open row, all data has already been sensed and latched.[21]\n\tWhile reading of columns in an open row is occurring, current is flowing back up the bit-lines from the output of the sense amplifiers and recharging the storage cells. This reinforces (i.e. \"refreshes\") the charge in the storage cell by increasing the voltage in the storage capacitor if it was charged to begin with, or by keeping it discharged if it was empty.  Note that due to the length of the bit-lines there is a fairly long propagation delay for the charge to be transferred back to the cell's capacitor. This takes significant time past the end of sense amplification, and thus overlaps with one or more column reads.[21]\n\tWhen done with reading all the columns in the current open row, the word-line is switched off to disconnect the storage cell capacitors (the row is \"closed\") from the bit-lines. The sense amplifier is switched off, and the bit-lines are precharged again.[21]\n\n\nTo write to memory[edit]\n\n  \nWriting to a DRAM cell\n\n\n\nTo store data, a row is opened and a given column's sense amplifier is temporarily forced to the desired high or low voltage state, thus causing the bit-line to charge or discharge the cell storage capacitor to the desired value. Due to the sense amplifier's positive feedback configuration, it will hold a bit-line at stable voltage even after the forcing voltage is removed. During a write to a particular cell, all the columns in a row are sensed simultaneously just as during reading, so although only a single column's storage-cell capacitor charge is changed, the entire row is refreshed (written back in), as illustrated in the figure to the right.[21]\n\n\nRefresh rate[edit]\n\nMain article: Memory refresh\n\nSee also:  § Security\n\nTypically, manufacturers specify that each row must be refreshed every 64 ms or less, as defined by the JEDEC standard.\n\nSome systems refresh every row in a burst of activity involving all rows every 64 ms. Other systems refresh one row at a time staggered throughout the 64 ms interval. For example, a system with 213 = 8,192 rows would require a staggered refresh rate of one row every 7.8 µs which is 64 ms divided by 8,192 rows. A few real-time systems refresh a portion of memory at a time determined by an external timer function that governs the operation of the rest of a system, such as the vertical blanking interval that occurs every 10–20 ms in video equipment.\n\nThe row address of the row that will be refreshed next is maintained by external logic or a counter within the DRAM. A system that provides the row address (and the refresh command) does so to have greater control over when to refresh and which row to refresh. This is done to minimize conflicts with memory accesses, since such a system has both knowledge of the memory access patterns and the refresh requirements of the DRAM. When the row address is supplied by a counter within the DRAM, the system relinquishes control over which row is refreshed and only provides the refresh command. Some modern DRAMs are capable of self-refresh; no external logic is required to instruct the DRAM to refresh or to provide a row address.\n\nUnder some conditions, most of the data in DRAM can be recovered even if the DRAM has not been refreshed for several minutes.[22]\n\n\nMemory timing[edit]\n\nMain article: Memory timings\n\nMany parameters are required to fully describe the timing of DRAM operation. Here are some examples for two timing grades of asynchronous DRAM, from a data sheet published in 1998:[23]\n\n\n\t\t\"50 ns\"\t\"60 ns\"\tDescription\n\n\ttRC\t84 ns\t104 ns\tRandom read or write cycle time (from one full /RAS cycle to another)\n\n\ttRAC\t50 ns\t60 ns\tAccess time: /RAS low to valid data out\n\n\ttRCD\t11 ns\t14 ns\t/RAS low to /CAS low time\n\n\ttRAS\t50 ns\t60 ns\t/RAS pulse width (minimum /RAS low time)\n\n\ttRP\t30 ns\t40 ns\t/RAS precharge time (minimum /RAS high time)\n\n\ttPC\t20 ns\t25 ns\tPage-mode read or write cycle time (/CAS to /CAS)\n\n\ttAA\t25 ns\t30 ns\tAccess time: Column address valid to valid data out (includes address setup time before /CAS low)\n\n\ttCAC\t13 ns\t15 ns\tAccess time: /CAS low to valid data out\n\n\ttCAS\t8 ns\t10 ns\t/CAS low pulse width minimum\n\n\n\nThus, the generally quoted number is the /RAS access time. This is the time to read a random bit from a precharged DRAM array. The time to read additional bits from an open page is much less.\n\nWhen such a RAM is accessed by clocked logic, the times are generally rounded up to the nearest clock cycle. For example, when accessed by a 100 MHz state machine (i.e. a 10 ns clock), the 50 ns DRAM can perform the first read in five clock cycles, and additional reads within the same page every two clock cycles. This was generally described as \"5‐2‐2‐2\" timing, as bursts of four reads within a page were common.\n\nWhen describing synchronous memory, timing is described by clock cycle counts separated by hyphens. These numbers represent tCL‐tRCD‐tRP‐tRAS in multiples of the DRAM clock cycle time. Note that this is half of the data transfer rate when double data rate signaling is used. JEDEC standard PC3200 timing is 3‐4‐4‐8[24] with a 200 MHz clock, while premium-priced high performance PC3200 DDR DRAM DIMM might be operated at 2‐2‐2‐5 timing.[25]\n\n\n\t\tPC-3200 (DDR-400)\tPC2-6400 (DDR2-800)\tPC3-12800 (DDR3-1600)\tDescription\n\n\tTypical\tFast\tTypical\tFast\tTypical\tFast\n\n\tcycles\ttime\tcycles\ttime\tcycles\ttime\tcycles\ttime\tcycles\ttime\tcycles\ttime\n\n\ttCL\t3\t15 ns\t2\t10 ns\t5\t12.5 ns\t4\t10 ns\t9\t11.25 ns\t8\t10 ns\t/CAS low to valid data out (equivalent to tCAC)\n\n\ttRCD\t4\t20 ns\t2\t10 ns\t5\t12.5 ns\t4\t10 ns\t9\t11.25 ns\t8\t10 ns\t/RAS low to /CAS low time\n\n\ttRP\t4\t20 ns\t2\t10 ns\t5\t12.5 ns\t4\t10 ns\t9\t11.25 ns\t8\t10 ns\t/RAS precharge time (minimum precharge to active time)\n\n\ttRAS\t8\t40 ns\t5\t25 ns\t16\t40 ns\t12\t30 ns\t27\t33.75 ns\t24\t30 ns\tRow active time (minimum active to precharge time)\n\n\n\nMinimum random access time has improved from tRAC = 50 ns to tRCD + tCL = 22.5 ns, and even the premium 20 ns variety is only 2.5 times better compared to the typical case (~2.22 times better). CAS latency has improved even less, from tCAC = 13 ns to 10 ns. However, the DDR3 memory does achieve 32 times higher bandwidth; due to internal pipelining and wide data paths, it can output two words every 1.25 ns (1600 Mword/s), while the EDO DRAM can output one word per tPC = 20 ns (50 Mword/s).\n\n\nTiming abbreviations[edit]\n\n\t\n\ttCL – CAS latency\n\ttCR – Command rate\n\ttPTP – precharge to precharge delay\n\ttRAS – RAS active time\n\ttRCD – RAS to CAS delay\n\ttREF – Refresh period\n\ttRFC – Row refresh cycle time\n\ttRP – RAS precharge\n\n\n\t\n\ttRRD – RAS to RAS delay\n\ttRTP – Read to precharge delay\n\ttRTR – Read to read delay\n\ttRTW – Read to write delay\n\ttWR – Write recovery time\n\ttWTP – Write to precharge delay\n\ttWTR – Write to read delay\n\ttWTW – Write to write delay\n\n\n\n\n\nMemory cell design[edit]\n\nSee also: Memory cell (computing)\n\nEach bit of data in a DRAM is stored as a positive or negative electrical charge in a capacitive structure. The structure providing the capacitance, as well as the transistors that control access to it, is collectively referred to as a DRAM cell. They are the fundamental building block in DRAM arrays. Multiple DRAM memory cell variants exist, but the most commonly used variant in modern DRAMs is the one-transistor, one-capacitor (1T1C) cell. The transistor is used to admit current into the capacitor during writes, and to discharge the capacitor during reads. The access transistor is designed to maximize drive strength and minimize transistor-transistor leakage (Kenner, pg. 34).\n\nThe capacitor has two terminals, one of which is connected to its access transistor, and the other to either ground or VCC/2. In modern DRAMs, the latter case is more common, since it allows faster operation. In modern DRAMs, a voltage of +VCC/2 across the capacitor is required to store a logic one; and a voltage of -VCC/2 across the capacitor is required to store a logic zero. The electrical charge stored in the capacitor is measured in coulombs. For a logic one, the charge is: \n  \n    \n      \n        Q\n        =\n        \n          \n            \n              V\n              \n                C\n                C\n              \n            \n            2\n          \n        \n        ⋅\n        C\n      \n    \n    {\\textstyle Q={V_{CC} \\over 2}\\cdot C}\n  \n, where Q is the charge in coulombs and C is the capacitance in farads. A logic zero has a charge of: \n  \n    \n      \n        Q\n        =\n        \n          \n            \n              −\n              \n                V\n                \n                  C\n                  C\n                \n              \n            \n            2\n          \n        \n        ⋅\n        C\n      \n    \n    {\\textstyle Q={-V_{CC} \\over 2}\\cdot C}\n  \n.[26]\n\nReading or writing a logic one requires the wordline is driven to a voltage greater than the sum of VCC and the access transistor's threshold voltage (VTH). This voltage is called VCC pumped (VCCP). The time required to discharge a capacitor thus depends on what logic value is stored in the capacitor. A capacitor containing logic one begins to discharge when the voltage at the access transistor's gate terminal is above VCCP. If the capacitor contains a logic zero, it begins to discharge when the gate terminal voltage is above VTH.[27]\n\n\nCapacitor design[edit]\n\nUp until the mid-1980s, the capacitors in DRAM cells were co-planar with the access transistor (they were constructed on the surface of the substrate), thus they were referred to as planar capacitors. The drive to increase both density, and to a lesser extent, performance, required denser designs. This was strongly motivated by economics; a major consideration for DRAM devices, especially commodity DRAMs. The minimization of DRAM cell area can produce a denser device (which could be sold at a higher price), or a lower priced device with the same capacity. Starting in the mid-1980s, the capacitor has been moved above or below the silicon substrate in order to meet these objectives. DRAM cells featuring capacitors above the substrate are referred to as stacked or folded plate capacitors; whereas those with capacitors buried beneath the substrate surface are referred to as trench capacitors. In the 2000s, manufacturers were sharply divided by the type of capacitor used by their DRAMs, and the relative cost and long-term scalability of both designs has been the subject of extensive debate. The majority of DRAMs, from major manufactures such as Hynix, Micron Technology, Samsung Electronics use the stacked capacitor structure, whereas smaller manufacturers such Nanya Technology use the trench capacitor structure (Jacob, pp. 355–357).\n\nThe capacitor in the stacked capacitor scheme is constructed above the surface of the substrate. The capacitor is constructed from an oxide-nitride-oxide (ONO) dielectric sandwiched in between two layers of polysilicon plates (the top plate is shared by all DRAM cells in an IC), and its shape can be a rectangle, a cylinder, or some other more complex shape. There are two basic variations of the stacked capacitor, based on its location relative to the bitline—capacitor-over-bitline (COB) and capacitor-under-bitline (CUB). In a former variation, the capacitor is underneath the bitline, which is usually made of metal, and the bitline has a polysilicon contact that extends downwards to connect it to the access transistor's source terminal. In the latter variation, the capacitor is constructed above the bitline, which is almost always made of polysilicon, but is otherwise identical to the COB variation. The advantage the COB variant possesses is the ease of fabricating the contact between the bitline and the access transistor's source as it is physically close to the substrate surface. However, this requires the active area to be laid out at a 45-degree angle when viewed from above, which makes it difficult to ensure that the capacitor contact does not touch the bitline. CUB cells avoid this, but suffer from difficulties in inserting contacts in between bitlines, since the size of features this close to the surface are at or near the minimum feature size of the process technology (Kenner, pp. 33–42).\n\nThe trench capacitor is constructed by etching a deep hole into the silicon substrate. The substrate volume surrounding the hole is then heavily doped to produce a buried n+ plate and to reduce resistance. A layer of oxide-nitride-oxide dielectric is grown or deposited, and finally the hole is filled by depositing doped polysilicon, which forms the top plate of the capacitor. The top of the capacitor is connected to the access transistor's drain terminal via a polysilicon strap (Kenner, pp. 42–44). A trench capacitor's depth-to-width ratio in DRAMs of the mid-2000s can exceed 50:1 (Jacob, p. 357).\n\nTrench capacitors have numerous advantages. Since the capacitor is buried in the bulk of the substrate instead of lying on its surface, the area it occupies can be minimized to what is required to connect it to the access transistor's drain terminal without decreasing the capacitor's size, and thus capacitance (Jacob, pp. 356–357). Alternatively, the capacitance can be increased by etching a deeper hole without any increase to surface area (Kenner, pg. 44). Another advantage of the trench capacitor is that its structure is under the layers of metal interconnect, allowing them to be more easily made planar, which enables it to be integrated in a logic-optimized process technology, which have many levels of interconnect above the substrate. The fact that the capacitor is under the logic means that it is constructed before the transistors are. This allows high-temperature processes to fabricate the capacitors, which would otherwise be degrading the logic transistors and their performance. This makes trench capacitors suitable for constructing embedded DRAM (eDRAM) (Jacob, p. 357). Disadvantages of trench capacitors are difficulties in reliably constructing the capacitor's structures within deep holes and in connecting the capacitor to the access transistor's drain terminal (Kenner, pg. 44).\n\n\nHistorical cell designs[edit]\n\nFirst-generation DRAM ICs (those with capacities of 1 Kbit), of which the first was the Intel 1103, used a three-transistor, one-capacitor (3T1C) DRAM cell. By the second-generation, the requirement to increase density by fitting more bits in a given area, or the requirement to reduce cost by fitting the same amount of bits in a smaller area, lead to the almost universal adoption of the 1T1C DRAM cell, although a couple of devices with 4 and 16 Kbit capacities continued to use the 3T1C cell for performance reasons (Kenner, p. 6). These performance advantages included, most significantly, the ability to read the state stored by the capacitor without discharging it, avoiding the need to write back what was read out (non-destructive read). A second performance advantage relates to the 3T1C cell has separate transistors for reading and writing; the memory controller can exploit this feature to perform atomic read-modify-writes, where a value is read, modified, and then written back as a single, indivisible operation (Jacob, p. 459).\n\n\nProposed cell designs[edit]\n\nThe one-transistor, zero-capacitor (1T) DRAM cell has been a topic of research since the late-1990s. 1T DRAM is a different way of constructing the basic DRAM memory cell, distinct from the classic one-transistor/one-capacitor (1T/1C) DRAM cell, which is also sometimes referred to as \"1T DRAM\", particularly in comparison to the 3T and 4T DRAM which it replaced in the 1970s.\n\nIn 1T DRAM cells, the bit of data is still stored in a capacitive region controlled by a transistor, but this capacitance is no longer provided by a separate capacitor. 1T DRAM is a \"capacitorless\" bit cell design that stores data using the parasitic body capacitance that is inherent to silicon on insulator (SOI) transistors. Considered a nuisance in logic design, this floating body effect can be used for data storage. This gives 1T DRAM cells the greatest density as well as allowing easier integration with high-performance logic circuits, since they are constructed with the same silicon on insulator process technologies.\n\nRefreshing of cells remains necessary, but unlike with 1T1C DRAM, reads in 1T DRAM are non-destructive; the stored charge causes a detectable shift in the threshold voltage of the transistor.[28] Performance-wise, access times are significantly better than capacitor-based DRAMs, but slightly worse than SRAM. There are several types of 1T DRAMs: the commercialized Z-RAM from Innovative Silicon, the TTRAM[29] from Renesas and the A-RAM from the UGR/CNRS consortium.\n\n\nArray structures[edit]\n\nDRAM cells are laid out in a regular rectangular, grid-like pattern to facilitate their control and access via wordlines and bitlines. The physical layout of the DRAM cells in an array is typically designed so that two adjacent DRAM cells in a column share a single bitline contact to reduce their area. DRAM cell area is given as n F2, where n is a number derived from the DRAM cell design, and F is the smallest feature size of a given process technology. This scheme permits comparison of DRAM size over different process technology generations, as DRAM cell area scales at linear or near-linear rates over. The typical area for modern DRAM cells varies between 6–8 F2.\n\nThe horizontal wire, the wordline, is connected to the gate terminal of every access transistor in its row. The vertical bitline is connected to the source terminal of the transistors in its a column. The lengths of the wordlines and bitlines are limited. The wordline length is limited by the desired performance of the array, since propagation time of the signal that must transverse the wordline is determined by the RC time constant. The bitline length is limited by its capacitance (which increases with length), which must be kept within a range for proper sensing (as DRAMs operate by sensing the charge of the capacitor released onto the bitline). Bitline length is also limited by the amount of operating current the DRAM can draw and by how power can be dissipated, since these two characteristics are largely determined by the charging and discharging of the bitline.\n\n\nBitline architecture[edit]\n\nSense amplifiers are required to read the state contained in the DRAM cells. When the access transistor is activated, the electrical charge in the capacitor is shared with the bitline. The bitline's capacitance is much greater than that of the capacitor (approximately ten times). Thus, the change in bitline voltage is minute. Sense amplifiers are required to resolve the voltage differential into the levels specified by the logic signaling system. Modern DRAMs use differential sense amplifiers, and are accompanied by requirements as to how the DRAM arrays are constructed. Differential sense amplifiers work by driving their outputs to opposing extremes based on the relative voltages on pairs of bitlines. The sense amplifiers function effectively and efficient only if the capacitance and voltages of these bitline pairs are closely matched. Besides ensuring that the lengths of the bitlines and the number of attached DRAM cells attached to them are equal, two basic architectures to array design have emerged to provide for the requirements of the sense amplifiers: open and folded bitline arrays.\n\n\nOpen bitline arrays[edit]\n\nThe first generation (1 Kbit) DRAM ICs, up until the 64 Kbit generation (and some 256 Kbit generation devices) had open bitline array architectures. In these architectures, the bitlines are divided into multiple segments, and the differential sense amplifiers are placed in between bitline segments. Because the sense amplifiers are placed between bitline segments, to route their outputs outside the array, an additional layer of interconnect placed above those used to construct the wordlines and bitlines is required.\n\nThe DRAM cells that are on the edges of the array do not have adjacent segments. Since the differential sense amplifiers require identical capacitance and bitline lengths from both segments, dummy bitline segments are provided. The advantage of the open bitline array is a smaller array area, although this advantage is slightly diminished by the dummy bitline segments. The disadvantage that caused the near disappearance of this architecture is the inherent vulnerability to noise, which affects the effectiveness of the differential sense amplifiers. Since each bitline segment does not have any spatial relationship to the other, it is likely that noise would affect only one of the two bitline segments.\n\n\nFolded bitline arrays[edit]\n\nThe folded bitline array architecture routes bitlines in pairs throughout the array. The close proximity of the paired bitlines provide superior common-mode noise rejection characteristics over open bitline arrays. The folded bitline array architecture began appearing in DRAM ICs during the mid-1980s, beginning with the 256 Kbit generation. This architecture is favored in modern DRAM ICs for its superior noise immunity.\n\nThis architecture is referred to as folded because it takes its basis from the open array architecture from the perspective of the circuit schematic. The folded array architecture appears to remove DRAM cells in alternate pairs (because two DRAM cells share a single bitline contact) from a column, then move the DRAM cells from an adjacent column into the voids.\n\nThe location where the bitline twists occupies additional area. To minimize area overhead, engineers select the simplest and most area-minimal twisting scheme that is able to reduce noise under the specified limit. As process technology improves to reduce minimum feature sizes, the signal to noise problem worsens, since coupling between adjacent metal wires is inversely proportional to their pitch. The array folding and bitline twisting schemes that are used must increase in complexity in order to maintain sufficient noise reduction. Schemes that have desirable noise immunity characteristics for a minimal impact in area is the topic of current research (Kenner, p. 37).\n\n\nFuture array architectures[edit]\n\nAdvances in process technology could result in open bitline array architectures being favored if it is able to offer better long-term area efficiencies; since folded array architectures require increasingly complex folding schemes to match any advance in process technology. The relationship between process technology, array architecture, and area efficiency is an active area of research.\n\n\nRow and column redundancy[edit]\n\nThe first DRAM integrated circuits did not have any redundancy. An integrated circuit with a defective DRAM cell would be discarded. Beginning with the 64 Kbit generation, DRAM arrays have included spare rows and columns to improve yields. Spare rows and columns provide tolerance of minor fabrication defects which have caused a small number of rows or columns to be inoperable. The defective rows and columns are physically disconnected from the rest of the array by a triggering a programmable fuse or by cutting the wire by a laser. The spare rows or columns are substituted in by remapping logic in the row and column decoders (Jacob, pp. 358–361).\n\n\nError detection and correction[edit]\n\nMain articles: RAM parity and ECC memory\n\nElectrical or magnetic interference inside a computer system can cause a single bit of DRAM to spontaneously flip to the opposite state. The majority of one-off (\"soft\") errors in DRAM chips occur as a result of background radiation, chiefly neutrons from cosmic ray secondaries, which may change the contents of one or more memory cells or interfere with the circuitry used to read/write them.\n\nThe problem can be mitigated by using redundant memory bits and additional circuitry that use these bits to detect and correct soft errors.[30] In most cases, the detection and correction are performed by the memory controller; sometimes, the required logic is transparently implemented within DRAM chips or modules, enabling the ECC memory functionality for otherwise ECC-incapable systems.[31] The extra memory bits are used to record parity and to enable missing data to be reconstructed by error-correcting code (ECC). Parity allows the detection of all single-bit errors (actually, any odd number of wrong bits). The most common error-correcting code, a SECDED Hamming code, allows a single-bit error to be corrected and, in the usual configuration, with an extra parity bit, double-bit errors to be detected.[32]\n\nRecent studies give widely varying error rates with over seven orders of magnitude difference, ranging from 10−10−10−17 error/bit·h, roughly one bit error, per hour, per gigabyte of memory to one bit error, per century, per gigabyte of memory.[33][34][35] The Schroeder et al. 2009 study reported a 32% chance that a given computer in their study would suffer from at least one correctable error per year, and provided evidence that most such errors are intermittent hard rather than soft errors.[36] A 2010 study at the University of Rochester also gave evidence that a substantial fraction of memory errors are intermittent hard errors.[37] Large scale studies on non-ECC main memory in PCs and laptops suggest that undetected memory errors account for a substantial number of system failures: the study reported a 1-in-1700 chance per 1.5% of memory tested (extrapolating to an approximately 26% chance for total memory) that a computer would have a memory error every eight months.[38]\n\n\nSecurity[edit]\n\nData remanence[edit]\n\nMain article: Data remanence\n\nAlthough dynamic memory is only specified and guaranteed to retain its contents when supplied with power and refreshed every short period of time (often 64 ms), the memory cell capacitors often retain their values for significantly longer time, particularly at low temperatures.[39] Under some conditions most of the data in DRAM can be recovered even if it has not been refreshed for several minutes.[40]\n\nThis property can be used to circumvent security and recover data stored in the main memory that is assumed to be destroyed at power-down. The computer could be quickly rebooted, and the contents of the main memory read out; or by removing a computer's memory modules, cooling them to prolong data remanence, then transferring them to a different computer to be read out. Such an attack was demonstrated to circumvent popular disk encryption systems, such as the open source TrueCrypt, Microsoft's BitLocker Drive Encryption, and Apple's FileVault.[39] This type of attack against a computer is often called a cold boot attack.\n\n\nMemory corruption[edit]\n\nSee also:  § Operations to read a data bit from a DRAM storage cell\n\nDynamic memory, by definition, requires periodic refresh. Furthermore, reading dynamic memory is a destructive operation, requiring a recharge of the storage cells in the row that has been read. If these processes are imperfect, a read operation can cause soft errors. In particular, there is a risk that some charge can leak between nearby cells, causing the refresh or read of one row to cause a disturbance error in an adjacent or even nearby row. The awareness of disturbance errors dates back to the first commercially available DRAM in the early 1970s (the Intel 1103). Despite the mitigation techniques employed by manufacturers, commercial researchers proved in a 2014 analysis that commercially available DDR3 DRAM chips manufactured in 2012 and 2013 are susceptible to disturbance errors.[41] The associated side effect that led to observed bit flips has been dubbed row hammer.\n\n\nPackaging[edit]\n\nMemory module[edit]\n\nMain article: Memory module\n\nDynamic RAM ICs are usually packaged in molded epoxy cases, with an internal lead frame for interconnections between the silicon die and the package leads.  The original IBM PC design used ICs packaged in dual in-line packages, soldered directly to the main board or mounted in sockets.  As memory density skyrocketed, the DIP package was no longer practical.  For convenience in handling, several dynamic RAM integrated circuits may be mounted on a single memory module, allowing installation of 16-bit, 32-bit or 64-bit wide memory in a single unit, without the requirement for the installer to insert multiple individual integrated circuits.  Memory modules may include additional devices for parity checking or error correction. Over the evolution of desktop computers, several standardized types of memory module have been developed.  Laptop computers, game consoles, and specialized devices may have their own formats of memory modules not interchangeable with standard desktop parts for packaging or proprietary reasons.\n\n\nEmbedded[edit]\n\nMain article: eDRAM\n\nDRAM that is integrated into an integrated circuit designed in a logic-optimized process (such as an application-specific integrated circuit, microprocessor, or an entire system on a chip) is called embedded DRAM (eDRAM). Embedded DRAM requires DRAM cell designs that can be fabricated without preventing the fabrication of fast-switching transistors used in high-performance logic, and modification of the basic logic-optimized process technology to accommodate the process steps required to build DRAM cell structures.\n\n\nVersions[edit]\n\nSince the fundamental DRAM cell and array has maintained the same basic structure for many years, the types of DRAM are mainly distinguished by the many different interfaces for communicating with DRAM chips.\n\n\nAsynchronous DRAM[edit]\n\nThe original DRAM, now known by the retronym \"asynchronous DRAM\" was the first type of DRAM in use. From its origins in the late 1960s, it was commonplace in computing up until around 1997, when it was mostly replaced by Synchronous DRAM. In the present day, manufacture of asynchronous RAM is relatively rare.[42]\n\n\nPrinciples of operation[edit]\n\nAn asynchronous DRAM chip has power connections, some number of address inputs (typically 12), and a few (typically one or four) bidirectional data lines. There are four active-low control signals:\n\n\n\tRAS, the Row Address Strobe. The address inputs are captured on the falling edge of RAS, and select a row to open. The row is held open as long as RAS is low.\n\tCAS, the Column Address Strobe. The address inputs are captured on the falling edge of CAS, and select a column from the currently open row to read or write.\n\tWE, Write Enable. This signal determines whether a given falling edge of CAS is a read (if high) or write (if low). If low, the data inputs are also captured on the falling edge of CAS.\n\tOE, Output Enable. This is an additional signal that controls output to the data I/O pins. The data pins are driven by the DRAM chip if RAS and CAS are low, WE is high, and OE is low. In many applications, OE can be permanently connected low (output always enabled), but it can be useful when connecting multiple memory chips in parallel.\n\n\nThis interface provides direct control of internal timing. When RAS is driven low, a CAS cycle must not be attempted until the sense amplifiers have sensed the memory state, and RAS must not be returned high until the storage cells have been refreshed. When RAS is driven high, it must be held high long enough for precharging to complete.\n\nAlthough the DRAM is asynchronous, the signals are typically generated by a clocked memory controller, which limits their timing to multiples of the controller's clock cycle.\n\n\nRAS Only Refresh (ROR)[edit]\n\nClassic asynchronous DRAM is refreshed by opening each row in turn.\n\nThe refresh cycles are distributed across the entire refresh interval in such a way that all rows are refreshed within the required interval. To refresh one row of the memory array using RAS Only Refresh, the following steps must occur:\n\n\n\tThe row address of the row to be refreshed must be applied at the address input pins.\n\tRAS must switch from high to low. CAS must remain high.\n\tAt the end of the required amount of time, RAS must return high.\n\n\nThis can be done by supplying a row address and pulsing RAS low; it is not necessary to perform any CAS cycles. An external counter is needed to iterate over the row addresses in turn.[43]\n\n\nCAS before RAS refresh (CBR)[edit]\n\nFor convenience, the counter was quickly incorporated into the DRAM chips themselves. If the CAS line is driven low before RAS (normally an illegal operation), then the DRAM ignores the address inputs and uses an internal counter to select the row to open. This is known as CAS-before-RAS (CBR) refresh. This became the standard form of refresh for asynchronous DRAM, and is the only form generally used with SDRAM.\n\n\nHidden refresh[edit]\n\nGiven support of CAS-before-RAS refresh, it is possible to deassert RAS while holding CAS low to maintain data output. If RAS is then asserted again, this performs a CBR refresh cycle while the DRAM outputs remain valid. Because data output is not interrupted, this is known as hidden refresh.[44]\n\n\nPage mode DRAM[edit]\n\nPage mode DRAM is a minor modification to the first-generation DRAM IC interface which improved the performance of reads and writes to a row by avoiding the inefficiency of precharging and opening the same row repeatedly to access a different column. In Page mode DRAM, after a row was opened by holding RAS low, the row could be kept open, and multiple reads or writes could be performed to any of the columns in the row. Each column access was initiated by asserting CAS and presenting a column address. For reads, after a delay (tCAC), valid data would appear on the data out pins, which were held at high-Z before the appearance of valid data. For writes, the write enable signal and write data would be presented along with the column address.[45]\n\nPage mode DRAM was later improved with a small modification which further reduced latency. DRAMs with this improvement were called fast page mode DRAMs (FPM DRAMs). In page mode DRAM, CAS was asserted before the column address was supplied. In FPM DRAM, the column address could be supplied while CAS was still deasserted. The column address propagated through the column address data path, but did not output data on the data pins until CAS was asserted. Prior to CAS being asserted, the data out pins were held at high-Z. FPM DRAM reduced tCAC latency.[46]\n\nStatic column is a variant of fast page mode in which the column address does not need to be stored in, but rather, the address inputs may be changed with CAS held low, and the data output will be updated accordingly a few nanoseconds later.[46]\n\nNibble mode is another variant in which four sequential locations within the row can be accessed with four consecutive pulses of CAS. The difference from normal page mode is that the address inputs are not used for the second through fourth CAS edges; they are generated internally starting with the address supplied for the first CAS edge.[46]\n\n\nExtended data out DRAM (EDO DRAM)[edit]\n\n  \nA pair of 32 MB EDO DRAM modules\n\n\n\nEDO DRAM, sometimes referred to as Hyper Page Mode enabled DRAM, is similar to Fast Page Mode DRAM with the additional feature that a new access cycle can be started while keeping the data output of the previous cycle active. This allows a certain amount of overlap in operation (pipelining), allowing somewhat improved performance. It is up to 30% faster than FPM DRAM,[47] which it began to replace in 1995 when Intel introduced the 430FX chipset with EDO DRAM support. Irrespective of the performance gains, FPM and EDO SIMMs can be used interchangeably in many (but not all) applications.[48][49]\n\nTo be precise, EDO DRAM begins data output on the falling edge of CAS, but does not stop the output when CAS rises again. It holds the output valid (thus extending the data output time) until either RAS is deasserted, or a new CAS falling edge selects a different column address.\n\nSingle-cycle EDO has the ability to carry out a complete memory transaction in one clock cycle. Otherwise, each sequential RAM access within the same page takes two clock cycles instead of three, once the page has been selected. EDO's performance and capabilities allowed it to somewhat replace the then-slow L2 caches of PCs. It created an opportunity to reduce the immense performance loss associated with a lack of L2 cache, while making systems cheaper to build. This was also good for notebooks due to difficulties with their limited form factor, and battery life limitations. An EDO system with L2 cache was tangibly faster than the older FPM/L2 combination.\n\nSingle-cycle EDO DRAM became very popular on video cards towards the end of the 1990s. It was very low cost, yet nearly as efficient for performance as the far more costly VRAM.\n\n\nBurst EDO DRAM (BEDO DRAM)[edit]\n\nAn evolution of EDO DRAM, Burst EDO DRAM, could process four memory addresses in one burst, for a maximum of 5‐1‐1‐1, saving an additional three clocks over optimally designed EDO memory. It was done by adding an address counter on the chip to keep track of the next address. BEDO also added a pipeline stage allowing page-access cycle to be divided into two parts. During a memory-read operation, the first part accessed the data from the memory array to the output stage (second latch). The second part drove the data bus from this latch at the appropriate logic level. Since the data is already in the output buffer, quicker access time is achieved (up to 50% for large blocks of data) than with traditional EDO.\n\nAlthough BEDO DRAM showed additional optimization over EDO, by the time it was available the market had made a significant investment towards synchronous DRAM, or SDRAM [1][dead link]. Even though BEDO RAM was superior to SDRAM in some ways, the latter technology quickly displaced BEDO.\n\n\nSynchronous dynamic RAM (SDRAM)[edit]\n\nMain article: Synchronous dynamic random-access memory\n\nSDRAM significantly revises the asynchronous memory interface, adding a clock (and a clock enable) line.  All other signals are received on the rising edge of the clock.\n\nThe /RAS and /CAS inputs no longer act as strobes, but are instead, along with /WE, part of a 3-bit command:\n\n\nSDRAM Command summary\n\t/CS\t/RAS\t/CAS\t/WE\tAddress\tCommand\n\n\tH\tx\tx\tx\tx\tCommand inhibit (No operation)\n\n\tL\tH\tH\tH\tx\tNo operation\n\n\tL\tH\tH\tL\tx\tBurst Terminate: stop a read or write burst in progress\n\n\tL\tH\tL\tH\tcolumn\tRead from currently active row\n\n\tL\tH\tL\tL\tcolumn\tWrite to currently active row\n\n\tL\tL\tH\tH\trow\tActivate a row for read and write\n\n\tL\tL\tH\tL\tx\tPrecharge (deactivate) the current row\n\n\tL\tL\tL\tH\tx\tAuto refresh: Refresh one row of each bank, using an internal counter\n\n\tL\tL\tL\tL\tmode\tLoad mode register: Address bus specifies DRAM operation mode.\n\n\n\nThe /OE line's function is extended to a per-byte \"DQM\" signal, which controls data input (writes) in addition to data output (reads).  This allows DRAM chips to be wider than 8 bits while still supporting byte-granularity writes.\n\nMany timing parameters remain under the control of the DRAM controller. For example, a minimum time must elapse between a row being activated and a read or write command. One important parameter must be programmed into the SDRAM chip itself, namely the CAS latency.  This is the number of clock cycles allowed for internal operations between a read command and the first data word appearing on the data bus.  The \"Load mode register\" command is used to transfer this value to the SDRAM chip.  Other configurable parameters include the length of read and write bursts, i.e. the number of words transferred per read or write command.\n\nThe most significant change, and the primary reason that SDRAM has supplanted asynchronous RAM, is the support for multiple internal banks inside the DRAM chip.  Using a few bits of \"bank address\" which accompany each command, a second bank can be activated and begin reading data while a read from the first bank is in progress.  By alternating banks, an SDRAM device can keep the data bus continuously busy, in a way that asynchronous DRAM cannot.\n\n\nSingle data rate synchronous DRAM (SDR SDRAM)[edit]\n\nSee also: SDR SDRAM\n\nSingle data rate SDRAM (sometimes known as SDR) is the original generation of SDRAM; it made a single transfer of data per clock cycle.\n\n\nDouble data rate synchronous DRAM (DDR SDRAM)[edit]\n\nMain articles: DDR SDRAM, DDR2 SDRAM, DDR3 SDRAM, and DDR4 SDRAM\n\nDouble data rate SDRAM (DDR) was a later development of SDRAM, used in PC memory beginning in 2000. Subsequent versions are numbered sequentially (DDR2, DDR3, etc.).  DDR SDRAM internally performs double-width accesses at the clock rate, and uses a double data rate interface to transfer one half on each clock edge.  DDR2 and DDR3 increased this factor to 4× and 8×, respectively, delivering 4-word and 8-word bursts over 2 and 4 clock cycles, respectively.  The internal access rate is mostly unchanged (200 million per second for DDR-400, DDR2-800 and DDR3-1600 memory), but each access transfers more data.\n\n\nDirect Rambus DRAM (DRDRAM)[edit]\n\nMain article: RDRAM\n\nDirect RAMBUS DRAM (DRDRAM) was developed by Rambus. First supported on motherboards in 1999, it was intended to become an industry standard, but was out competed by DDR SDRAM, making it technically obsolete by 2003.\n\n\nReduced Latency DRAM (RLDRAM)[edit]\n\nMain article: RLDRAM\n\nReduced Latency DRAM is a high performance double data rate (DDR) SDRAM that combines fast, random access with high bandwidth, mainly intended for networking and caching applications.\n\n\nGraphics RAM[edit]\n\nGraphics RAMs are asynchronous and synchronous DRAMs designed for graphics-related tasks such as texture memory and framebuffers, found on video cards.\n\n\nVideo DRAM (VRAM)[edit]\n\nMain article: VRAM\n\nVRAM is a dual-ported variant of DRAM that was once commonly used to store the frame-buffer in some graphics adaptors.\n\n\nWindow DRAM (WRAM)[edit]\n\nWRAM is a variant of VRAM that was once used in graphics adaptors such as the Matrox Millennium and ATI 3D Rage Pro. WRAM was designed to perform better and cost less than VRAM. WRAM offered up to 25% greater bandwidth than VRAM and accelerated commonly used graphical operations such as text drawing and block fills.[50]\n\n\nMultibank DRAM (MDRAM)[edit]\n\nMultibank DRAM is a type of specialized DRAM developed by MoSys. It is constructed from small memory banks of 256 KB, which are operated in an interleaved fashion, providing bandwidths suitable for graphics cards at a lower cost to memories such as SRAM. MDRAM also allows operations to two banks in a single clock cycle, permitting multiple concurrent accesses to occur if the accesses were independent. MDRAM was primarily used in graphic cards, such as those featuring the Tseng Labs ET6x00 chipsets. Boards based upon this chipset often had the unusual capacity of 2.25 MB because of MDRAM's ability to be implemented more easily with such capacities. A graphics card with 2.25 MB of MDRAM had enough memory to provide 24-bit color at a resolution of 1024×768—a very popular setting at the time.\n\n\nSynchronous graphics RAM (SGRAM)[edit]\n\nSGRAM is a specialized form of SDRAM for graphics adaptors. It adds functions such as bit masking (writing to a specified bit plane without affecting the others) and block write (filling a block of memory with a single colour). Unlike VRAM and WRAM, SGRAM is single-ported. However, it can open two memory pages at once, which simulates the dual-port nature of other video RAM technologies.\n\n\nGraphics double data rate SDRAM (GDDR SDRAM)[edit]\n\nMain article: GDDR\n\nGraphics double data rate SDRAM (GDDR SDRAM) is a type of specialized DDR SDRAM designed to be used as the main memory of graphics processing units (GPUs). GDDR SDRAM is distinct from commodity types of DDR SDRAM such as DDR3, although they share some core technologies. Their primary characteristics are higher clock frequencies for both the DRAM core and I/O interface, which provides greater memory bandwidth for GPUs. As of 2018, there are six, successive generations of GDDR: GDDR2, GDDR3, GDDR4, GDDR5, and GDDR5X, GDDR6\n\n\nPseudostatic RAM (PSRAM)[edit]\n\n  \n1 Mbit high speed CMOS pseudo static RAM, made by Toshiba\n\n\n\nPSRAM or PSDRAM is dynamic RAM with built-in refresh and address-control circuitry to make it behave similarly to static RAM (SRAM). It combines the high density of DRAM with the ease of use of true SRAM. PSRAM (made by Numonyx) is used in the Apple iPhone and other embedded systems such as XFlar Platform.[51]\n\nSome DRAM components have a \"self-refresh mode\". While this involves much of the same logic that is needed for pseudo-static operation, this mode is often equivalent to a standby mode. It is provided primarily to allow a system to suspend operation of its DRAM controller to save power without losing data stored in DRAM, rather than to allow operation without a separate DRAM controller as is the case with PSRAM.\n\nAn embedded variant of PSRAM was sold by MoSys under the name 1T-SRAM. It is a set of small DRAM banks with an SRAM cache in front to make it behave much like SRAM. It is used in Nintendo GameCube and Wii video game consoles.\n\n\nSee also[edit]\n\n\n\tElectronics portal\n\n\n\n\tDRAM price fixing\n\tFlash memory\n\tList of device bit rates\n\tMemory bank\n\tMemory geometry\n\n\nReferences[edit]\n\n\n\t^ \"How to \"open\" microchip and what's inside? : ZeptoBars\". 2012-11-15. Archived from the original on 2016-03-14. Retrieved 2016-04-02. Micron MT4C1024 — 1 mebibit (220 bit) dynamic ram. Widely used in 286 and 386-era computers, early 90's. Die size - 8662x3969µm.\n\n\t^ S. Mittal, \"A Survey of Architectural Techniques For DRAM Power Management Archived 2018-05-08 at the Wayback Machine\", IJHPSA, 4(2), 110-119, 2012.\n\n\t^ \"Are the Major DRAM Suppliers Stunting DRAM Demand?\". www.icinsights.com. Archived from the original on 2018-04-16. Retrieved 2018-04-16. In the 34-year period from 1978-2012, the DRAM price-per-bit declined by an average annual rate of 33%. However, from 2012 through 2017, the average DRAM price-per-bit decline was only 3% per year.  Moreover, the 47% full-year 2017 jump in the price-per-bit of DRAM was the largest annual increase since 1978, surpassing the previous high of 45% registered 30 years ago in 1988!\n\n\n\t^ Copeland B. Jack, and others (2006) Colossus: The Secrets of Bletchley Park's Codebreaking Computers Oxford: Oxford University Press, p301.\n\n\t^ a b \"Spec Sheet for Toshiba \"TOSCAL\" BC-1411\". www.oldcalculatormuseum.com. Archived from the original on 3 July 2017. Retrieved 8 May 2018.\n\n\n\t^ Toscal BC-1411 calculator Archived 2017-07-29 at the Wayback Machine, Science Museum, London\n\n\t^ Toshiba \"Toscal\" BC-1411 Desktop Calculator Archived 2007-05-20 at the Wayback Machine\n\n\t^ \"Nondestructive memory array\".\n\n\n\t^ \"1966: Semiconductor RAMs Serve High-speed Storage Needs\". Computer History Museum.\n\n\n\t^ \"1960 - Metal Oxide Semiconductor (MOS) Transistor Demonstrated\". The Silicon Engine. Computer History Museum.\n\n\n\t^ \"IBM100 - DRAM\". IBM. 9 August 2017.\n\n\n\t^ \"Robert Dennard\". Encyclopedia Britannica.\n\n\n\t^ a b \"1970: Semiconductors compete with magnetic cores\". Computer History Museum.\n\n\n\t^ Mary Bellis (23 Feb 2018). \"Who Invented the Intel 1103 DRAM Chip?\". ThoughtCo. Retrieved 27 Feb 2018.\n\n\n\t^ \"Archived copy\" (PDF). Archived from the original (PDF) on 2014-01-16. Retrieved 2014-01-15.CS1 maint: archived copy as title (link)\n\n\n\t^ \"Electronic Design\". Electronic Design. Hayden Publishing Company. 41 (15–21). 1993. The first commercial synchronous DRAM, the Samsung 16-Mbit KM48SL2000, employs a single-bank architecture that lets system designers easily transition from asynchronous to synchronous systems.\n\n\n\t^ \"KM48SL2000-7 Datasheet\". Samsung. August 1992. Retrieved 19 June 2019.\n\n\n\t^ \"Samsung Electronics Develops First 128Mb SDRAM with DDR/SDR Manufacturing Option\". Samsung Electronics. Samsung. 10 February 1999. Retrieved 23 June 2019.\n\n\n\t^ \"Lecture 12: DRAM Basics\" (PDF). utah.edu. 2011-02-17. Archived (PDF) from the original on 2015-06-16. Retrieved 2015-03-10.\n\n\n\t^ David August (2004-11-23). \"Lecture 20: Memory Technology\" (PDF). cs.princeton.edu. pp. 3–5. Archived from the original (PDF) on 2005-05-19. Retrieved 2015-03-10.\n\n\n\t^ a b c d e f g h i KeethBakerJohnsonLin 2007, pp. 24–30\n\n\t^ Lest We Remember: Cold Boot Attacks on Encryption Keys Archived 2015-01-05 at the Wayback Machine, Halderman et al, USENIX Security 2008.\n\n\t^ \"Micron 4 Meg x 4 EDO DRAM data sheet\" (PDF). micron.com. Archived from the original (PDF) on 27 September 2007. Retrieved 8 May 2018.\n\n\n\t^ \"Corsair CMX1024-3200 (1 GByte, two bank unbuffered DDR SDRAM DIMM)\" (PDF). December 2003. Archived from the original (PDF) on 11 September 2008.\n\n\n\t^ \"Corsair TWINX1024-3200XL dual-channel memory kit\" (PDF). May 2004. Archived from the original (PDF) on 7 December 2006.\n\n\n\t^ KeethBakerJohnsonLin 2007, p. 22\n\n\t^ KeethBakerJohnsonLin 2007, p. 24\n\n\t^ Sallese, Jean-Michel (2002-06-20). \"Principles of the 1T Dynamic Access Memory Concept on SOI\" (PDF). MOS Modeling and Parameter Extraction Group Meeting. Wroclaw, Poland. Archived (PDF) from the original on 2007-11-29. Retrieved 2007-10-07.\n\n\n\t^ F. Morishita;  et al. (21 September 2005). A capacitorless twin-transistor random access memory (TTRAM) on SOI. Proceedings of the IEEE. Custom Integrated Circuits Conference 2005. pp. 428–431. doi:10.1109/CICC.2005.1568699. ISBN 978-0-7803-9023-2. Archived from the original on 7 November 2017.\n\n\n\t^ \"A Survey of Techniques for Improving Error-Resilience of DRAM\", Journal of Systems Architecture, 2018\n\n\t^ \"ECC DRAM –  Intelligent Memory\". intelligentmemory.com. Archived from the original on 2014-12-23. Retrieved 2015-01-16.\n\n\n\t^ Mastipuram, Ritesh; Wee, Edwin C (30 September 2004). \"Soft errors' impact on system reliability\". EDN. Cypress Semiconductor. Archived from the original on 16 April 2007.\n\n\n\t^ Borucki, \"Comparison of Accelerated DRAM Soft Error Rates Measured at Component and System Level\", 46th Annual International Reliability Physics Symposium, Phoenix, 2008, pp. 482–487\n\n\t^ Schroeder, Bianca et al. (2009). \"DRAM errors in the wild: a large-scale field study\" Archived 2015-03-10 at the Wayback Machine. Proceedings of the Eleventh International Joint Conference on Measurement and Modeling of Computer Systems, pp. 193–204.\n\n\t^ \"A Memory Soft Error Measurement on Production Systems\". www.ece.rochester.edu. Archived from the original on 14 February 2017. Retrieved 8 May 2018.\n\n\n\t^ \"Archived copy\". Archived from the original on 2015-11-24. Retrieved 2015-11-24.CS1 maint: archived copy as title (link)\n\n\n\t^ Li, Huang; Shen, Chu (2010). \"\"A Realistic Evaluation of Memory Hardware Errors and Software System Susceptibility\". Usenix Annual Tech Conference 2010\" (PDF). Archived (PDF) from the original on 2015-05-15.\n\n\n\t^ \"Cycles, cells and platters: an empirical analysis of hardware failures on a million consumer PCs. Proceedings of the sixth conference on Computer systems (EuroSys '11). pp 343-356\" (PDF). 2011. Archived (PDF) from the original on 2012-11-14.\n\n\n\t^ a b \"Center for Information Technology Policy » Lest We Remember: Cold Boot Attacks on Encryption Keys\". Archived from the original on July 22, 2011.\n 080222 citp.princeton.edu\n\n\t^ Scheick, Leif Z.; Guertin, Steven M.; Swift, Gary M. (December 2000). \"Analysis of radiation effects on individual DRAM cells\". IEEE Transactions on Nuclear Science. 47 (6): 2534–2538. doi:10.1109/23.903804. ISSN 0018-9499.\n\n\n\t^ Yoongu Kim; Ross Daly; Jeremie Kim; Chris Fallin; Ji Hye Lee; Donghyuk Lee; Chris Wilkerson; Konrad Lai; Onur Mutlu (June 24, 2014). \"Flipping Bits in Memory Without Accessing Them: DRAM Disturbance Errors\" (PDF). ece.cmu.edu. Archived (PDF) from the original on 2015-03-26. Retrieved March 10, 2015.\n\n\n\t^ Ian Poole. \"SDRAM Memory Basics & Tutorial\". Archived from the original on 2018-02-27. Retrieved 26 Feb 2018.\n\n\n\t^ \"Understanding DRAM Operation (Application Note)\" (PDF). IBM. December 1996. Archived from the original (PDF) on 29 August 2017.\n\n\n\t^ Various Methods of DRAM Refresh Archived 2011-10-03 at the Wayback Machine Micron Technical Note TN-04-30\n\n\t^ KeethBakerJohnsonLin 2007, p. 13\n\n\t^ a b c KeethBakerJohnsonLin 2007, p. 14\n\n\t^ Lin, Albert (20 December 1999). \"Memory Grades, the Most Confusing Subject\". Simmtester.com. CST, Inc. Archived from the original on 7 November 2017. Retrieved 1 November 2017.\n\n\n\t^ Huang, Andrew (14 September 1996). \"Bunnie's RAM FAQ\". Archived from the original on 12 June 2017.\n\n\n\t^ Cuppu, Vinodh; Jacob, Bruce; Davis, Brian; Mudge, Trevor (November 2001). \"High-Performance DRAMs in Workstation Environments\" (PDF). IEEE Transactions on Computers. 50 (11): 1133–1153. doi:10.1109/12.966491. Archived (PDF) from the original on 8 August 2017. Retrieved 2 November 2017.\n\n\n\t^ \"Window RAM (WRAM)\". Archived from the original on 2010-01-02.\n\n\n\t^ EE Times teardown of iPhone 3G[permanent dead link]\n\n\n\n\n\tBrent Keeth, R. Jacob Baker, Brian Johnson, Feng Lin. DRAM Circuit Design: Fundamental and High-Speed Topics\n\n\nFurther reading[edit]\n\n\tKeeth, Brent; Baker, R. Jacob; Johnson, Brian; Lin, Feng (December 4, 2007). DRAM Circuit Design: Fundamental and High-Speed Topics. John Wiley & Sons. ISBN 978-0470184752.\n\n\tBruce Jacob, Spencer W. Ng, David T. Wang (2008). Memory Systems: Cache, DRAM, Disk. Morgan Kaufmann Publishers.\n\n\nExternal links[edit]\n\n\tDRAM density and speed trends has some interesting historical trend charts of DRAM density and speed from 1980.\n\tBenefits of Chipkill-Correct ECC for PC Server Main Memory — A 1997 discussion of SDRAM reliability—some interesting information on \"soft errors\" from cosmic rays, especially with respect to error-correcting code schemes\n\tTezzaron Semiconductor Soft Error White Paper 1994 literature review of memory error rate measurements.\n\tScaling and Technology Issues for Soft Error Rates  A Johnston—4th Annual Research Conference on Reliability Stanford University, October 2000\n\tChallenges and future directions for the scaling of dynamic random-access memory (DRAM) — J. A. Mandelman, R. H. Dennard, G. B. Bronner, J. K. DeBrosse, R. Divakaruni, Y. Li, and C. J. Radens, IBM 2002\n\tArs Technica: RAM Guide\n\tDavid Tawei Wang (2005). \"Modern DRAM Memory Systems: Performance Analysis and a High Performance, Power-Constrained DRAM-Scheduling Algorithm\" (PDF). PhD thesis, University of Maryland, College Park. Retrieved 2007-03-10. Cite journal requires |journal= (help)\n A detailed description of current DRAM technology.\n\tMulti-port Cache DRAM — MP-RAM\n\tWhat every programmer should know about memory by Ulrich Drepper\n\n\n\t\tv\n\tt\n\te\n\n\nDynamic random-access memory (DRAM)\n\n\tAsynchronous\t\n\tFPM RAM\n\tEDO RAM\n\n\n\n\n\tSynchronous\t\n\tSDRAM\n\tDDR SDRAM\n\tDDR2\n\tDDR3\n\tDDR4\n\tDDR5\n\n\n\tLPDDR (Mobile DDR)\n\tFast Cycle DRAM (FCRAM)\n\teDRAM\n\tRLDRAM\n\tHBM\n\tHBM2\n\tHBM3\n\n\n\tHybrid Memory Cube\n\n\n\n\n\tGraphics\t\n\tVRAM\n\tWRAM\n\tMDRAM\n\tSGRAM\n\tGDDR\n\tGDDR2\n\tGDDR3\n\tGDDR4\n\tGDDR5\n\tGDDR6\n\n\n\n\n\n\n\tRambus\t\n\tRDRAM\n\tXDR DRAM\n\tXDR2 DRAM\n\n\n\n\n\tMemory modules\t\n\tSIMM\n\tDIMM\n\tSO-DIMM\n\tUniDIMM\n\n\n\n\n\tLists\t\n\tDRAM timeline\n\tSDRAM timeline\n\tBandwidth\n\tTransistor count\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Dynamic_random-access_memory&oldid=916692600\"\n\n\t\t\n\t\tCategories: \tComputer memory\n\tTypes of RAM\n\tAmerican inventions\n\tJapanese inventions\n\t20th-century inventions\n\n\nHidden categories: \tWebarchive template wayback links\n\tCS1 maint: archived copy as title\n\tCS1: long volume value\n\tAll articles with dead external links\n\tArticles with dead external links from July 2019\n\tArticles with permanently dead external links\n\tWikipedia references cleanup from April 2019\n\tAll articles needing references cleanup\n\tArticles covered by WikiProject Wikify from April 2019\n\tAll articles covered by WikiProject Wikify\n\tAll articles that may contain original research\n\tArticles that may contain original research from December 2016\n\tArticles with dead external links from May 2019\n\tCS1 errors: missing periodical\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tCatalà\n\tČeština\n\tDeutsch\n\tEesti\n\tEspañol\n\tEuskara\n\tفارسی\n\tFrançais\n\t한국어\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tҚазақша\n\tLatina\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tNederlands\n\t日本語\n\tNorsk\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tShqip\n\tSimple English\n\tSlovenčina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t吴语\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 20 September 2019, at 04:07 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "20", "dc:title": "Dynamic random-access memory - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/MT4C1024-HD.jpg/1200px-MT4C1024-HD.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-dynamic_random_access_memory", "title": "Dynamic random-access memory - Wikipedia"}}