{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSpecific impulse - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tSpecific impulse\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Effective exhaust velocity)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tSpecific impulse (usually abbreviated Isp) is a measure of how effectively a rocket uses propellant or a jet engine uses fuel. Specific impulse can be calculated in a variety of different ways with different units. By definition, it is the total impulse (or change in momentum) delivered per unit of propellant consumed[1] and is dimensionally equivalent to the generated thrust divided by the propellant mass flow rate or weight flow rate.[2] If mass (kilogram, pound-mass, or slug) is used as the unit of propellant, then specific impulse has units of velocity. If weight (newton or pound-force) is used instead, then specific impulse has units of time (seconds).  Multiplying flow rate by the standard gravity (g0) converts specific impulse from the weight basis to the mass basis.[2]\n\nA propulsion system with a higher specific impulse uses the mass of the propellant more efficiently. In the case of a rocket or other vehicle governed by the Tsiolkovsky rocket equation, less propellant needed for a given delta-v.[1][3] In rockets, this means the vehicle the engine is attached to can more efficiently gain altitude and velocity. This effectiveness is less important in jet aircraft that are lifted by aerodynamic forces, use outside air for combustion, and carry payloads that are much heavier than the propellant.\n\nSpecific impulse can include the contribution to impulse provided by external air that has been used for combustion and is exhausted with the spent propellant. Jet engines use outside air, and therefore have a much higher specific impulse than rocket engines. The specific impulse in terms of propellant mass spent has units of distance per time, which is a notional velocity called the effective exhaust velocity. This is higher than the actual exhaust velocity because the mass of the combustion air is not being accounted for. Actual and effective exhaust velocity are the same in rocket engines operating in a vacuum.\n\nSpecific impulse is inversely proportional to specific fuel consumption (SFC) by the relationship Isp = 1/(go·SFC) for SFC in kg/(N·s) and Isp = 3600/SFC for SFC in lb/(lbf·hr).\n\n\nContents\n\n\n\t1 General considerations\n\t2 Units\n\t2.1 Specific impulse in seconds\n\t2.1.1 Rocketry\n\n\n\n\t2.2 Specific impulse as effective exhaust velocity\n\t2.3 Actual exhaust speed versus effective exhaust speed\n\n\n\n\t3 Energy efficiency\n\t3.1 Rockets\n\t3.2 Air breathing\n\n\n\n\t4 Examples\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nGeneral considerations[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (August 2019) (Learn how and when to remove this template message)\n\n\n\nThe amount of propellant can be measured either in units of mass or weight. If mass is used, specific impulse is an impulse per unit mass, which dimensional analysis shows to have units of speed, specifically the effective exhaust velocity. As the SI system is mass-based, this type of analysis is usually done in meters per second. If a force-based unit system is used, impulse is divided by propellant weight (weight is a measure of force), resulting in units of time (seconds). These two formulations differ from each other by the standard gravitational acceleration (g0) at the surface of the earth.\n\nThe rate of change of momentum of a rocket (including its propellant) per unit time is equal to the thrust. The higher the specific impulse, the less propellant is needed to produce a given thrust for a given time and the more efficient the propellant is. This should not be confused with the physics concept of energy efficiency, which can decrease as specific impulse increases, since propulsion systems that give high specific impulse require high energy to do so.[4]\n\nThrust and specific impulse should not be confused. Thrust is the force supplied by the engine and depends on the amount of reaction mass flowing through the engine. Specific impulse measures the impulse produced per unit of propellant and is proportional  to the exhaust velocity. Thrust and specific impulse are related by the design and propellants of the engine in question, but this relationship is tenuous. For example, LH2/LOx bipropellant produces higher Isp but lower thrust than RP-1/LOx due to the exhaust gases having a lower density and higher velocity (H2O vs CO2 and H2O). In many cases, propulsion systems with very high specific impulse—some ion thrusters reach 10,000 seconds—produce low thrust.[5] \n\nWhen calculating specific impulse, only propellant carried with the vehicle before use is counted. For a chemical rocket, the propellant mass therefore would include both fuel and oxidizer. In rocketry, a heavier engine with a higher specific impulse may not be as effective in gaining altitude, distance, or velocity as a lighter engine with a lower specific impulse, especially if the latter engine possesses a higher thrust-to-weight ratio. This is a significant reason for most rocket designs having multiple stages. The first stage is optimised for high thrust to boost the later stages with higher specific impulse into higher altitudes where they can perform more efficiently.\n\nFor air-breathing engines, only the mass of the fuel is counted, not the mass of air passing through the engine. Air resistance and the engine's inability to keep a high specific impulse at a fast burn rate are why all the propellant is not used as fast as possible.\n\nIf it were not for air resistance and the reduction of propellant during flight, specific impulse would be a direct measure of the engine's effectiveness in converting propellant weight or mass into forward momentum.\n\n\nUnits[edit]\n\nVarious equivalent rocket motor performance measurements, in SI and English engineering units\n\t\n\tSpecific impulse\n\tEffective \nexhaust velocity\n\tSpecific fuel \nconsumption\n\n\tBy weight\n\tBy mass\n\n\tSI\n\t= x s\n\t= 9.80665·x N·s/kg\n\t= 9.80665·x m/s\n\t= 101,972/x g/(kN·s)\n\n\tEnglish engineering units\n\t= x s\n\t= x lbf·s/lb\n\t= 32.17405·x ft/s\n\t= 3,600/x lb/(lbf·hr)\n\n\n\nThe most common unit for specific impulse is the second, as values are identical regardless of whether the calculations are done in SI, imperial, or customary units. Nearly all manufacturers quote their engine performance in seconds, and the unit is also useful for specifying aircraft engine performance.[6]\n\nThe use of metres per second to specify effective exhaust velocity is also reasonably common. The unit is intuitive when describing rocket engines, although the effective exhaust speed of the engines may be significantly different from the actual exhaust speed, especially in gas-generator cycle engines. For airbreathing jet engines, the effective exhaust velocity is not physically meaningful, although it can be used for comparison purposes.[7]\n\nMeters per second are numerically equivalent to Newton-seconds per kg (N·s/kg), and SI measurements of specific impulse can be written in terms of either units interchangeably.[citation needed]\n\nSpecific fuel consumption is inversely proportional to specific impulse and has units of g/(kN·s) or lb/(lbf·hr). Specific fuel consumption is used extensively for describing the performance of air-breathing jet engines.[8]\n\n\nSpecific impulse in seconds[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Specific impulse\" – news · newspapers · books · scholar · JSTOR  (August 2019) (Learn how and when to remove this template message)\n\n\n\nThe time unit of seconds to measure the performance of a fuel/engine combination can be thought of as \"How many seconds this propellant can accelerate its own initial mass at 1 g\". The more seconds it can accelerate its own mass, the more delta-V it delivers to the whole system.\n\nIn other words, given a particular engine and a pound of a particular fuel on the surface of the earth, specific impulse measures how long of a time that engine can exert a continuous pound of force (thrust) until fully burning through that pound of propellant. A given mass of a more energy-dense fuel can burn for a longer duration than some less energy-dense fuel made to exert the same force while burning in an engine.[note] Different engine designs burning the same fuel may not be equally efficient at directing their fuel's energy into effective thrust. In the same manner, some car engines are better built than others to maximize the miles-per-gallon of the gasoline they burn.\n\nNote: The \"pound of fuel\" refers to some particular mass of fuel measured in an arbitrary gravitational field (for example, Earth's); the \"pound of force\" refers to the force exerted by that pound-mass pressing down in the same arbitrary gravitational field; the particular acceleration of gravity is unimportant because it merely relates the two units, and thus specific impulse is not tied to gravity in any way—it is measured the same on any planet or in space.\n\nFor all vehicles, specific impulse (impulse per unit weight-on-Earth of propellant) in seconds can be defined by the following equation:[9]\n\n\n\t\n  \n    \n      \n        \n          F\n          \n            thrust\n          \n        \n        =\n        \n          g\n          \n            0\n          \n        \n        ⋅\n        \n          I\n          \n            sp\n          \n        \n        ⋅\n        \n          \n            \n              m\n              ˙\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle F_{\\text{thrust}}=g_{0}\\cdot I_{\\text{sp}}\\cdot {\\dot {m}},}\n  \n\n\n\nwhere:\n\n\n\t\n  \n    \n      \n        \n          F\n          \n            thrust\n          \n        \n      \n    \n    {\\displaystyle F_{\\text{thrust}}}\n  \n is the thrust obtained from the engine (newtons or pounds force),\n\t\n  \n    \n      \n        \n          g\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle g_{0}}\n  \n is the standard gravity, which is nominally the gravity at Earth's surface (m/s2 or ft/s2),\n\t\n  \n    \n      \n        \n          I\n          \n            sp\n          \n        \n      \n    \n    {\\displaystyle I_{\\text{sp}}}\n  \n is the specific impulse measured (seconds),\n\t\n  \n    \n      \n        \n          \n            \n              m\n              ˙\n            \n          \n        \n      \n    \n    {\\displaystyle {\\dot {m}}}\n  \n is the mass flow rate of the expended propellant (kg/s or slugs/s)\n\n\nThe English unit pound mass is more commonly used than the slug, and when using pounds per second for mass flow rate, the conversion constant g0 becomes unnecessary, because the slug is dimensionally equivalent to pounds divided by g0:\n\n\n\t\n  \n    \n      \n        \n          F\n          \n            thrust\n          \n        \n        =\n        \n          I\n          \n            sp\n          \n        \n        ⋅\n        \n          \n            \n              m\n              ˙\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle F_{\\text{thrust}}=I_{\\text{sp}}\\cdot {\\dot {m}}.}\n  \n\n\n\nIsp in seconds is the amount of time a rocket engine can generate thrust, given a quantity of propellant whose weight is equal to the engine's thrust.\n\nThe advantage of this formulation is that it may be used for rockets, where all the reaction mass is carried on board, as well as airplanes, where most of the reaction mass is taken from the atmosphere. In addition, it gives a result that is independent of units used (provided the unit of time used is the second).\n\n\n  \nThe specific impulse of various jet engines {SSME=Space Shuttle Main Engine}\n\n\n\n\nRocketry[edit]\n\nIn rocketry, the only reaction mass is the propellant, so an equivalent way of calculating the specific impulse in seconds is used. Specific impulse is defined as the thrust integrated over time per unit weight-on-Earth of the propellant:[2]\n\n\n\t\n  \n    \n      \n        \n          I\n          \n            \n              s\n              p\n            \n          \n        \n        =\n        \n          \n            \n              v\n              \n                e\n              \n            \n            \n              g\n              \n                0\n              \n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle I_{\\rm {sp}}={\\frac {v_{\\text{e}}}{g_{0}}},}\n  \n\n\n\nwhere\n\n\n\t\n  \n    \n      \n        \n          I\n          \n            \n              s\n              p\n            \n          \n        \n      \n    \n    {\\displaystyle I_{\\rm {sp}}}\n  \n is the specific impulse measured in seconds,\n\t\n  \n    \n      \n        \n          v\n          \n            e\n          \n        \n      \n    \n    {\\displaystyle v_{\\text{e}}}\n  \n is the average exhaust speed along the axis of the engine (in ft/s or m/s),\n\t\n  \n    \n      \n        \n          g\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle g_{0}}\n  \n is the standard gravity (in ft/s2 or m/s2).\n\n\nIn rockets, due to atmospheric effects, the specific impulse varies with altitude, reaching a maximum in a vacuum. This is because the exhaust velocity isn't simply a function of the chamber pressure, but is a function of the difference between the interior and exterior of the combustion chamber. Values are usually given for operation at sea level (\"sl\") or in a vacuum (\"vac\").\n\n\nSpecific impulse as effective exhaust velocity[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Specific impulse\" – news · newspapers · books · scholar · JSTOR  (August 2019) (Learn how and when to remove this template message)\n\n\n\nBecause of the geocentric factor of g0 in the equation for specific impulse, many prefer an alternate definition. The specific impulse of a rocket can be defined in terms of thrust per unit mass flow of propellant. This is an equally valid (and in some ways somewhat simpler) way of defining the effectiveness of a rocket propellant. For a rocket, the specific impulse defined in this way is simply the effective exhaust velocity relative to the rocket, ve. The two definitions of specific impulse are proportional to one another, and related to each other by:\n\n\n\t\n  \n    \n      \n        \n          v\n          \n            e\n          \n        \n        =\n        \n          g\n          \n            0\n          \n        \n        ⋅\n        \n          I\n          \n            sp\n          \n        \n        ,\n      \n    \n    {\\displaystyle v_{\\text{e}}=g_{0}\\cdot I_{\\text{sp}},}\n  \n\n\n\nwhere\n\n\n\t\n  \n    \n      \n        \n          I\n          \n            sp\n          \n        \n      \n    \n    {\\displaystyle I_{\\text{sp}}}\n  \n is the specific impulse in seconds,\n\t\n  \n    \n      \n        \n          v\n          \n            e\n          \n        \n      \n    \n    {\\displaystyle v_{\\text{e}}}\n  \n is the specific impulse measured in m/s, which is the same as the effective exhaust velocity measured in m/s (or ft/s if g is in ft/s2),\n\t\n  \n    \n      \n        \n          g\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle g_{0}}\n  \n is the standard gravity, 9.80665 m/s2 (in Imperial units 32.174 ft/s2).\n\n\nThis equation is also valid for air-breathing jet engines, but is rarely used in practice.\n\n(Note that different symbols are sometimes used; for example, c is also sometimes seen for exhaust velocity. While the symbol \n  \n    \n      \n        \n          I\n          \n            sp\n          \n        \n      \n    \n    {\\displaystyle I_{\\text{sp}}}\n  \n might logically be used for specific impulse in units of N·s/kg; to avoid confusion, it is desirable to reserve this for specific impulse measured in seconds.)\n\nIt is related to the thrust, or forward force on the rocket by the equation:[10]\n\n\n\t\n  \n    \n      \n        \n          F\n          \n            thrust\n          \n        \n        =\n        \n          v\n          \n            e\n          \n        \n        ⋅\n        \n          \n            \n              m\n              ˙\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle F_{\\text{thrust}}=v_{\\text{e}}\\cdot {\\dot {m}},}\n  \n\n\n\nwhere \n  \n    \n      \n        \n          \n            \n              m\n              ˙\n            \n          \n        \n      \n    \n    {\\displaystyle {\\dot {m}}}\n  \n is the propellant mass flow rate, which is the rate of decrease of the vehicle's mass.\n\nA rocket must carry all its fuel with it, so the mass of the unburned fuel must be accelerated along with the rocket itself. Minimizing the mass of fuel required to achieve a given change in velocity is crucial to building effective rockets. The Tsiolkovsky rocket equation shows that for a rocket with a given empty mass and a given amount of fuel, the total change in velocity it can accomplish is proportional to the effective exhaust velocity. \n\nA spacecraft without propulsion follows an orbit determined by its trajectory and any gravitational field. Deviations from the corresponding velocity pattern (these are called Δv) are achieved by sending exhaust mass in the direction opposite to that of the desired velocity change.\n\n\nActual exhaust speed versus effective exhaust speed[edit]\n\nWhen an engine is run within the atmosphere, the exhaust velocity is reduced by atmospheric pressure, in turn reducing specific impulse. This is a reduction in the effective exhaust velocity, versus the actual exhaust velocity achieved in vacuum conditions. In the case of gas-generator cycle rocket engines, more than one exhaust gas stream is present as turbopump exhaust gas exits through a separate nozzle. Calculating the effective exhaust velocity requires averaging the two mass flows as well as accounting for any atmospheric pressure.[citation needed]\n\nFor air-breathing jet engines, particularly turbofans, the actual exhaust velocity and the effective exhaust velocity are different by orders of magnitude. This is because a good deal of additional momentum is obtained by using air as reaction mass. This allows a better match between the airspeed and the exhaust speed, which saves energy/propellant and enormously increases the effective exhaust velocity while reducing the actual exhaust velocity.[citation needed]\n\n\nEnergy efficiency[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (August 2019) (Learn how and when to remove this template message)\n\n\n\nRockets[edit]\n\nFor rockets and rocket-like engines such as ion thrusters a higher \n  \n    \n      \n        \n          I\n          \n            sp\n          \n        \n      \n    \n    {\\displaystyle I_{\\text{sp}}}\n  \n implies lower energy efficiency, as the power needed to run the engine is as follows:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              d\n              m\n            \n            \n              d\n              t\n            \n          \n        \n        \n          \n            \n              v\n              \n                e\n              \n              \n                2\n              \n            \n            2\n          \n        \n      \n    \n    {\\displaystyle {\\frac {dm}{dt}}{\\frac {v_{e}^{2}}{2}}}\n  \n\n\n\nwhere ve is the actual exhaust jet velocity.\n\nfrom momentum considerations the thrust generated is:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              d\n              m\n            \n            \n              d\n              t\n            \n          \n        \n        \n          v\n          \n            e\n          \n        \n      \n    \n    {\\displaystyle {\\frac {dm}{dt}}v_{e}}\n  \n\n\n\nDividing the power by the thrust to obtain the specific power requirements we get:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              v\n              \n                e\n              \n            \n            2\n          \n        \n      \n    \n    {\\displaystyle {\\frac {v_{e}}{2}}}\n  \n\n\n\nWith constant thrust, the power needed increases as the exhaust velocity, leading to a lower energy efficiency per unit thrust. However, real-world vehicles are also limited in the mass amount of propellant they can carry. At low exhaust velocity the amount of reaction mass increases, at very high exhaust velocity the energy required becomes prohibitive.\n\nTheoretically, for a given delta-v, in space, among all fixed values for the exhaust speed the value \n  \n    \n      \n        \n          v\n          \n            e\n          \n        \n        =\n        0.6275\n        Δ\n        v\n      \n    \n    {\\displaystyle v_{\\text{e}}=0.6275\\Delta v}\n  \n is the most energy efficient for a specified (fixed) final mass, see energy in spacecraft propulsion.\n\nHowever, a variable exhaust speed can be more energy efficient still. For example, if a rocket is accelerated from some positive initial speed using an exhaust speed equal to the speed of the rocket no energy is lost as kinetic energy of reaction mass, since it becomes stationary.[11] (Theoretically, by making this initial speed low and using another method of obtaining this small speed, the energy efficiency approaches 100%, but requires a large initial mass.) In this case the rocket keeps the same momentum, so its speed is inversely proportional to its remaining mass. During such a flight the kinetic energy of the rocket is proportional to its speed and, correspondingly, inversely proportional to its remaining mass. The power needed per unit acceleration is constant throughout the flight; the reaction mass to be expelled per unit time to produce a given acceleration is proportional to the square of the rocket's remaining mass.\n\nAlso it is advantageous to expel reaction mass at a location where the gravity potential is low, see Oberth effect.\n\n\nAir breathing[edit]\n\nAir-breathing engines such as turbojets increase the momentum generated from their propellant by using it to power the acceleration of inert air rearwards. It turns out that the amount of energy needed to generate a particular amount of thrust is inversely proportional to the amount of air propelled rearwards, thus increasing the mass of air (as with a turbofan) both improves energy efficiency as well as \n  \n    \n      \n        \n          I\n          \n            sp\n          \n        \n      \n    \n    {\\displaystyle I_{\\text{sp}}}\n  \n.\n\n\nExamples[edit]\n\nFor a more comprehensive list, see Spacecraft propulsion § Table of methods.\n\nSpecific fuel consumption (SFC), specific impulse, and effective exhaust velocity numbers for various rocket and jet engines.\n\tEngine type\n\tScenario\n\tSpec. fuel cons.\n\tSpecific \nimpulse (s)\n\tEffective exhaust \nvelocity (m/s)\n\n\t(lb/lbf·h)\n\t(g/kN·s)\n\n\tNK-33 rocket engine\tVacuum\n\t10.9\n\t308\n\t331[12]\n\t3250\n\n\tSSME rocket engine\tSpace shuttle vacuum\n\t7.95\n\t225\n\t453[13]\n\t4440\n\n\tRamjet\n\tMach 1\n\t4.5\n\t130\n\t800\n\t7800\n\n\tJ-58 turbojet\tSR-71 at Mach 3.2 (Wet)\n\t1.9[14]\n\t54\n\t1900\n\t19000\n\n\tEurojet EJ200\tReheat\n\t1.66–1.73\n\t47–49[15]\n\t2080–2170\n\t20400–21300\n\n\tRolls-Royce/Snecma Olympus 593 turbojet\tConcorde Mach 2 cruise (Dry)\n\t1.195[16]\n\t33.8\n\t3010\n\t29500\n\n\tEurojet EJ200\tDry\n\t0.74–0.81\n\t21–23[15]\n\t4400–4900\n\t44000–48000\n\n\tCF6-80C2B1F turbofan\tBoeing 747-400 cruise\n\t0.605[16]\n\t17.1\n\t5950\n\t58400\n\n\tGeneral Electric CF6 turbofan\tSea level\n\t0.307[16]\n\t8.7\n\t11700\n\t115000\n\n\n\nSpecific impulse of various propulsion technologies\n\tEngine\n\tEffective exhaust \nvelocity (m/s)\n\tSpecific \nimpulse (s)\n\tExhaust specific \nenergy (MJ/kg)\n\n\tTurbofan jet engine\n(actual V is ~300 m/s)\n\t29,000\n\t3,000\n\tApprox. 0.05\n\n\tSpace Shuttle Solid Rocket Booster\n\n\t2,500\n\t250\n\t3\n\n\tLiquid oxygen-liquid hydrogen\n\n\t4,400\n\t450\n\t9.7\n\n\tIon thruster\n\t29,000\n\t3,000\n\t430\n\n\tVASIMR[17][18][19]\n\t30,000–120,000\n\t3,000–12,000\n\t1,400\n\n\tDual-stage 4-grid electrostatic ion thruster[20]\n\t210,000\n\t21,400\n\t22,500\n\n\tIdeal photonic rocket[a]\n\t299,792,458\n\t30,570,000\n\t89,875,517,874\n\n\n\nAn example of a specific impulse measured in time is 453 seconds, which is equivalent to an effective exhaust velocity of 4,440 m/s, for the Space Shuttle Main Engines when operating in a vacuum.[21] An air-breathing jet engine typically has a much larger specific impulse than a rocket; for example a turbofan jet engine may have a specific impulse of 6,000 seconds or more at sea level whereas a rocket would be around 200–400 seconds.[22]\n\nAn air-breathing engine is thus much more propellant efficient than a rocket engine, because the actual exhaust speed is much lower, the air provides an oxidizer, and air is used as reaction mass. Since the physical exhaust velocity is lower, the kinetic energy the exhaust carries away is lower and thus the jet engine uses far less energy to generate thrust (at subsonic speeds).[23] While the actual exhaust velocity is lower for air-breathing engines, the effective exhaust velocity is very high for jet engines. This is because the effective exhaust velocity calculation essentially assumes that the propellant is providing all the thrust, and hence is not physically meaningful for air-breathing engines; nevertheless, it is useful for comparison with other types of engines.[24]\n\nThe highest specific impulse for a chemical propellant ever test-fired in a rocket engine was 542 seconds (5,320 m/s) with a tripropellant of lithium, fluorine, and hydrogen. However, this combination is impractical; see rocket propellant.[25][26]\n\nNuclear thermal rocket engines differ from conventional rocket engines in that energy is supplied to the propellants by an external nuclear heat source instead of the heat of combustion.[27] The nuclear rocket typically operates by passing liquid hydrogen gas through an operating nuclear reactor. Testing in the 1960s yielded specific impulses of about 850 seconds (8,340 m/s), about twice that of the Space Shuttle engines.[citation needed]\n\nA variety of other rocket propulsion methods, such as ion thrusters, give much higher specific impulse but with much lower thrust; for example the Hall effect thruster on the SMART-1 satellite has a specific impulse of 1,640 s (16,100 m/s) but a maximum thrust of only 68 millinewtons.[28]  The variable specific impulse magnetoplasma rocket (VASIMR) engine currently in development will theoretically yield 20,000−300,000 m/s, and a maximum thrust of 5.7 newtons.[29]\n\n\nSee also[edit]\n\n\n\tJet engine\n\tImpulse\n\tTsiolkovsky rocket equation\n\tSystem-specific impulse\n\tSpecific energy\n\tStandard gravity\n\tThrust specific fuel consumption—fuel consumption per unit thrust\n\tSpecific thrust—thrust per unit of air for a duct engine\n\tHeating value\n\tEnergy density\n\tDelta-v (physics)\n\tRocket propellant\n\tLiquid rocket propellants\n\n\n\n\nReferences[edit]\n\n\n\t^ a b \"What is specific impulse?\". Qualitative Reasoning Group. Retrieved 22 December 2009.\n\n\t^ a b c Benson, Tom (11 July 2008). \"Specific impulse\". NASA. Retrieved 22 December 2009.\n\n\n\t^ Hutchinson, Lee (14 April 2013). \"New F-1B rocket engine upgrades Apollo-era design with 1.8M lbs of thrust\". Ars Technica. Retrieved 15 April 2013. The measure of a rocket's fuel effectiveness is called its specific impulse (abbreviated as 'ISP'—or more properly Isp).... 'Mass specific impulse...describes the thrust-producing effectiveness of a chemical reaction and it is most easily thought of as the amount of thrust force produced by each pound (mass) of fuel and oxidizer propellant burned in a unit of time. It is kind of like a measure of miles per gallon (mpg) for rockets.'\n\n\n\t^ \"Archived copy\". Archived from the original on 2 October 2013. Retrieved 16 November 2013.CS1 maint: archived copy as title (link)\n\n\n\t^ \"Mission Overview\". exploreMarsnow. Retrieved 23 December 2009.\n\n\n\t^ http://www.grc.nasa.gov/WWW/k-12/airplane/specimp.html\n\n\t^ http://www.qrg.northwestern.edu/projects/vss/docs/propulsion/3-what-is-specific-impulse.html\n\n\t^ http://www.grc.nasa.gov/WWW/k-12/airplane/sfc.html\n\n\t^ Rocket Propulsion Elements, 7th Edition by George P. Sutton, Oscar Biblarz\n\n\t^ Thomas A. Ward (2010). Aerospace Propulsion Systems. John Wiley & Sons. p. 68. ISBN 978-0-470-82497-9.\n\n\n\t^ Note that this limits the speed of the rocket to the maximum exhaust speed.\n\n\t^ \"NK33\". Encyclopedia Astronautica.\n\n\n\t^ \"SSME\". Encyclopedia Astronautica.\n\n\n\t^ Nathan Meier (21 March 2005). \"Military Turbojet/Turbofan Specifications\".\n\n\n\t^ a b \"EJ200 turbofan engine\" (PDF). MTU Aero Engines. April 2016.\n\n\n\t^ a b c Ilan Kroo. \"Data on Large Turbofan Engines\". Aircraft Design: Synthesis and Analysis. Stanford University.\n\n\n\t^ http://www.adastrarocket.com/TimSTAIF2005.pdf\n\n\t^ http://www.adastrarocket.com/AIAA-2010-6772-196_small.pdf\n\n\t^ http://spacefellowship.com/news/art24083/vasimr-vx-200-meets-full-power-efficiency-milestone.html\n\n\t^ http://www.esa.int/esaCP/SEMOSTG23IE_index_0.html\n\n\t^ http://www.astronautix.com/engines/ssme.htm\n\n\t^ http://web.mit.edu/16.unified/www/SPRING/propulsion/notes/node85.html\n\n\t^ \"Archived copy\". Archived from the original on 20 October 2013. Retrieved 12 July 2014.CS1 maint: archived copy as title (link)\n\n\n\t^ http://www.britannica.com/EBchecked/topic/198045/effective-exhaust-velocity\n\n\t^ ARBIT, H. A., CLAPP, S. D., DICKERSON, R. A., NAGAI, C. K., Combustion characteristics of the fluorine-lithium/hydrogen tripropellant combination. AMERICAN INST OF AERONAUTICS AND ASTRONAUTICS, PROPULSION JOINT SPECIALIST CONFERENCE, 4TH, CLEVELAND, OHIO, June 10–14, 1968.\n\n\t^ ARBIT, H. A., CLAPP, S. D., NAGAI, C. K., Lithium-fluorine-hydrogen propellant investigation Final report NASA, May 1, 1970.\n\n\t^ http://trajectory.grc.nasa.gov/projects/ntp/index.shtml\n\n\t^ http://www.mendeley.com/research/characterization-of-a-high-specific-impulse-xenon-hall-effect-thruster/\n\n\t^ http://www.adastrarocket.com/AdAstra%20Release%2023Nov2010final.pdf\n\n\n\n\n\n\t^ A hypothetical device doing perfect conversion of mass to photons emitted perfectly aligned so as to be antiparallel to the desired thrust vector.  This represents the theoretical upper limit for propulsion relying strictly on onboard fuel and the rocket principle.\n\n\n\n\n\nExternal links[edit]\n\n\tRPA - Design Tool for Liquid Rocket Engine Analysis\n\tList of Specific Impulses of various rocket fuels\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Specific_impulse&oldid=917700959#Specific_impulse_as_a_speed_(effective_exhaust_velocity)\"\n\n\t\t\n\t\tCategories: \tRocket propulsion\n\tSpacecraft propulsion\n\tPhysical quantities\n\tClassical mechanics\n\tEngine technology\n\n\nHidden categories: \tCS1 maint: archived copy as title\n\tArticles needing additional references from August 2019\n\tAll articles needing additional references\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from August 2019\n\tArticles with unsourced statements from July 2011\n\tUse dmy dates from July 2011\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tČeština\n\tDeutsch\n\tEspañol\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tहिन्दी\n\tIdo\n\tItaliano\n\tעברית\n\tLietuvių\n\tNederlands\n\t日本語\n\tPolski\n\tPortuguês\n\tРусский\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSuomi\n\tதமிழ்\n\tไทย\n\tTürkçe\n\tУкраїнська\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 25 September 2019, at 01:39 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Specific impulse - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-effective_exhaust_velocity", "title": "Specific impulse - Wikipedia"}}