{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nElectrostatic discharge - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tElectrostatic discharge\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\tPart of a series of articles about\n\tElectromagnetism\n\t\n\t\n\tElectricity\n\tMagnetism\n\n\n\t\nElectrostatics\n\n\tConductor\n\tCoulomb's law\n\tElectric charge\n\tElectric dipole moment\n\tElectric field\n\tElectric flux / potential energy\n\tElectrostatic discharge\n\tGauss's law\n\tInduction\n\tInsulator\n\tPolarization density\n\tStatic electricity\n\tTriboelectricity\n\n\n\n\n\t\nMagnetostatics\n\n\tAmpère's law\n\tBiot–Savart law\n\tGauss's law for magnetism\n\tMagnetic field\n\tMagnetic flux\n\tMagnetic dipole moment\n\tMagnetization\n\tMagnetomotive force\n\n\n\n\n\t\nElectrodynamics\n\n\tLorentz force law\n\tElectromagnetic induction\n\tFaraday's law\n\tLenz's law\n\tDisplacement current\n\tMagnetic potential\n\tMaxwell's equations\n\tElectromagnetic field\n\tElectromagnetic pulse\n\tElectromagnetic radiation\n\tMaxwell tensor\n\tPoynting vector\n\tLiénard–Wiechert potential\n\tJefimenko's equations\n\tEddy current\n\tLondon equations\n\n\n\tMathematical descriptions of the electromagnetic field\n\n\n\n\n\n\t\nElectrical network\n\n\tAlternating current\n\tCapacitance\n\tDirect current\n\tElectric current\n\tElectric potential\n\tElectromotive force\n\tImpedance\n\tInductance\n\tOhm's law\n\tParallel circuit\n\tResistance\n\tResonant cavities\n\tSeries circuit\n\tVoltage\n\tWaveguides\n\n\n\n\n\t\nCovariant formulation\n\n\tElectromagnetic tensor\n(stress–energy tensor)\n\n\n\n\tFour-current\n\tElectromagnetic four-potential\n\n\n\n\n\t\nScientists\n\n\tAmpère\n\tBiot\n\tCoulomb\n\tFaraday\n\tGauss\n\tHeaviside\n\tHenry\n\tHertz\n\tLenz\n\tLorentz\n\tMaxwell\n\tØrsted\n\tSavart\n\tTesla\n\tVolta\n\tWeber\n\t\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nElectrostatic discharge (ESD) is the sudden flow of electricity between two electrically charged objects caused by contact, an electrical short, or dielectric breakdown. A buildup of static electricity can be caused by tribocharging or by electrostatic induction. The ESD occurs when differently-charged objects are brought close together or when the dielectric between them breaks down, often creating a visible spark.\n\nESD can create spectacular electric sparks (lightning, with the accompanying sound of thunder, is a large-scale ESD event), but also less dramatic forms which may be neither seen nor heard, yet still be large enough to cause damage to sensitive electronic devices. Electric sparks require a field strength above approximately 40 kV/cm in air, as notably occurs in lightning strikes. Other forms of ESD include corona discharge from sharp electrodes and brush discharge from blunt electrodes.\n\nESD can cause harmful effects of importance in industry, including explosions in gas, fuel vapor and coal dust, as well as failure of solid state electronics components such as integrated circuits.  These can suffer permanent damage when subjected to high voltages.  Electronics manufacturers therefore establish electrostatic protective areas free of static, using measures to prevent charging, such as avoiding highly charging materials and measures to remove static such as grounding human workers, providing antistatic devices, and controlling humidity.\n\nESD simulators may be used to test electronic devices, for example with a human body model or a charged device model.\n\n\nContents\n\n\n\t1 Causes\n\t2 Types\n\t2.1 Sparks\n\n\n\n\t3 Damage prevention in electronics\n\t3.1 Protection during manufacturing\n\t3.2 Protection during transit\n\n\n\n\t4 Simulation and testing for electronic devices\n\t5 See also\n\t6 References\n\n\n\n\n\nCauses[edit]\n\nOne of the causes of ESD events is static electricity. Static electricity is often generated through tribocharging, the separation of electric charges that occurs when two materials are brought into contact and then separated. Examples of tribocharging  include walking on a rug, rubbing a plastic comb against dry hair, rubbing a balloon against a sweater, ascending from a fabric car seat, or removing some types of plastic packaging. In all these cases, the breaking of contact between two materials results in tribocharging, thus creating a difference of electrical potential that can lead to an ESD event.\n\nAnother cause of ESD damage is through electrostatic induction. This occurs when an electrically charged object is placed near a conductive object isolated from the ground. The presence of the charged object creates an electrostatic field that causes electrical charges on the surface of the other object to redistribute. Even though the net electrostatic charge of the object has not changed, it now has regions of excess positive and negative charges. An ESD event may occur when the object comes into contact with a conductive path. For example, charged regions on the surfaces of styrofoam cups or bags can induce potential on nearby ESD sensitive components via electrostatic induction and an ESD event may occur if the component is touched with a metallic tool.\n\nESD can also be caused by energetic charged particles impinging on an object. This causes increasing surface and deep charging. This is a known hazard for most spacecraft.[1]\n\n\nTypes[edit]\n\nThe most spectacular form of ESD is the spark, which occurs when a heavy electric field creates an ionized conductive channel in air. This can cause minor discomfort to people, severe damage to electronic equipment, and fires and explosions if the air contains combustible gases or particles.\n\nHowever, many ESD events occur without a visible or audible spark. A person carrying a relatively small electric charge may not feel a discharge that is sufficient to damage sensitive electronic components.  Some devices may be damaged by discharges as small as 30 V. These invisible forms of ESD can cause outright device failures, or less obvious forms of degradation that may affect the long term reliability and performance of electronic devices.  The degradation in some devices may not become evident until well into their service life.[citation needed]\n\n\nSparks[edit]\n\nMain article: electric spark\n\nA spark is triggered when the electric field strength exceeds approximately 4–30 kV/cm[2] — the dielectric field strength of air. This may cause a very rapid increase in the number of free electrons and ions in the air, temporarily causing the air to abruptly become an electrical conductor in a process called dielectric breakdown.\n\n\n  \nLightning over Rymań. Northern Poland.\n\n\n\nPerhaps the best known example of a natural spark is lightning.  In this case the electric potential between a cloud and ground, or between two clouds, is typically hundreds of millions of volts. The resulting current that cycles through the stroke channel causes an enormous transfer of energy. On a much smaller scale, sparks can form in air during electrostatic discharges from charged objects that are charged to as little as 380 V (Paschen's law).\n\nEarth's atmosphere consists of 21% oxygen (O2) and 78% nitrogen (N2). During an electrostatic discharge, such as a lightning flash, the affected atmospheric molecules become electrically overstressed.  The diatomic oxygen molecules are split, and then recombine to form ozone (O3), which is unstable, or reacts with metals and organic matter. If the electrical stress is high enough, nitrogen oxides (NOx) can form. Both products are toxic to animals, and nitrogen oxides are essential for nitrogen fixation. Ozone attacks all organic matter by ozonolysis and is used in water purification.\n\nSparks are an ignition source in combustible environments that may lead to catastrophic explosions in concentrated fuel environments.  Most explosions can be traced back to a tiny electrostatic discharge, whether it was an unexpected combustible fuel leak invading a known open air sparking device, or an unexpected spark in a known fuel rich environment.  The end result is the same if oxygen is present and the three criteria of the fire triangle have been combined.\n\n\nDamage prevention in electronics[edit]\n\n  \nA portion of a static discharger on an aircraft. Note the two sharp 3/8\" metal micropoints and the protective yellow plastic.\n\n\n\nMany electronic components, especially microchips, can be damaged by ESD. Sensitive components need to be protected during and after manufacture, during shipping and device assembly, and in the finished device. Grounding is especially important for effective ESD control. It should be clearly defined, and regularly evaluated.[3]\n\n\nSee also: Electrostatic-sensitive device and Electrostatic discharge materials\n\nProtection during manufacturing[edit]\n\nIn manufacturing, prevention of ESD is based on an Electrostatic Discharge Protected Area (EPA). The EPA can be a small workstation or a large manufacturing area. The main principle of an EPA is that there are no highly-charging materials in the vicinity of ESD sensitive electronics, all conductive and dissipative materials are grounded, workers are grounded, and charge build-up on ESD sensitive electronics is prevented. International standards are used to define a typical EPA and can be found for example from International Electrotechnical Commission (IEC) or American National Standards Institute (ANSI).\n\nESD prevention within an EPA may include using appropriate ESD-safe packing material, the use of conductive filaments on garments worn by assembly workers, conducting wrist straps and foot-straps to prevent high voltages from accumulating on workers' bodies, anti-static mats or conductive flooring materials to conduct harmful electric charges away from the work area, and humidity control. Humid conditions prevent electrostatic charge generation because the thin layer of moisture that accumulates on most surfaces serves to dissipate electric charges.\n\nIonizers are used especially when insulative materials cannot be grounded. Ionization systems help to neutralize charged surface regions on insulative or dielectric materials. Insulating materials prone to triboelectric charging of more than 2,000 V should be kept away at least 12 inches from sensitive devices to prevent accidental charging of devices through field induction. On aircraft, static dischargers are used on the trailing edges of wings and other surfaces.\n\nManufacturers and users of integrated circuits must take precautions to avoid ESD. ESD prevention can be part of the device itself and include special design techniques for device input and output pins. External protection components can also be used with circuit layout.\n\nDue to dielectric nature of electronics component and assemblies, electrostatic charging cannot be completely prevented during handling of devices. Most of ESD sensitive electronic assemblies and components are also so small that manufacturing and handling is done with automated equipment. ESD prevention activities are therefore important with those processes where components come into direct contact with equipment surfaces. In addition, it is important to prevent ESD when an electrostatic discharge sensitive component is connected with other conductive parts of the product itself. An efficient way to prevent ESD is to use materials that are not too conductive but will slowly conduct static charges away. These materials are called static dissipative and have resistivity values below 1012 ohm-meters. Materials in automated manufacturing which will touch on conductive areas of ESD sensitive electronic should be made of dissipative material, and the dissipative material must be grounded. These special materials are able to conduct electricity, but do so very slowly. Any built-up static charges dissipate without the sudden discharge that can harm the internal structure of silicon circuits.[4]\n\n\nProtection during transit[edit]\n\n  \nA network card inside an antistatic bag, a bag made of a partially conductive plastic that acts as a Faraday cage, shielding the card from ESD.\n\n\n\nSensitive devices need to be protected during shipping, handling, and storage. The  buildup and discharge of static can be minimized by controlling the surface resistance and volume resistivity of packaging materials. Packaging is also designed to minimize frictional or triboelectric charging of packs due to rubbing together during shipping, and it may be necessary to incorporate electrostatic or electromagnetic shielding in the packaging material.[5]  A common example is that semiconductor devices and computer components are usually shipped in an antistatic bag made of a partially conductive plastic, which acts as a Faraday cage to protect the contents against ESD.\n\n\nSimulation and testing for electronic devices[edit]\n\n  \nElectric discharge showing the ribbon-like plasma filaments from multiple discharges from a Tesla coil.\n\n\n\nFor testing the susceptibility of electronic devices to ESD from human contact, an ESD Simulator with a special output circuit, called the human body model (HBM) is often used. This consists of a capacitor in series with a resistor. The capacitor is charged to a specified high voltage from an external source, and then suddenly discharged through the resistor into an electrical terminal of the device under test. One of the most widely used models is defined in the JEDEC 22-A114-B standard, which specifies a 100 picofarad capacitor and a 1,500 ohm resistor. Other similar standards are MIL-STD-883 Method 3015, and the ESD Association's ESD STM5.1. For comportment to European Union standards for Information Technology Equipment, the IEC/EN 61000-4-2 test specification is used.[6] Another specification (Schaffner) C = 150 pF R = 330 Ω that gives high fidelity results. Mostly the theory is there, minimum of the companies measure the real ESD survival rate. Guidelines and requirements are given for test cell geometries, generator specifications, test levels, discharge rate and waveform, types and points of discharge on the \"victim\" product, and functional criteria for gauging product survivability.\n\nA charged device model (CDM) test is used to define the ESD a device can withstand when the device itself has an electrostatic charge and discharges due to metal contact. This discharge type is the most common type of ESD in electronic devices and causes most of the ESD damages in their manufacturing. CDM discharge depends mainly on parasitic parameters of the discharge and strongly depends on size and type of component package. One of the most widely used CDM simulation test models is defined by the JEDEC.\n\nOther standardized ESD test circuits include the machine model (MM) and transmission line pulse (TLP).\n\n\nSee also[edit]\n\n\tAutomotive Electronics Council, which defines in some of its standards, ESD test qualification requirements for electronic components used in vehicles\n\tDielectric wireless receiver\n\tElectric arc\n\tElectromagnetic pulse\n\tElectrostatic Discharge Association\n\tElectrostatic voltmeter\n\tggNMOS\n\tLatchup, for qualification testing of semiconductor devices, ESD and latchup are commonly considered together\n\tSpark gap\n\tStatic electricity\n\tWimshurst machine\n\n\nReferences[edit]\n\n\n\t^ Henry B. Garrett and Albert C. Whittlesey: Spacecraft charging, an update; IEEE Trans. Plasma Science, 28(6), 2000.\n\n\t^ CRC Handbook of Chemistry and Physics  (PDF)\n\n\t^ \"Fundamentals of Electrostatic Discharge\". In Compliance Magazine. May 1, 2015. Retrieved 25 June 2015.\n\n\t^ \"ESD Explained: What is Electrostatic Discharge?\". Saline Lectronics. 2019-02-14. Retrieved 2019-02-26.\n\n\n\t^ GR-1421, Generic Requirements for ESD-[https://newtophome.info/best-power-strips/ Protective Circuit Pack Containers], Telcordia.\n\n\t^ \"Baytems ESDzap - Lightweight ESD Simulator Product Overview\" (PDF). Baytems. Aug 25, 2012. Retrieved 2012-08-25.\n\n\n\n\n\n\n\tAuthority control \t\n\tNDL: 00563320\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Electrostatic_discharge&oldid=913473734\"\n\n\t\t\n\t\tCategories: \tElectrical breakdown\n\tElectrical safety\n\tElectrostatics\n\tPlasma physics\n\n\nHidden categories: \tAll articles with unsourced statements\n\tArticles with unsourced statements from March 2013\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tБългарски\n\tCatalà\n\tČeština\n\tDeutsch\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\t한국어\n\tLietuvių\n\tMagyar\n\tМакедонски\n\tNederlands\n\tनेपाली\n\tNorsk nynorsk\n\tPolski\n\tPortuguês\n\tRomână\n\tSlovenščina\n\tSuomi\n\tSvenska\n\tTürkçe\n\tУкраїнська\n\t吴语\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 September 2019, at 08:16 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "Electrostatic discharge - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/VFPt_Solenoid_correct2.svg/1200px-VFPt_Solenoid_correct2.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-electrostatic_discharge", "title": "Electrostatic discharge - Wikipedia"}}