{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nElectric power - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tElectric power\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t the rate per unit of time at which electrical energy is transferred by an electric circuit\n\n  \nElectric power is transmitted on overhead lines like these, and also on underground high-voltage cables.\n\n\n\nElectric power is the rate, per unit time, at which electrical energy is transferred by an electric circuit. The SI unit of power is the watt, one joule per second.\n\nElectric power is usually produced by electric generators, but can also be supplied by  sources such as electric batteries.   It is usually supplied to businesses and homes (as domestic mains electricity) by the electric power industry through an electric power grid. Electric energy is usually sold by the kilowatt hour (1 kW·h = 3.6 MJ) which is the product of the  power in kilowatts multiplied by running time in hours.  Electric utilities measure power using an electricity meter, which keeps a running total of the electric energy delivered to a customer.\n\nElectrical power provides a low entropy form of energy and can be carried long distances and converted into other forms of energy such as motion, light or heat with high energy efficiency.[1]\n\n\nContents\n\n\n\t1 Definition\n\t2 Explanation\n\t2.1 Passive sign convention\n\t2.2 Resistive circuits\n\t2.3 Alternating current\n\t2.4 Electromagnetic fields\n\n\n\n\t3 Generation\n\t4 Electric power industry\n\t5 Use\n\t6 See also\n\t7 Notes\n\t8 References\n\t9 External links\n\n\n\n\n\nDefinition[edit]\n\nElectric power, like mechanical power, is the rate of doing work, measured in watts, and represented by the letter P. The term wattage is used colloquially to mean \"electric power in watts.\"  The electric power in watts produced by an electric current I consisting of a charge of Q coulombs every t seconds passing through an electric potential (voltage) difference of V is\n\n\n\t\n  \n    \n      \n        P\n        =\n        \n          work done per unit time\n        \n        =\n        \n          \n            \n              V\n              Q\n            \n            t\n          \n        \n        =\n        V\n        I\n        \n      \n    \n    {\\displaystyle P={\\text{work done per unit time}}={\\frac {VQ}{t}}=VI\\,}\n  \n\n\n\nwhere\n\n\n\tQ is electric charge in coulombs\n\tt is time in seconds\n\tI is electric current in amperes\n\tV is electric potential or voltage in volts\n\n\nExplanation[edit]\n\n  \nAnimation showing electric load\n\n\n\nElectric power is transformed to other forms of energy when electric charges move through an electric potential (voltage) difference, which occurs in electrical components in electric circuits.  From the standpoint of electric power, components in an electric circuit can be divided into two categories:  \n\n\n\tPassive devices or loads:  When electric charges move through a potential difference from a higher to a lower voltage, that is when conventional current (positive charge) moves from the positive (+)  terminal to the negative (−) terminal, work is done by the charges on the device. The potential energy of the charges due to the voltage between the terminals is converted to kinetic energy in the device. These devices are called passive components or loads; they 'consume' electric power from the circuit, converting it to other forms of energy such as mechanical work, heat, light, etc.  Examples are electrical appliances, such as light bulbs, electric motors, and electric heaters.  In alternating current (AC) circuits the direction of the voltage periodically reverses, but the current always flows from the higher potential to the lower potential side.\n\n\n  \nAnimation showing power source\n\n\n\n\tActive devices or power sources: If the charges are moved by an 'exterior force' through the device in the direction from the lower electric potential to the higher, (so positive charge moves from the negative to the positive terminal), work will be done on the charges, and energy is being converted to electric potential energy from some other type of energy, such as mechanical energy or chemical energy. Devices in which this occurs are called active devices or power sources; such as electric generators and batteries.\n\n\nSome devices can be either a source or a load, depending on the voltage and current through them.  For example, a rechargeable battery acts as a source when it provides power to a circuit, but as a load when it is connected to a battery charger and is being recharged, or a generator as a power source and a motor as a load.\n\n\nPassive sign convention[edit]\n\nMain article: Passive sign convention\n\nSince electric power can flow either into or out of a component, a convention is needed for which direction represents positive power flow. Electric power flowing out of a circuit into a component is arbitrarily defined to have a positive sign, while power flowing into a circuit from a component is defined to have a negative sign. Thus passive components have positive power consumption, while power sources have negative power consumption.   This is called the passive sign convention.\n\n\nResistive circuits[edit]\n\nIn the case of resistive (Ohmic, or linear) loads, Joule's law can be combined with Ohm's law (V = I·R) to produce alternative expressions for the amount of power that is dissipated:\n\n\n\t\n  \n    \n      \n        P\n        =\n        I\n        V\n        =\n        \n          I\n          \n            2\n          \n        \n        R\n        =\n        \n          \n            \n              V\n              \n                2\n              \n            \n            R\n          \n        \n        ,\n      \n    \n    {\\displaystyle P=IV=I^{2}R={\\frac {V^{2}}{R}},}\n  \n\n\n\nwhere R is the electrical resistance.\n\n\nAlternating current[edit]\n\nMain article: AC power\n\nIn alternating current circuits, energy storage elements such as inductance and capacitance may result in periodic reversals of the direction of energy flow. The portion of power flow that, averaged over a complete cycle of the AC waveform, results in net transfer of energy in one direction is known as real power (also referred to as active power). That portion of power flow due to stored energy, that returns to the source in each cycle, is known as reactive power. The real power P in watts consumed by a device is given by\n\n\n\t\n  \n    \n      \n        P\n        =\n        \n          \n            1\n            2\n          \n        \n        \n          V\n          \n            p\n          \n        \n        \n          I\n          \n            p\n          \n        \n        cos\n        ⁡\n        θ\n        =\n        \n          V\n          \n            \n              r\n              m\n              s\n            \n          \n        \n        \n          I\n          \n            \n              r\n              m\n              s\n            \n          \n        \n        cos\n        ⁡\n        θ\n        \n      \n    \n    {\\displaystyle P={1 \\over 2}V_{p}I_{p}\\cos \\theta =V_{\\rm {rms}}I_{\\rm {rms}}\\cos \\theta \\,}\n  \n\n\n\nwhere\n\n\n\tVp is the peak voltage in volts\n\tIp is the peak current in amperes\n\tVrms is the root-mean-square voltage in volts\n\tIrms is the root-mean-square current in amperes\n\tθ is the phase angle between the current and voltage sine waves\n\n\n  \nPower triangle: The components of AC power\n\n\n\nThe relationship between real power, reactive power and apparent power can be expressed by representing the quantities as vectors. Real power is represented as a horizontal vector and reactive power is represented as a vertical vector. The apparent power vector is the hypotenuse of a right triangle formed by connecting the real and reactive power vectors. This representation is often called the power triangle. Using the Pythagorean Theorem, the relationship among real, reactive and apparent power is:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              (apparent power)\n            \n          \n          \n            2\n          \n        \n        =\n        \n          \n            \n              (real power)\n            \n          \n          \n            2\n          \n        \n        +\n        \n          \n            \n              (reactive power)\n            \n          \n          \n            2\n          \n        \n      \n    \n    {\\displaystyle {\\mbox{(apparent power)}}^{2}={\\mbox{(real power)}}^{2}+{\\mbox{(reactive power)}}^{2}}\n  \n\n\n\nReal and reactive powers can also be calculated directly from the apparent power, when the current and voltage are both sinusoids with a known phase angle θ between them:\n\n\n\t\n  \n    \n      \n        \n          \n            (real power)\n          \n        \n        =\n        \n          \n            (apparent power)\n          \n        \n        cos\n        ⁡\n        θ\n      \n    \n    {\\displaystyle {\\mbox{(real power)}}={\\mbox{(apparent power)}}\\cos \\theta }\n  \n\n\n\n\t\n  \n    \n      \n        \n          \n            (reactive power)\n          \n        \n        =\n        \n          \n            (apparent power)\n          \n        \n        sin\n        ⁡\n        θ\n      \n    \n    {\\displaystyle {\\mbox{(reactive power)}}={\\mbox{(apparent power)}}\\sin \\theta }\n  \n\n\n\nThe ratio of real power to apparent power is called power factor and is a number always between 0 and 1. Where the currents and voltages have non-sinusoidal forms, power factor is generalized to include the effects of distortion.\n\n\nElectromagnetic fields[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (November 2012) (Learn how and when to remove this template message)\n\n\n\nElectrical energy flows wherever electric and magnetic fields exist together and fluctuate in the same place. The simplest example of this is in electrical circuits, as the preceding section showed. In the general case, however, the simple equation P = IV must be replaced by a more complex calculation, the integral of the cross-product of the electrical and magnetic field vectors over a specified area, thus:\n\n\n\t\n  \n    \n      \n        P\n        =\n        \n          ∫\n          \n            S\n          \n        \n        (\n        \n          E\n        \n        ×\n        \n          H\n        \n        )\n        ⋅\n        \n          d\n          A\n        \n        .\n        \n      \n    \n    {\\displaystyle P=\\int _{S}(\\mathbf {E} \\times \\mathbf {H} )\\cdot \\mathbf {dA} .\\,}\n  \n\n\n\nThe result is a scalar since it is the surface integral of the Poynting vector.\n\n\nGeneration[edit]\n\nMain article: Electricity generation\n\nThe fundamental principles of much electricity generation were discovered during the 1820s and early 1830s by the British scientist Michael Faraday.  His basic method is still used today: electricity is generated by the movement of a loop of wire, or disc of copper between the poles of a magnet.\n\nFor electric utilities, it is the first process in the delivery of electricity to consumers. The other processes, electricity transmission, distribution, and electrical power storage and recovery using pumped-storage methods are normally carried out by the electric power industry.\n\nElectricity is mostly generated at a power station by electromechanical generators, driven by heat engines heated by combustion, geothermal power or nuclear fission. Other generators are driven by the kinetic energy of flowing water and wind. There are many other technologies that are used to generate electricity such as photovoltaic solar panels.\n\nA battery is a device consisting of one or more electrochemical cells that convert stored chemical energy into electrical energy.[2] Since the invention of the first battery (or \"voltaic pile\") in 1800 by Alessandro Volta and especially since the technically improved Daniell cell in 1836, batteries have become a common power source for many household and industrial applications. According to a 2005 estimate, the worldwide battery industry generates US$48 billion in sales each year,[3] with 6% annual growth. There are two types of batteries: primary batteries (disposable batteries), which are designed to be used once and discarded, and secondary batteries (rechargeable batteries), which are designed to be recharged and used multiple times. Batteries come in many sizes, from miniature cells used to power hearing aids and wristwatches to battery banks the size of rooms that provide standby power for telephone exchanges and computer data centers.\n\n\nElectric power industry[edit]\n\nMain article: Electric power industry\n\nThe electric power industry provides the production and delivery of power, in sufficient quantities to areas that need electricity, through a grid connection. The grid distributes electrical energy to customers. Electric power is generated by central power stations or by distributed generation. The electric power industry has gradually been trending towards deregulation - with emerging players offering consumers competition to the traditional public utility companies.[4]\n\n\nUse[edit]\n\nElectric power, produced from central generating stations and distributed over an electrical transmission grid, is widely used in industrial, commercial and consumer applications. The per capita electric power consumption of a country correlates with its industrial development. [5]  Electric motors power manufacturing machinery and propel subways and railway trains. Electric lighting is the most important form of artificial light. Electrical energy is used directly in processes such as extraction of aluminum from its ores and in production of steel in electric arc furnaces. Reliable electric power is essential to telecommunications and broadcasting. Electric power is used to provide air conditioning in hot climates, and in some places electric power is an economically competitive source of energy for building space heating. Use of electric power for pumping water ranges from individual household wells to irrigation projects and energy storage projects.\n\n\nSee also[edit]\n\n\n\tEnergy portal\n\n\n\n\tEGRID\n\tElectric energy consumption\n\tElectric power system\n\tHigh-voltage cable\n\tPower engineering\n\tRural electrification\n\n\nNotes[edit]\n\n\n\t^ \nSmith, Clare (2001). Environmental physics. London, United Kingdom: Routledge. ISBN 0-415-20191-8.\n\n\t^ \"battery\" (def. 4b), Merriam-Webster Online Dictionary (2009). Retrieved 25 May 2009.\n\n\t^ Power Shift: DFJ on the lookout for more power source investments Archived 2005-12-01 at the Wayback Machine. Draper Fisher Jurvetson. Retrieved 20 November 2005.\n\n\t^ The Opportunity of Energy Group-Buying EnPowered, April 18, 2016,\n\n\t^ Ignacio J. Pérez-Arriaga (ed), Regulation of the Power Sector, Springer Science & Business Media, 2014 \nISBN 1447150341, page 8 \n\n\n\n\n\nReferences[edit]\n\n\tReports on August 2003 Blackout, North American Electric Reliability Council website\n\tCroft, Terrell; Summers, Wilford I. (1987). American Electricians' Handbook (Eleventh ed.). New York: McGraw Hill. ISBN 0-07-013932-6.\n\n\tFink, Donald G.; Beaty, H. Wayne (1978). Standard Handbook for Electrical Engineers (Eleventh ed.). New York: McGraw Hill. ISBN 0-07-020974-X.\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Electricity.\n\n\n\tU.S. Department of Energy: Electric Power\n\tGlobTek, Inc. Glossary of Electric power Power Supply Terms\n\tPlatform of electric sector\n\n\n\t\tv\n\tt\n\te\n\n\nElectricity delivery\n\n\tConcepts\t\n\tAvailability factor\n\tAutomatic Generation Control\n\tBackfeeding\n\tBase load\n\tCapacity factor\n\tDemand factor\n\tDroop speed control\n\tEconomic dispatch\n\tElectric power\n\tDemand management\n\tEROEI\n\tFault\n\tHome energy storage\n\tGrid storage\n\tGrid code\n\tIntermittency\n\tLoad factor\n\tLoad following\n\tMerit order\n\tNameplate capacity\n\tPeak demand\n\tPower quality\n\tPower-flow study\n\tRepowering\n\tUtility frequency\n\tVariability\n\n\n\n\n\tSources\t\n\tNonrenewable\t\n\tCoal\n\tFossil fuel power station\n\tNatural gas\n\tPetroleum\n\tNuclear\n\tOil shale\n\n\n\n\n\tRenewable\t\n\tBiomass\n\tBiofuel\n\tGeothermal\n\tHydro\n\tMarine\n\tCurrent\n\tOsmotic\n\tThermal\n\tTidal\n\tWave\n\n\n\tSolar\n\tWind\n\n\n\n\n\n\n\n\tGeneration\t\n\tAC power\n\tCogeneration\n\tCombined cycle\n\tCooling tower\n\tInduction generator\n\tMicro CHP\n\tMicrogeneration\n\tRankine cycle\n\tThree-phase electric power\n\tVirtual power plant\n\n\n\n\n\tTransmission\nand distribution\n\t\n\tDemand response\n\tDistributed generation\n\tDynamic demand\n\tElectric power distribution\n\tElectrical busbar system\n\tElectric power system\n\tElectric power transmission\n\tElectrical grid\n\tElectrical interconnector\n\tHigh-voltage direct current\n\tHigh-voltage shore connection\n\tLoad management\n\tMains electricity by country\n\tPower line\n\tPower station\n\tPower storage\n\tPumped hydro\n\tSmart grid\n\tSubstation\n\tSuper grid\n\tTransformer\n\tTransmission system operator (TSO)\n\tTransmission tower\n\tUtility pole\n\n\n\n\n\tFailure modes\t\n\tBlackout (Rolling blackout)\n\tBrownout\n\tBlack start\n\tCascading failure\n\n\n\n\n\tProtective\ndevices\n\t\n\tArc-fault circuit interrupter\n\tEarth leakage circuit breaker\n\tResidual-current device (GFI)\n\tPower-system protection\n\tProtective relay\n\tDigital protective relay\n\tSulfur hexafluoride circuit breaker\n\n\n\n\n\tEconomics\nand policies\n\t\n\tCarbon offset\n\tCost of electricity by source\n\tEcotax\n\tEnergy subsidies\n\tFeed-in tariff\n\tFossil-fuel phase-out\n\tNet metering\n\tPigovian tax\n\tRenewable Energy Certificates\n\tRenewable energy payments\n\tRenewable energy policy\n\tSpark/Dark/Quark/Bark spread\n\n\n\n\n\tStatistics and Production\t\n\tList of electricity sectors\n\tElectric energy consumption\n\n\n\n\n\t\n\tCategories\n\tElectric power distribution\n\tElectricity economics\n\tPower station technology\n\tPortals\n\tEnergy\n\tRenewable energy\n\n\n\n\n\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4151723-4\n\tLCCN: sh85041875\n\tNARA: 10638903\n\tNDL: 00561409\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Electric_power&oldid=918811001\"\n\n\t\t\n\t\tCategories: \tElectric power\n\tElectromagnetism\n\n\nHidden categories: \tWebarchive template wayback links\n\tArticles with short description\n\tArticles needing additional references from November 2012\n\tAll articles needing additional references\n\tCommons category link is locally defined\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NARA identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tБългарски\n\tBoarisch\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tᐃᓄᒃᑎᑐᑦ/inuktitut\n\tItaliano\n\tעברית\n\tҚазақша\n\tKreyòl ayisyen\n\tKurdî\n\tLietuvių\n\tМакедонски\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNordfriisk\n\tNorsk\n\tNorsk nynorsk\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tSeeltersk\n\tසිංහල\n\tSimple English\n\tSlovenčina\n\tСрпски / srpski\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 30 September 2019, at 11:57 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "16", "dc:title": "Electric power - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/NIGU_Strain_tower.JPG/1200px-NIGU_Strain_tower.JPG", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-electric_power", "title": "Electric power - Wikipedia"}}