{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nElectrical resistance and conductance - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tElectrical resistance and conductance\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Electrical resistance)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about specific applications of conductivity and resistivity in electrical elements. For other types of conductivity, see Conductivity. For electrical conductivity in general, see Electrical resistivity and conductivity.\n\n\"Resistive\" redirects here. For the term used when referring to touchscreens, see resistive touchscreen.\n\n\tPart of a series of articles about\n\tElectromagnetism\n\t\n\t\n\tElectricity\n\tMagnetism\n\n\n\t\nElectrostatics\n\n\tConductor\n\tCoulomb's law\n\tElectric charge\n\tElectric dipole moment\n\tElectric field\n\tElectric flux / potential energy\n\tElectrostatic discharge\n\tGauss's law\n\tInduction\n\tInsulator\n\tPolarization density\n\tStatic electricity\n\tTriboelectricity\n\n\n\n\n\t\nMagnetostatics\n\n\tAmpère's law\n\tBiot–Savart law\n\tGauss's law for magnetism\n\tMagnetic field\n\tMagnetic flux\n\tMagnetic dipole moment\n\tMagnetization\n\tMagnetomotive force\n\n\n\n\n\t\nElectrodynamics\n\n\tLorentz force law\n\tElectromagnetic induction\n\tFaraday's law\n\tLenz's law\n\tDisplacement current\n\tMagnetic potential\n\tMaxwell's equations\n\tElectromagnetic field\n\tElectromagnetic pulse\n\tElectromagnetic radiation\n\tMaxwell tensor\n\tPoynting vector\n\tLiénard–Wiechert potential\n\tJefimenko's equations\n\tEddy current\n\tLondon equations\n\n\n\tMathematical descriptions of the electromagnetic field\n\n\n\n\n\n\t\nElectrical network\n\n\tAlternating current\n\tCapacitance\n\tDirect current\n\tElectric current\n\tElectric potential\n\tElectromotive force\n\tImpedance\n\tInductance\n\tOhm's law\n\tParallel circuit\n\tResistance\n\tResonant cavities\n\tSeries circuit\n\tVoltage\n\tWaveguides\n\n\n\n\n\t\nCovariant formulation\n\n\tElectromagnetic tensor\n(stress–energy tensor)\n\n\n\n\tFour-current\n\tElectromagnetic four-potential\n\n\n\n\n\t\nScientists\n\n\tAmpère\n\tBiot\n\tCoulomb\n\tFaraday\n\tGauss\n\tHeaviside\n\tHenry\n\tHertz\n\tLenz\n\tLorentz\n\tMaxwell\n\tØrsted\n\tSavart\n\tTesla\n\tVolta\n\tWeber\n\t\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nThe electrical resistance of an object is a measure of its opposition to the flow of electric current. The inverse quantity is electrical conductance, and is the ease with which an electric current passes.  Electrical resistance shares some conceptual parallels with the notion of mechanical friction. The SI unit of electrical resistance is the ohm (Ω), while electrical conductance is measured in siemens (S).\n\nThe resistance of an object depends in large part on the material it is made of—objects made of electrical insulators like rubber tend to have very high resistance and low conductivity, while objects made of electrical conductors like metals tend to have very low resistance and high conductivity. This material dependence is quantified by resistivity or conductivity. However, resistance and conductance are extensive rather than bulk properties, meaning that they also depend on the size and shape of an object. For example, a wire's resistance is higher if it is long and thin, and lower if it is short and thick. All objects show some resistance, except for superconductors, which have a resistance of zero.\n\nThe resistance (R) of an object is defined as the ratio of voltage across it (V) to current through it (I), while the conductance (G) is the inverse:\n\n\n\t\n  \n    \n      \n        R\n        =\n        \n          \n            V\n            I\n          \n        \n        ,\n        \n        G\n        =\n        \n          \n            I\n            V\n          \n        \n        =\n        \n          \n            1\n            R\n          \n        \n      \n    \n    {\\displaystyle R={V \\over I},\\qquad G={I \\over V}={\\frac {1}{R}}}\n  \n\n\n\nFor a wide variety of materials and conditions, V and I are directly proportional to each other, and therefore R and G are constants (although they will depend on the size and shape of the object, the material it is made of, and other factors like temperature or strain). This proportionality is called Ohm's law, and materials that satisfy it are called ohmic materials.\n\nIn other cases, such as a transformer, diode or battery, V and I are not directly proportional. The ratio V over I is sometimes still useful, and is referred to as a \"chordal resistance\" or \"static resistance\",[1][2] since it corresponds to the inverse slope of a chord between the origin and an I–V curve. In other situations, the derivative \n  \n    \n      \n        \n          \n            \n              d\n              V\n            \n            \n              d\n              I\n            \n          \n        \n        \n        \n      \n    \n    {\\displaystyle {\\frac {dV}{dI}}\\,\\!}\n  \n may be most useful; this is called the \"differential resistance\".\n\n\nContents\n\n\n\t1 Introduction\n\t2 Conductors and resistors\n\t3 Ohm's law\n\t4 Relation to resistivity and conductivity\n\t5 Measuring resistance\n\t6 Typical resistances\n\t7 Static and differential resistance\n\t8 AC circuits\n\t8.1 Impedance and admittance\n\t8.2 Frequency dependence of resistance\n\n\n\n\t9 Energy dissipation and Joule heating\n\t10 Dependence of resistance on other conditions\n\t10.1 Temperature dependence\n\t10.2 Strain dependence\n\t10.3 Light illumination dependence\n\n\n\n\t11 Superconductivity\n\t12 See also\n\t13 References\n\t14 External links\n\n\n\n\n\nIntroduction[edit]\n\n  \nThe hydraulic analogy compares electric current flowing through circuits to water flowing through pipes. When a pipe (left) is filled with hair (right), it takes a larger pressure to achieve the same flow of water. Pushing electric current through a large resistance is like pushing water through a pipe clogged with hair: It requires a larger push (electromotive force) to drive the same flow (electric current).\n\n\n\nIn the hydraulic analogy, current flowing through a wire (or resistor) is like water flowing through a pipe, and the voltage drop across the wire is like the pressure drop that pushes water through the pipe. Conductance is proportional to how much flow occurs for a given pressure, and resistance is proportional to how much pressure is required to achieve a given flow. (Conductance and resistance are reciprocals.)\n\nThe voltage drop (i.e., difference between voltages on one side of the resistor and the other), not the voltage itself, provides the driving force pushing current through a resistor. In hydraulics, it is similar: The pressure difference between two sides of a pipe, not the pressure itself, determines the flow through it. For example, there may be a large water pressure above the pipe, which tries to push water down through the pipe. But there may be an equally large water pressure below the pipe, which tries to push water back up through the pipe. If these pressures are equal, no water flows. (In the image at right, the water pressure below the pipe is zero.)\n\nThe resistance and conductance of a wire, resistor, or other element is mostly determined by two properties:\n\n\n\tgeometry (shape), and\n\tmaterial\n\n\nGeometry is important because it is more difficult to push water through a long, narrow pipe than a wide, short pipe. In the same way, a long, thin copper wire has higher resistance (lower conductance) than a short, thick copper wire.\n\nMaterials are important as well. A pipe filled with hair restricts the flow of water more than a clean pipe of the same shape and size. Similarly, electrons can flow freely and easily through a copper wire, but cannot flow as easily through a steel wire of the same shape and size, and they essentially cannot flow at all through an insulator like rubber, regardless of its shape. The difference between copper, steel, and rubber is related to their microscopic structure and electron configuration, and is quantified by a property called resistivity.\n\nIn addition to geometry and material, there are various other factors that influence resistance and conductance, such as temperature; see below.\n\n\nConductors and resistors[edit]\n\n  \nA 65 Ω resistor, as identified by its electronic color code (blue–green–black-gold-red).  An ohmmeter could be used to verify this value.\n\n\n\nSubstances in which electricity can flow are called conductors. A piece of conducting material of a particular resistance meant for use in a circuit is called a resistor. Conductors are made of high-conductivity materials such as metals, in particular copper and aluminium. Resistors, on the other hand, are made of a wide variety of materials depending on factors such as the desired resistance, amount of energy that it needs to dissipate, precision, and costs.\n\n\nOhm's law[edit]\n\nMain article: Ohm's law\n\n  \nThe current-voltage characteristics of four devices: Two resistors, a diode, and a battery. The horizontal axis is voltage drop, the vertical axis is current. Ohm's law is satisfied when the graph is a straight line through the origin. Therefore, the two resistors are ohmic, but the diode and battery are not.\n\n\n\nFor many materials, the current I through the material is proportional to the voltage V applied across it:\n\n\n\t\n  \n    \n      \n        I\n        ∝\n        V\n      \n    \n    {\\displaystyle I\\propto V}\n  \n\n\n\nover a wide range of voltages and currents.  Therefore, the resistance and conductance of objects or electronic components made of these materials is constant. This relationship is called Ohm's law, and materials which obey it are called ohmic materials.  Examples of ohmic components are wires and resistors. The current-voltage (IV) graph of an ohmic device consists of a straight line through the origin with positive slope.\n\nOther components and materials used in electronics do not obey Ohm's law; the current is not proportional to the voltage, so the resistance varies with the voltage and current through them.  These are called nonlinear or nonohmic. Examples include diodes and fluorescent lamps.  The IV curve of a nonohmic device is a curved line.\n\n\nRelation to resistivity and conductivity[edit]\n\nMain article: Electrical resistivity and conductivity\n\n  \nA piece of resistive material with electrical contacts on both ends.\n\n\n\nThe resistance of a given object depends primarily on two factors: What material it is made of, and its shape. For a given material, the resistance is inversely proportional to the cross-sectional area; for example, a thick copper wire has lower resistance than an otherwise-identical thin copper wire. Also, for a given material, the resistance is proportional to the length; for example, a long copper wire has higher resistance than an otherwise-identical short copper wire. The resistance R and conductance G of a conductor of uniform cross section, therefore, can be computed as\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                R\n              \n              \n                \n                =\n                ρ\n                \n                  \n                    ℓ\n                    A\n                  \n                \n                ,\n              \n            \n            \n              \n                G\n              \n              \n                \n                =\n                σ\n                \n                  \n                    A\n                    ℓ\n                  \n                \n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}R&=\\rho {\\frac {\\ell }{A}},\\\\[5pt]G&=\\sigma {\\frac {A}{\\ell }}.\\end{aligned}}}\n  \n\n\n\nwhere \n  \n    \n      \n        ℓ\n      \n    \n    {\\displaystyle \\ell }\n  \n is the length of the conductor, measured in metres (m), A is the cross-sectional area of the conductor measured in square metres (m²), σ (sigma) is the electrical conductivity measured in siemens per meter (S·m−1), and ρ (rho) is the electrical resistivity (also called specific electrical resistance) of the material, measured in ohm-metres (Ω·m). The resistivity and conductivity are proportionality constants, and therefore depend only on the material the wire is made of, not the geometry of the wire. Resistivity and conductivity are reciprocals: \n  \n    \n      \n        ρ\n        =\n        1\n        \n          /\n        \n        σ\n      \n    \n    {\\displaystyle \\rho =1/\\sigma }\n  \n. Resistivity is a measure of the material's ability to oppose electric current.\n\nThis formula is not exact, as it assumes the current density is totally uniform in the conductor, which is not always true in practical situations. However, this formula still provides a good approximation for long thin conductors such as wires.\n\nAnother situation for which this formula is not exact is with alternating current (AC), because the skin effect inhibits current flow near the center of the conductor. For this reason, the geometrical cross-section is different from the effective cross-section in which current actually flows, so resistance is higher than expected. Similarly, if two conductors near each other carry AC current, their resistances increase due to the proximity effect. At commercial power frequency, these effects are significant for large conductors carrying large currents, such as busbars in an electrical substation,[3] or large power cables carrying more than a few hundred amperes.\n\nThe resistivity of different materials varies by an enormous amount: For example, the conductivity of teflon is about 1030 times lower than the conductivity of copper. Why is there such a difference? Loosely speaking, a metal has large numbers of \"delocalized\" electrons that are not stuck in any one place, but free to move across large distances, whereas in an insulator (like teflon), each electron is tightly bound to a single molecule, and a great force is required to pull it away. Semiconductors lie between these two extremes. More details can be found in the article: Electrical resistivity and conductivity. For the case of electrolyte solutions, see the article: Conductivity (electrolytic).\n\nResistivity varies with temperature. In semiconductors, resistivity also changes when exposed to light. See below.\n\n\nMeasuring resistance[edit]\n\nMain article: Ohmmeter\n\nAn instrument for measuring resistance is called an ohmmeter.  Simple ohmmeters cannot measure low resistances accurately because the resistance of their measuring leads causes a voltage drop that interferes with the measurement, so more accurate devices use four-terminal sensing.\n\n\nTypical resistances[edit]\n\nSee also: Electrical resistivities of the elements (data page) and Electrical resistivity and conductivity\n\n\tComponent\n\tResistance (Ω)\n\n\t1 meter of copper wire with 1 mm diameter\n\t0.02[4]\n\n\t1 km overhead power line (typical)\n\t0.03[5]\n\n\tAA battery (typical internal resistance)\n\t0.1[6]\n\n\tIncandescent light bulb filament (typical)\n\t200–1000[7]\n\n\tHuman body\n\t1000 to 100,000[8]\n\n\n\nStatic and differential resistance[edit]\n\nSee also: Small-signal model\n\n\nThe IV curve of a non-ohmic device (purple).  The static resistance at point A is the inverse slope of line B through the origin. The differential resistance at A is the inverse slope of tangent line C.\n\n\nThe IV curve of a component with negative differential resistance, an unusual phenomenon where the IV curve is non-monotonic.\n\n\n\n\n\nMany electrical elements, such as diodes and batteries do not satisfy Ohm's law. These are called non-ohmic or non-linear, and their I–V curves are not straight lines through the origin.\n\nResistance and conductance can still be defined for non-ohmic elements.  However, unlike ohmic resistance, non-linear resistance is not constant but varies with the voltage or current through the device; i.e., its operating point.  There are two types of resistance:[1][2]\n\n\n\tStatic resistance (also called chordal or DC resistance) – This corresponds to the usual definition of resistance; the voltage divided by the current\n\n\n\t\t\n  \n    \n      \n        \n          R\n          \n            \n              s\n              t\n              a\n              t\n              i\n              c\n            \n          \n        \n        =\n        \n          \n            V\n            I\n          \n        \n        \n      \n    \n    {\\displaystyle R_{\\mathrm {static} }={\\frac {V}{I}}\\,}\n  \n.\n\n\n\tIt is the slope of the line (chord) from the origin through the point on the curve.  Static resistance determines the power dissipation in an electrical component.  Points on the IV curve located in the 2nd or 4th quadrants, for which the slope of the chordal line is negative, have negative static resistance. Passive devices, which have no source of energy, cannot have negative static resistance.  However active devices such as transistors or op-amps can synthesize negative static resistance with feedback, and it is used in some circuits such as gyrators.\n\n\n\tDifferential resistance (also called dynamic, incremental or small signal resistance) – Differential resistance is the derivative of the voltage with respect to the current; the slope of the IV curve at a point\n\n\n\t\t\n  \n    \n      \n        \n          R\n          \n            \n              d\n              i\n              f\n              f\n            \n          \n        \n        =\n        \n          \n            \n              d\n              V\n            \n            \n              d\n              I\n            \n          \n        \n        \n      \n    \n    {\\displaystyle R_{\\mathrm {diff} }={\\frac {dV}{dI}}\\,}\n  \n.\n\n\n\tIf the IV curve is nonmonotonic (with peaks and troughs), the curve has a negative slope in some regions—so in these regions the device has negative differential resistance.  Devices with negative differential resistance can amplify a signal applied to them, and are used to make amplifiers and oscillators.  These include tunnel diodes, Gunn diodes, IMPATT diodes, magnetron tubes, and unijunction transistors.\n\n\nAC circuits[edit]\n\nImpedance and admittance[edit]\n\nMain articles: Electrical impedance and Admittance\n\n  \nThe voltage (red) and current (blue) versus time (horizontal axis) for a capacitor (top) and inductor (bottom). Since the amplitude of the current and voltage sinusoids are the same, the absolute value of impedance is 1 for both the capacitor and the inductor (in whatever units the graph is using). On the other hand, the phase difference between current and voltage is −90° for the capacitor; therefore, the complex phase of the impedance of the capacitor is −90°. Similarly, the phase difference between current and voltage is +90° for the inductor; therefore, the complex phase of the impedance of the inductor is +90°.\n\n\n\nWhen an alternating current flows through a circuit, the relation between current and voltage across a circuit element is characterized not only by the ratio of their magnitudes, but also the difference in their phases. For example, in an ideal resistor, the moment when the voltage reaches its maximum, the current also reaches its maximum (current and voltage are oscillating in phase). But for a capacitor or inductor, the maximum current flow occurs as the voltage passes through zero and vice versa (current and voltage are oscillating 90° out of phase, see image at right). Complex numbers are used to keep track of both the phase and magnitude of current and voltage:\n\n\n\t\n  \n    \n      \n        V\n        (\n        t\n        )\n        =\n        \n          Re\n        \n        (\n        \n          V\n          \n            0\n          \n        \n        \n          e\n          \n            j\n            ω\n            t\n          \n        \n        )\n        ,\n        \n        I\n        (\n        t\n        )\n        =\n        \n          Re\n        \n        (\n        \n          I\n          \n            0\n          \n        \n        \n          e\n          \n            j\n            ω\n            t\n          \n        \n        )\n        ,\n        \n        Z\n        =\n        \n          \n            \n              V\n              \n                0\n              \n            \n            \n              I\n              \n                0\n              \n            \n          \n        \n        ,\n        \n        Y\n        =\n        \n          \n            \n              I\n              \n                0\n              \n            \n            \n              V\n              \n                0\n              \n            \n          \n        \n      \n    \n    {\\displaystyle V(t)={\\text{Re}}(V_{0}e^{j\\omega t}),\\quad I(t)={\\text{Re}}(I_{0}e^{j\\omega t}),\\quad Z={\\frac {V_{0}}{I_{0}}},\\quad Y={\\frac {I_{0}}{V_{0}}}}\n  \n\n\n\nwhere:\n\n\n\tt is time,\n\tV(t) and I(t) are, respectively, voltage and current as a function of time,\n\tV0, I0, Z, and Y are complex numbers,\n\tZ is called impedance,\n\tY is called admittance,\n\tRe indicates real part,\n\t\n  \n    \n      \n        ω\n      \n    \n    {\\displaystyle \\omega }\n  \n is the angular frequency of the AC current,\n\t\n  \n    \n      \n        j\n        =\n        \n          \n            −\n            1\n          \n        \n      \n    \n    {\\displaystyle j={\\sqrt {-1}}}\n  \n is the imaginary unit.\n\n\nThe impedance and admittance may be expressed as complex numbers that can be broken into real and imaginary parts:\n\n\n\t\n  \n    \n      \n        Z\n        =\n        R\n        +\n        j\n        X\n        ,\n        \n        Y\n        =\n        G\n        +\n        j\n        B\n      \n    \n    {\\displaystyle Z=R+jX,\\quad Y=G+jB}\n  \n\n\n\nwhere R and G are resistance and conductance respectively, X is reactance, and B is susceptance. For ideal resistors, Z and Y reduce to R and G respectively, but for AC networks containing capacitors and inductors, X and B are nonzero.\n\n\n  \n    \n      \n        Z\n        =\n        1\n        \n          /\n        \n        Y\n      \n    \n    {\\displaystyle Z=1/Y}\n  \n for AC circuits, just as \n  \n    \n      \n        R\n        =\n        1\n        \n          /\n        \n        G\n      \n    \n    {\\displaystyle R=1/G}\n  \n for DC circuits.\n\n\nFrequency dependence of resistance[edit]\n\nA key feature of AC circuits is that the resistance and conductance can be frequency-dependent, a phenomenon known as the universal dielectric response [9]. One reason, mentioned above is the skin effect (and the related proximity effect). Another reason is that the resistivity itself may depend on frequency (see Drude model, deep-level traps, resonant frequency, Kramers–Kronig relations, etc.)\n\n\nEnergy dissipation and Joule heating[edit]\n\nMain article: Joule heating\n\n  \nRunning current through a material with high resistance creates heat, in a phenomenon called Joule heating. In this picture, a cartridge heater, warmed by Joule heating, is glowing red hot.\n\n\n\nResistors (and other elements with resistance) oppose the flow of electric current; therefore, electrical energy is required to push current through the resistance. This electrical energy is dissipated, heating the resistor in the process. This is called Joule heating (after James Prescott Joule), also called ohmic heating or resistive heating.\n\nThe dissipation of electrical energy is often undesired, particularly in the case of transmission losses in power lines. High voltage transmission helps reduce the losses by reducing the current for a given power.\n\nOn the other hand, Joule heating is sometimes useful, for example in electric stoves and other electric heaters (also called resistive heaters). As another example, incandescent lamps rely on Joule heating: the filament is heated to such a high temperature that it glows \"white hot\" with thermal radiation (also called incandescence).\n\nThe formula for Joule heating is:\n\n\n\t\n  \n    \n      \n        P\n        =\n        \n          I\n          \n            2\n          \n        \n        R\n      \n    \n    {\\displaystyle P=I^{2}R}\n  \n\n\n\nwhere P is the power (energy per unit time) converted from electrical energy to thermal energy, R is the resistance, and I is the current through the resistor.\n\n\nDependence of resistance on other conditions[edit]\n\nTemperature dependence[edit]\n\nMain article: Electrical resistivity and conductivity § Temperature dependence\n\nNear room temperature, the resistivity of metals typically increases as temperature is increased, while the resistivity of semiconductors typically decreases as temperature is increased. The resistivity of insulators and electrolytes may increase or decrease depending on the system. For the detailed behavior and explanation, see Electrical resistivity and conductivity.\n\nAs a consequence, the resistance of wires, resistors, and other components often change with temperature. This effect may be undesired, causing an electronic circuit to malfunction at extreme temperatures. In some cases, however, the effect is put to good use. When temperature-dependent resistance of a component is used purposefully, the component is called a resistance thermometer or thermistor. (A resistance thermometer is made of metal, usually platinum, while a thermistor is made of ceramic or polymer.)\n\nResistance thermometers and thermistors are generally used in two ways. First, they can be used as thermometers: By measuring the resistance, the temperature of the environment can be inferred. Second, they can be used in conjunction with Joule heating (also called self-heating): If a large current is running through the resistor, the resistor's temperature rises and therefore its resistance changes. Therefore, these components can be used in a circuit-protection role similar to fuses, or for feedback in circuits, or for many other purposes. In general, self-heating can turn a resistor into a nonlinear and hysteretic circuit element. For more details see Thermistor#Self-heating effects.\n\nIf the temperature T does not vary too much, a linear approximation is typically used:\n\n\n\t\n  \n    \n      \n        R\n        (\n        T\n        )\n        =\n        \n          R\n          \n            0\n          \n        \n        [\n        1\n        +\n        α\n        (\n        T\n        −\n        \n          T\n          \n            0\n          \n        \n        )\n        ]\n      \n    \n    {\\displaystyle R(T)=R_{0}[1+\\alpha (T-T_{0})]}\n  \n\n\n\nwhere \n  \n    \n      \n        α\n      \n    \n    {\\displaystyle \\alpha }\n  \n is called the temperature coefficient of resistance, \n  \n    \n      \n        \n          T\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle T_{0}}\n  \n is a fixed reference temperature (usually room temperature), and \n  \n    \n      \n        \n          R\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle R_{0}}\n  \n is the resistance at temperature \n  \n    \n      \n        \n          T\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle T_{0}}\n  \n. The parameter \n  \n    \n      \n        α\n      \n    \n    {\\displaystyle \\alpha }\n  \n is an empirical parameter fitted from measurement data. Because the linear approximation is only an approximation, \n  \n    \n      \n        α\n      \n    \n    {\\displaystyle \\alpha }\n  \n is different for different reference temperatures. For this reason it is usual to specify the temperature that \n  \n    \n      \n        α\n      \n    \n    {\\displaystyle \\alpha }\n  \n was measured at with a suffix, such as \n  \n    \n      \n        \n          α\n          \n            15\n          \n        \n      \n    \n    {\\displaystyle \\alpha _{15}}\n  \n, and the relationship only holds in a range of temperatures around the reference.[10]\n\nThe temperature coefficient \n  \n    \n      \n        α\n      \n    \n    {\\displaystyle \\alpha }\n  \n is typically +3×10−3 K−1 to +6×10−3 K−1 for metals near room temperature. It is usually negative for semiconductors and insulators, with highly variable magnitude.[11]\n\n\nStrain dependence[edit]\n\nMain article: Strain gauge\n\nJust as the resistance of a conductor depends upon temperature, the resistance of a conductor depends upon strain. By placing a conductor under tension (a form of stress that leads to strain in the form of stretching of the conductor), the length of the section of conductor under tension increases and its cross-sectional area decreases. Both these effects contribute to increasing the resistance of the strained section of conductor. Under compression (strain in the opposite direction), the resistance of the strained section of conductor decreases. See the discussion on strain gauges for details about devices constructed to take advantage of this effect.\n\n\nLight illumination dependence[edit]\n\nMain articles: Photoresistor and Photoconductivity\n\nSome resistors, particularly those made from semiconductors, exhibit photoconductivity, meaning that their resistance changes when light is shining on them. Therefore, they are called photoresistors (or light dependent resistors). These are a common type of light detector.\n\n\nSuperconductivity[edit]\n\nMain article: Superconductivity\n\nSuperconductors are materials that have exactly zero resistance and infinite conductance, because they can have V=0 and I≠0. This also means there is no joule heating, or in other words no dissipation of electrical energy. Therefore, if superconductive wire is made into a closed loop, current flows around the loop forever. Superconductors require cooling to temperatures near 4 K with liquid helium for most metallic superconductors like niobium–tin alloys, or cooling to temperatures near 77K with liquid nitrogen for the expensive, brittle and delicate ceramic high temperature superconductors.\nNevertheless, there are many technological applications of superconductivity, including superconducting magnets.\n\n\nSee also[edit]\n\n\n\tElectronics portal\n\n\n\n\tConductance quantum and its reciprocal, the Von Klitzing constant (under Von Klitzing)\n\tElectrical measurements\n\tContact resistance\n\tElectrical resistivity and conductivity for more information about the physical mechanisms for conduction in materials.\n\tJohnson–Nyquist noise\n\tQuantum Hall effect, a standard for high-accuracy resistance measurements.\n\tResistor\n\tRKM code\n\tSeries and parallel circuits\n\tSheet resistance\n\tSI electromagnetism units\n\tThermal resistance\n\tVoltage divider\n\tVoltage drop\n\n\nReferences[edit]\n\n\n\t^ a b Forbes T. Brown (2006). Engineering System Dynamics. CRC Press. p. 43. ISBN 978-0-8493-9648-9.\n\n\t^ a b Kenneth L. Kaiser (2004). Electromagnetic Compatibility Handbook. CRC Press. pp. 13–52. ISBN 978-0-8493-2087-3.\n\n\n\t^ Fink and Beaty, Standard Handbook for Electrical Engineers 11th Edition, page 17-19\n\n\t^ The resistivity of copper is about 1.7×10−8 Ωm. See [1].\n\n\t^ John D. McDonald (2016). Electric Power Substations Engineering, Second Edition. CRC Press. pp. 363–. ISBN 978-1-4200-0731-2.\n\n\n\t^ [2] For a fresh Energizer E91 AA alkaline battery, the internal resistance varies from 0.9 Ω at -40 °C, to 0.1 Ω at +40 °C.\n\n\t^ A 60 W light bulb in the USA (120 V mains electricity) draws RMS current 60 W/120 V=500 mA, so its resistance is 120 V/500 mA=240 Ω. The resistance of a 60 W light bulb in Europe (230 V mains) is 900 Ω. The resistance of a filament is temperature-dependent; these values are for when the filament is already heated up and the light is already glowing.\n\n\t^ 100,000 Ω for dry skin contact, 1000 Ω for wet or broken skin contact. High voltage breaks down the skin, lowering resistance to 500 Ω. Other factors and conditions are relevant as well. For more details, see the electric shock article, and: \"Publication No. 98-131: Worker Deaths by Electrocution\" (PDF). National Institute for Occupational Safety and Health. Retrieved 2014-11-02.\n\n\n\t^ Zhai, Chongpu; Gan, Yixiang; Hanaor, Dorian; Proust, Gwénaëlle (2018). \"Stress-dependent electrical transport and its universal scaling in granular materials\". Extreme Mechanics Letters. 22: 83–88. arXiv:1712.05938. doi:10.1016/j.eml.2018.05.005.\n\n\n\t^ Ward, MR, Electrical Engineering Science, pp36–40, McGraw-Hill, 1971.\n\n\t^ See Electrical resistivity and conductivity for a table. The temperature coefficient of resistivity is similar but not identical to the temperature coefficient of resistance. The small difference is due to thermal expansion changing the dimensions of the resistor.\n\n\n\n\n\nExternal links[edit]\n\n\tClemson Vehicular Electronics Laboratory: Resistance Calculator\n\tElectron Conductance Models Using Maximal Entropy Random Walks Wolfram Demonstrantions Project\n\n\n\tAuthority control \t\n\tBNF: cb119825351 (data)\n\tGND: 4128466-5\n\tLCCN: sh85041986\n\tNDL: 00561371\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Electrical_resistance_and_conductance&oldid=914341793\"\n\n\t\t\n\t\tCategories: \tElectrical resistance and conductance\n\tElectricity\n\tPhysical quantities\n\tElectromagnetism\n\n\nHidden categories: \tWikipedia articles with BNF identifiers\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tአማርኛ\n\tالعربية\n\tAzərbaycanca\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBoarisch\n\tBosanski\n\tCatalà\n\tČeština\n\tChiShona\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tҚазақша\n\tKiswahili\n\tKreyòl ayisyen\n\tКыргызча\n\tLatina\n\tLatviešu\n\tLietuvių\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tBahasa Melayu\n\tМонгол\n\tNederlands\n\t日本語\n\tNordfriisk\n\tNorsk\n\tNorsk nynorsk\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tPlattdüütsch\n\tPolski\n\tPortuguês\n\tRomână\n\tRuna Simi\n\tРусский\n\tScots\n\tSeeltersk\n\tShqip\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tТатарча/tatarça\n\tతెలుగు\n\tไทย\n\tTürkçe\n\tTürkmençe\n\tУкраїнська\n\tاردو\n\tئۇيغۇرچە / Uyghurche\n\tTiếng Việt\n\t文言\n\tWolof\n\t吴语\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 6 September 2019, at 19:46 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "6", "dc:title": "Electrical resistance and conductance - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/VFPt_Solenoid_correct2.svg/1200px-VFPt_Solenoid_correct2.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-electrical_resistance", "title": "Electrical resistance and conductance - Wikipedia"}}