{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nElectric heating - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tElectric heating\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Electric heater)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\n\n\n  \n30 kW resistance heating coils\n\n\n\nElectric heating is a process in which electrical energy is converted to heat energy. Common applications include space heating, cooking, water heating and industrial processes. An electric heater is an electrical device that converts an electric current into heat.[1] The heating element inside every electric heater is an electrical resistor, and works on the principle of Joule heating: an electric current passing through a resistor will convert that electrical energy into heat energy. Most modern electric heating devices use nichrome wire as the active element; the heating element, depicted on the right,  uses nichrome wire supported by ceramic insulators. \n\nAlternatively, a heat pump uses an electric motor to drive a refrigeration cycle, that draws heat energy from a source such as the ground or outside air and directs that heat into the space to be warmed. Some systems can be reversed so that the interior space is cooled and the warm air is discharged outside or into the ground.\n\n\nContents\n\n\n\t1 Space heating\n\t1.1 Radiant heaters\n\t1.2 Convection heaters\n\t1.3 Fan heaters\n\t1.4 Storage heating\n\t1.5 Domestic electrical underfloor heating\n\t1.6 Lighting system\n\t1.7 Heat pumps\n\n\n\n\t2 Liquid heating\n\t2.1 Immersion heater\n\t2.2 Circulation heaters\n\t2.3 Electrode heater\n\n\n\n\t3 Environmental and efficiency aspects\n\t4 Economic aspects\n\t5 Industrial electric heating\n\t6 See also\n\t7 References\n\n\n\n\n\nSpace heating[edit]\n\nSpace heating is used to warm the interiors of buildings. Space heaters are useful in places where air-handling is difficult, such as in laboratories. Several methods of electric space heating are used.\n\n\nRadiant heaters[edit]\n\n  \nAn electric radiative space heater\n\n\n\nElectric radiant heating  uses heating elements that reach a high temperature. The element is usually packaged inside a glass envelope resembling a light bulb and with a reflector to direct the energy output away from the body of the heater. The element emits infrared radiation that travels through air or space until it hits an absorbing surface, where it is partially converted to heat and partially reflected. This heat directly warms people and objects in the room, rather than warming the air. This style of heater is particularly useful in areas through which unheated air flows. They are also ideal for basements and garages where spot heating is desired. More generally, they are an excellent choice for task-specific heating.\n\nRadiant heaters operate silently and present the greatest potential danger of ignition of nearby furnishings due to the focused intensity of their output and lack of overheat protection. In the United Kingdom, these appliances are sometimes called electric fires, because they were originally used to replace open fires.\n\nThe active medium of the heater depicted in this section is a coil of nichrome resistance wire inside a fused silica tube, open to the atmosphere at the ends, although models exist where the fused silica is sealed at the ends and the resistance alloy is not nichrome.\n\n\nConvection heaters[edit]\n\nMain article: Convection heater\n\nIn a convection heater, the heating element heats the air in contact with it by thermal conduction. Hot air is less dense than cool air, so it rises due to buoyancy, allowing more cool air to flow in to take its place. This sets up a convection current of hot air that rises from the heater, heats up the surrounding space, cools and then repeats the cycle. These heaters are sometimes filled with oil. They are ideally suited for heating a closed space. They operate silently and have a lower risk of ignition hazard if they make unintended contact with furnishings compared to radiant electric heaters.\n\n\nFan heaters[edit]\n\nMain article: Fan heater\n\nA fan heater, also called a forced convection heater, is a kind of convection heater that includes an electric fan to speed up the airflow. They operate with considerable noise caused by the fan. They have a moderate risk of ignition hazard if they make unintended contact with furnishings. Their advantage is that they are more compact than heaters that use natural convection and are also cost-efficient for portable and small room heating systems.[2]\n\n\nStorage heating[edit]\n\nMain article: Storage heater\n\nA storage heating system takes advantage of cheaper electricity prices, sold during low demand periods such as overnight. In the United Kingdom, this is branded as Economy 7. The storage heater stores heat in clay bricks, then releases it during the day when required. Newer storage heaters are able to be used with various tariffs. Whilst they can still be used with economy 7, they can be used with day-time tariffs. This is due to the modern design features that are added during manufacturing. Alongside new designs the use of a thermostat or sensor has improved the efficiency of the storage heater. A thermostat or sensor is able to read the temperature of the room, and change the output of the heater accordingly.\n\nWater can also be used as a heat-storage medium.\n\n\nDomestic electrical underfloor heating[edit]\n\nMain article: Underfloor heating\n\nAn electric underfloor heating system has heating cables embedded in the floor. Current flows through a conductive heating material, supplied either directly from the line voltage (120 or 240 volts) or at low voltage from a transformer. The heated cables warm the flooring by direct conduction and will switch off once it reaches the temperature set by the floor thermostat. A warmer floor surface radiates heat to colder surrounding surfaces (ceiling, walls, furniture.) which absorb heat and reflects all non absorbed heat to yet other still cooler surfaces. The cycle of radiation, absorption and reflection starts slowly and slows down slowly nearing set point temperatures and ceases to take place once equilibrium is reached all-round. A floor thermostat or a room thermostat or combination controls the floor on/off. In the process of radiant heating a thin layer of air which is in touch with the warmed surfaces also absorbs some heat and this creates a little convection (air circulation). Contrary to belief people are not heated by this warmed circulating air or convection (convection has a cooling effect) but are heated by the direct radiation of the source and reflection of its surrounds.\nComfort is reached at lower air temperature due to eliminating circulating air. Radiant heating experiences highest comfort levels as people's own energy (± 70 Watt for an adult) (must radiate out in heating season) is in balance with its surrounds. Compared to convection heating system based on academic research the air temperatures may be lowered by up to 3 degrees.\nOne variation is using tubes filled with circulating hot water as heat source for warming the floor. The heating principle remains the same. Both old style electric and warm water (hydronic) underfloor heating systems embedded in the floor construction are slow and cannot respond to external weather changes or internal demand/lifestyle requirements.\nThe latest variant places specialized electric heating systems and blankets directly under the floor-decor and on top of additional insulation all placed on top of construction floors. Construction floors stay cold.\nThe principle change of heat source positioning allows it to respond within minutes to changing weather and internal demand requirements such as life style being in/out, at work, rest, sleep, more people present/cooking, etc.\n\n\nLighting system[edit]\n\nIn large office towers, the lighting system is integrated along with the heating and ventilation system. Waste heat from fluorescent lamps is captured in the return air of the heating system; in large buildings a substantial part of the annual heating energy is supplied by the lighting system. However, this waste heat becomes a liability when using air conditioning. Such expenses can be avoided by integrating an energy efficient lighting system that also creates an electric heat source.[3]\n\n\nHeat pumps[edit]\n\nMain article: Heat pump\n\nA heat pump uses an electrically driven compressor to operate a refrigeration cycle that extracts heat energy from outdoor air, the ground or ground water, and moves that heat to the space to be warmed. A liquid contained within the evaporator section of the heat pump boils at low pressure, absorbing heat energy from the outdoor air or the ground. The vapor is then compressed by a compressor and piped into a condenser coil within the building to be heated. The heat from the hot dense gas is absorbed by the air in the building (and sometimes also used for domestic hot water) causing the hot working fluid to condense back into a liquid. From there the high pressure fluid is passed back to the evaporator section where it expands through an orifice and into the evaporator section, completing the cycle. In the summer months, the cycle can be reversed to move heat out of the conditioned space and to the outside air.\n\nHeat pumps may obtain low-grade heat from the outdoor air in mild climates. In areas with average winter temperatures well below freezing, ground source heat pumps are more efficient than air-source heat pumps because they can extract residual solar heat stored in the ground at warmer temperatures than is available from cold air.[4] According to the US EPA, geothermal heat pumps can reduce energy consumption up to 44% compared with air source heat pumps and up to 72% compared with electric resistance heating.[5] The high purchase price of a heat pump vs resistance heaters may be offset when air conditioning is also needed.\n\n\nLiquid heating[edit]\n\nImmersion heater[edit]\n\n  \nSmall domestic immersion heater, 500 W\n\n\n\nAn immersion heater has an electrical resistance heating element encased in a tube and directly placed in the water (or other fluid) to be heated.  Portable immersion heaters may not have a control thermostat, since they are intended to be used only briefly and under control of an operator.\n\nFor domestic hot water supply, or industrial process hot water, permanently installed heating elements in an insulated hot water tank may be used, controlled by a thermostat to regulate temperature. Household units may be rated only a few kilowatts.  Industrial water heaters may reach 2000 kilowatts.  Where off-peak electric power rates are available, hot water may be stored to use when required. \n\nElectric shower and tankless heaters also use an immersion heater (shielded or naked) that is turned on with the flow of water. A group of separate heaters can be switched to offer different heating levels. Electric showers and tankless heaters usually use from 3 to 10.5 kilowatts.\n\nMinerals present in the water supply may precipitate out of solution and form a hard scale on the heating element surface, or may fall to the bottom of the tank and clog water flow. Maintenance of water heating equipment may require periodic removal of accumulated scale and sediment. Where water supplies are known to be highly mineralized, scale production can be reduced by using low-watt-density heating elements.[6]\n\n\nCirculation heaters[edit]\n\nCirculation heaters or \"direct electric heat exchangers\" (DEHE) use heating elements inserted into a \"shell side\" medium directly to provide the heating effect.  All of the heat generated by the electric circulation heater is transferred into the medium, thus an electric heater is 100 percent efficient. Direct electric heat exchangers  or \"circulation heaters\"  are used to heat liquids and gases in industrial processes.[7][8]\n\n\nElectrode heater[edit]\n\nMain article: Electrode boiler\n\nWith an electrode heater, there is no wire-wound resistance and the liquid itself acts as the resistance. This has potential hazards, so the regulations governing electrode heaters are strict.\n\n\nEnvironmental and efficiency aspects[edit]\n\nThe efficiency of any system depends on the definition of the boundaries of the system. For an electrical energy customer the efficiency of electric space heating is almost 100% because almost all purchased energy is converted to building heat (the only exception being fan noise and indication lights which demand very little electricity and virtually none at all when compared to the extremely large energy draw of the heating itself). However, if a power plant supplying electricity is included, the overall efficiency drops drastically. For example, a fossil-fuel power station may only deliver 3 units of electrical energy for every 10 units of fuel energy released. Even though the electric heater is 100% efficient, the amount of fuel needed to produce the heat is more than if the fuel were burned in a furnace or boiler at the building being heated. If the same fuel could be used for space heating by a consumer, it would be more efficient overall to burn the fuel at the end user's building. On the other hand, replacing electric heating with fossil fuel burning heaters, isn't necessary good as it removes the ability to have renewable electric heating, this can be achieved by sourcing the electricity from a renewable source.\n\nVariations between countries generating electrical power affect concerns about efficiency and the environment. In France 10% is generated from fossil fuels, in Britain 80%.[9]  The cleanliness and efficiency of electricity are dependent on the source.\n\nIn Sweden the use of direct electric heating has been restricted since the 1980s for this reason, and there are plans to phase it out entirely – see Oil phase-out in Sweden – while Denmark has banned the installation of direct electric space heating in new buildings for similar reasons.[10]\nIn the case of new buildings, low-energy building techniques can be used which can virtually eliminate the need for heating, such as those built to the Passivhaus standard.\n\nIn Quebec, however, electric heating is still the most popular form of home heating. According to a 2003 Statistics Canada survey, 68% of households in the province use electricity for space heating. More than 90% of all power consumed in Quebec is generated by hydroelectric dams, which have low greenhouse gases emissions compared to fossil-fuel power stations.  Low and stable rates are charged by Hydro-Québec, the provincially owned utility.[11]\n\nTo provide heat more efficiently, an electrically driven heat pump can raise the indoor temperature by extracting energy from the ground, the outside air, or waste streams such as exhaust air. This can cut the electricity consumption to as little as 35% of that used by resistive heating.[12]\nWhere the primary source of electrical energy is hydroelectric, nuclear, or wind, transferring electricity via the grid can be convenient, since the resource may be too distant for direct heating applications (with the notable exception of solar thermal energy).\n\n\nEconomic aspects[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (April 2017) (Learn how and when to remove this template message)\n\n\nThe operation of electric resistance heaters to heat an area for long periods is costly in many regions. However, intermittent or partial day use can be more cost efficient than whole building heating due to superior zonal control.\n\nFor example: A lunch room in an office setting has limited hours of operation. During low-use periods a \"monitor\" level of heat (50 °F or 10 °C) is provided by the central heating system. Peak use times between the hours of 11:00 and 14:00 are heated to \"comfort levels\" (70 °F or 21 °C). Significant savings can be realized in overall energy consumption, since infrared radiation losses through thermal radiation are not as large with a smaller temperature gradient both between this space and unheated outside air, as well as between the refrigerator and the (now cooler) lunch room.\n\nEconomically, electric heat can be compared to other sources of home heating by multiplying the local cost per kilowatt hour for electricity by the number of kilowatts the heater uses. E.g.: 1500-watt heater at 12 cents per kilowatt hour 1.5×12=18 cents per hour.[13] When comparing to burning fuel it may be useful to convert kilowatt hours to BTUs: 1.5 kWh × 3412.142=5118 BTU.\n\n\nIndustrial electric heating[edit]\n\nSee also: Induction furnace, Electric arc furnace, Muffle furnace.\n\nElectric heating is widely used in industry.[14]\n\nAdvantages of electric heating methods over other forms include precision control of temperature and distribution of heat energy, combustion not used to develop heat, and the ability to attain temperatures not readily achievable with chemical combustion. Electric heat can be accurately applied at the precise point needed in a process, at high concentration of power per unit area or volume. Electric heating devices can be built in any required size and can be located anywhere within a plant. Electric heating processes are generally clean, quiet, and do not emit much byproduct heat to the surroundings. Electrical heating equipment has a high speed of response, lending it to rapid-cycling mass-production equipment.\n\nThe limitations and disadvantages of electric heating in industry include the higher cost of electrical energy compared to direct use of fuel, and the capital cost of both the electric heating apparatus itself and the infrastructure required to deliver large quantities of electrical energy to the point of use. This may be somewhat offset by in-plant (on-site) efficiency gains in using less energy overall to achieve the same result.\n\nDesign of an industrial heating system starts with assessment of the temperature required, the amount of heat required, and the feasible modes of transferring heat energy. In addition to conduction, convection and radiation, electrical heating methods can use electric and magnetic fields to heat material.\n\nMethods of electric heating include resistance heating, electric arc heating, induction heating, and dielectric heating. In some processes (for example, arc welding), electric current is directly applied to the workpiece. In other processes, heat is produced within the workpiece by induction or dielectric losses. As well, heat can be produced then transferred to the work by conduction, convection or radiation.\n\nIndustrial heating processes can be broadly categorized as low-temperature (to about 400 °C or 752 °F), medium-temperature (between 400 and 1,150 °C or 752 and 2,102 °F), and high-temperature (beyond 1,150 °C or 2,102 °F). Low-temperature processes include baking and drying, curing finishes, soldering, molding and shaping plastics. Medium temperature processes include melting plastics and some non-metals for casting or reshaping, as well as annealing, stress-relieving and heat-treating metals. High-temperature processes include steelmaking, brazing, welding, casting metals, cutting, smelting and the preparation of some chemicals.\n\n\nSee also[edit]\n\n\n\tEnergy portal\n\n\n\n\n\tAuxiliary power unit\n\tCentral heating\n\tDiathermy\n\tDielectric heating\n\tElectric Train Heating\n\tElectroslag welding\n\tElectroslag remelting\n\tEnergy conservation\n\tHead-end power\n\tHeater (types of heaters)\n\tHotel electric power\n\tHVAC\n\tInfrared heater\n\tMicrowave oven\n\tRenewable energy\n\tThermal efficiency\n\tThermal immersion circulator\n\tUnderfloor heating\n\n\n\n\nReferences[edit]\n\n\n\t^ \"Electric Heater\". Britannica.com. The Editors of Encyclopædia Britannica.\n\n\t^ admin (28 April 2016). \"Advantages of using a Fan Heater - Pypto\". Pypto. Retrieved 18 December 2017.\n\n\n\t^ \"Energy Efficient Lighting | WBDG Whole Building Design Guide\". www.wbdg.org. Retrieved 18 December 2017.\n\n\n\t^ \"Comparison of efficiency of air source heat pumps and ground source heat pumps\". Icax.co.uk. Retrieved 20 December 2013.\n\n\n\t^ \"Choosing and Installing Geothermal Heat Pumps - Department of Energy\". Energy.gov. Retrieved 16 April 2017.\n\n\n\t^ \"Immersion Heaters - Sigma Thermal\". Sigma Thermal. Retrieved 18 December 2017.\n\n\n\t^ \"Gastech News\". 12 August 2012.\n\n\n\t^ \"Electric Resistance Heating - Department of Energy\". Energy.gov. Retrieved 16 April 2017.\n\n\n\t^ IEA Statistics and Balances; retrieved 2011-5-8\n\n\t^ The Green Electricity Illusion, AECB, published 2005-11-11, accessed 26 May 2007\n\n\t^ Snider, Bradley. Home heating and the environment, in Canadian Social Trends, Spring 2006, pp. 15–19. Ottawa: Statistics Canada.\n\n\t^ \"Ground-Source Heat Pumps (Earth-Energy Systems)\". NRCan.gc.ca. Retrieved 16 April 2017.\n\n\n\t^ \"How to calculate electric energy cost of common household items - McGill's Repair and Construction, LLC\". McGill's Repair and Construction, LLC. 19 January 2014. Retrieved 18 December 2017.\n\n\n\t^ Donald G. Fink and H. Wayne Beaty, Standard Handbook for Electrical Engineers, Eleventh Edition, McGraw-Hill, New York, 1978, \nISBN 0-07-020974-X, pages 21-144 to 21-188\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nHeating, ventilation, and air conditioning\n\n\tFundamental concepts\t\n\tAir changes per hour\n\tBake-out\n\tBuilding envelope\n\tConvection\n\tDilution\n\tDomestic energy consumption\n\tEnthalpy\n\tFluid dynamics\n\tGas compressor\n\tHeat pump and refrigeration cycle\n\tHeat transfer\n\tHumidity\n\tInfiltration\n\tLatent heat\n\tNoise control\n\tOutgassing\n\tParticulates\n\tPsychrometrics\n\tSensible heat\n\tStack effect\n\tThermal comfort\n\tThermal destratification\n\tThermal mass\n\tThermodynamics\n\tVapour pressure of water\n\n\n\n\n\tTechnology\t\n\tAbsorption refrigerator\n\tAir barrier\n\tAir conditioning\n\tAntifreeze\n\tAutomobile air conditioning\n\tAutonomous building\n\tBuilding insulation materials\n\tCentral heating\n\tCentral solar heating\n\tChilled beam\n\tChilled water\n\tConstant air volume (CAV)\n\tCoolant\n\tDedicated outdoor air system (DOAS)\n\tDeep water source cooling\n\tDemand-controlled ventilation (DCV)\n\tDisplacement ventilation\n\tDistrict cooling\n\tDistrict heating\n\tElectric heating\n\tEnergy recovery ventilation (ERV)\n\tFirestop\n\tForced-air\n\tForced-air gas\n\tFree cooling\n\tHeat recovery ventilation (HRV)\n\tHybrid heat\n\tHydronics\n\tHVAC\n\tIce storage air conditioning\n\tKitchen ventilation\n\tMixed-mode ventilation\n\tMicrogeneration\n\tNatural ventilation\n\tPassive cooling\n\tPassive house\n\tRadiant heating and cooling system\n\tRadiant cooling\n\tRadiant heating\n\tRadon mitigation\n\tRefrigeration\n\tRenewable heat\n\tRoom air distribution\n\tSolar air heat\n\tSolar combisystem\n\tSolar cooling\n\tSolar heating\n\tThermal insulation\n\tUnderfloor air distribution\n\tUnderfloor heating\n\tVapor barrier\n\tVapor-compression refrigeration (VCRS)\n\tVariable air volume (VAV)\n\tVariable refrigerant flow (VRF)\n\tVentilation\n\n\n\n\n\tComponents\t\n\tAir conditioner inverter\n\tAir door\n\tAir filter\n\tAir handler\n\tAir ionizer\n\tAir-mixing plenum\n\tAir purifier\n\tAir source heat pumps\n\tAutomatic balancing valve\n\tBack boiler\n\tBarrier pipe\n\tBlast damper\n\tBoiler\n\tCentrifugal fan\n\tCeramic heater\n\tChiller\n\tCondensate pump\n\tCondenser\n\tCondensing boiler\n\tConvection heater\n\tCompressor\n\tCooling tower\n\tDamper\n\tDehumidifier\n\tDuct\n\tEconomizer\n\tElectrostatic precipitator\n\tEvaporative cooler\n\tEvaporator\n\tExhaust hood\n\tExpansion tank\n\tFan coil unit\n\tFan filter unit\n\tFan heater\n\tFire damper\n\tFireplace\n\tFireplace insert\n\tFreeze stat\n\tFlue\n\tFreon\n\tFume hood\n\tFurnace\n\tFurnace room\n\tGas compressor\n\tGas heater\n\tGasoline heater\n\tGeothermal heat pump\n\tGrease duct\n\tGrille\n\tGround-coupled heat exchanger\n\tHeat exchanger\n\tHeat pipe\n\tHeat pump\n\tHeating film\n\tHeating system\n\tHigh efficiency glandless circulating pump\n\tHigh-efficiency particulate air (HEPA)\n\tHigh pressure cut off switch\n\tHumidifier\n\tInfrared heater\n\tInverter compressor\n\tKerosene heater\n\tLouver\n\tMechanical fan\n\tMechanical room\n\tOil heater\n\tPackaged terminal air conditioner\n\tPlenum space\n\tPressurisation ductwork\n\tProcess duct work\n\tRadiator\n\tRadiator reflector\n\tRecuperator\n\tRefrigerant\n\tRegister\n\tReversing valve\n\tRun-around coil\n\tScroll compressor\n\tSolar chimney\n\tSolar-assisted heat pump\n\tSpace heater\n\tSmoke exhaust ductwork\n\tThermal expansion valve\n\tThermal wheel\n\tThermosiphon\n\tThermostatic radiator valve\n\tTrickle vent\n\tTrombe wall\n\tTurning vanes\n\tUltra-low particulate air (ULPA)\n\tWhole-house fan\n\tWindcatcher\n\tWood-burning stove\n\n\n\n\n\tMeasurement\nand control\t\n\tAir flow meter\n\tAquastat\n\tBACnet\n\tBlower door\n\tBuilding automation\n\tCarbon dioxide sensor\n\tClean Air Delivery Rate (CADR)\n\tGas sensor\n\tHome energy monitor\n\tHumidistat\n\tHVAC control system\n\tIntelligent buildings\n\tLonWorks\n\tMinimum efficiency reporting value (MERV)\n\tOpenTherm\n\tProgrammable communicating thermostat\n\tProgrammable thermostat\n\tPsychrometrics\n\tRoom temperature\n\tSmart thermostat\n\tThermostat\n\tThermostatic radiator valve\n\n\n\n\n\tProfessions, trades,\nand services\t\n\tArchitectural acoustics\n\tArchitectural engineering\n\tArchitectural technologist\n\tBuilding services engineering\n\tBuilding information modeling (BIM)\n\tDeep energy retrofit\n\tDuct leakage testing\n\tEnvironmental engineering\n\tHydronic balancing\n\tKitchen exhaust cleaning\n\tMechanical engineering\n\tMechanical, electrical, and plumbing\n\tMold growth, assessment, and remediation\n\tRefrigerant reclamation\n\tTesting, adjusting, balancing\n\n\n\n\n\tIndustry organizations\t\n\tACCA\n\tAMCA\n\tASHRAE\n\tASTM International\n\tBRE\n\tBSRIA\n\tCIBSE\n\tLEED\n\tSMACNA\n\n\n\n\n\tHealth and safety\t\n\tIndoor air quality (IAQ)\n\tPassive smoking\n\tSick building syndrome (SBS)\n\tVolatile organic compound (VOC)\n\n\n\n\n\tSee also\t\n\tASHRAE Handbook\n\tBuilding science\n\tFireproofing\n\tGlossary of HVAC terms\n\tTemplate:Home automation\n\tTemplate:Solar energy\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Electric_heating&oldid=916779875\"\n\n\t\t\n\t\tCategories: \tElectric heating\n\n\nHidden categories: \tUse dmy dates from June 2017\n\tArticles needing additional references from April 2017\n\tAll articles needing additional references\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tČeština\n\tDeutsch\n\tفارسی\n\tFrançais\n\t한국어\n\tहिन्दी\n\tHrvatski\n\tItaliano\n\tMagyar\n\tNederlands\n\t日本語\n\tSlovenčina\n\tСрпски / srpski\n\tSuomi\n\tSvenska\n\tייִדיש\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 20 September 2019, at 16:07 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Electric heating - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/30kw_resistance_heating_coil.JPG/1200px-30kw_resistance_heating_coil.JPG", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-electric_heater", "title": "Electric heating - Wikipedia"}}