{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nField propulsion - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tField propulsion\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\t\n\tThis article has multiple issues. Please help improve it or discuss these issues on the talk page. (Learn how and when to remove these template messages)\n\n      \t\n\tThis article includes a list of references, but its sources remain unclear because it has insufficient inline citations. Please help to improve this article by introducing more precise citations.  (December 2013) (Learn how and when to remove this template message)\n\n\n\n\t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Field propulsion\" – news · newspapers · books · scholar · JSTOR  (December 2013) (Learn how and when to remove this template message)\n\n\n\n    \n\n\n (Learn how and when to remove this template message)\n\n\n\nField propulsion is the concept of spacecraft propulsion where no propellant is necessary but instead momentum of the spacecraft is changed by an interaction of the spacecraft with external force fields, such as gravitational and magnetic fields from stars and planets. It is purely speculative and has not yet been demonstrated to be of practical use, or theoretically valid.\n\n\nContents\n\n\n\t1 Types\n\t1.1 Practical methods\n\t1.2 Speculative methods\n\t1.3 Field propulsion based on physical structure of space\n\t1.4 Conservation Laws\n\t1.5 Advantages\n\n\n\n\t2 See also\n\t3 References\n\t4 External links\n\n\n\n\n\nTypes[edit]\n\nPractical methods[edit]\n\nAlthough not presently in wide use for space, there exist proven terrestrial examples of \"Field Propulsion\", in which electromagnetic fields act upon a conducting medium such as seawater or plasma for propulsion, is known as magnetohydrodynamics or MHD.  MHD is similar in operation to electric motors, however rather than using moving parts or metal conductors, fluid or plasma conductors are employed.  The EMS-1 and more recently the Yamato 1[1] are examples of such electromagnetic Field propulsion systems, first proposed in patent US 5333444 .[2] There is definitely potential to apply MHD to the space environment such as in experiments like NASA's electrodynamic tether, Lorentz Actuated Orbits,[3] the wingless electromagnetic air vehicle, and magnetoplasmadynamic thruster (which does use propellant).\n\nElectrohydrodynamics is another method whereby electrically charged fluids are used for propulsion and boundary layer control such as ion propulsion[citation needed]\n\nOther practical methods which could be loosely considered as field propulsion include: The gravity assist trajectory, which uses planetary gravity fields and orbital momentum; Solar sails and magnetic sails use respectively the radiation pressure and solar wind for spacecraft thrust; Aerobraking uses the atmosphere of a planet to change relative velocity of a spacecraft. The last two actually involve the exchange of momentum with physical particles and are not usually expressed as an interaction with fields, but they are sometimes included as examples of field propulsion since no spacecraft propellant is required.[citation needed]\n\n\nSpeculative methods[edit]\n\nOther concepts that have been proposed are speculative, using \"frontier physics\" and concepts from modern physics. So far none of these methods have been unambiguously demonstrated, much less proven practical.\n\nThe Woodward effect is based on a controversial concept of inertia and certain solutions to the equations for General Relativity. Experiments attempting to conclusively demonstrate this effect have been conducted since the 1990s.\n\nAlthough speculative, ideas such as coupling to the momentum flux of the zero-point electromagnetic wave field hypothesized in stochastic electrodynamics have a plausible basis for further investigation within the existing theoretical physics paradigm.\n\nIn contrast, examples of proposals for field propulsion that rely on physics outside the present paradigms are various schemes for faster-than-light, warp drive and antigravity, and often amount to little more than catchy descriptive phrases, with no known physical basis[citation needed].  Until it is shown that the conservation of energy and momentum break down under certain conditions (or scales), any such schemes worthy of discussion must rely on energy and momentum transfer to the spacecraft from some external source such as a local force field, which in turn must obtain it from still other momentum and/or energy sources in the cosmos (in order to satisfy conservation of both energy and momentum).[citation needed]\n\n\n\n\n\nField propulsion based on physical structure of space[edit]\n\nThis concept is based on the general relativity theory and the quantum field theory from which the idea that space has a physical structure can be proposed. The macroscopic structure is described by the general relativity theory and the microscopic structure by the quantum field theory.\nThe idea is to deform space around the space craft. By deforming the space it would be possible to create a region with higher pressure behind the space craft than before it. Due to the pressure gradient a force would be exerted on the space craft which in turn creates thrust for propulsion.[4] Due to the purely theoretical nature of this propulsion concept it is hard to determine the amount of thrust and the maximum velocity that could be achieved. Currently there are two different concepts for such a field propulsion system one that is purely based on the general relativity theory and one based on the quantum field theory.[5]\n\nIn the general relativistic field propulsion system space is considered to be an elastic field similar to rubber which means that space itself can be treated as an infinite elastic body. If the space-time curves, a normal inwards surface stress is generated which serves as a pressure field. By creating a great number of those curve surfaces behind the space craft it is possible to achieve a unidirectional surface force which can be use for the acceleration of the space craft.[5]\n\nFor the quantum field theoretical propulsion system it is assumed, as stated by the quantum field theory and quantum Electrodynamics, that the quantum vacuum consists out of a zero-radiating electromagnetic field in a non-radiating mode and at a zero-point energy state, the lowest possible energy state. It is also theorized that matter is composed out of elementary primary charged entities, partons, which are bound together as elementary oscillators. By applying an electromagnetic zero point field a Lorentz force is applied on the partons. Using this on a dielectric material could effect the inertia of the mass and that way create an acceleration of the material without creating stress or strain inside the material.[5]\n\n\nConservation Laws[edit]\n\nConservation of momentum is a fundamental requirement of propulsion systems because in experiments momentum is always conserved,[6] and is implicit in published work of  Newton and Galileo. In each of the propulsion technologies, some form of energy exchange is required with momentum directed backward at light speed c or some lesser velocity v to balance the forward change of momentum. In absence of interaction with an external field, the power P that is required to create a thrust force F is given.\n\nF = P/v when mass is ejected  or  F=P/c if mass free energy is ejected.\n\nFor a photon rocket the efficiency is too small to be competitive.[7] Other technologies may have better efficiency if the ejection velocity is less than light speed, or a local field can interact with another large scale field of the same type residing in space, which is the intent of field effect propulsion.\n\n\nAdvantages[edit]\n\nThe main advantage of a field propulsion systems is that no propellant is needed, only an energy source. This means that no propellant has to be stored and transported with the space craft which makes it attractive for long term interplanetary or even interstellar manned missions.[5] With current technology a large amount of fuel meant for the way back has to be brought to the destination which increases the payload of the overall space craft significantly.  The increased payload of fuel, thus requires more force to accelerate it, requiring even more fuel which is the primary drawback of current rocket technology.  Approximately 83% of a Hydrogen-Oxygen powered rocket, which can achieve orbit, is fuel.[8]\n\n\nSee also[edit]\n\n\n\tAdvanced Space Propulsion Investigation Committee\n\tBreakthrough Propulsion Physics Program\n\tBussard ramjet\n\tReactionless drive\n\tUnited States gravity control propulsion research\n\n\n\n\nReferences[edit]\n\n\n\t^ http://www.ovaltech.ca/pdfss/mhddesign.pdf\n\n\t^ Meng, J.C.S. (1994). U.S. Patent No. 5333444. Washington DC: US Patent and Trademark Office.\n\n\t^ http://www.ovaltech.ca/pdfss/Lorentz_Actuated_Orbits_1385Peck.pdf\n\n\t^ Musha, Takaaki. Field Propulsion System for Space Travel: Physics of Non-Conventional Propulsion Methods for Interstellar Travel. Bentham Books. pp. 20–37. ISBN 978-1-60805-566-1.\n\n\t^ a b c d Minami, Yoshinari; Musha, Takaaki (February 2013). \"Field propulsion systems for space travel\". Acta Astronautica. 82 (2): 215–20. Bibcode:2013AcAau..82..215M. doi:10.1016/j.actaastro.2012.02.027.\n\n\n\t^ Ho-Kim, Quang; Kumar, Narendra; Lam, Harry C. S. (2004). Invitation to Contemporary Physics (illustrated ed.). World Scientific. p. 19. \nISBN 978-981-238-303-7. Extract of page 19\n\n\t^ There will be no photon rocket, by V. Smilga http://www.dtic.mil/dtic/tr/fulltext/u2/611872.pdf\n\n\t^ Pettit, Don. \"The Tyranny of the Rocket Equation\". NASA.\n\n\n\n\n\n\nExternal links[edit]\n\n\tExamples of current field propulsion systems for ships.\n\tExample of a possible field propulsion system based on existing physics and links to papers on the topic. broken link\n\tStoyan Sarg (2009). Field Propulsion by Control of Gravity: Theory and Experiments. CreateSpace Independent Publishing Platform. ISBN 978-1-4486-9308-5.\n\n\tY. Minami., An Introduction to Concepts of Field Propulsion, JBIS,56,350-359(2003).\n\tMinami Y., Musha T., Field Propulsion Systems for Space Travel, the Seventh IAA Symposium on Realistic Near-Term Advanced Scientific Space Missions, 11–13 July 2011, Aosta, Italy\n\tEd.T.Musha, Y.Minami, Field Propulsion System for Space Travel: Physics of Non-Conventional Propulsion Methods for Interstellar Travel, 2011 \nISBN 978-1-60805-270-7.\n\tField Resonance Propulsion Concept - NASA\n\tASPS\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Field_propulsion&oldid=904129872\"\n\n\t\t\n\t\tCategories: \tSpacecraft propulsion\n\tScience fiction themes\n\tHypothetical technology\n\n\nHidden categories: \tArticles lacking in-text citations from December 2013\n\tAll articles lacking in-text citations\n\tArticles needing additional references from December 2013\n\tAll articles needing additional references\n\tArticles with multiple maintenance issues\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from January 2014\n\tArticles with unsourced statements from August 2014\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tEspañol\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 30 June 2019, at 05:02 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Field propulsion - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-field_propulsion", "title": "Field propulsion - Wikipedia"}}