{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nField-emission electric propulsion - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tField-emission electric propulsion\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Field-emission electric propulsion\" – news · newspapers · books · scholar · JSTOR  (June 2018) (Learn how and when to remove this template message)\n\n\n\nField-emission electric propulsion (FEEP) is an advanced electrostatic space propulsion concept, a form of ion thruster, that uses liquid metal (usually either caesium, indium or mercury) as a propellant. A FEEP device consists of an emitter and an accelerator electrode. A potential difference of the order of 10 kV is applied between the two, which generates a strong electric field at the tip of the metal surface. The interplay of electric force and surface tension generates surface instabilities which give rise to Taylor cones on the liquid surface. At sufficiently high values of the applied field, ions are extracted from the cone tip by field evaporation or similar mechanisms, which then are accelerated to high velocities (typically 100 km/s or more).\n\nA separate electron source is required to keep the spacecraft electrically neutral. Due to its very low thrust (in the micronewton to millinewton range), FEEP thrusters are primarily used for microradian, micronewton attitude control on spacecraft, such as in the ESA/NASA LISA Pathfinder scientific spacecraft. \n\nThe FEEP thruster was also slated for installation on Gravity Field and Steady-State Ocean Circulation Explorer spacecraft,[1] but the Gridded ion thruster was used instead.[2]\n\nThe first FEEP thruster operated in space was the IFM Nano Thruster, successfully commissioned in Low Earth Orbit in 2018.[3]\n\n\nContents\n\n\n\t1 The concept\n\t2 The slit emitter\n\t3 Other designs\n\t4 References\n\t5 External links\n\n\n\n\n\nThe concept[edit]\n\nField emission electric propulsion (FEEP) is an electrostatic propulsion concept based on field ionization of a liquid metal and subsequent acceleration of the ions by a strong electric field. FEEP is currently the object of interest in the scientific community, due to its unique features: sub-μN to mN thrust range, near instantaneous switch on/switch off capability, and high-resolution throttleability (better than one part in 104), which enables accurate thrust modulation in both continuous and pulsed modes.[4] Presently baseline for scientific missions onboard drag-free satellites, this propulsion system has also been proposed for attitude control and orbit maintenance on\ncommercial small satellites and constellations.\n\nThis type of thruster can accelerate a large number of different liquid metals or alloys. The best performance (in terms of thrust efficiency and power-to-thrust ratio) can be obtained using high atomic weight alkali metals, such as cesium and rubidium (133 amu for Cs, 85.5 amu for Rb). These propellants have a low ionization potential (3.87 eV for Cs and 4.16 eV for Rb), low melting point (28.7 °C for Cs and 38.9 °C for Rb) and very good wetting capabilities. These features lead to low power losses due to ionization and heating and the capability to use capillary forces for feeding purposes (i.e. no pressurised tanks nor valves are required). Moreover, alkali metals have the lowest attitude to form ionized droplets or multiply-charged ions, thus leading to the best attainable mass efficiency. The actual thrust is produced by exhausting a beam of mainly singly-ionized cesium or rubidium atoms, produced by field evaporation at the tip of the emitter.\n\nAn accelerating electrode (accelerator) is placed directly in front of the emitter. This electrode consists of a metal (usually stainless steel) plate where two sharp blades are machined. When thrust is required, a strong electric field is generated by the application of a high voltage difference between the emitter and the accelerator. Under this condition, the free surface of the liquid metal enters a regime of local instability, due to the combined effects of the electrostatic force and the surface tension. A series of protruding cusps, or \"Taylor cones\" are thus created. When the electric field reaches a value in the order of 109 V/m, the atoms at the tip of the cusps spontaneously ionize and an ion jet is extracted by the electric field, while the electrons are rejected in the bulk of the liquid. An external source of electrons (neutralizer) provides negative charges to maintain global electrical neutrality of the thruster assembly.\n\n\nThe slit emitter[edit]\n\nLiquid metal ion sources (LMIS) based on field ionization or field evaporation were introduced in the late '60s and quickly became widespread as simple, cheap ion sources for a number of applications. In particular, the use of LMIS operated on gallium, indium, alkali metals or alloys has been standard practice in secondary ion mass spectrometry (SIMS) since the '70s.\n\nWhile there exist different field emitter configurations, such as the needle, the capillary and slit emitter types, the principle of operation is the same in all cases. In the slit emitter, for example, a liquid metal propellant is fed by capillary forces through a narrow channel. The emitter consists of two identical halves made from stainless steel, and clamped or screwed together. A nickel layer, sputter deposited onto one of the emitter halves, outlines the desired channel contour and determines channel height (a.k.a. slit height, typically 1–2 μm) and channel width (a.k.a. slit length, ranging from 1 mm up to about 7 cm).\n\nThe channel ends at the emitter tip, formed by sharp edges that are located opposite a negative, or accelerator, electrode, and separated by a small gap (about 0.6 mm) from the emitter tip. An extraction voltage is applied between the two electrodes. The emitter carries a positive potential while the accelerator is at negative potential. The electric field being generated between the emitter and accelerator now acts on the liquid metal propellant.\n\nThe narrow slit width not only enables the capillary feed, but, when combined with the sharp channel edges directly opposite the accelerator, also ensures that a high electric field strength is obtained near the slit exit. The liquid metal column, when subjected to this electric field, begins to deform, forming cusps (Taylor cones), which protrude from the surface of the liquid. As the liquid cusps form ever sharper cones due to the action of the electric field, the local electric field strength near these cusps intensifies. Once a local electric field strength of about 109 V/m is reached, electrons are ripped off the metal atoms. These electrons are collected through the liquid metal column by the channel walls, and the positive ions are accelerated away from the liquid through a gap in the negative accelerator electrode by the same electric field that created them.\n\nSlit emitters had been developed to increase the emitting area of the thruster in order to yield higher thrust levels and to avoid the irregular behaviour observed for single emitters. The substantial advantage of slit emitters over stacked needles is in the self-adjusting mechanism governing the formation and redistribution of emission sites on the liquid metal surface according to the operating parameters; in a stacked-needle array, on the contrary, the Taylor cones can only exist on the fixed tips, which pre-configure a geometrical arrangement that can only be consistent with one particular operating condition. \n\nSlit emitters with a wide variety of slit widths have been fabricated; currently, devices with slit widths between 2 mm and 7 cm are available. These devices, spanning a thrust range from 0.1 μN to 2 mN, are operated with cesium or rubidium.\n\n\nOther designs[edit]\n\nThe miniaturized FEEP module design with a crown-shape emitter to fit into the standard CubeSat chassis was reported in 2017.\n\nThe single-emitter FEEP design of 0.5 mN is commercially available,[5], and its arrayed version development is nearing completion as in 2018.[6]\n\n\nReferences[edit]\n\n\t^ FEEP feasibility report\n\n\t^ GOCE (Gravity field and steady-state Ocean Circulation Explorer) from eoportal.org\n\n\t^ Krejci, David. \"(PDF) DEMONSTRATION OF THE IFM NANO FEEP THRUSTER IN LOW EARTH ORBIT\". ResearchGate. Retrieved 27 March 2019.\n\n\t^ Marcuccio, S., Genovese, A., Andrenucci, M., \"Experimental Performance of Field Emission Microthrusters\", Journal of Propulsion and Power, Vol. 14, No. 5, September-October 1998, pp. 774-781. Archived 2013-05-20 at the Wayback Machine\n\n\t^ IFM Nano Thruster for CubeSats €30,000\n\n\t^ IFM 350 NANO THRUSTER - IOD\n\n\n\n\nExternal links[edit]\n\n\tFEEP – Field Emission Electric Propulsion at Alta SpA\n\tFEEP thrusters studied in the Nonequilibrium Gas and Plasma Dynamics Group at the University of Michigan\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft propulsion\n\n\tChemical\nrockets\t\n\tState\t\n\tLiquid-propellant rocket\n\tSolid-propellant rocket\n\tHybrid-propellant rocket\n\n\n\n\n\tPropellants\t\n\tLiquid propellant\n\tCryogenic\n\tHypergolic\n\n\n\tMonopropellant\n\tBipropellant\n\tStaged combustion cycle\n\tExpander cycle\n\tGas-generator cycle\n\tTap-off cycle\n\tPressure-fed engine\n\tPump-fed engine\n\tElectric-pump-fed engine\n\n\n\tTripropellant\n\n\n\n\n\n\n\n\tElectrical\nthrusters\t\n\tElectrostatic\t\n\tColloid thruster\n\tIon thruster\n\tGridded\n\tHall-effect thruster\n\tField-emission electric propulsion\n\n\n\n\n\n\n\tElectromagnetic\t\n\tPulsed inductive thruster\n\tMagnetoplasmadynamic thruster\n\tElectrodeless plasma thruster\n\n\n\n\n\tElectrothermal\t\n\tPulsed plasma thruster\n\tHelicon double-layer thruster\n\tArcjet rocket\n\tResistojet rocket\n\tVASIMR\n\n\n\n\n\tOther\t\n\tAtmosphere-breathing electric propulsion\n\tHigh Power Electric Propulsion\n\tMagBeam\n\tMass driver\n\n\n\n\n\n\n\n\tNuclear\npropulsion\t\n\tClosed system\t\n\tDirect Fusion Drive\n\tNuclear electric rocket\n\tNuclear thermal rocket\n\tRadioisotope\n\tSalt-water\n\tGas core\n\t\"Lightbulb\"\n\n\n\n\n\n\n\tOpen system\t\n\tNuclear pulse propulsion\n\tAntimatter-catalyzed\n\n\n\tPulsed nuclear thermal rocket‎\n\tFusion rocket\n\tBussard ramjet\n\n\n\tFission-fragment rocket\n\tFission sail\n\n\n\tNuclear photonic rocket\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tBeam-powered propulsion\n\tCold gas thruster\n\tGravity assist\n\tSolar sail\n\tElectric sail\n\tMagnetic sail\n\n\n\tSolar thermal rocket\n\tTethers\n\tSteam thruster\n\n\n\n\n\tSpaceflight portal\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Field-emission_electric_propulsion&oldid=892418323\"\n\n\t\t\n\t\tCategories: \tIon engines\n\n\nHidden categories: \tWebarchive template wayback links\n\tArticles needing additional references from June 2018\n\tAll articles needing additional references\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tItaliano\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 14 April 2019, at 11:38 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "Field-emission electric propulsion - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-field-emission_electric_propulsion", "title": "Field-emission electric propulsion - Wikipedia"}}