{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFree-space optical communication - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tFree-space optical communication\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about optical communication over long distances. For short- to medium-range communication, see Optical wireless communications.\n\n\n\n\nCommunication using light sent through free space\n\n  \nAn 8-beam free space optics laser link, rated for 1 Gbit/s. The receptor is the large lens in the middle, the transmitters the smaller ones. At the top right corner is a monocular for assisting the alignment of the two heads.\n\n\n\nFree-space optical communication (FSO) is an optical communication technology that uses light propagating in free space to wirelessly transmit data for telecommunications or computer networking. \"Free space\" means air, outer space, vacuum, or something similar. This contrasts with using solids such as optical fiber cable.\n\nThe technology is useful where the physical connections are impractical due to high costs or other considerations.\n\n\nContents\n\n\n\t1 History\n\t2 Usage and technologies\n\t2.1 Commercial products\n\t2.2 Useful distances\n\t2.3 Extending the useful distance\n\t2.4 Extraterrestrial\n\t2.4.1 Operational systems\n\t2.4.2 Demonstrations\n\t2.4.3 Commercial use\n\n\n\n\n\n\n\t3 LEDs\n\t4 Engineering details\n\t4.1 Technical advantages\n\t4.2 Range limiting factors\n\n\n\n\t5 See also\n\t6 References\n\t7 Further reading\n\t8 External links\n\n\n\n\n\nHistory[edit]\n\n  \nA photophone receiver and headset, one half of Bell and Tainter's optical telecommunication system of 1880\n\n\n\nOptical communications, in various forms, have been used for thousands of years. The Ancient Greeks used a coded alphabetic system of signalling with torches developed by Cleoxenus, Democleitus and Polybius.[1] In the modern era, semaphores and wireless solar telegraphs called heliographs were developed, using coded signals to communicate with their recipients.\n\nIn 1880, Alexander Graham Bell and his assistant Charles Sumner Tainter created the photophone, at Bell's newly established Volta Laboratory in Washington, DC. Bell considered it his most important invention. The device allowed for the transmission of sound on a beam of light. On June 3, 1880, Bell conducted the world's first wireless telephone transmission between two buildings, some 213 meters (700 feet) apart.[2][3]\n\n\nIts first practical use came in military communication systems many decades later, first for optical telegraphy. German colonial troops used heliograph telegraphy transmitters during the Herero and Namaqua genocide starting in 1904, in German South-West Africa (today's Namibia) as did British, French, US or Ottoman signals.\n  \nWW I German Blinkgerät\n\n\n During the trench warfare of World War I when wire communications were often cut, German signals used three types of optical Morse transmitters called Blinkgerät, the intermediate type for distances of up to 4 km (2.5 miles) at daylight and of up to 8 km (5 miles) at night, using red filters for undetected communications. Optical telephone communications were tested at the end of the war, but not introduced at troop level. In addition, special blinkgeräts were used for communication with airplanes, balloons, and tanks, with varying success.[citation needed]\n\nA major technological step was to replace the Morse code by modulating optical waves in speech transmission. Carl Zeiss, Jena developed the Lichtsprechgerät 80/80 (literal translation: optical speaking device) that the German army used in their World War II anti-aircraft defense units, or in bunkers at the Atlantic Wall.[4]\n\nThe invention of lasers in the 1960s revolutionized free space optics. Military organizations were particularly interested and boosted their development. However, the technology lost market momentum when the installation of optical fiber networks for civilian uses was at its peak.\n\nMany simple and inexpensive consumer remote controls use low-speed communication using infrared (IR) light. This is known as consumer IR technologies.\n\n\nUsage and technologies[edit]\n\nFree-space point-to-point optical links can be implemented using infrared laser light, although low-data-rate communication over short distances is possible using LEDs. Infrared Data Association (IrDA) technology is a very simple form of free-space optical communications. On the communications side the FSO technology is considered as a part of the optical wireless communications applications. Free-space optics can be used for communications between spacecraft.[5]\n\n\nCommercial products[edit]\n\n\tIn 2008, MRV Communications introduced a free-space optics (FSO)-based system with a data rate of 10 Gbit/s initially claiming a distance of 2 km at high availability.[6] This equipment is no longer available; before end-of-life, the product's useful distance was changed down to 350 m.[7]\n\tIn 2013, the company MOSTCOM started to serially produce a new wireless communication system[8] that also had a data rate of 10 Gbit/s as well as an improved range of up to 2.5 km, but to get to 99.99% uptime the designers used an RF hybrid solution, meaning the data rate drops to extremely low levels during atmospheric disturbances (typically down to 10 Mbit/s). In April 2014, the company with Scientific and Technological Centre \"Fiord\" demonstrated the transmission speed 30 Gbit/s under \"laboratory conditions\".\n\tLightPointe offers many similar hybrid solutions to MOSTCOM's offering.[9]\n\n\nUseful distances[edit]\n\nThe reliability of FSO units has always been a problem for commercial telecommunications. Consistently, studies find too many dropped packets and signal errors over small ranges (400 to 500 meters). This is from both independent studies, such as in the Czech republic,[10] as well as formal internal nationwide studies, such as one conducted by MRV FSO staff.[11] Military based studies consistently produce longer estimates for reliability, projecting the maximum range for terrestrial links is of the order of 2 to 3 km (1.2 to 1.9 mi).[12] All studies agree the stability and quality of the link is highly dependent on atmospheric factors such as rain, fog, dust and heat. Relays may be employed to extend the range for FSO communications.[13]\n\n\nExtending the useful distance[edit]\n\n  \nDARPA ORCA official concept art created c. 2008\n\n\n\nThe main reason terrestrial communications have been limited to non-commercial telecommunications functions is fog. Fog consistently keeps FSO laser links over 500 meters from achieving a year-round bit error rate of 1 per 100,000. Several entities are continually attempting to overcome these key disadvantages to FSO communications and field a system with a better quality of service. DARPA has sponsored over US$130 million in research towards this effort, with the ORCA and ORCLE programs.[14][15][16]\n\nOther non-government groups are fielding tests to evaluate different technologies that some claim have the ability to address key FSO adoption challenges. As of October 2014[update], none have fielded a working system that addresses the most common atmospheric events.\n\nFSO research from 1998–2006 in the private sector totaled $407.1 million, divided primarily among four start-up companies. All four failed to deliver products that would meet telecommunications quality and distance standards:[17]\n\n\n\tTerabeam received approximately $575 million in funding from investors such as Softbank, Mobius Venture Capital and Oakhill Venture Partners. AT&T and Lucent backed this attempt.[18][19] The work ultimately failed, and the company was purchased in 2004 for $52 million (excluding warrants and options) by Falls Church, Va.-based YDI, effective June 22, 2004, and used the name Terabeam for the new entity. On September 4, 2007, Terabeam (then headquartered in San Jose, California) announced it would change its name to Proxim Wireless Corporation, and change its NASDAQ stock symbol from TRBM to PRXM.[20]\n\tAirFiber received $96.1 million in funding, and never solved the weather issue. They sold out to MRV communications in 2003, and MRV sold their FSO units until 2012 when the end-of-life was abruptly announced for the Terescope series.[7]\n\tLightPointe Communications received $76 million in start-up funds, and eventually reorganized to sell hybrid FSO-RF units to overcome the weather-based challenges.[21]\n\tThe Maxima Corporation published its operating theory in Science (magazine),[22] and received $9 million in funding before permanently shutting down. No known spin-off or purchase followed this effort.\n\tWireless Excellence developed and launched CableFree UNITY solutions that combine FSO with millimeter wave and radio technologies to extend distance, capacity and availability, with a goal of making FSO a more useful and practical technology.[23]\n\n\nOne private company published a paper on November 20, 2014, claiming they had achieved commercial reliability (99.999% availability) in extreme fog. There is no indication this product is currently commercially available.[24]\n\n\nExtraterrestrial[edit]\n\nSee also: Laser communication in space\n\nThe massive advantages of laser communication in space have multiple space agencies racing to develop a stable space communication platform, with many significant demonstrations and achievements.\n\n\nOperational systems[edit]\n\nThe first gigabit laser-based communication was achieved by the European Space Agency and called the European Data Relay System (EDRS) on November 28, 2014. The system is operational and is being used on a daily basis.\n\n\nDemonstrations[edit]\n\nNASA's OPALS announced a breakthrough in space-to-ground communication December 9, 2014, uploading 175 megabytes in 3.5 seconds. Their system is also able to re-acquire tracking after the signal was lost due to cloud cover.\n\nIn the early morning hours of Oct. 18, NASA's Lunar Laser Communication Demonstration (LLCD) made history, transmitting data from lunar orbit to Earth at a rate of 622 Megabits-per-second (Mbps). LLCD was flown aboard the Lunar Atmosphere and Dust Environment Explorer satellite (LADEE), whose primary science mission was to investigate the tenuous and exotic atmosphere that exists around the moon.\n\nIn January 2013, NASA used lasers to beam an image of the Mona Lisa to the Lunar Reconnaissance Orbiter roughly 390,000 km (240,000 mi) away. To compensate for atmospheric interference, an error correction code algorithm similar to that used in CDs was implemented.[25]\n\nA two-way distance record for communication was set by the Mercury laser altimeter instrument aboard the MESSENGER spacecraft, and was able to communicate across a distance of 24 million km (15 million miles), as the craft neared Earth on a fly-by in May, 2005. The previous record had been set with a one-way detection of laser light from Earth, by the Galileo probe, of 6 million km in 1992.\nQuote from Laser Communication in Space Demonstrations (EDRS)\n\n\nCommercial use[edit]\n\nVarious planned satellite constellations such as SpaceX's Starlink intended to provide global broadband coverage employ laser communication for inter-satellite links between the several hundred to thousand satellites effectively creating a space-based optical mesh network.\n\n\nLEDs[edit]\n\n  \nRONJA is a free implementation of FSO using high-intensity LEDs.\n\n\n\nIn 2001, Twibright Labs released Ronja Metropolis, an open source DIY 10 Mbit/s full duplex LED FSO over 1.4 km[26][27]\nIn 2004, a Visible Light Communication Consortium was formed in Japan.[28] This was based on work from researchers that used a white LED-based space lighting system for indoor local area network (LAN) communications. These systems present advantages over traditional UHF RF-based systems from improved isolation between systems, the size and cost of receivers/transmitters, RF licensing laws and by combining space lighting and communication into the same system.[29] In January 2009, a task force for visible light communication was formed by the Institute of Electrical and Electronics Engineers working group for wireless personal area network standards known as IEEE 802.15.7.[30] A trial was announced in 2010, in St. Cloud, Minnesota.[31]\n\nAmateur radio operators have achieved significantly farther distances using incoherent sources of light from high-intensity LEDs. One reported 173 miles (278 km) in 2007.[32] However, physical limitations of the equipment used limited bandwidths to about 4 kHz. The high sensitivities required of the detector to cover such distances made the internal capacitance of the photodiode used a dominant factor in the high-impedance amplifier which followed it, thus naturally forming a low-pass filter with a cut-off frequency in the 4 kHz range. Use of lasers can reach very high data rates which are comparable to fiber communications.\n\nProjected data rates and future data rate claims vary. A low-cost white LED (GaN-phosphor) which could be used for space lighting can typically be modulated up to 20 MHz.[33] Data rates of over 100 Mbit/s can be easily achieved using efficient modulation schemes and Siemens claimed to have achieved over 500 Mbit/s in 2010.[34] Research published in 2009, used a similar system for traffic control of automated vehicles with LED traffic lights.[35]\n\nIn September 2013, pureLiFi, the Edinburgh start-up working on Li-Fi, also demonstrated high speed point-to-point connectivity using any off-the-shelf LED light bulb. In previous work, high bandwidth specialist LEDs have been used to achieve the high data rates. The new system, the Li-1st, maximizes the available optical bandwidth for any LED device, thereby reducing the cost and improving the performance of deploying indoor FSO systems.[36]\n\n\nEngineering details[edit]\n\nTypically, best use scenarios for this technology are:\n\n\n\tLAN-to-LAN connections on campuses at Fast Ethernet or Gigabit Ethernet speeds\n\tLAN-to-LAN connections in a city, a metropolitan area network\n\tTo cross a public road or other barriers which the sender and receiver do not own\n\tSpeedy service delivery of high-bandwidth access to optical fiber networks\n\tConverged Voice-Data-Connection\n\tTemporary network installation (for events or other purposes)\n\tReestablish high-speed connection quickly (disaster recovery)\n\tAs an alternative or upgrade add-on to existing wireless technologies\n\tEspecially powerful in combination with auto aiming systems, this way you could power moving cars or you can power your laptop while you move or use auto-aiming nodes to create a network with other nodes.\n\n\n\tAs a safety add-on for important fiber connections (redundancy)\n\tFor communications between spacecraft, including elements of a satellite constellation\n\tFor inter- and intra-chip communication[37]\n\n\nThe light beam can be very narrow, which makes FSO hard to intercept, improving security. In any case, it is comparatively easy to encrypt any data traveling across the FSO connection for additional security. FSO provides vastly improved electromagnetic interference (EMI) behavior compared to using microwaves.\n\n\nTechnical advantages[edit]\n\n\tEase of deployment\n\tCan be used to power devices[citation needed]\n\tLicense-free long-range operation (in contrast with radio communication)\n\tHigh bit rates\n\tLow bit error rates\n\tImmunity to electromagnetic interference\n\tFull duplex operation\n\tProtocol transparency\n\tIncreased security when working with narrow beam(s)[citation needed]\n\tNo Fresnel zone necessary\n\tReference open source implementation\n\n\nRange limiting factors[edit]\n\nFor terrestrial applications, the principal limiting factors are:\n\n\n\tFog (10 to ~100 dB/km attenuation)\n\tBeam dispersion\n\tAtmospheric absorption\n\tRain\n\tSnow\n\tTerrestrial scintillation\n\tInterference from background light sources (including the sun)\n\tShadowing\n\tPointing stability in wind\n\tPollution / smog\n\n\nThese factors cause an attenuated receiver signal and lead to higher bit error ratio (BER). To overcome these issues, vendors found some solutions, like multi-beam or multi-path architectures, which use more than one sender and more than one receiver. Some state-of-the-art devices also have larger fade margin (extra power, reserved for rain, smog, fog). To keep an eye-safe environment, good FSO systems have a limited laser power density and support laser classes 1 or 1M. Atmospheric and fog attenuation, which are exponential in nature, limit practical range of FSO devices to several kilometres. However the free space optics, based on 1550 nm wavelength, have considerably lower optical loss than free space optics, using 830 nm wavelength, in dense fog conditions. FSO using wavelength 1550 nm system are capable of transmitting several times higher power than systems with 850 nm and are at the same time safe to the human eye (1M class). Additionally, some free space optics, such as EC SYSTEM,[38] ensure higher connection reliability in bad weather conditions by constantly monitoring link quality to regulate laser diode transmission power with built-in automatic gain control.[38]\n\n\nSee also[edit]\n\n\tAtomic line filter#Laser tracking and communication\n\tExtremely high frequency\n\tKORUZA\n\tLaser safety\n\tMie scattering\n\tModulating retro-reflector\n\tN-slit interferometer\n\tOptical window\n\tRadio window\n\tRayleigh scattering\n\n\nReferences[edit]\n\n\n\t^ \"Book X\". The Histories of Polybius. 1889. pp. 43–46.\n\n\t^ Mary Kay Carson (2007). Alexander Graham Bell: Giving Voice To The World. Sterling Biographies. New York: Sterling Publishing. pp. 76–78. ISBN 978-1-4027-3230-0.\n\n\n\t^ \nAlexander Graham Bell (October 1880). \"On the Production and Reproduction of Sound by Light\". American Journal of Science, Third Series. XX (118): 305–324.\n also published as \"Selenium and the Photophone\" in Nature, September 1880.\n\n\t^ \"German, WWII, WW2, Lichtsprechgerät 80/80\". LAUD Electronic Design AS. Archived from the original on July 24, 2011. Retrieved June 28, 2011.\n\n\n\t^ Schütz, Andreas; Giggenbach, Dirk (10 November 2008). \"DLR communicates with TerraSAR-X Earth Observation satellite via laser beam\". DLR Portal. Deutsches Zentrum für Luft und Raumfahrt (DLR) - German Aerospace Center. Retrieved 14 March 2018.\n\n\n\t^ \"TereScope 10GE\". MRV Terescope. Archived from the original on 2014-08-18. Retrieved October 27, 2014.\n\n\n\t^ a b An end-of-life notice was posted suddenly and briefly on the MRV Terescope product page in 2011. All references to the Terescope have been completely removed from MRV's official page as of October 27, 2014.\n\n\t^ \"10 Gbps Through The Air\". Arto Link. Retrieved October 27, 2014. new Artolink wireless communication system with the highest capacity: 10 Gbps, full duplex [..] Artolink M1-10GE model\n\n\n\t^ \"LightPointe main page\". Retrieved October 27, 2014.\n\n\n\t^ Miloš Wimmer (13 August 2007). \"MRV TereScope 700/G Laser Link\". CESNET. Retrieved October 27, 2014.\n\n\n\t^ Eric Korevaar, Isaac I. Kim and Bruce McArthur (2001). \"Atmospheric Propagation Characteristics of Highest Importance to Commercial Free Space Optics\" (PDF). Optical Wireless Communications IV, SPIE Vol. 4530 p. 84. Retrieved October 27, 2014.\n\n\n\t^ Tom Garlington, Joel Babbitt and George Long (March 2005). \"Analysis of Free Space Optics as a Transmission Technology\" (PDF). WP No. AMSEL-IE-TS-05001. US Army Information Systems Engineering Command. p. 3. Archived from the original (PDF) on June 13, 2007. Retrieved June 28, 2011.\n\n\n\t^ Bhowal, A.; Kshetrimayum, R. S. (2019). \"Outage Probability Bound of Decode and Forward Two Way Relay employing Optical Spatial Modulation over Gamma-Gamma Channels\". IET Optoelectronics. 13 (4): 183–190. doi:10.1049/iet-opt.2018.5103.\n\n\n\t^ US Federal Employees. \"$86.5M in FY2008 & 2009, Page 350 Department of Defense Fiscal Year (FY) 2010 Budget Estimates, May 2009, Defense Advanced Research Projects Agency, Justification Book Volume 1, Research, Development, Test & Evaluation, Defense-Wide, Fiscal Year (FY) 2010\" (PDF). Retrieved October 4, 2014.CS1 maint: uses authors parameter (link)\n\n\n\t^ US Federal Employees. \"US$40.5M in 2010 & 2011, page 273, Department of Defense, Fiscal Year (FY) 2012 Budget Estimates, February 2011, Defense Advanced Research Projects Agency, Justification Book Volume 1, Research, Development, Test & Evaluation, Defense-Wide, Fiscal Year (FY) 2012 Budget Estimates\". Retrieved October 4, 2014.CS1 maint: uses authors parameter (link)\n\n\n\t^ US Federal Employees. \"US$5.9M in 2012, page 250, Department of Defense, Fiscal Year (FY) 2014 President's Budget Submission, April 2013, Defense Advanced Research Projects Agency, Justification Book Volume 1, Research, Development, Test & Evaluation, Defense-Wide\". Archived from the original on October 25, 2016. Retrieved October 4, 2014.CS1 maint: uses authors parameter (link)\n\n\n\t^ Bruce V. Bigelow (June 16, 2006). \"Zapped of its potential, Rooftop laser startups falter, but debate on high-speed data technology remains\". Retrieved October 26, 2014.CS1 maint: uses authors parameter (link)\n\n\n\t^ Nancy Gohring (March 27, 2000). \"TeraBeam's Light Speed; Telephony, Vol. 238 Issue 13, p16\". Retrieved October 27, 2014.\n\n\n\t^ Fred Dawson (May 1, 2000). \"TeraBeam, Lucent Extend Bandwidth Limits, Multichannel News, Vol 21 Issue 18 Pg 160\". Retrieved October 27, 2014.\n\n\n\t^ Terabeam\n\n\t^ \"LightPointe Website\". Retrieved October 27, 2014.\n\n\n\t^ Robert F. Service (21 December 2001). \"Hot New Beam May Zap Bandwidth Bottleneck\". Retrieved 27 October 2014.\n\n\n\t^ \"CableFree UNITY Website\". Retrieved September 28, 2016.\n\n\n\t^ Fog Optics staff (20 November 2014). \"Fog Laser Field Test\" (PDF). Archived from the original (PDF) on 2015-04-26. Retrieved 21 December 2014.\n\n\n\t^ \"NASA Beams Mona Lisa to Lunar Reconnaissance Orbiter at the Moon\". NASA. January 17, 2013. Archived from the original on April 19, 2018. Retrieved May 23, 2018.\n\n\n\t^ \"Changelog of Twibright Labs Products\". ronja.twibright.com. Retrieved 14 March 2018.\n\n\n\t^ http://www.bizjournals.com/prnewswire/press_releases/2013/01/17/BR44159\n\n\t^ \"Visible Light Communication Consortium\". web site. Archived from the original on April 6, 2004.\n (Japanese)\n\n\t^ Tanaka, Y.; Haruyama, S.; Nakagawa, M.; , \"Wireless optical transmissions with white colored LED for wireless home links,\" Personal, Indoor and Mobile Radio Communications, 2000. PIMRC 2000. The 11th IEEE International Symposium on, vol. 2, no., pp. 1325–1329 vol.2, 2000.\n\n\t^ \"IEEE 802.15 WPAN Task Group 7 (TG7) Visible Light Communication\". IEEE 802 local and metro area network standards committee. 2009. Retrieved June 28, 2011.\n\n\n\t^ Kari Petrie (November 19, 2010). \"City first to sign on to new technology\". St. Cloud Times. p. 1.\n\n\n\t^ Clint Turner (October 3, 2007). \"A 173-mile 2-way all-electronic optical contact\". Modulated light web site. Retrieved June 28, 2011.\n\n\n\t^ J. Grubor; S. Randel; K.-D. Langer; J. W. Walewski (December 15, 2008). \"Broadband Information Broadcasting Using LED-Based Interior Lighting\". Journal of Lightwave Technology. 26 (24): 3883–3892. Bibcode:2008JLwT...26.3883G. doi:10.1109/JLT.2008.928525.\n\n\n\t^ \"500 Megabits/Second with White LED Light\". news release. Siemens. January 18, 2010. Archived from the original on March 11, 2013. Retrieved February 2, 2013.\n\n\n\t^ Lee, I.E.; Sim, M.L.; Kung, F.W.L.; , \"Performance enhancement of outdoor visible-light communication system using selective combining receiver,\" Optoelectronics, IET , vol. 3, no. 1, pp. 30–39, February 2009.\n\n\t^ \"Pure LiFi transmits data using light\". web site.\n (English)\n\n\t^ Jing Xue, Alok Garg, Berkehan Ciftcioglu, Jianyun Hu, Shang Wang, Ioannis Savidis, Manish Jain, Rebecca Berman, Peng Liu, Michael Huang, Hui Wu, Eby G. Friedman, Gary W. Wicks, Duncan Moore (June 2010). \"An Intra-Chip Free-Space Optical Interconnect\" (PDF). The 37th International Symposium on Computer Architecture. Retrieved June 30, 2011.CS1 maint: uses authors parameter (link)\n\n\n\t^ a b [1], PragueBest s.r.o. \"Free Space optics (FSO) with capacity 10 Gigabits Full Duplex - EC System\". www.ecsystem.cz. Retrieved 14 March 2018.\n\n\n\n\n\nFurther reading[edit]\n\n\tChristos Kontogeorgakis (May 1997). Millimeter Through Visible Frequency Waves Through Aerosols-Particle Modeling, Reflectivity and Attenuation (PDF). Virginia Polytechnic Institute and State University.\n Master's Thesis\n\tHeinz Willebrand & Baksheesh Ghuman (December 2001). Free Space Optics: Enabling Optical Connectivity in Today's Networks. SAMS. Archived from the original on 2012-06-22.\n\n\tMoll, Florian (December 2013). \"Free-space laser system for secure air-to-ground quantum communications\". SPIE Newsroom. doi:10.1117/2.1201311.005189.\n\n\tDavid G. Aviv (2006). Laser Space Communications. ARTECH HOUSE. ISBN 978-1-59693-028-5.\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Free Space Optics.\n\n\n\tFree Space Optics on COST297 for HAPs\n\tExplanation of Fresnel zones in microwave and optical links\n\tvideo showing Lichtsprechgerät 80 in use on YouTube\n\tInternational Space Station to Beam Video Via Laser Back to Earth, March 2014 NASA's Optical Payload for Lasercomm Science demonstration mission to the ISS\n\tWireless Optical Link Budget (with python examples).\n\n\n\t\tv\n\tt\n\te\n\n\nOptical telecommunication\n\n\tBasic\t\n\tSmoke signal\n\tBeacon\n\tHydraulic telegraph\n\tShips' flags\n\tSemaphore line\n\tHeliograph\n\tSignal lamp\n\tPhotophone\n\n\n\n\n\tAdvanced\t\n\tFiber-optics\n\tOptical fiber\n\tCable\n\tConnectors\n\n\n\n\n\tOptical wireless\n\tFree-space\n\tVisible light\n\tLi-Fi\n\tIn space\n\tConsumer IR\n\n\n\tOptical Transport Network\n\n\n\n\n\tTechnologies\t\n\tOC Rates\n\tIntensity modulation\n\tModulating retro-reflector\n\n\n\n\n\t\n\t Category\n\t Portal\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nTelecommunications\n\n\tHistory\t\n\tBeacon\n\tBroadcasting\n\tCable protection system\n\tCable TV\n\tCommunications satellite\n\tComputer network\n\tDrums\n\tElectrical telegraph\n\tFax\n\tHeliographs\n\tHydraulic telegraph\n\tInternet\n\tMass media\n\tMobile phone\n\tOptical telecommunication\n\tOptical telegraphy\n\tPager\n\tPhotophone\n\tPrepaid mobile phone\n\tRadio\n\tRadiotelephone\n\tSatellite communications\n\tSemaphore\n\tSmartphone\n\tSmoke signals\n\tTelecommunications history\n\tTelautograph\n\tTelegraphy\n\tTeleprinter (teletype)\n\tTelephone\n\tThe Telephone Cases\n\tTelevision\n\tUndersea telegraph line\n\tVideoconferencing\n\tVideophone\n\tVideotelephony\n\tWhistled language\n\n\n\n\t\n\n\tPioneers\t\n\tEdwin Howard Armstrong\n\tJohn Logie Baird\n\tPaul Baran\n\tAlexander Graham Bell\n\tTim Berners-Lee\n\tJagadish Chandra Bose\n\tVint Cerf\n\tClaude Chappe\n\tDonald Davies\n\tLee de Forest\n\tPhilo Farnsworth\n\tReginald Fessenden\n\tElisha Gray\n\tErna Schneider Hoover\n\tCharles K. Kao\n\tHedy Lamarr\n\tInnocenzo Manzetti\n\tGuglielmo Marconi\n\tAntonio Meucci\n\tRadia Perlman\n\tAlexander Stepanovich Popov\n\tJohann Philipp Reis\n\tHenry Sutton\n\tNikola Tesla\n\tCamille Tissot\n\tAlfred Vail\n\tCharles Wheatstone\n\tVladimir K. Zworykin\n\n\n\n\n\tTransmission\nmedia\t\n\tCoaxial cable\n\tFiber-optic communication\n\tOptical fiber\n\n\n\tFree-space optical communication\n\tMolecular communication\n\tRadio waves\n\tTransmission line\n\n\n\n\n\tNetwork topology\nand switching\t\n\tLinks\n\tNodes\n\tTerminal node\n\tNetwork switching (circuit\n\tpacket)\n\tTelephone exchange\n\n\n\n\n\tMultiplexing\t\n\tSpace-division\n\tFrequency-division\n\tTime-division\n\tPolarization-division\n\tOrbital angular-momentum\n\tCode-division\n\n\n\n\n\tNetworks\t\n\tARPANET\n\tBITNET\n\tCellular network\n\tComputer\n\tCYCLADES\n\tEthernet\n\tFidoNet\n\tInternet\n\tInternet2\n\tISDN\n\tLAN\n\tMobile\n\tNGN\n\tNPL network\n\tPublic Switched Telephone\n\tRadio\n\tTelecommunications equipment\n\tTelevision\n\tTelex\n\tWAN\n\tWireless network\n\tWorld Wide Web\n\n\n\n\n\t\n\t Category\n\t Outline\n\t Portal\n\t Commons\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Free-space_optical_communication&oldid=917596081\"\n\n\t\t\n\t\tCategories: \tTelecommunications equipment\n\tOptical communications\n\tLaser communication in space\n\n\nHidden categories: \tCS1 maint: uses authors parameter\n\tUse American English from March 2019\n\tAll Wikipedia articles written in American English\n\tArticles with short description\n\tArticles containing German-language text\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from May 2014\n\tArticles containing potentially dated statements from October 2014\n\tAll articles containing potentially dated statements\n\tArticles with unsourced statements from November 2016\n\tArticles with unsourced statements from May 2013\n\tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCatalà\n\tDeutsch\n\tEspañol\n\tFrançais\n\tBahasa Indonesia\n\tItaliano\n\tPolski\n\tRomână\n\tРусский\n\tSuomi\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 24 September 2019, at 15:22 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Free-space optical communication - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/FSO-gigabit-laser-link-0a.jpg/1200px-FSO-gigabit-laser-link-0a.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-free-space_optical_communication", "title": "Free-space optical communication - Wikipedia"}}