{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFrequency - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tFrequency\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Frequencies)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tNumber of occurrences or cycles per unit time\n\nFor other uses, see Frequency (disambiguation).\n\n\"Frequencies\" redirects here. For the film, see Frequencies (film). For the album, see Frequencies (album).\n\nFor broader coverage of this topic, see Temporal rate.\n\n\tfrequency\n\tCommon symbols\n\tf, ν\n\tSI unit\tHz\n\tIn SI base units\ts−1\n\n\nFrequency is the number of occurrences of a repeating event per unit of time.[1] It is also referred to as temporal frequency, which emphasizes the contrast to spatial frequency and angular frequency. The period is the duration of time of one cycle in a repeating event, so the period is the reciprocal of the frequency.[2]  For example: if a newborn baby's heart beats at a frequency of 120 times a minute, its period—the time interval between beats—is half a second (60 seconds divided by 120 beats). Frequency is an important parameter used in science and engineering to specify the rate of oscillatory and vibratory phenomena, such as mechanical vibrations, audio signals (sound), radio waves, and light.\n\n\nContents\n\n\n\t1 Definitions\n\t2 Units\n\t3 Period versus frequency\n\t4 Related types of frequency\n\t5 In wave propagation\n\t6 Measurement\n\t6.1 Counting\n\t6.2 Stroboscope\n\t6.3 Frequency counter\n\t6.4 Heterodyne methods\n\n\n\n\t7 Examples\n\t7.1 Light\n\t7.2 Sound\n\t7.3 Line current\n\n\n\n\t8 See also\n\t9 References\n\t10 Further reading\n\t11 External links\n\n\n\n\n\nDefinitions[edit]\n\n  \nThese three dots are flashing, or cycling, periodically—from lowest frequency (0.5 hertz) to highest frequency (2.0 hertz), top to bottom. For each flashing dot: \"f\" is the frequency in hertz, (Hz)—or the number of events per second (cycles per second)—that the dot flashes; while \"T\" is the period, or time, in seconds (s) of each cycle, (the number of seconds per cycle). Note T and f are reciprocal values to each other.\n\n\n\n  \nAs time elapses—here moving left to right on the horizontal axis—the five sinusoidal waves vary, or cycle, regularly at different rates. The red wave (top) has the lowest frequency (cycles at the slowest rate) while the purple wave (bottom) has the highest frequency (cycles at the fastest rate).\n\n\n\nFor cyclical processes, such as rotation, oscillations, or waves, frequency is defined as a number of cycles per unit time. In physics and engineering disciplines, such as optics, acoustics, and radio, frequency is usually denoted by a Latin letter f or by the Greek letter \n  \n    \n      \n        ν\n      \n    \n    {\\displaystyle \\nu }\n  \n or ν (nu) (see e.g. Planck's formula).\n\nThe relation between the frequency and the period \n  \n    \n      \n        T\n      \n    \n    {\\displaystyle T}\n  \n of a repeating event or oscillation is given by\n\n\n\t\n  \n    \n      \n        f\n        =\n        \n          \n            1\n            T\n          \n        \n        .\n      \n    \n    {\\displaystyle f={\\frac {1}{T}}.}\n  \n\n\n\nUnits[edit]\n\nThe SI derived unit of frequency is the hertz (Hz), named after the German physicist Heinrich Hertz. One hertz means that an event repeats once per second. If a TV has a refresh rate of 1 hertz the TV's screen will change (or refresh) its picture once a second. A previous name for this unit was cycles per second (cps). The SI unit for period is the second.\n\nA traditional unit of measure used with rotating mechanical devices is revolutions per minute, abbreviated r/min or rpm. 60 rpm equals one hertz.[3]\n\n\nPeriod versus frequency[edit]\n\nAs a matter of convenience, longer and slower waves, such as ocean surface waves, tend to be described by wave period rather than frequency. Short and fast waves, like audio and radio, are usually described by their frequency instead of period. These commonly used conversions are listed below:\n\n\n\tFrequency\n\t1 mHz (10−3 Hz)\n\t1 Hz (100 Hz)\n\t1 kHz (103 Hz)\n\t1 MHz (106 Hz)\n\t1 GHz (109 Hz)\n\t1 THz (1012 Hz)\n\n\tPeriod\n\t1 ks (103 s)\n\t1 s (100 s)\n\t1 ms (10−3 s)\n\t1 µs (10−6 s)\n\t1 ns (10−9 s)\n\t1 ps (10−12 s)\n\n\n\nRelated types of frequency[edit]\n\nFor other uses, see Frequency (disambiguation).\n\n  \nDiagram of the relationship between the different types of frequency and other wave properties.\n\n\n\n\tAngular frequency, usually denoted by the Greek letter ω (omega), is defined as the rate of change of angular displacement, θ, (during rotation), or the rate of change of the phase of a sinusoidal waveform (notably in oscillations and waves), or as the rate of change of the argument to the sine function:\n\n\n\t\t\n  \n    \n      \n        y\n        (\n        t\n        )\n        =\n        sin\n        ⁡\n        \n          (\n          \n            θ\n            (\n            t\n            )\n          \n          )\n        \n        =\n        sin\n        ⁡\n        (\n        ω\n        t\n        )\n        =\n        sin\n        ⁡\n        (\n        2\n        \n          π\n        \n        f\n        t\n        )\n      \n    \n    {\\displaystyle y(t)=\\sin \\left(\\theta (t)\\right)=\\sin(\\omega t)=\\sin(2\\mathrm {\\pi } ft)}\n  \n\n\n\n\n\n\t\t\n  \n    \n      \n        \n          \n            \n              \n                d\n              \n              θ\n            \n            \n              \n                d\n              \n              t\n            \n          \n        \n        =\n        ω\n        =\n        2\n        \n          π\n        \n        f\n      \n    \n    {\\displaystyle {\\frac {\\mathrm {d} \\theta }{\\mathrm {d} t}}=\\omega =2\\mathrm {\\pi } f}\n  \n\n\n\n\n\n\tAngular frequency is commonly measured in radians per second (rad/s) but, for discrete-time signals, can also be expressed as radians per sampling interval, which is a dimensionless quantity.  Angular frequency (in radians) is larger than regular frequency (in Hz) by a factor of 2π.\n\n\n\tSpatial frequency is analogous to temporal frequency, but the time axis is replaced by one or more spatial displacement axes. E.g.:\n\n\n\t\t\n  \n    \n      \n        y\n        (\n        t\n        )\n        =\n        sin\n        ⁡\n        \n          (\n          \n            θ\n            (\n            t\n            ,\n            x\n            )\n          \n          )\n        \n        =\n        sin\n        ⁡\n        (\n        ω\n        t\n        +\n        k\n        x\n        )\n      \n    \n    {\\displaystyle y(t)=\\sin \\left(\\theta (t,x)\\right)=\\sin(\\omega t+kx)}\n  \n\n\n\n\n\n\t\t\n  \n    \n      \n        \n          \n            \n              \n                d\n              \n              θ\n            \n            \n              \n                d\n              \n              x\n            \n          \n        \n        =\n        k\n      \n    \n    {\\displaystyle {\\frac {\\mathrm {d} \\theta }{\\mathrm {d} x}}=k}\n  \n\n\n\n\n\n\tWavenumber, k, is the spatial frequency analogue of angular temporal frequency and is measured in radians per meter. In the case of more than one spatial dimension, wavenumber is a vector quantity.\n\n\nIn wave propagation [edit]\n\nFurther information: Wave propagation\n\nFor periodic waves in nondispersive media (that is, media in which the wave speed is independent of frequency), frequency has an inverse relationship to the wavelength, λ (lambda). Even in dispersive media, the frequency f of a sinusoidal wave is equal to the phase velocity v of the wave divided by the wavelength λ of the wave:\n\n\n\t\n  \n    \n      \n        f\n        =\n        \n          \n            v\n            λ\n          \n        \n        .\n      \n    \n    {\\displaystyle f={\\frac {v}{\\lambda }}.}\n  \n\n\n\nIn the special case of electromagnetic waves moving through a vacuum, then v = c, where c is the speed of light in a vacuum, and this expression becomes:\n\n\n\t\n  \n    \n      \n        f\n        =\n        \n          \n            c\n            λ\n          \n        \n        .\n      \n    \n    {\\displaystyle f={\\frac {c}{\\lambda }}.}\n  \n\n\n\nWhen waves from a monochrome source travel from one medium to another, their frequency remains the same—only their wavelength and speed change.\n\n\nMeasurement[edit]\n\nSee also: Frequency meter\n\nMeasurement of frequency can be done in the following ways,\n\n\nCounting[edit]\n\nCalculating the frequency of a repeating event is accomplished by counting the number of times that event occurs within a specific time period, then dividing the count by the length of the time period. For example, if 71 events occur within 15 seconds the frequency is:\n\n\n\t\n  \n    \n      \n        f\n        =\n        \n          \n            71\n            \n              15\n              \n              \n                s\n              \n            \n          \n        \n        ≈\n        4.73\n        \n        \n          Hz\n        \n      \n    \n    {\\displaystyle f={\\frac {71}{15\\,{\\text{s}}}}\\approx 4.73\\,{\\text{Hz}}}\n  \n\n\n\nIf the number of counts is not very large, it is more accurate to measure the time interval for a predetermined number of occurrences, rather than the number of occurrences within a specified time.[4]  The latter method introduces a random error into the count of between zero and one count, so on average half a count. This is called gating error and causes an average error in the calculated frequency of \n  \n    \n      \n        Δ\n        f\n        =\n        \n          \n            1\n            \n              2\n              \n                T\n                \n                  m\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle \\Delta f={\\frac {1}{2T_{m}}}}\n  \n, or a fractional error of \n  \n    \n      \n        \n          \n            \n              Δ\n              f\n            \n            f\n          \n        \n        =\n        \n          \n            1\n            \n              2\n              f\n              \n                T\n                \n                  m\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\frac {\\Delta f}{f}}={\\frac {1}{2fT_{m}}}}\n  \n where \n  \n    \n      \n        \n          T\n          \n            m\n          \n        \n      \n    \n    {\\displaystyle T_{m}}\n  \n is the timing interval and \n  \n    \n      \n        f\n      \n    \n    {\\displaystyle f}\n  \n is the measured frequency. This error decreases with frequency, so it is generally a problem at low frequencies where the number of counts N is small.\n\n\n\n\n\n\n\n\nA resonant-reed frequency meter, an obsolete device used from about 1900 to the 1940s for measuring the frequency of alternating current.  It consists of a strip of metal with reeds of graduated lengths, vibrated by an electromagnet.  When the unknown frequency is applied to the electromagnet, the reed which is resonant at that frequency will vibrate with large amplitude, visible next to the scale.\n\n\n\n\nStroboscope[edit]\n\nAn older method of measuring the frequency of rotating or vibrating objects is to use a stroboscope. This is an intense repetitively flashing light (strobe light) whose frequency can be adjusted with a calibrated timing circuit. The strobe light is pointed at the rotating object and the frequency adjusted up and down. When the frequency of the strobe equals the frequency of the rotating or vibrating object, the object completes one cycle of oscillation and returns to its original position between the flashes of light, so when illuminated by the strobe the object appears stationary. Then the frequency can be read from the calibrated readout on the stroboscope. A downside of this method is that an object rotating at an integral multiple of the strobing frequency will also appear stationary.\n\n\nFrequency counter[edit]\n\nMain article: Frequency counter\n\n  \nModern frequency counter\n\n\n\nHigher frequencies are usually measured with a frequency counter. This is an electronic instrument which measures the frequency of an applied repetitive electronic signal and displays the result in hertz on a digital display. It uses digital logic to count the number of cycles during a time interval established by a precision quartz time base. Cyclic processes that are not electrical in nature, such as the rotation rate of a shaft, mechanical vibrations, or sound waves, can be converted to a repetitive electronic signal by transducers and the signal applied to a frequency counter. As of 2018, frequency counters can cover the range up to about 100 GHz. This represents the limit of direct counting methods; frequencies above this must be measured by indirect methods.\n\n\nHeterodyne methods[edit]\n\nAbove the range of frequency counters, frequencies of electromagnetic signals are often measured indirectly by means of heterodyning (frequency conversion). A reference signal of a known frequency near the unknown frequency is mixed with the unknown frequency in a nonlinear mixing device such as a diode. This creates a heterodyne or \"beat\" signal at the difference between the two frequencies.  If the two signals are close together in frequency the heterodyne is low enough to be measured by a frequency counter. This process only measures the difference between the unknown frequency and the reference frequency. To reach higher frequencies, several stages of heterodyning can be used. Current research is extending this method to infrared and light frequencies (optical heterodyne detection).\n\n\nExamples[edit]\n\nLight[edit]\n\nMain articles: Light and Electromagnetic radiation\n\n  \nComplete spectrum of electromagnetic radiation with the visible portion highlighted\n\n\n\nVisible light is an electromagnetic wave, consisting of oscillating electric and magnetic fields traveling through space. The frequency of the wave determines its color: 4×1014 Hz is red light, 8×1014 Hz is violet light, and between these (in the range 4-8×1014 Hz) are all the other colors of the visible spectrum. An electromagnetic wave can have a frequency less than 4×1014 Hz, but it will be invisible to the human eye; such waves are called infrared (IR) radiation. At even lower frequency, the wave is called a microwave, and at still lower frequencies it is called a radio wave. Likewise, an electromagnetic wave can have a frequency higher than 8×1014 Hz, but it will be invisible to the human eye; such waves are called ultraviolet (UV) radiation. Even higher-frequency waves are called X-rays, and higher still are gamma rays.\n\nAll of these waves, from the lowest-frequency radio waves to the highest-frequency gamma rays, are fundamentally the same, and they are all called electromagnetic radiation. They all travel through a vacuum at the same speed (the speed of light), giving them wavelengths inversely proportional to their frequencies.\n\n\n\t\n  \n    \n      \n        \n          c\n          =\n          f\n          λ\n        \n      \n    \n    {\\displaystyle \\displaystyle c=f\\lambda }\n  \n\n\n\nwhere c is the speed of light (c in a vacuum, or less in other media), f is the frequency and λ is the wavelength.\n\nIn dispersive media, such as glass, the speed depends somewhat on frequency, so the wavelength is not quite inversely proportional to frequency.\n\n\nSound[edit]\n\nMain article: Audio frequency\n\n  \nThe sound wave spectrum, with rough guide of some applications\n\n\n\nSound propagates as mechanical vibration waves of pressure and displacement, in air or other substances.[5]. In general, frequency components of a sound determine its \"color\", its timbre. When speaking about the frequency (in singular) of a sound, it means the property that most determines pitch.[6]\n\nThe frequencies an ear can hear are limited to a specific range of frequencies.  The audible frequency range for humans is typically given as being between about 20 Hz and 20,000 Hz (20 kHz), though the high frequency limit usually reduces with age. Other species have different hearing ranges. For example, some dog breeds can perceive vibrations up to 60,000 Hz.[7]\n\nIn many media, such as air, the speed of sound is approximately independent of frequency, so the wavelength of the sound waves (distance between repetitions) is approximately inversely proportional to frequency.\n\n\nLine current[edit]\n\nMain article: Utility frequency\n\nIn Europe, Africa, Australia, Southern South America, most of Asia, and Russia, the frequency of the alternating current in household electrical outlets is 50 Hz (close to the tone G), whereas in North America and Northern South America, the frequency of the alternating current in household electrical outlets is 60 Hz (between the tones B♭ and B; that is, a minor third above the European frequency). The frequency of the 'hum' in an audio recording can show where the recording was made, in countries using a European, or an American, grid frequency.\n\n\nSee also[edit]\n\nSee also: Frequency (disambiguation) and Category:Units of frequency\n\n\n\tAperiodic frequency\n\tAudio frequency\n\tBandwidth (signal processing)\n\tCutoff frequency\n\tDownsampling\n\tElectronic filter\n\tFrequency band\n\tFrequency converter\n\tFrequency domain\n\tFrequency distribution\n\tFrequency extender\n\tFrequency grid\n\tFrequency modulation\n\tFrequency spectrum\n\tInteraction frequency\n\tNatural frequency\n\tNegative frequency\n\tPeriodicity (disambiguation)\n\tPink noise\n\tPreselector\n\tRadar signal characteristics\n\tSignaling (telecommunications)\n\tSpread spectrum\n\tSpectral component\n\tTransverter\n\tUpsampling\n\n\n\n\nReferences[edit]\n\n\n\t^ \"Definition of FREQUENCY\". Retrieved 3 October 2016.\n\n\t^ \"Definition of PERIOD\". Retrieved 3 October 2016.\n\n\n\t^ Davies, A. (1997). Handbook of Condition Monitoring: Techniques and Methodology. New York: Springer. ISBN 978-0-412-61320-3.\n\n\n\t^ Bakshi, K.A.; A.V. Bakshi; U.A. Bakshi (2008). Electronic Measurement Systems. US: Technical Publications. pp. 4–14. ISBN 978-81-8431-206-5.\n\n\n\t^ \"Definition of SOUND\". Retrieved 3 October 2016.\n\n\n\t^ Pilhofer, Michael (2007). Music Theory for Dummies. For Dummies. p. 97. ISBN 9780470167946.\n\n\n\t^ Elert, Glenn; Timothy Condon (2003). \"Frequency Range of Dog Hearing\". The Physics Factbook. Retrieved 2008-10-22.\n\n\n\n\n\n\nFurther reading[edit]\n\n\tGiancoli, D.C. (1988). Physics for Scientists and Engineers (2nd ed.). Prentice Hall. ISBN 978-0-13-669201-0.\n\n\n\nExternal links[edit]\n\n\t\tLook up frequency or often in Wiktionary, the free dictionary.\n\n\n\tConversion: frequency to wavelength and back\n\tConversion: period, cycle duration, periodic time to frequency\n\tKeyboard frequencies = naming of notes – The English and American system versus the German system\n\tTeaching resource for 14-16yrs on sound including frequency\n\tA simple tutorial on how to build a frequency meter\n\tFrequency – diracdelta.co.uk – JavaScript calculation.\n\tA frequency generator with sound, useful for hearing tests\n\n\n\t\tv\n\tt\n\te\n\n\nAcoustics\n\n\tEngineering\t\n\tArchitectural acoustics\n\tMonochord\n\tReverberation\n\tSoundproofing\n\tString vibration\n\tString resonance\n\n\n\n\n\n\t\t\n\tSpectrogram\n\n\n\n\n\tPsychoacoustics\t\n\tBark scale\n\tCombination tone\n\tEqual-loudness contour\n\tFletcher–Munson curves\n\n\n\tMel scale\n\tMissing fundamental\n\n\n\n\n\tFrequency and pitch\t\n\tBeat\n\tFormant\n\tFundamental frequency\n\tFrequency spectrum\n\tharmonic spectrum\n\n\n\tHarmonic\n\tSeries\n\tInharmonicity\n\n\n\tMersenne's laws\n\tOvertone\n\tResonance\n\tStanding wave\n\tNode\n\n\n\tSubharmonic\n\n\n\n\n\tAcousticians\t\n\tJohn Backus\n\tJens Blauert\n\tErnst Chladni\n\tHermann von Helmholtz\n\tFranz Melde\n\tMarin Mersenne\n\tWerner Meyer-Eppler\n\tLord Rayleigh\n\tJoseph Sauveur\n\tD. Van Holliday\n\tThomas Young\n\n\n\n\n\tRelated topics\t\n\tEcho\n\tInfrasound\n\tSound\n\tUltrasound\n\tMusical acoustics\n\tPiano\n\tViolin\n\n\n\n\n\n\n\t\n\t Category\n\n\n\n\n\n\n\n\tPhysics portal\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Frequency&oldid=919033745\"\n\n\t\t\n\t\tCategories: \tAcoustics\n\tMechanical vibrations\n\tPhysical quantities\n\tWave mechanics\n\tFilter frequency response\n\tTemporal rates\n\n\nHidden categories: \tArticles with short description\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tالعربية\n\tAragonés\n\tAsturianu\n\tAzərbaycanca\n\tتۆرکجه\n\tবাংলা\n\tBân-lâm-gú\n\tБашҡортса\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBoarisch\n\tBosanski\n\tCatalà\n\tЧӑвашла\n\tCebuano\n\tČeština\n\tChiShona\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tFrysk\n\tGaeilge\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tInterlingua\n\tÍslenska\n\tItaliano\n\tעברית\n\tქართული\n\tҚазақша\n\tKiswahili\n\tKreyòl ayisyen\n\tKurdî\n\tКыргызча\n\tLatina\n\tLatviešu\n\tLietuvių\n\tMagyar\n\tМакедонски\n\tMalagasy\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tМонгол\n\tNederlands\n\tनेपाल भाषा\n\t日本語\n\tНохчийн\n\tNordfriisk\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tOromoo\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tپښتو\n\tPlattdüütsch\n\tPolski\n\tPortuguês\n\tRomână\n\tRuna Simi\n\tРусиньскый\n\tРусский\n\tसंस्कृतम्\n\tScots\n\tShqip\n\tSicilianu\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tТатарча/tatarça\n\tతెలుగు\n\tไทย\n\tТоҷикӣ\n\tᏣᎳᎩ\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tVèneto\n\tTiếng Việt\n\tWinaray\n\tWolof\n\t吴语\n\tייִדיש\n\t粵語\n\tŽemaitėška\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 October 2019, at 13:43 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Frequency - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-frequencies", "title": "Frequency - Wikipedia"}}