{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGamma ray - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\n\n\n\n\tGamma ray\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Gamma photon)\n\n\t\t\t\t\n\nThis is the latest accepted revision, reviewed on 25 September 2019.\n\n\n\n\n\n\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tEnergetic electromagnetic radiation arising from radioactive decay of atomic nuclei\n\n\n\n\nThis article is about the term's use in physics. For other uses, see Gamma ray (disambiguation).\n\n\nIllustration of an emission of a gamma ray (γ) from an atomic nucleus\n\n\n\nGamma rays are emitted during nuclear fission in nuclear explosions.\n\n\n\n\n\n  \nNASA guide to electromagnetic spectrum showing overlap of frequency between X-rays and gamma rays\n\n\n\nA gamma ray, or gamma radiation (symbol γ or \n  \n    \n      \n        γ\n      \n    \n    {\\displaystyle \\gamma }\n  \n), is a penetrating electromagnetic radiation arising from the radioactive decay of atomic nuclei. It consists of the shortest wavelength electromagnetic waves and so imparts the highest photon energy. Paul Villard, a French chemist and physicist, discovered gamma radiation in 1900 while studying radiation emitted by radium. In 1903, Ernest Rutherford named this radiation gamma rays based on their relatively strong penetration of matter; he had previously discovered two less penetrating types of decay radiation, which he named alpha rays and beta rays in ascending order of penetrating power.\n\nGamma rays from radioactive decay are in the energy range from a few kiloelectron volts (keV) to approximately 8 megaelectronvolts (~8 MeV), corresponding to the typical energy levels in nuclei with reasonably long lifetimes. The energy spectrum of gamma rays can be used to identify the decaying radionuclides using gamma spectroscopy. Very-high-energy gamma rays in the 100–1000 teraelectron volt (TeV) range have been observed from sources such as the Cygnus X-3 microquasar.\n\nNatural sources of gamma rays originating on Earth are mostly as a result of radioactive decay and secondary radiation from atmospheric interactions with cosmic ray particles. However, there are other rare natural sources, such as terrestrial gamma-ray flashes, which produce gamma rays from electron action upon the nucleus. Notable artificial sources of gamma rays include fission, such as that which occurs in nuclear reactors, and high energy physics experiments, such as neutral pion decay and nuclear fusion.\n\nGamma rays and X-rays are both electromagnetic radiation, and since they overlap in the electromagnetic spectrum, the terminology varies between scientific disciplines. In some fields of physics, they are distinguished by their origin: Gamma rays are created by nuclear decay, while in the case of X-rays, the origin is outside the nucleus. In astrophysics, gamma rays are conventionally defined as having photon energies above 100 keV and are the subject of gamma ray astronomy, while radiation below 100 keV is classified as X-rays and is the subject of X-ray astronomy. This convention stems from the early man-made X-rays, which had energies only up to 100 keV, whereas many gamma rays could go to higher energies. A large fraction of astronomical gamma rays are screened by Earth's atmosphere.\n\nGamma rays are ionizing radiation and are thus biologically hazardous. Due to their high penetration power, they can damage bone marrow and internal organs. Unlike alpha and beta rays, they pass easily through the body and thus pose a formidable radiation protection challenge, requiring shielding made from dense materials such as lead or concrete.\n\n\nContents\n\n\n\t1 History of discovery\n\t2 Sources\n\t2.1 Radioactive decay (gamma decay)\n\t2.1.1 Decay schemes\n\n\n\n\t2.2 Particle physics\n\t2.3 Gamma rays from sources other than radioactive decay\n\t2.3.1 Laboratory sources\n\t2.3.2 Terrestrial thunderstorms\n\t2.3.3 Solar flares\n\t2.3.4 Cosmic rays\n\t2.3.5 Pulsars and magnetars\n\t2.3.6 Quasars and active galaxies\n\t2.3.7 Gamma-ray bursts\n\n\n\n\n\n\n\t3 Properties\n\t3.1 Penetration of matter\n\t3.2 Matter interaction\n\t3.3 Light interaction\n\t3.4 Gamma spectroscopy\n\n\n\n\t4 Uses\n\t5 Health effects\n\t5.1 Body response\n\t5.2 Risk assessment\n\n\n\n\t6 Units of measurement and exposure\n\t7 Distinction from X-rays\n\t8 See also\n\t9 Notes\n\t10 References\n\t11 External links\n\n\n\n\n\nHistory of discovery[edit]\n\nThe first gamma ray source to be discovered was the radioactive decay process called gamma decay. In this type of decay, an excited nucleus emits a gamma ray almost immediately upon formation.[note 1] Paul Villard, a French chemist and physicist, discovered gamma radiation in 1900, while studying radiation emitted from radium. Villard knew that his described radiation was more powerful than previously described types of rays from radium, which included beta rays, first noted as \"radioactivity\" by Henri Becquerel in 1896, and alpha rays, discovered as a less penetrating form of radiation by Rutherford, in 1899. However, Villard did not consider naming them as a different fundamental type.[1][2] Later, in 1903, Villard's radiation was recognized as being of a type fundamentally different from previously named rays by Ernest Rutherford, who named Villard's rays \"gamma rays\" by analogy with the beta and alpha rays that Rutherford had differentiated in 1899.[3] The \"rays\" emitted by radioactive elements were named in order of their power to penetrate various materials, using the first three letters of the Greek alphabet: alpha rays as the least penetrating, followed by beta rays, followed by gamma rays as the most penetrating. Rutherford also noted that gamma rays were not deflected (or at least, not easily deflected) by a magnetic field, another property making them unlike alpha and beta rays.\n\nGamma rays were first thought to be particles with mass, like alpha and beta rays. Rutherford initially believed that they might be extremely fast beta particles, but their failure to be deflected by a magnetic field indicated that they had no charge.[4] In 1914, gamma rays were observed to be reflected from crystal surfaces, proving that they were electromagnetic radiation.[4] Rutherford and his co-worker Edward Andrade measured the wavelengths of gamma rays from radium, and found that they were similar to X-rays, but with shorter wavelengths and (thus) higher frequency. This was eventually recognized as giving them more energy per photon, as soon as the latter term became generally accepted. A gamma decay was then understood to usually emit a gamma photon.\n\n\nSources[edit]\n\nPlay media\n  \nThis animation tracks several gamma rays through space and time, from their emission in the jet of a distant blazar to their arrival in Fermi's Large Area Telescope (LAT).\n\n\n\nNatural sources of gamma rays on Earth include gamma decay from naturally occurring radioisotopes such as potassium-40, and also as a secondary radiation from various atmospheric interactions with cosmic ray particles. Some rare terrestrial natural sources that produce gamma rays that are not of a nuclear origin, are lightning strikes and terrestrial gamma-ray flashes, which produce high energy emissions from natural high-energy voltages. Gamma rays are produced by a number of astronomical processes in which very high-energy electrons are produced. Such electrons produce secondary gamma rays by the mechanisms of bremsstrahlung, inverse Compton scattering and synchrotron radiation. A large fraction of such astronomical gamma rays are screened by Earth's atmosphere. Notable artificial sources of gamma rays include fission, such as occurs in nuclear reactors, as well as high energy physics experiments, such as neutral pion decay and nuclear fusion.\n\nA sample of gamma ray-emitting material that is used for irradiating or imaging is known as a gamma source. It is also called a radioactive source, isotope source, or radiation source, though these more general terms also apply to alpha- and beta-emitting devices. Gamma sources are usually sealed to prevent radioactive contamination, and transported in heavy shielding.\n\n\nRadioactive decay (gamma decay)[edit]\n\nMain article: Nuclear isomer\n\nGamma rays are produced during gamma decay, which normally occurs after other forms of decay occur, such as alpha or beta decay. An excited nucleus can decay by the emission of an \nα\n or \nβ\n particle. The daughter nucleus that results is usually left in an excited state. It can then decay to a lower energy state by emitting a gamma ray photon, in a process called gamma decay.\n\nThe emission of a gamma ray from an excited nucleus typically requires only 10−12 seconds. Gamma decay may also follow nuclear reactions such as neutron capture, nuclear fission, or nuclear fusion. Gamma decay is also a mode of relaxation of many excited states of atomic nuclei following other types of radioactive decay, such as beta decay, so long as these states possess the necessary component of nuclear spin. When high-energy gamma rays, electrons, or protons bombard materials, the excited atoms emit characteristic \"secondary\" gamma rays, which are products of the creation of excited nuclear states in the bombarded atoms. Such transitions, a form of nuclear gamma fluorescence, form a topic in nuclear physics called gamma spectroscopy. Formation of fluorescent gamma rays are a rapid subtype of radioactive gamma decay.\n\nIn certain cases, the excited nuclear state that follows the emission of a beta particle or other type of excitation, may be more stable than average, and is termed a metastable excited state, if its decay takes (at least) 100 to 1000 times longer than the average 10−12 seconds. Such relatively long-lived excited nuclei are termed nuclear isomers, and their decays are termed isomeric transitions. Such nuclei have half-lifes that are more easily measurable, and rare nuclear isomers are able to stay in their excited state for minutes, hours, days, or occasionally far longer, before emitting a gamma ray. The process of isomeric transition is therefore similar to any gamma emission, but differs in that it involves the intermediate metastable excited state(s) of the nuclei. Metastable states are often characterized by high nuclear spin, requiring a change in spin of several units or more with gamma decay, instead of a single unit transition that occurs in only 10−12 seconds. The rate of gamma decay is also slowed when the energy of excitation of the nucleus is small.[5]\n\nAn emitted gamma ray from any type of excited state may transfer its energy directly to any electrons, but most probably to one of the K shell electrons of the atom, causing it to be ejected from that atom, in a process generally termed the photoelectric effect (external gamma rays and ultraviolet rays may also cause this effect). The photoelectric effect should not be confused with the internal conversion process, in which a gamma ray photon is not produced as an intermediate particle (rather, a \"virtual gamma ray\" may be thought to mediate the process).\n\n\nDecay schemes[edit]\n\n  \nRadioactive decay scheme of 60\nCo\n\n\n\n\n  \nGamma emission spectrum of cobalt-60\n\n\n\nOne example of gamma ray production due to radionuclide decay is the decay scheme for cobalt-60, as illustrated in the accompanying diagram. First, 60\nCo\n decays to excited 60\nNi\n by beta decay emission of an electron of 0.31 MeV. Then the excited 60\nNi\n decays to the ground state (see nuclear shell model) by emitting gamma rays in succession of 1.17 MeV followed by 1.33 MeV. This path is followed 99.88% of the time:\n\n\n\t\t60\n27Co\n \t→ \t60\n28Ni*\n \t+ \t\ne−\n \t+ \t\nν\ne \t+ \t\nγ\n \t+ \t1.17 MeV\n\n\t60\n28Ni*\n \t→ \t60\n28Ni\n \t \t \t \t \t+ \t\nγ\n \t+ \t1.33 MeV\n\n\n\n\n\nAnother example is the alpha decay of 241\nAm\n to form 237\nNp\n; which is followed by gamma emission. In some cases, the gamma emission spectrum of the daughter nucleus is quite simple, (e.g. 60\nCo\n/60\nNi\n) while in other cases, such as with (241\nAm\n/237\nNp\n and 192\nIr\n/192\nPt\n), the gamma emission spectrum is complex, revealing that a series of nuclear energy levels exist.\n\n\nParticle physics[edit]\n\nGamma rays are produced in many processes of particle physics. Typically, gamma rays are the products of neutral systems which decay through electromagnetic interactions (rather than a weak or strong interaction). For example, in an electron–positron annihilation, the usual products are two gamma ray photons. If the annihilating electron and positron are at rest, each of the resulting gamma rays has an energy of ~ 511 keV and frequency of ~ 1.24×1020 Hz. Similarly, a neutral pion most often decays into two photons. Many other hadrons and massive bosons also decay electromagnetically. High energy physics experiments, such as the Large Hadron Collider, accordingly employ substantial radiation shielding.[6] Because subatomic particles mostly have far shorter wavelengths than atomic nuclei, particle physics gamma rays are generally several orders of magnitude more energetic than nuclear decay gamma rays. Since gamma rays are at the top of the electromagnetic spectrum in terms of energy, all extremely high-energy photons are gamma rays; for example, a photon having the Planck energy would be a gamma ray.\n\n\nGamma rays from sources other than radioactive decay[edit]\n\nMain article: Gamma-ray astronomy\n\nA few gamma rays in astronomy are known to arise from gamma decay (see discussion of SN1987A), but most do not.\n\nPhotons from astrophysical sources that carry energy in the gamma radiation range are often explicitly called gamma-radiation. In addition to nuclear emissions, they are often produced by sub-atomic particle and particle-photon interactions. Those include electron-positron annihilation, neutral pion decay, bremsstrahlung, inverse Compton scattering, and synchrotron radiation.\n\n\nPlay media\n  \nThe red dots show some of the ~500 terrestrial gamma-ray flashes daily detected by the Fermi Gamma-ray Space Telescope through 2010. Credit: NASA/Goddard Space Flight Center.\n\n\n\nLaboratory sources[edit]\n\nIn October 2017, scientists from various European universities proposed a means for sources of GeV photons using lasers as exciters through a controlled interplay between the cascade and anomalous radiative trapping.[7]\n\n\nTerrestrial thunderstorms[edit]\n\nThunderstorms can produce a brief pulse of gamma radiation called a terrestrial gamma-ray flash. These gamma rays are thought to be produced by high intensity static electric fields accelerating electrons, which then produce gamma rays by bremsstrahlung as they collide with and are slowed by atoms in the atmosphere. Gamma rays up to 100 MeV can be emitted by terrestrial thunderstorms, and were discovered by space-borne observatories. This raises the possibility of health risks to passengers and crew on aircraft flying in or near thunderclouds.[8]\n\n\nSolar flares[edit]\n\nThe most effusive solar flares emit across the entire EM spectrum, including γ-rays. The first confident observation occurred in 1972.[9]\n\n\nCosmic rays[edit]\n\nExtraterrestrial, high energy gamma rays include the gamma ray background produced when cosmic rays (either high speed electrons or protons) collide with ordinary matter, producing pair-production gamma rays at 511 keV. Alternatively, bremsstrahlung are produced at energies of tens of MeV or more when cosmic ray electrons interact with nuclei of sufficiently high atomic number (see gamma ray image of the Moon at the beginning of this article, for illustration).\n\n\n  \nImage of entire sky in 100 MeV or greater gamma rays as seen by the EGRET instrument aboard the CGRO spacecraft. Bright spots within the galactic plane are pulsars while those above and below the plane are thought to be quasars.\n\n\n\nPulsars and magnetars[edit]\n\nThe gamma ray sky (see illustration at right) is dominated by the more common and longer-term production of gamma rays that emanate from pulsars within the Milky Way. Sources from the rest of the sky are mostly quasars. Pulsars are thought to be neutron stars with magnetic fields that produce focused beams of radiation, and are far less energetic, more common, and much nearer sources (typically seen only in our own galaxy) than are quasars or the rarer gamma-ray burst sources of gamma rays. Pulsars have relatively long-lived magnetic fields that produce focused beams of relativistic speed charged particles, which emit gamma rays (bremsstrahlung) when those strike gas or dust in their nearby medium, and are decelerated. This is a similar mechanism to the production of high-energy photons in megavoltage radiation therapy machines (see bremsstrahlung). Inverse Compton scattering, in which charged particles (usually electrons) impart energy to low-energy photons boosting them to higher energy photons. Such impacts of photons on relativistic charged particle beams is another possible mechanism of gamma ray production. Neutron stars with a very high magnetic field (magnetars), thought to produce astronomical soft gamma repeaters, are another relatively long-lived star-powered source of gamma radiation.\n\n\nQuasars and active galaxies[edit]\n\nMore powerful gamma rays from very distant quasars and closer active galaxies are thought to have a gamma ray production source similar to a particle accelerator. High energy electrons produced by the quasar, and subjected to inverse Compton scattering, synchrotron radiation, or bremsstrahlung, are the likely source of the gamma rays from those objects. It is thought that a supermassive black hole at the center of such galaxies provides the power source that intermittently destroys stars and focuses the resulting charged particles into beams that emerge from their rotational poles. When those beams interact with gas, dust, and lower energy photons they produce X-rays and gamma rays. These sources are known to fluctuate with durations of a few weeks, suggesting their relatively small size (less than a few light-weeks across). Such sources of gamma and X-rays are the most commonly visible high intensity sources outside our galaxy. They shine not in bursts (see illustration), but relatively continuously when viewed with gamma ray telescopes. The power of a typical quasar is about 1040 watts, a small fraction of which is gamma radiation. Much of the rest is emitted as electromagnetic waves of all frequencies, including radio waves.\n\n\n  \nA hypernova. Artist's illustration showing the life of a massive star as nuclear fusion converts lighter elements into heavier ones. When fusion no longer generates enough pressure to counteract gravity, the star rapidly collapses to form a black hole. Theoretically, energy may be released during the collapse along the axis of rotation to form a long duration gamma-ray burst.\n\n\n\nGamma-ray bursts[edit]\n\nSee also: Gamma-ray burst\n\nThe most intense sources of gamma rays, are also the most intense sources of any type of electromagnetic radiation presently known. They are the \"long duration burst\" sources of gamma rays in astronomy (\"long\" in this context, meaning a few tens of seconds), and they are rare compared with the sources discussed above. By contrast, \"short\" gamma-ray bursts of two seconds or less, which are not associated with supernovae, are thought to produce gamma rays during the collision of pairs of neutron stars, or a neutron star and a black hole.[10]\n\nThe so-called long-duration gamma-ray bursts produce a total energy output of about 1044 joules (as much energy as our Sun will produce in its entire life-time) but in a period of only 20 to 40 seconds. Gamma rays are approximately 50% of the total energy output. The leading hypotheses for the mechanism of production of these highest-known intensity beams of radiation, are inverse Compton scattering and synchrotron radiation from high-energy charged particles. These processes occur as relativistic charged particles leave the region of the event horizon of a newly formed black hole created during supernova explosion. The beam of particles moving at relativistic speeds are focused for a few tens of seconds by the magnetic field of the exploding hypernova. The fusion explosion of the hypernova drives the energetics of the process. If the narrowly directed beam happens to be pointed toward the Earth, it shines at gamma ray frequencies with such intensity, that it can be detected even at distances of up to 10 billion light years, which is close to the edge of the visible universe.\n\n\nProperties[edit]\n\nPenetration of matter[edit]\n\nSee also: Radiation protection § Electromagnetic radiation\n\n  \nAlpha radiation consists of helium nuclei and is readily stopped by a sheet of paper. Beta radiation, consisting of electrons or positrons, is stopped by an aluminum plate, but gamma radiation requires shielding by dense material such as lead or concrete.\n\n\n\nDue to their penetrating nature, gamma rays require large amounts of shielding mass to reduce them to levels which are not harmful to living cells, in contrast to alpha particles, which can be stopped by paper or skin, and beta particles, which can be shielded by thin aluminium. Gamma rays are best absorbed by materials with high atomic numbers and high density, which contribute to the total stopping power. Because of this, a lead (high Z) shield is 20–30% better as a gamma shield than an equal mass of another low-Z shielding material, such as aluminium, concrete, water, or soil; lead's major advantage is not in lower weight, but rather its compactness due to its higher density. Protective clothing, goggles and respirators can protect from internal contact with or ingestion of alpha or beta emitting particles, but provide no protection from gamma radiation from external sources.\n\nThe higher the energy of the gamma rays, the thicker the shielding made from the same shielding material is required. Materials for shielding gamma rays are typically measured by the thickness required to reduce the intensity of the gamma rays by one half (the half value layer or HVL). For example, gamma rays that require 1 cm (0.4″) of lead to reduce their intensity by 50% will also have their intensity reduced in half by 4.1 cm of granite rock, 6 cm (2½″) of concrete, or 9 cm (3½″) of packed soil. However, the mass of this much concrete or soil is only 20–30% greater than that of lead with the same absorption capability. Depleted uranium is used for shielding in portable gamma ray sources, but here the savings in weight over lead are larger, as a portable source is very small relative to the required shielding, so the shielding resembles a sphere to some extent. The volume of a sphere is dependent on the cube of the radius; so a source with its radius cut in half will have its volume (and weight) reduced by a factor of eight, which will more than compensate for uranium's greater density (as well as reducing bulk).[clarification needed] In a nuclear power plant, shielding can be provided by steel and concrete in the pressure and particle containment vessel, while water provides a radiation shielding of fuel rods during storage or transport into the reactor core. The loss of water or removal of a \"hot\" fuel assembly into the air would result in much higher radiation levels than when kept under water.\n\n\nMatter interaction[edit]\n\n  \nThe total absorption coefficient of aluminium (atomic number 13) for gamma rays, plotted versus gamma energy, and the contributions by the three effects. As is usual, the photoelectric effect is largest at low energies, Compton scattering dominates at intermediate energies, and pair production dominates at high energies.\n\n\n\n  \nThe total absorption coefficient of lead (atomic number 82) for gamma rays, plotted versus gamma energy, and the contributions by the three effects. Here, the photoelectric effect dominates at low energy. Above 5 MeV, pair production starts to dominate.\n\n\n\nWhen a gamma ray passes through matter, the probability for absorption is proportional to the thickness of the layer, the density of the material, and the absorption cross section of the material. The total absorption shows an exponential decrease of intensity with distance from the incident surface:\n\n\n\t\n  \n    \n      \n        I\n        (\n        x\n        )\n        =\n        \n          I\n          \n            0\n          \n        \n        ⋅\n        \n          e\n          \n            −\n            μ\n            x\n          \n        \n      \n    \n    {\\displaystyle I(x)=I_{0}\\cdot e^{-\\mu x}}\n  \n\n\n\nwhere x is the thickness of the material from the incident surface, μ= nσ is the absorption coefficient, measured in cm−1, n the number of atoms per cm3 of the material (atomic density) and σ the absorption cross section in cm2.\n\nAs it passes through matter, gamma radiation ionizes via three processes: the photoelectric effect, Compton scattering, and pair production.\n\n\n\tPhotoelectric effect: This describes the case in which a gamma photon interacts with and transfers its energy to an atomic electron, causing the ejection of that electron from the atom. The kinetic energy of the resulting photoelectron is equal to the energy of the incident gamma photon minus the energy that originally bound the electron to the atom (binding energy). The photoelectric effect is the dominant energy transfer mechanism for X-ray and gamma ray photons with energies below 50 keV (thousand electron volts), but it is much less important at higher energies.\n\tCompton scattering: This is an interaction in which an incident gamma photon loses enough energy to an atomic electron to cause its ejection, with the remainder of the original photon's energy emitted as a new, lower energy gamma photon whose emission direction is different from that of the incident gamma photon, hence the term \"scattering\". The probability of Compton scattering decreases with increasing photon energy. Compton scattering is thought to be the principal absorption mechanism for gamma rays in the intermediate energy range 100 keV to 10 MeV. Compton scattering is relatively independent of the atomic number of the absorbing material, which is why very dense materials like lead are only modestly better shields, on a per weight basis, than are less dense materials.\n\tPair production: This becomes possible with gamma energies exceeding 1.02 MeV, and becomes important as an absorption mechanism at energies over 5 MeV (see illustration at right, for lead). By interaction with the electric field of a nucleus, the energy of the incident photon is converted into the mass of an electron-positron pair. Any gamma energy in excess of the equivalent rest mass of the two particles (totaling at least 1.02 MeV) appears as the kinetic energy of the pair and in the recoil of the emitting nucleus. At the end of the positron's range, it combines with a free electron, and the two annihilate, and the entire mass of these two is then converted into two gamma photons of at least 0.51 MeV energy each (or higher according to the kinetic energy of the annihilated particles).\n\n\nThe secondary electrons (and/or positrons) produced in any of these three processes frequently have enough energy to produce much ionization themselves.\n\nAdditionally, gamma rays, particularly high energy ones, can interact with atomic nuclei resulting in ejection of particles in photodisintegration, or in some cases, even nuclear fission (photofission).\n\n\nLight interaction[edit]\n\nHigh-energy (from 80 GeV to ~10 TeV) gamma rays arriving from far-distant quasars are used to estimate the extragalactic background light in the universe: The highest-energy rays interact more readily with the background light photons and thus the density of the background light may be estimated by analyzing the incoming gamma ray spectra.[11][12]\n\n\nGamma spectroscopy[edit]\n\nMain article: Gamma spectroscopy\n\nGamma spectroscopy is the study of the energetic transitions in atomic nuclei, which are generally associated with the absorption or emission of gamma rays. As in optical spectroscopy (see Franck–Condon effect) the absorption of gamma rays by a nucleus is especially likely (i.e., peaks in a \"resonance\") when the energy of the gamma ray is the same as that of an energy transition in the nucleus. In the case of gamma rays, such a resonance is seen in the technique of Mössbauer spectroscopy. In the Mössbauer effect the narrow resonance absorption for nuclear gamma absorption can be successfully attained by physically immobilizing atomic nuclei in a crystal. The immobilization of nuclei at both ends of a gamma resonance interaction is required so that no gamma energy is lost to the kinetic energy of recoiling nuclei at either the emitting or absorbing end of a gamma transition. Such loss of energy causes gamma ray resonance absorption to fail. However, when emitted gamma rays carry essentially all of the energy of the atomic nuclear de-excitation that produces them, this energy is also sufficient to excite the same energy state in a second immobilized nucleus of the same type.\n\n\nUses[edit]\n\n  \nGamma-ray image of a truck with two stowaways taken with a VACIS (vehicle and container imaging system)\n\n\n\nGamma rays provide information about some of the most energetic phenomena in the universe; however, they are largely absorbed by the Earth's atmosphere. Instruments aboard high-altitude balloons and satellites missions, such as the Fermi Gamma-ray Space Telescope, provide our only view of the universe in gamma rays.\n\nGamma-induced molecular changes can also be used to alter the properties of semi-precious stones, and is often used to change white topaz into blue topaz.\n\nNon-contact industrial sensors commonly use sources of gamma radiation in refining, mining, chemicals, food, soaps and detergents, and pulp and paper industries, for the measurement of levels, density, and thicknesses [13]. Gamma-ray sensors are also used for measuring the fluid levels in water and oil industries [14]. Typically, these use Co-60 or Cs-137 isotopes as the radiation source.\n\nIn the US, gamma ray detectors are beginning to be used as part of the Container Security Initiative (CSI). These machines are advertised to be able to scan 30 containers per hour.\n\nGamma radiation is often used to kill living organisms, in a process called irradiation. Applications of this include the sterilization of medical equipment (as an alternative to autoclaves or chemical means), the removal of decay-causing bacteria from many foods and the prevention of the sprouting of fruit and vegetables to maintain freshness and flavor.\n\nDespite their cancer-causing properties, gamma rays are also used to treat some types of cancer, since the rays also kill cancer cells. In the procedure called gamma-knife surgery, multiple concentrated beams of gamma rays are directed to the growth in order to kill the cancerous cells. The beams are aimed from different angles to concentrate the radiation on the growth while minimizing damage to surrounding tissues.\n\nGamma rays are also used for diagnostic purposes in nuclear medicine in imaging techniques. A number of different gamma-emitting radioisotopes are used. For example, in a PET scan a radiolabeled sugar called fludeoxyglucose emits positrons that are annihilated by electrons, producing pairs of gamma rays that highlight cancer as the cancer often has a higher metabolic rate than the surrounding tissues. The most common gamma emitter used in medical applications is the nuclear isomer technetium-99m which emits gamma rays in the same energy range as diagnostic X-rays. When this radionuclide tracer is administered to a patient, a gamma camera can be used to form an image of the radioisotope's distribution by detecting the gamma radiation emitted (see also SPECT). Depending on which molecule has been labeled with the tracer, such techniques can be employed to diagnose a wide range of conditions (for example, the spread of cancer to the bones via bone scan).\n\n\nHealth effects[edit]\n\nSee also: Sievert\n\nGamma rays cause damage at a cellular level and are penetrating, causing diffuse damage throughout the body. However, they are less ionising than alpha or beta particles, which are less penetrating.\n\nLow levels of gamma rays cause a stochastic health risk, which for radiation dose assessment is defined as the probability of cancer induction and genetic damage.[15] High doses produce deterministic effects, which is the severity of acute tissue damage that is certain to happen. These effects are compared to the physical quantity absorbed dose measured by the unit gray (Gy).[16]\n\n\nBody response[edit]\n\nWhen gamma radiation breaks DNA molecules, a cell may be able to repair the damaged genetic material, within limits. However, a study of Rothkamm and Lobrich has shown that this repair process works well after high-dose exposure but is much slower in the case of a low-dose exposure.[17]\n\n\nRisk assessment[edit]\n\nThe natural outdoor exposure in the United Kingdom ranges from 0.1 to 0.5 µSv/h with significant increase around known nuclear and contaminated sites.[18] Natural exposure to gamma rays is about 1 to 2 mSv per year, and the average total amount of radiation received in one year per inhabitant in the USA is 3.6 mSv.[19] There is a small increase in the dose, due to naturally occurring gamma radiation, around small particles of high atomic number materials in the human body caused by the photoelectric effect.[20]\n\nBy comparison, the radiation dose from chest radiography (about 0.06 mSv) is a fraction of the annual naturally occurring background radiation dose.[21] A chest CT delivers 5 to 8 mSv. A whole-body PET/CT scan can deliver 14 to 32 mSv depending on the protocol.[22] The dose from fluoroscopy of the stomach is much higher, approximately 50 mSv (14 times the annual background).\n\nAn acute full-body equivalent single exposure dose of 1 Sv (1000 mSv) causes slight blood changes, but 2.0–3.5 Sv (2.0–3.5 Gy) causes very severe syndrome of nausea, hair loss, and hemorrhaging, and will cause death in a sizable number of cases—-about 10% to 35% without medical treatment. A dose of 5 Sv[23] (5 Gy) is considered approximately the LD50 (lethal dose for 50% of exposed population) for an acute exposure to radiation even with standard medical treatment. A dose higher than 5 Sv (5 Gy) brings an increasing chance of death above 50%. Above 7.5–10 Sv (7.5–10 Gy) to the entire body, even extraordinary treatment, such as bone-marrow transplants, will not prevent the death of the individual exposed (see radiation poisoning).[24] (Doses much larger than this may, however, be delivered to selected parts of the body in the course of radiation therapy.)\n\nFor low-dose exposure, for example among nuclear workers, who receive an average yearly radiation dose of 19 mSv,[clarification needed]  the risk of dying from cancer (excluding leukemia) increases by 2 percent. For a dose of 100 mSv, the risk increase is 10 percent. By comparison, risk of dying from cancer was increased by 32 percent for the survivors of the atomic bombing of Hiroshima and Nagasaki.[25]\n\n\nUnits of measurement and exposure[edit]\n\nThe following table shows radiation quantities in SI and non-SI units:\n\n\nIonising radiation related quantities view ‧ talk ‧ edit\n\tQuantity\tUnit\tSymbol\tDerivation\tYear\tSI equivalence\n\n\tActivity (A)\n\tbecquerel\n\tBq\n\ts−1\n\t1974\n\tSI unit\n\n\tcurie\n\tCi\n\t3.7 × 1010 s−1\n\t1953\n\t3.7×1010 Bq\n\n\trutherford\n\tRd\n\t106 s−1\n\t1946\n\t1,000,000 Bq\n\n\tExposure (X)\n\tcoulomb per kilogram\n\tC/kg\n\tC⋅kg−1 of air\n\t1974\n\tSI unit\n\n\tröntgen\n\tR\n\tesu / 0.001293 g of air\n\t1928\n\t2.58 × 10−4 C/kg\n\n\tAbsorbed dose (D)\n\tgray\n\tGy\n\tJ⋅kg−1\n\t1974\n\tSI unit\n\n\terg per gram\n\terg/g\n\terg⋅g−1\n\t1950\n\t1.0 × 10−4 Gy\n\n\trad\n\trad\n\t100 erg⋅g−1\n\t1953\n\t0.010 Gy\n\n\tDose equivalent (H)\n\tsievert\n\tSv\n\tJ⋅kg−1 × WR\n\t1977\n\tSI unit\n\n\tröntgen equivalent man\n\trem\n\t100 erg⋅g−1\n\t1971\n\t0.010 Sv\n\n\n\nThe measure of the ionizing effect of gamma and X-rays in dry air is called the exposure, for which a legacy unit, the röntgen was used from 1928. This has been replaced by kerma, now mainly used for instrument calibration purposes but not for received dose effect. The effect of gamma and other ionizing radiation on living tissue is more closely related to the amount of energy deposited in tissue rather than the ionisation of air, and replacement radiometric units and quantities for radiation protection have been defined and developed from 1953 onwards. These are:\n\n\n\tThe gray (Gy), is the SI unit of absorbed dose, which is the amount of radiation energy deposited in the irradiated material. For gamma radiation this is numerically equivalent to equivalent dose measured by the sievert, which indicates the stochastic biological effect of low levels of radiation on human tissue. The radiation weighting conversion factor from absorbed dose to equivalent dose is 1 for gamma, whereas alpha particles have a factor of 20, reflecting their greater ionising effect on tissue.\n\tThe rad is the deprecated CGS unit for absorbed dose and the rem is the deprecated CGS unit of equivalent dose, used mainly in the USA.\n\n\nDistinction from X-rays[edit]\n\n\tNuclear physics\n\t\n\t\nNucleus ·  Nucleons (p, n) ·  Nuclear matter ·  Nuclear force ·  Nuclear structure ·  Nuclear reaction\n\t\nModels of the nucleus\nLiquid drop ·  Nuclear shell model ·  Interacting boson model ·  Ab initio\n\n\n\t\nNuclides' classification\nIsotopes – equal Z\nIsobars – equal A\nIsotones – equal N\nIsodiaphers – equal N − Z\n     Isomers – equal all the above\nMirror nuclei – Z ↔ N\n\nStable ·  Magic ·  Even/odd ·  Halo\n\n\n\t\nNuclear stability\nBinding energy ·  p–n ratio ·  Drip line ·  Island of stability ·  Valley of stability\n\n\n\t\nRadioactive decay\nAlpha α ·  Beta β (2β, β+) ·  K/L capture ·  Isomeric (Gamma γ ·  Internal conversion) ·  Spontaneous fission ·  Cluster decay ·  Neutron emission ·  Proton emissionDecay energy ·  Decay chain ·  Decay product ·  Radiogenic nuclide\n\n\n\n\t\nNuclear fission\nSpontaneous ·  Products (pair breaking) ·  Photofission\n\n\n\t\nCapturing processes\nelectron (2×) ·  neutron (s ·  r) ·  proton (p ·  rp)\n\n\n\t\nHigh-energy processes\nSpallation (by cosmic ray) ·  Photodisintegration\n\n\n\t\nNucleosynthesis and\n nuclear astrophysics\nNuclear fusion\nProcesses: Stellar ·  Big Bang ·  Supernova\nNuclides: Primordial ·  Cosmogenic ·  Artificial\n\n\n\t\nHigh-energy nuclear physics\nQuark–gluon plasma ·  RHIC ·  LHC\n\n\n\t\nScientists\nAlvarez ·  Becquerel ·  Bethe ·  A. Bohr ·  N. Bohr ·  Chadwick ·  Cockcroft ·  Ir. Curie ·  Fr. Curie ·  Pi. Curie ·  Skłodowska-Curie ·  Davisson ·  Fermi ·  Hahn ·  Jensen ·  Lawrence ·  Mayer ·  Meitner ·  Oliphant ·  Oppenheimer ·  Proca ·  Purcell ·  Rabi ·  Rutherford ·  Soddy ·  Strassmann ·  Świątecki ·  Szilárd ·  Teller ·  Thomson ·  Walton ·  Wigner\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\n  \nIn practice, gamma ray energies overlap with the range of X-rays, especially in the higher-frequency region referred to as \"hard\" X-rays. This depiction follows the older convention of distinguishing by wavelength.\n\n\n\nThe conventional distinction between X-rays and gamma rays has changed over time. Originally, the electromagnetic radiation emitted by X-ray tubes almost invariably had a longer wavelength than the radiation (gamma rays) emitted by radioactive nuclei.[26] Older literature distinguished between X- and gamma radiation on the basis of wavelength, with radiation shorter than some arbitrary wavelength, such as 10−11 m, defined as gamma rays.[27] Since the energy of photons is proportional to their frequency and inversely proportional to wavelength, this past distinction between X-rays and gamma rays can also be thought of in terms of its energy, with gamma rays considered to be higher energy electromagnetic radiation than are X-rays.\n\nHowever, since current artificial sources are now able to duplicate any electromagnetic radiation that originates in the nucleus, as well as far higher energies, the wavelengths characteristic of radioactive gamma ray sources vs. other types now completely overlap. Thus, gamma rays are now usually distinguished by their origin: X-rays are emitted by definition by electrons outside the nucleus, while gamma rays are emitted by the nucleus.[26][28][29][30] Exceptions to this convention occur in astronomy, where gamma decay is seen in the afterglow of certain supernovas, but radiation from high energy processes known to involve other radiation sources than radioactive decay is still classed as gamma radiation.\n\n\n  \nThe Moon as seen by the Compton Gamma Ray Observatory, in gamma rays of greater than 20 MeV. These are produced by cosmic ray bombardment of its surface. The Sun, which has no similar surface of high atomic number to act as target for cosmic rays, cannot usually be seen at all at these energies, which are too high to emerge from primary nuclear reactions, such as solar nuclear fusion (though occasionally the Sun produces gamma rays by cyclotron-type mechanisms, during solar flares). Gamma rays typically have higher energy than X-rays.[31]\n\n\n\nFor example, modern high-energy X-rays produced by linear accelerators for megavoltage treatment in cancer often have higher energy (4 to 25 MeV) than do most classical gamma rays produced by nuclear gamma decay. One of the most common gamma ray emitting isotopes used in diagnostic nuclear medicine, technetium-99m, produces gamma radiation of the same energy (140 keV) as that produced by diagnostic X-ray machines, but of significantly lower energy than therapeutic photons from linear particle accelerators. In the medical community today, the convention that radiation produced by nuclear decay is the only type referred to as \"gamma\" radiation is still respected.\n\nDue to this broad overlap in energy ranges, in physics the two types of electromagnetic radiation are now often defined by their origin: X-rays are emitted by electrons (either in orbitals outside of the nucleus, or while being accelerated to produce bremsstrahlung-type radiation),[32] while gamma rays are emitted by the nucleus or by means of other particle decays or annihilation events. There is no lower limit to the energy of photons produced by nuclear reactions, and thus ultraviolet or lower energy photons produced by these processes would also be defined as \"gamma rays\".[33] The only naming-convention that is still universally respected is the rule that electromagnetic radiation that is known to be of atomic nuclear origin is always referred to as \"gamma rays\", and never as X-rays. However, in physics and astronomy, the converse convention (that all gamma rays are considered to be of nuclear origin) is frequently violated.\n\nIn astronomy, higher energy gamma and X-rays are defined by energy, since the processes that produce them may be uncertain and photon energy, not origin, determines the required astronomical detectors needed.[34] High-energy photons occur in nature that are known to be produced by processes other than nuclear decay but are still referred to as gamma radiation. An example is \"gamma rays\" from lightning discharges at 10 to 20 MeV, and known to be produced by the bremsstrahlung mechanism.\n\nAnother example is gamma-ray bursts, now known to be produced from processes too powerful to involve simple collections of atoms undergoing radioactive decay. This is part and parcel of the general realization that many gamma rays produced in astronomical processes result not from radioactive decay or particle annihilation, but rather in non-radioactive processes similar to X-rays.[clarification needed] Although the gamma rays of astronomy often come from non-radioactive events, a few gamma rays in astronomy are specifically known to originate from gamma decay of nuclei (as demonstrated by their spectra and emission half life). A classic example is that of supernova SN 1987A, which emits an \"afterglow\" of gamma-ray photons from the decay of newly made radioactive nickel-56 and cobalt-56. Most gamma rays in astronomy, however, arise by other mechanisms.\n\n\nSee also[edit]\n\n\tAnnihilation\n\tGalactic Center GeV Excess\n\tGaseous ionization detectors\n\tVery-high-energy gamma ray\n\tUltra-high-energy gamma ray\n\n\nNotes[edit]\n\n\n\t^ It is now understood that a nuclear isomeric transition, however, can produce inhibited gamma decay with a measurable and much longer half-life.\n\n\n\n\n\nReferences[edit]\n\n\n\t^ P. Villard (1900) \"Sur la réflexion et la réfraction des rayons cathodiques et des rayons déviables du radium\", Comptes rendus, vol. 130, pages 1010–1012. See also: P. Villard (1900) \"Sur le rayonnement du radium\", Comptes rendus, vol. 130, pages 1178–1179.\n\n\t^ L'Annunziata, Michael F. (2007). Radioactivity: introduction and history. Amsterdam, Netherlands: Elsevier BV. pp. 55–58. ISBN 978-0-444-52715-8.\n\n\t^ Rutherford named γ rays on page 177 of: E. Rutherford (1903) \"The magnetic and electric deviation of the easily absorbed rays from radium\", Philosophical Magazine, Series 6, vol. 5, no. 26, pages 177–187.\n\n\t^ a b \"Rays and Particles\". Galileo.phys.virginia.edu. Retrieved 2013-08-27.\n\n\n\t^ Gamma decay review Accessed Sept. 29, 2014\n\n\t^ \"LHC gamma radiation from proton-proton collisions\". Physics Stack Exchange. 2017-02-19. Retrieved 2017-11-27.\n\n\n\t^ Ultrabright GeV Photon Source via Controlled Electromagnetic Cascades in Laser-Dipole Waves, A. Gonoskov et al, Physical Review X, Phys. Rev. X 7, 041003, 2017-10-07\n\n\t^ Smith, Joseph; David M. Smith (August 2012). \"Deadly Rays From Clouds\". Scientific American. Vol. 307 no. 2. pp. 55–59. Bibcode:2012SciAm.307b..54D. doi:10.1038/scientificamerican0812-54.\n\n\n\t^ Chupp, E. L.; Forrest, D. J.; Higbie, P. R.; Suri, A. N.; Tsai, C.; Dunphy, P. P. (1973). \"Solar Gamma Ray Lines observed during the Solar Activity of August 2 to August 11, 1972\". Nature. 241 (5388): 333–335. doi:10.1038/241333a0.\n\n\n\t^ 2005 NASA announcement of first close study of a short gamma-ray burst.\n\n\t^ Bock, R. K.;  et al. (2008-06-27). \"Very-High-Energy Gamma Rays from a Distant Quasar: How Transparent Is the Universe?\". Science. 320 (5884): 1752–1754. arXiv:0807.2822. Bibcode:2008Sci...320.1752M. doi:10.1126/science.1157087. ISSN 0036-8075. PMID 18583607.\n\n\n\t^ Domínguez, Alberto;  et al. (2015-06-01). \"All the Light There Ever Was\". Scientific American. Vol. 312 no. 6. pp. 38–43. ISSN 0036-8075.\n\n\n\t^ Beigzadeh, A.M. (2019). \"Design and improvement of a simple and easy-to-use gamma-ray densitometer for application in wood industry\". Measurement. 138: 157–161. doi:10.1016/j.measurement.2019.02.017.\n\n\n\t^ Falahati, M. (2018). \"Design, modelling and construction of a continuous nuclear gauge for measuring the fluid levels\". Journal of Instrumentation. 13 (2): P02028. doi:10.1088/1748-0221/13/02/P02028.\n\n\n\t^ The ICRP says \"In the low dose range, below about 100 mSv, it is scientifically plausible to assume that the incidence of cancer or heritable effects will rise in direct proportion to an increase in the equivalent dose in the relevant organs and tissues\" ICRP publication 103 paragraph 64\n\n\t^ ICRP report 103 para 104 and 105\n\n\t^ Rothkamm, K; Löbrich, M (2003). \"Evidence for a lack of DNA double-strand break repair in human cells exposed to very low x-ray doses\". Proceedings of the National Academy of Sciences of the United States of America. 100 (9): 5057–62. Bibcode:2003PNAS..100.5057R. doi:10.1073/pnas.0830918100. PMC 154297. PMID 12679524.\n\n\n\t^ ENVIRONMENT AGENCY UK Radioactivity in Food and the Environment, 2012\n\n\t^ United Nations Scientific Committee on the Effects of Atomic Radiation Annex E: Medical radiation exposures – Sources and Effects of Ionizing – 1993, p. 249, New York, UN\n\n\t^ Pattison, J. E.; Hugtenburg, R. P.; Green, S. (2009). \"Enhancement of natural background gamma-radiation dose around uranium microparticles in the human body\". Journal of the Royal Society Interface. 7 (45): 603–611. doi:10.1098/rsif.2009.0300. PMC 2842777. PMID 19776147.\n\n\n\t^ US National Council on Radiation Protection and Measurements – NCRP Report No. 93 – pp 53–55, 1987. Bethesda, Maryland, USA, NCRP\n\n\t^ \"PET/CT total radiation dose calculations\" (PDF). Retrieved 2011-11-08.\n\n\n\t^ \"Lethal dose\", NRC Glossary (October 18, 2011)\n\n\t^ Rodgerson, D.O.; Reidenberg, B.E.; Harris, A.g.; Pecora, A.L. (2012). \"Potential for a pluripotent adult stem cell treatment for acute radiation sickness\". World Journal of Experimental Medicine. 2 (3): 37–44. doi:10.5493/wjem.v2.i3.37. PMC 3905584. PMID 24520532.\n\n\n\t^ Cardis, E (9 July 2005). \"Risk of cancer after low doses of ionising radiation: retrospective cohort study in 15 countries\". BMJ. 331 (7508): 77–0. doi:10.1136/bmj.38499.599861.E0. PMC 558612. PMID 15987704.\n\n\n\t^ a b Dendy, P. P.; B. Heaton (1999). Physics for Diagnostic Radiology. USA: CRC Press. p. 12. ISBN 0-7503-0591-6.\n\n\n\t^ Charles Hodgman, Ed. (1961). CRC Handbook of Chemistry and Physics, 44th Ed. USA: Chemical Rubber Co. p. 2850.\n\n\n\t^ Feynman, Richard; Robert Leighton; Matthew Sands (1963). The Feynman Lectures on Physics, Vol.1. USA: Addison-Wesley. pp. 2–5. ISBN 0-201-02116-1.\n\n\n\t^ L'Annunziata, Michael; Mohammad Baradei (2003). Handbook of Radioactivity Analysis. Academic Press. p. 58. ISBN 0-12-436603-1.\n\n\n\t^ Grupen, Claus; G. Cowan; S. D. Eidelman; T. Stroh (2005). Astroparticle Physics. Springer. p. 109. ISBN 3-540-25312-2.\n\n\n\t^ \"CGRO SSC >> EGRET Detection of Gamma Rays from the Moon\". Heasarc.gsfc.nasa.gov. 2005-08-01. Retrieved 2011-11-08.\n\n\n\t^ \"Bremsstrahlung radiation\" is \"braking radiation\", but \"acceleration\" is being used here in the specific sense of the deflection of an electron from its course: Serway, Raymond A;  et al. (2009). College Physics. Belmont, CA: Brooks Cole. p. 876. ISBN 978-0-03-023798-0.\n\n\n\t^ Shaw, R. W.; Young, J. P.; Cooper, S. P.; Webb, O. F. (1999). \"Spontaneous Ultraviolet Emission from 233Uranium/229Thorium Samples\". Physical Review Letters. 82 (6): 1109–1111. Bibcode:1999PhRvL..82.1109S. doi:10.1103/PhysRevLett.82.1109.\n\n\n\t^ \"Gamma-Ray Telescopes & Detectors\". NASA GSFC. Retrieved 2011-11-22.\n\n\n\n\n\nExternal links[edit]\n\nListen to this article (info/dl)\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis audio file was created from a revision of the article \"Gamma ray\" dated 2019-8-16, and does not reflect subsequent edits to the article. (Audio help)\n\nMore spoken articles\n\n\n\n\tBasic reference on several types of radiation\n\tRadiation Q & A\n\tGCSE information\n\tRadiation information\n\tGamma-ray bursts\n\tThe Lund/LBNL Nuclear Data Search – Contains information on gamma-ray energies from isotopes.\n\tMapping soils with airborne detectors\n\t The LIVEChart of Nuclides – IAEA with filter on gamma-ray energy\n\tHealth Physics Society Public Education Website\n\n\n\t\tv\n\tt\n\te\n\n\nElectromagnetic spectrum\n\n\t\n\tGamma rays\n\tX-rays\n\tUltraviolet\n\tVisible\n\tInfrared\n\tMicrowave\n\tRadio\n\n\n← higher frequencies       longer wavelengths →\n\n\n\n\n\tX-rays\t\n\tsoft X-ray\n\thard X-ray\n\n\n\n\n\tUltraviolet\t\n\tExtreme ultraviolet\n\tVacuum ultraviolet\n\tLyman-alpha\n\tFUV\n\tMUV\n\tNUV\n\tUVC\n\tUVB\n\tUVA\n\n\n\n\n\tVisible (optical)\t\n\tViolet\n\tBlue\n\tCyan\n\tGreen\n\tYellow\n\tOrange\n\tRed\n\n\n\n\n\tMicrowaves\t\n\tW band\n\tV band\n\tQ band\n\tKa band\n\tK band\n\tKu band\n\tX band\n\tC band\n\tS band\n\tL band\n\n\n\n\n\tRadio\t\n\tTHF\n\tEHF\n\tSHF\n\tUHF\n\tVHF\n\tHF\n\tMF\n\tLF\n\tVLF\n\tULF\n\tSLF\n\tELF\n\n\n\n\n\tWavelength types\t\n\tMicrowave\n\tShortwave\n\tMedium wave\n\tLongwave\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNuclear processes\n\n\tRadioactive\ndecay\n\t\n\tAlpha decay\n\tBeta decay\n\tGamma radiation\n\tCluster decay\n\tDouble beta decay\n\tDouble electron capture\n\tInternal conversion\n\tIsomeric transition\n\tNeutron emission\n\tPositron emission\n\tProton emission\n\tSpontaneous fission\n\n\n\n\n\tStellar\nnucleosynthesis\n\t\n\tDeuterium fusion\n\tLithium burning\n\tpp-chain\n\tCNO cycle\n\tα process\n\tTriple-α\n\tC burning\n\tNe burning\n\tO burning\n\tSi burning\n\tR-process\n\tS-process\n\tP-process\n\tRp-process\n\n\n\n\n\tOther\nprocesses\n\t\n\tPhotodisintegration\n\tPhotofission\n\n\n \n\tCapture\n\t\n\tElectron capture\n\tNeutron capture\n\tProton capture\n\n\n\n\n\tExchange\n\t\n\t(n-p) reaction\n\n\n\n\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nRadiation (physics and health)\n\n\tMain articles\t\n\tNon-ionizing radiation\t\n\tAcoustic radiation force\n\tInfrared\n\tLight\n\tStarlight\n\tSunlight\n\tMicrowave\n\tRadio waves\n\tUltraviolet\n\n\n\n\n\tIonizing radiation\t\n\tRadioactive decay\n\tCluster decay\n\tBackground radiation\n\tAlpha particle\n\tBeta particle\n\tGamma ray\n\tCosmic ray\n\tNeutron radiation\n\tNuclear fission\n\tNuclear fusion\n\tNuclear reactors\n\tNuclear weapons\n\tParticle accelerators\n\tRadioactive materials\n\tX-ray\n\n\n\n\n\t\n\tEarth's energy budget\n\tElectromagnetic radiation\n\tSynchrotron radiation\n\tThermal radiation\n\tBlack-body radiation\n\tParticle radiation\n\tGravitational Radiation\n\tCosmic background radiation\n\tCherenkov radiation\n\tAskaryan radiation\n\tBremsstrahlung\n\tUnruh radiation\n\tDark radiation\n\n\n\n\n\n\n\n\tRadiation \nand health\t\n\tRadiation syndrome\n\tacute\n\tchronic\n\n\n\tHealth physics\n\tDosimetry\n\tElectromagnetic radiation and health\n\tLaser safety\n\tLasers and aviation safety\n\tMedical radiography\n\tMobile phone radiation and health\n\tRadiation protection\n\tRadiation therapy\n\tRadioactivity in the life sciences\n\tRadioactive contamination\n\tRadiobiology\n\tBiological dose units and quantities\n\tWireless electronic devices and health\n\tRadiation Heat-transfer\n\n\n\n\n\tRelated articles\t\n\tHalf-life\n\tNuclear physics\n\tRadioactive source\n\tRadiation hardening\n\tList of civilian radiation accidents\n\t1996 Costa Rica accident\n\t1987 Goiânia accident\n\t1984 Moroccan accident\n\t1990 Zaragoza accident\n\n\n\n\n\tSee also: the categories Radiation effects, Radioactivity, Radiobiology, and Radiation protection.\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4019205-2\n\tLCCN: sh85052990\n\tNDL: 00562232\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Gamma_ray&oldid=917793743\"\n\n\t\t\n\t\tCategories: \tSpoken articles\n\tElectromagnetic spectrum\n\tGamma rays\n\tIARC Group 1 carcinogens\n\tNuclear physics\n\tRadiation\n\tRadioactivity\n\n\nHidden categories: \tArticles with short description\n\tWikipedia pending changes protected pages\n\tWikipedia articles needing clarification from August 2018\n\tWikipedia articles needing clarification from February 2009\n\tWikipedia articles needing clarification from July 2016\n\tArticles with hAudio microformats\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NDL identifiers\n\tArticles containing video clips\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBosanski\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFiji Hindi\n\tFrançais\n\tGaeilge\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tInterlingua\n\tÍslenska\n\tItaliano\n\tעברית\n\tქართული\n\tҚазақша\n\tKreyòl ayisyen\n\tLatina\n\tLatviešu\n\tLietuvių\n\tLigure\n\tLimburgs\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tМонгол\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tPiemontèis\n\tPlattdüütsch\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tShqip\n\tසිංහල\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tТатарча/tatarça\n\tతెలుగు\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\tWalon\n\t文言\n\tWinaray\n\t吴语\n\t粵語\n\tŽemaitėška\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 25 September 2019, at 14:33 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "8", "dc:title": "Gamma ray - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Gamma_Decay.svg/1200px-Gamma_Decay.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-gamma_photon", "title": "Gamma ray - Wikipedia"}}