{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGimbal - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tGimbal\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about the pivoted support system. For the former settlement in California, see Gimbal, California. For the mobile engagement company, see Gimbal (company).\n\n  \nIllustration of a simple three-axis gimbal set; the center ring can be vertically fixed\n\n\n\nA gimbal is a pivoted support that allows the rotation of an object about a single axis. A set of three gimbals, one mounted on the other with orthogonal pivot axes, may be used to allow an object mounted on the innermost gimbal to remain independent of the rotation of its support (e.g. vertical in the first animation). For example, on a ship, the gyroscopes, shipboard compasses, stoves, and even drink holders typically use gimbals to keep them upright with respect to the horizon despite the ship's pitching and rolling.\n\nThe gimbal suspension used for mounting compasses and the like is sometimes called a Cardan suspension after Italian mathematician and physicist Gerolamo Cardano (1501–1576) who described it in detail.  However, Cardano did not invent the gimbal, nor did he claim to.  The device has been known since antiquity, first described in the 3rd c. BC by Philo of Byzantium, although some modern authors support it may not have a single identifiable inventor.[1][2]\n\n\nContents\n\n\n\t1 History\n\t2 Applications\n\t2.1 Inertial navigation\n\t2.2 Rocket engines\n\t2.3 Photography and imaging\n\t2.4 Film and video\n\t2.5 Marine chronometers\n\n\n\n\t3 See also\n\t4 References\n\n\n\n\n\nHistory[edit]\n\n  \nCardan suspension in Villard de Honnecourt's sketchbook (ca. 1230)\n\n\n\n  \nEarly modern dry compass suspended by gimbals (1570)\n\n\n\nThe gimbal was first described by the Greek inventor Philo of Byzantium (280–220 BC).[3][4][5][6] Philo described an eight-sided ink pot with an opening on each side, which can be turned so that while any face is on top, a pen can be dipped and inked — yet the ink never runs out through the holes of the other sides. This was done by the suspension of the inkwell at the center, which was mounted on a series of concentric metal rings so that it remained stationary no matter which way the pot is turned.[3]\n\nIn Ancient China, the Han Dynasty (202 BC – 220 AD) inventor and mechanical engineer Ding Huan  created a gimbal incense burner around 180 AD.[3][7][8] There is a hint in the writing of the earlier Sima Xiangru (179–117 BC) that the gimbal existed in China since the 2nd century BC.[9] There is mention during the Liang Dynasty (502–557) that gimbals were used for hinges of doors and windows, while an artisan once presented a portable warming stove to Empress Wu Zetian (r. 690–705) which employed gimbals.[10] Extant specimens of Chinese gimbals used for incense burners date to the early Tang Dynasty (618–907), and were part of the silver-smithing tradition in China.[11]\n\nThe authenticity of Philo's description of a cardan suspension has been doubted by some authors on the ground that the part of Philo's Pneumatica which describes the use of the gimbal survived only in an Arabic translation of the early 9th century.[3] Thus, as late as 1965, the sinologist Joseph Needham suspected Arab interpolation.[12] However, Carra de Vaux, author of the French translation which still provides the basis for modern scholars,[13] regards the Pneumatics as essentially genuine.[14] The historian of technology George Sarton (1959) also asserts that it is safe to assume the Arabic version is a faithful copying of Philo's original, and credits Philon explicitly with the invention.[15] So does his colleague Michael Lewis (2001).[16] In fact, research by the latter scholar (1997) demonstrates that the Arab copy contains sequences of Greek letters which fell out of use after the 1st century, thereby strengthening the case that it is a faithful copy of the Hellenistic original,[17] a view recently also shared by the classicist Andrew Wilson (2002).[18]\n\nThe ancient Roman author Athenaeus Mechanicus, writing during the reign of Augustus (30 BC–14 AD), described the military use of a gimbal-like mechanism, calling it \"little ape\" (pithêkion). When preparing to attack coastal towns from the sea-side, military engineers used to yoke merchant-ships together to take the siege machines up to the walls. But to prevent the shipborne machinery from rolling around the deck in heavy seas, Athenaeus advises that \"you must fix the pithêkion on the platform attached to the merchant-ships in the middle, so that the machine stays upright in any angle\".[19]\n\nAfter antiquity, gimbals remained widely known in the Near East. In the Latin West, reference to the device appeared again in the 9th century recipe book called the Little Key of Painting Mappae clavicula.[20] The French inventor Villard de Honnecourt depicts a set of gimbals in his famous sketchbook (see right). In the early modern period, dry compasses were suspended in gimbals.\n\n\nApplications[edit]\n\n  \nIn a set of three gimbals mounted together, each offers a degree of freedom: roll, pitch and yaw\n\n\n\nInertial navigation[edit]\n\nIn inertial navigation, as applied to ships and submarines, a minimum of three gimbals are needed to allow an inertial navigation system (stable table) to remain fixed in inertial space, compensating for changes in the ship's yaw, pitch, and roll. In this application, the inertial measurement unit (IMU) is equipped with three orthogonally mounted gyros to sense rotation about all axes in three-dimensional space. The gyro outputs are kept to a null through drive motors on each gimbal axis, to maintain the orientation of the IMU. To accomplish this, the gyro error signals are passed through \"resolvers\" mounted on the three gimbals, roll, pitch and yaw. These resolvers perform an automatic matrix transformation according to each gimbal angle, so that the required torques are delivered to the appropriate gimbal axis. The yaw torques must be resolved by roll and pitch transformations. The gimbal angle is never measured.\nSimilar sensing platforms are used on aircraft.\n\nIn inertial navigation systems, gimbal lock may occur when vehicle rotation causes two of the three gimbal rings to align with their pivot axes in a single plane. When this occurs, it is no longer possible to maintain the sensing platform's orientation.\n\n\nRocket engines[edit]\n\nMain article: Gimbaled thrust\n\nIn spacecraft propulsion, rocket engines are generally mounted on a pair of gimbals to allow a single engine to vector thrust about both the pitch and yaw axes; or sometimes just one axis is provided per engine. To control roll, twin engines with differential pitch or yaw control signals are used to provide torque about the vehicle's roll axis.\n\nThe word \"gimbal\" began as a noun. Most modern dictionaries continue to list it as such. Lacking a convenient term to describe the swinging movement of a rocket engine, engineers began also using the word \"gimbal\" as a verb. When a thrust chamber is swung by an attached actuator, the movement is referred to as \"gimballed\" or \"gimballing\".  Official rocket documentation reflects this usage.\n\n\nPhotography and imaging[edit]\n\n  \nA Baker-Nunn satellite-tracking camera on an altitude-altitude-azimuth mount\n\n\n\nGimbals are also used to mount everything from small camera lenses to large photographic telescopes.\n\nIn portable photography equipment, single-axis gimbal heads are used in order to allow a balanced movement for camera and lenses.[21] This proves useful in wildlife photography as well as in any other case where very long and heavy telephoto lenses are adopted: a gimbal head rotates a lens around its center of gravity, thus allowing for easy and smooth manipulation while tracking moving subjects.\n\nVery large gimbal mounts in the form 2 or 3 axis altitude-altitude mounts[22] are used in satellite photography for tracking purposes.\n\nGyrostabilized gimbals which house multiple sensors are also used for airborne surveillance applications including airborne law enforcement, pipe and power line inspection, mapping, and ISR (intelligence, surveillance, and reconnaissance).  Sensors include thermal imaging, daylight, low light cameras as well as laser range finder, and illuminators.[23]\n\nGimbal systems are also used in scientific optics equipment. For example, they are used to rotate a material sample along an axis to study their angular dependence of optical properties.[24]\n\n\nFilm and video[edit]\n\nHandheld 3-axis gimbals are used in stabilization systems designed to give the camera operator the independence of handheld shooting without camera vibration or shake. There are two versions of such stabilization systems; mechanical and motorized.\n\nMechanical gimbals have the sled, which includes the top stage where the camera is attached, the post which in most models can be extended, with the monitor and batteries at the bottom to counterbalance the camera weight. This is how the Steadicam stays upright, by simply making the bottom slightly heavier than the top, pivoting at the gimbal. This leaves the center of gravity of the whole rig, however heavy it may be, exactly at the operator's fingertip, allowing deft and finite control of the whole system with the lightest of touches on the gimbal.\n\nPowered by three brushless motors, motorized gimbals have the ability to keep the camera level on all axes as the camera operator moves the camera. An inertial measurement unit (IMU) responds to movement and utilizes its three separate motors to stabilize the camera. With the guidance of algorithms, the stabilizer is able to notice the difference between deliberate movement such as pans and tracking shots from unwanted shake. This allows the camera to seem as if it is floating through the air, an effect achieved by a Steadicam in the past. Gimbals can be mounted to cars and other vehicles such as drones, where vibrations or other unexpected movements would make tripods or other camera mounts unacceptable.\n\n\nMarine chronometers[edit]\n\nThe rate of a mechanical marine chronometer is sensitive to its orientation.  Because of this, chronometers were normally mounted on gimbals, in order to isolate them from the rocking motions of a ship at sea.\n\n\nSee also[edit]\n\n\t\tWikimedia Commons has media related to Gimbals.\n\n\n\tGimbal lock\n\tCanfield joint\n\tHeligimbal\n\tUniversal joint - Cardan joint\n\tCardan shaft\n\tGyroscope\n\tKeyhole problem\n\tTrunnion\n\n\nReferences[edit]\n\n\n\t^ Needham, Joseph. (1986). Science and Civilization in China: Volume 4, Physics and Physical Technology; Part 2, Mechanical Engineering. Taipei: Caves Books Ltd. Page 229.\n\n\t^ Francis C. Moon, The Machines of Leonardo da Vinci and Franz Reuleaux: Kinematics of Machines from the Renaissance to the 20th century, p.314, Springer, 2007 ISBN 1-4020-5598-6.\n\n\t^ a b c d Sarton, George (1959). A History of Science: Hellenistic Science and Culture in the Last Three centuries B.C. Cambridge: Harvard University Press. pp. 349–350.\n\n\n\t^ Carter, Ernest Frank (1967). Dictionary of Inventions and Discoveries. Philosophical Library. p. 74.\n\n\n\t^ Seherr-Thoss, Hans-Christoph; Schmelz, Friedrich; Aucktor, Erich (2006). Universal Joints and Driveshafts: Analysis, Design, Applications. Springer. p. 1. ISBN 978-3-540-30169-1.\n\n\n\t^ Krebs, Robert E.; Krebs, Carolyn A. (2003). Groundbreaking Scientific Experiments, Inventions, and Discoveries of the Ancient World. Greenwood Press. p. 216. ISBN 978-0-313-31342-4.\n\n\n\t^ Needham, Joseph. (1986). Science and Civilization in China: Volume 4, Physics and Physical Technology; Part 2, Mechanical Engineering. Taipei: Caves Books Ltd. p.233.\n\n\t^ Handler, Sarah (2001). Austere Luminosity of Chinese Classical Furniture. University of California Press (published October 1, 2001). p. 308. ISBN 978-0520214842.\n\n\n\t^ Needham, Joseph. (1986). Science and Civilization in China: Volume 4, Physics and Physical Technology; Part 2, Mechanical Engineering. Taipei: Caves Books Ltd. pp.233–234.\n\n\t^ Needham, Joseph. (1986). Science and Civilization in China: Volume 4, Physics and Physical Technology; Part 2, Mechanical Engineering. Taipei: Caves Books Ltd. p.234.\n\n\t^ Needham, Joseph. (1986). Science and Civilization in China: Volume 4, Physics and Physical Technology; Part 2, Mechanical Engineering. Taipei: Caves Books Ltd. pp.234–235.\n\n\t^ Needham, Joseph. (1986). Science and Civilization in China: Volume 4, Physics and Physical Technology; Part 2, Mechanical Engineering. Taipei: Caves Books Ltd. p.236.\n\n\t^ Hill, D. R. (1977). History of Technology. Part II. p. 75.\n\n\n\t^ Carra de Vaux: \"Le livre des appareils pneumatiques et des machines hydrauliques de Philon de Byzance d'après les versions d'Oxford et de Constantinople\", Académie des Inscriptions et des Belles Artes: notice et extraits des mss. de la Bibliothèque nationale, Paris 38 (1903), pp.27-235\n\n\t^ Sarton, George. (1959). A History of Science: Hellenistic Science and Culture in the Last Three centuries B.C. New York: The Norton Library, Norton & Company Inc. SBN 393005267. pp.343–350.\n\n\t^ Lewis, M. J. T. (2001). Surveying Instruments of Greece and Rome. Cambridge University Press. p. 76 at Fn. 45. ISBN 978-0-521-79297-4.\n\n\n\t^ Lewis, M. J. T. (1997). Millstone and Hammer: the Origins of Water Power. pp. 26–36.\n\n\n\t^ Wilson, Andrew (2002). \"Machines, Power and the Ancient Economy\". The Journal of Roman Studies. 92 (7): 1–32. doi:10.1017/S0075435800032135.\n\n\n\t^ Athenaeus Mechanicus, \"On Machines\" (\"Peri Mēchanēmatōn\"), 32.1-33.3\n\n\t^ Needham, Joseph. (1986). Science and Civilization in China: Volume 4, Physics and Physical Technology; Part 2, Mechanical Engineering. Taipei: Caves Books Ltd. pp.229, 231.\n\n\t^ \"3-Axis Handheld GoPro Gimbals\". gimbalreview.com. GimbalReview. 2017. Retrieved 7 May 2017.\n\n\n\t^ \"Article\". Soviet Journal of Optical Technology. Optical Society of America, American Institute of Physics. 43 (3): 119. 1976.\n\n\n\t^ Dietsch, Roy (2013). Airborne Gimbal Camera – Interface Guide.\n\n\n\t^ Bihari, Nupur; Dash, Smruti Prasad; Dhankani, Karankumar C.; Pearce, Joshua M. (2018-12-01). \"3-D printable open source dual axis gimbal system for optoelectronic measurements\" (PDF). Mechatronics. 56: 175–187. doi:10.1016/j.mechatronics.2018.07.005. ISSN 0957-4158.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Gimbal&oldid=916134274\"\n\n\t\t\n\t\tCategories: \tAncient Roman technology\n\tChinese inventions\n\tGreek inventions\n\tGyroscopes\n\tHellenistic engineering\n\tMechanisms (engineering)\n\n\nHidden categories: \tCS1: long volume value\n\tCommons category link from Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tČeština\n\tDeutsch\n\tEspañol\n\tFrançais\n\t한국어\n\tHrvatski\n\tÍslenska\n\tItaliano\n\tעברית\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tNorsk\n\tPortuguês\n\tРусский\n\tSuomi\n\tSvenska\n\tไทย\n\tУкраїнська\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 17 September 2019, at 06:29 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "Gimbal - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Gyroscope_operation.gif", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-gimbal", "title": "Gimbal - Wikipedia"}}