{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGlobal Positioning System - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tGlobal Positioning System\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about the American satellite navigation system. It is not to be confused with similar non-American (global and regional) systems. For similar systems, see Satellite navigation.\n\n\"GPS\" redirects here. For the device, see GPS receiver. For other uses, see GPS (disambiguation).\n\nAmerican satellite navigation system\n\n\n\n\nGlobal Positioning System (GPS)\t\n\n\n\tCountry/ies of origin\tUnited States\n\tOperator(s)\tAFSPC\n\tType\tMilitary, civilian\n\tStatus\tOperational\n\tCoverage\tGlobal\n\tAccuracy\t500–30 cm (20–1 ft)\n\tConstellation size\n\tTotal satellites\t33\n\tSatellites in orbit\t31\n\tFirst launch\tFebruary 1978; 41 years ago (1978-02)\n\tTotal launches\t72\n\tOrbital characteristics\n\tRegime(s)\t6x MEO planes\n\tOrbital height\t20,180 km (12,540 mi)\n\n\n\tGeodesy\n\t\n\t\nFundamentals\n\n\tGeodesy\n\tGeodynamics\n\tGeomatics\n\tHistory\n\n\n\n\n\t\nConcepts\n\n\tGeographical distance\n\tGeoid\n\tFigure of the Earth (Earth radius and Earth's circumference)\n\tGeodetic datum\n\tGeodesic\n\tGeographic coordinate system\n\tHorizontal position representation\n\tLatitude / Longitude\n\tMap projection\n\tReference ellipsoid\n\tSatellite geodesy\n\tSpatial reference system\n\tSpatial relations\n\n\n\n\n\t\nTechnologies\n\n\tGlobal Nav. Sat. Systems (GNSSs)\n\tGlobal Pos. System (GPS)\n\tGLONASS (Russia)\n\tBeiDou (BDS) (China)\n\tGalileo (Europe)\n\tNAVIC (India)\n\tQuasi-Zenith Sat. Sys. (QZSS) (Japan)\n\tDiscrete Global Grid and Geocoding\n\n\n\n\n\t\nStandards (history)\n\t NGVD 29\t Sea Level Datum 1929\n\t OSGB36\t Ordnance Survey Great Britain 1936\n\t SK-42\t Systema Koordinat 1942 goda\n\t ED50\t European Datum 1950\n\t SAD69\t South American Datum 1969\n\t GRS 80\t Geodetic Reference System 1980\n\t ISO 6709\t Geographic point coord. 1983\n\t NAD 83\t North American Datum 1983\n\t WGS 84\t World Geodetic System 1984\n\t NAVD 88\t N. American Vertical Datum 1988\n\t ETRS89\t European Terrestrial Ref. Sys. 1989\n\t GCJ-02\t Chinese obfuscated datum 2002\n\t Geo URI\t Internet link to a point  2010\n\n\n\tInternational Terrestrial Reference System\n\tSpatial Reference System Identifier (SRID)\n\tUniversal Transverse Mercator (UTM)\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\n\nArtist's conception of GPS Block II-F satellite in Earth orbit.\n\n\nCivilian GPS receivers (\"GPS navigation device\") in a marine application.\n\n\n\nAutomotive navigation system in a taxicab.\n\n\nA U.S. Air Force Senior Airman runs through a checklist during Global Positioning System satellite operations.\n\n\n\n\n\nThe Global Positioning System (GPS), originally NAVSTAR GPS,[1] is a satellite-based radionavigation system owned by the United States government and operated by the United States Air Force.[2] It is a global navigation satellite system (GNSS) that provides geolocation and time information to a GPS receiver anywhere on or near the Earth where there is an unobstructed line of sight to four or more GPS satellites.[3] Obstacles such as mountains and buildings block the relatively weak GPS signals.\n\nThe GPS does not require the user to transmit any data, and it operates independently of any telephonic or internet reception, though these technologies can enhance the usefulness of the GPS positioning information. The GPS provides critical positioning capabilities to military, civil, and commercial users around the world. The United States government created the system, maintains it, and makes it freely accessible to anyone with a GPS receiver.[4]\n\nThe GPS project was started by the U.S. Department of Defense in 1973, with the first prototype spacecraft launched in 1978 and the full constellation of 24 satellites operational in 1993. Originally limited to use by the United States military, civilian use was allowed from the 1980s. Advances in technology and new demands on the existing system have now led to efforts to modernize the GPS and implement the next generation of GPS Block IIIA satellites and Next Generation Operational Control System (OCX).[5] Announcements from Vice President Al Gore and the White House in 1998 initiated these changes. In 2000, the U.S. Congress authorized the modernization effort, GPS III. During the 1990s, GPS quality was degraded by the United States government in a program called \"Selective Availability\"; this was discontinued in May 2000 by a law signed by President Bill Clinton.[6]\n\nThe GPS service is provided by the United States government, which can selectively deny access to the system, as happened to the Indian military in 1999 during the Kargil War, or degrade the service at any time.[7] As a result, several countries have developed or are in the process of setting up other global or regional satellite navigation systems. The Russian Global Navigation Satellite System (GLONASS) was developed contemporaneously with GPS, but suffered from incomplete coverage of the globe until the mid-2000s.[8] GLONASS can be added to GPS devices, making more satellites available and enabling positions to be fixed more quickly and accurately, to within two meters (6.6 ft).[9] China's BeiDou Navigation Satellite System began global services in 2018, with full deployment scheduled for 2020. There are also the European Union Galileo positioning system, and India's NAVIC. Japan's Quasi-Zenith Satellite System (QZSS) is a GPS satellite-based augmentation system to enhance GPS's accuracy in Asia-Oceania, with satellite navigation independent of GPS scheduled for 2023.[10]\n\nWhen selective availability was lifted in 2000, GPS had about a five-meter (16 ft) accuracy. The latest stage of accuracy enhancement uses the L5 band and is now fully deployed. GPS receivers released in 2018 that use the L5 band can have much higher accuracy, pinpointing to within 30 centimetres or 11.8 inches.[11][12]\n\n\nContents\n\n\n\t1 History\n\t1.1 Predecessors\n\t1.2 Development\n\t1.3 Timeline and modernization\n\t1.4 Awards\n\n\n\n\t2 Basic concept of GPS\n\t2.1 Fundamentals\n\t2.2 More detailed description\n\t2.3 User-satellite geometry\n\t2.4 Receiver in continuous operation\n\t2.5 Non-navigation applications\n\n\n\n\t3 Structure\n\t3.1 Space segment\n\t3.2 Control segment\n\t3.3 User segment\n\n\n\n\t4 Applications\n\t4.1 Civilian\n\t4.1.1 Restrictions on civilian use\n\n\n\n\t4.2 Military\n\n\n\n\t5 Communication\n\t5.1 Message format\n\t5.2 Satellite frequencies\n\t5.3 Demodulation and decoding\n\n\n\n\t6 Navigation equations\n\t6.1 Problem description\n\t6.2 Geometric interpretation\n\t6.2.1 Spheres\n\t6.2.2 Hyperboloids\n\t6.2.3 Inscribed sphere\n\t6.2.4 Spherical cones\n\n\n\n\t6.3 Solution methods\n\t6.3.1 Least squares\n\t6.3.2 Iterative\n\t6.3.3 Closed-form\n\n\n\n\n\n\n\t7 Error sources and analysis\n\t8 Accuracy enhancement and surveying\n\t8.1 Augmentation\n\t8.2 Precise monitoring\n\t8.3 Timekeeping\n\t8.3.1 Leap seconds\n\t8.3.2 Accuracy\n\t8.3.3 Format\n\n\n\n\t8.4 Carrier phase tracking (surveying)\n\n\n\n\t9 Regulatory spectrum issues concerning GPS receivers\n\t10 Other systems\n\t11 See also\n\t12 Notes\n\t13 References\n\t14 Further reading\n\t15 External links\n\n\n\n\n\nHistory[edit]\n\n\t\t\nAir Force film introducing the Navstar Global Positioning System, circa 1977\n\nPlay media\n\n\n\n\n\n\n\nThe GPS project was launched in the United States in 1973 to overcome the limitations of previous navigation systems,[13] integrating ideas from several predecessors, including classified engineering design studies from the 1960s. The U.S. Department of Defense developed the system, which originally used 24 satellites. It was initially developed for use by the United States military and became fully operational in 1995. Civilian use was allowed from the 1980s. Roger L. Easton of the Naval Research Laboratory, Ivan A. Getting of The Aerospace Corporation, and Bradford Parkinson of the Applied Physics Laboratory are credited with inventing it.[14] The work of Gladys West is credited as instrumental in the development of computational techniques for detecting satellite positions with the precision needed for GPS.[15]\n\nThe design of GPS is based partly on similar ground-based radio-navigation systems, such as LORAN and the Decca Navigator, developed in the early 1940s.\n\nIn 1955, Friedwardt Winterberg proposed a test of general relativity – detecting time slowing in a strong gravitational field using accurate atomic clocks placed in orbit inside artificial satellites.\nSpecial and general relativity predict that the clocks on the GPS satellites would be seen by the Earth's observers to run 38 microseconds faster per day than the clocks on the Earth. The GPS calculated positions would quickly drift into error, accumulating to 10 kilometers per day (6 mi/d). This was corrected for in the design of GPS.[16]\n\n\nPredecessors[edit]\n\nWhen the Soviet Union launched the first artificial satellite (Sputnik 1) in 1957, two American physicists, William Guier and George Weiffenbach, at Johns Hopkins University's Applied Physics Laboratory (APL) decided to monitor its radio transmissions.[17] Within hours they realized that, because of the Doppler effect, they could pinpoint where the satellite was along its orbit. The Director of the APL gave them access to their UNIVAC to do the heavy calculations required.\n\nEarly the next year, Frank McClure, the deputy director of the APL, asked Guier and Weiffenbach to investigate the inverse problem—pinpointing the user's location, given the satellite's. (At the time, the Navy was developing the submarine-launched Polaris missile, which required them to know the submarine's location.) This led them and APL to develop the TRANSIT system.[18] In 1959, ARPA (renamed DARPA in 1972) also played a role in TRANSIT.[19][20][21]\n\nTRANSIT was first successfully tested in 1960.[22] It used a constellation of five satellites and could provide a navigational fix approximately once per hour.\n\nIn 1967, the U.S. Navy developed the Timation satellite, which proved the feasibility of placing accurate clocks in space, a technology required for GPS.\n\nIn the 1970s, the ground-based OMEGA navigation system, based on phase comparison of signal transmission from pairs of stations,[23] became the first worldwide radio navigation system. Limitations of these systems drove the need for a more universal navigation solution with greater accuracy.\n\nAlthough there were wide needs for accurate navigation in military and civilian sectors, almost none of those was seen as justification for the billions of dollars it would cost in research, development, deployment, and operation of a constellation of navigation satellites. During the Cold War arms race, the nuclear threat to the existence of the United States was the one need that did justify this cost in the view of the United States Congress. This deterrent effect is why GPS was funded. It is also the reason for the ultra-secrecy at that time. The nuclear triad consisted of the United States Navy's submarine-launched ballistic missiles (SLBMs) along with United States Air Force (USAF) strategic bombers and intercontinental ballistic missiles (ICBMs). Considered vital to the nuclear deterrence posture, accurate determination of the SLBM launch position was a force multiplier.\n\nPrecise navigation would enable United States ballistic missile submarines to get an accurate fix of their positions before they launched their SLBMs.[24] The USAF, with two thirds of the nuclear triad, also had requirements for a more accurate and reliable navigation system. The Navy and Air Force were developing their own technologies in parallel to solve what was essentially the same problem.\n\nTo increase the survivability of ICBMs, there was a proposal to use mobile launch platforms (comparable to the Russian SS-24 and SS-25) and so the need to fix the launch position had similarity to the SLBM situation.\n\nIn 1960, the Air Force proposed a radio-navigation system called MOSAIC (MObile System for Accurate ICBM Control) that was essentially a 3-D LORAN. A follow-on study, Project 57, was worked in 1963 and it was \"in this study that the GPS concept was born.\" That same year, the concept was pursued as Project 621B, which had \"many of the attributes that you now see in GPS\"[25] and promised increased accuracy for Air Force bombers as well as ICBMs.\n\nUpdates from the Navy TRANSIT system were too slow for the high speeds of Air Force operation. The Naval Research Laboratory continued making advances with their Timation (Time Navigation) satellites, first launched in 1967, with the third one in 1974 carrying the first atomic clock into orbit.[26]\n\nAnother important predecessor to GPS came from a different branch of the United States military. In 1964, the United States Army orbited its first Sequential Collation of Range (SECOR) satellite used for geodetic surveying.[27] The SECOR system included three ground-based transmitters at known locations that would send signals to the satellite transponder in orbit. A fourth ground-based station, at an undetermined position, could then use those signals to fix its location precisely. The last SECOR satellite was launched in 1969.[28]\n\n\nDevelopment[edit]\n\nWith these parallel developments in the 1960s, it was realized that a superior system could be developed by synthesizing the best technologies from 621B, Transit, Timation, and SECOR in a multi-service program. Satellite orbital position errors, induced by variations in the gravity field and radar refraction among others, had to be resolved. A team led by Harold L Jury of Pan Am Aerospace Division in Florida from 1970–1973, used real-time data assimilation and recursive estimation to do so, reducing systematic and residual errors to a manageable level to permit accurate navigation.[29]\n\nDuring Labor Day weekend in 1973, a meeting of about twelve military officers at the Pentagon discussed the creation of a Defense Navigation Satellite System (DNSS). It was at this meeting that the real synthesis that became GPS was created. Later that year, the DNSS program was named Navstar.[30] Navstar is often erroneously considered an acronym for \"NAVigation System Using Timing and Ranging\" but was never considered as such by the GPS Joint Program Office (TRW may have once advocated for a different navigational system that used that acronym).[31] With the individual satellites being associated with the name Navstar (as with the predecessors Transit and Timation), a more fully encompassing name was used to identify the constellation of Navstar satellites, Navstar-GPS.[32] Ten \"Block I\" prototype satellites were launched between 1978 and 1985 (an additional unit was destroyed in a launch failure).[33]\n\nThe effect of the ionosphere on radio transmission was investigated in a geophysics laboratory of Air Force Cambridge Research Laboratory. Located at Hanscom Air Force Base, outside Boston, the lab was renamed the Air Force Geophysical Research Lab (AFGRL) in 1974. AFGRL developed the Klobuchar model for computing ionospheric corrections to GPS location.[34] Of note is work done by Australian space scientist Elizabeth Essex-Cohen at AFGRL in 1974. She was concerned with the curving of the paths of radio waves traversing the ionosphere from NavSTAR satellites.[35]\n\nAfter Korean Air Lines Flight 007, a Boeing 747 carrying 269 people, was shot down in 1983 after straying into the USSR's prohibited airspace,[36] in the vicinity of Sakhalin and Moneron Islands, President Ronald Reagan issued a directive making GPS freely available for civilian use, once it was sufficiently developed, as a common good.[37] The first Block II satellite was launched on February 14, 1989,[38] and the 24th satellite was launched in 1994. The GPS program cost at this point, not including the cost of the user equipment but including the costs of the satellite launches, has been estimated at US$5 billion (then-year dollars).[39]\n\nInitially, the highest-quality signal was reserved for military use, and the signal available for civilian use was intentionally degraded, in a policy known as Selective Availability. This changed with President Bill Clinton signing on May 1, 2000 a policy directive to turn off Selective Availability to provide the same accuracy to civilians that was afforded to the military. The directive was proposed by the U.S. Secretary of Defense, William Perry, in view of the widespread growth of differential GPS services to improve civilian accuracy and eliminate the U.S. military advantage. Moreover, the U.S. military was actively developing technologies to deny GPS service to potential adversaries on a regional basis.[40]\n\nSince its deployment, the U.S. has implemented several improvements to the GPS service, including new signals for civil use and increased accuracy and integrity for all users, all the while maintaining compatibility with existing GPS equipment. Modernization of the satellite system has been an ongoing initiative by the U.S. Department of Defense through a series of satellite acquisitions to meet the growing needs of the military, civilians, and the commercial market.\n\nAs of early 2015, high-quality, FAA grade, Standard Positioning Service (SPS) GPS receivers provided horizontal accuracy of better than 3.5 meters (11 ft),[41] although many factors such as receiver quality and atmospheric issues can affect this accuracy.\n\nGPS is owned and operated by the United States government as a national resource. The Department of Defense is the steward of GPS. The Interagency GPS Executive Board (IGEB) oversaw GPS policy matters from 1996 to 2004. After that, the National Space-Based Positioning, Navigation and Timing Executive Committee was established by presidential directive in 2004 to advise and coordinate federal departments and agencies on matters concerning the GPS and related systems.[42] The executive committee is chaired jointly by the Deputy Secretaries of Defense and Transportation. Its membership includes equivalent-level officials from the Departments of State, Commerce, and Homeland Security, the Joint Chiefs of Staff and NASA. Components of the executive office of the president participate as observers to the executive committee, and the FCC chairman participates as a liaison.\n\nThe U.S. Department of Defense is required by law to \"maintain a Standard Positioning Service (as defined in the federal radio navigation plan and the standard positioning service signal specification) that will be available on a continuous, worldwide basis,\" and \"develop measures to prevent hostile use of GPS and its augmentations without unduly disrupting or degrading civilian uses.\"\n\n\nTimeline and modernization[edit]\n\nSummary of satellites[43][44][45]\n\tBlock\tLaunch \nperiod\tSatellite launches\tCurrently in orbit\n and healthy\n\n\tSuc-\ncess\tFail-\nure\tIn prep-\naration\tPlan-\nned\n\n\tI\n\t1978–1985\t10\t1\t0\t0\t0\n\n\tII\n\t1989–1990\t9\t0\t0\t0\t0\n\n\tIIA\n\t1990–1997\t19\t0\t0\t0\t0\n\n\tIIR\n\t1997–2004\t12\t1\t0\t0\t12\n\n\tIIR-M\n\t2005–2009\t8\t0\t0\t0\t7\n\n\tIIF\n\t2010–2016\t12\t0\t0\t0\t12\n\n\tIIIA\n\tFrom 2018\t2\t0\t5\t3\t2\n\n\tIIIF\n\t—\t0\t0\t0\t22\t0\n\n\tTotal\n\t72\t2\t5\t25\t33\n\n\t(Last update: August 22, 2019)\n\n8 satellites from Block IIA are placed in reserve\nUSA-203 from Block IIR-M is unhealthy\n[46] For a more complete list, see list of GPS satellite launches\n\n\n\n\n\n\tIn 1972, the USAF Central Inertial Guidance Test Facility (Holloman AFB) conducted developmental flight tests of four prototype GPS receivers in a Y configuration over White Sands Missile Range, using ground-based pseudo-satellites.[47]\n\tIn 1978, the first experimental Block-I GPS satellite was launched.[33]\n\tIn 1983, after Soviet interceptor aircraft shot down the civilian airliner KAL 007 that strayed into prohibited airspace because of navigational errors, killing all 269 people on board, U.S. President Ronald Reagan announced that GPS would be made available for civilian uses once it was completed,[48][49] although it had been previously published [in Navigation magazine], and that the CA code (Coarse/Acquisition code) would be available to civilian users.\n\tBy 1985, ten more experimental Block-I satellites had been launched to validate the concept.\n\tBeginning in 1988, command and control of these satellites was moved from Onizuka AFS, California to the 2nd Satellite Control Squadron (2SCS) located at Falcon Air Force Station in Colorado Springs, Colorado.[50][51]\n\tOn February 14, 1989, the first modern Block-II satellite was launched.\n\tThe Gulf War from 1990 to 1991 was the first conflict in which the military widely used GPS.[52]\n\tIn 1991, a project to create a miniature GPS receiver successfully ended, replacing the previous 16 kg (35 lb) military receivers with a 1.25 kg (2.8 lb) handheld receiver.[20]\n\tIn 1992, the 2nd Space Wing, which originally managed the system, was inactivated and replaced by the 50th Space Wing.  \nEmblem of the 50th Space Wing\n\n\n\n\tBy December 1993, GPS achieved initial operational capability (IOC), with a full constellation (24 satellites) available and providing the Standard Positioning Service (SPS).[53]\n\tFull Operational Capability (FOC) was declared by Air Force Space Command (AFSPC) in April 1995, signifying full availability of the military's secure Precise Positioning Service (PPS).[53]\n\tIn 1996, recognizing the importance of GPS to civilian users as well as military users, U.S. President Bill Clinton issued a policy directive[54] declaring GPS a dual-use system and establishing an Interagency GPS Executive Board to manage it as a national asset.\n\tIn 1998, United States Vice President Al Gore announced plans to upgrade GPS with two new civilian signals for enhanced user accuracy and reliability, particularly with respect to aviation safety, and in 2000 the United States Congress authorized the effort, referring to it as GPS III.\n\tOn May 2, 2000 \"Selective Availability\" was discontinued as a result of the 1996 executive order, allowing civilian users to receive a non-degraded signal globally.\n\tIn 2004, the United States government signed an agreement with the European Community establishing cooperation related to GPS and Europe's Galileo system.\n\tIn 2004, United States President George W. Bush updated the national policy and replaced the executive board with the National Executive Committee for Space-Based Positioning, Navigation, and Timing.[55]\n\tNovember 2004, Qualcomm announced successful tests of assisted GPS for mobile phones.[56]\n\tIn 2005, the first modernized GPS satellite was launched and began transmitting a second civilian signal (L2C) for enhanced user performance.[57]\n\tOn September 14, 2007, the aging mainframe-based Ground Segment Control System was transferred to the new Architecture Evolution Plan.[58]\n\tOn May 19, 2009, the United States Government Accountability Office issued a report warning that some GPS satellites could fail as soon as 2010.[59]\n\tOn May 21, 2009, the Air Force Space Command allayed fears of GPS failure, saying \"There's only a small risk we will not continue to exceed our performance standard.\"[60]\n\tOn January 11, 2010, an update of ground control systems caused a software incompatibility with 8,000 to 10,000 military receivers manufactured by a division of Trimble Navigation Limited of Sunnyvale, Calif.[61]\n\tOn February 25, 2010,[62] the U.S. Air Force awarded the contract to develop the GPS Next Generation Operational Control System (OCX) to improve accuracy and availability of GPS navigation signals, and serve as a critical part of GPS modernization.\n\n\nAwards[edit]\n\n  \nAir Force Space Commander presents Gladys West with an award as she is inducted into the Air Force Space and Missile Pioneers Hall of Fame for her GPS work on Dec. 6, 2018.\n\n\n\nOn February 10, 1993, the National Aeronautic Association selected the GPS Team as winners of the 1992 Robert J. Collier Trophy, the US’s most prestigious aviation award. This team combines researchers from the Naval Research Laboratory, the USAF, the Aerospace Corporation, Rockwell International Corporation, and IBM Federal Systems Company. The citation honors them \"for the most significant development for safe and efficient navigation and surveillance of air and spacecraft since the introduction of radio navigation 50 years ago.\"\n\nTwo GPS developers received the National Academy of Engineering Charles Stark Draper Prize for 2003:\n\n\n\tIvan Getting, emeritus president of The Aerospace Corporation and an engineer at the Massachusetts Institute of Technology, established the basis for GPS, improving on the World War II land-based radio system called LORAN (Long-range Radio Aid to Navigation).\n\tBradford Parkinson, professor of aeronautics and astronautics at Stanford University, conceived the present satellite-based system in the early 1960s and developed it in conjunction with the U.S. Air Force. Parkinson served twenty-one years in the Air Force, from 1957 to 1978, and retired with the rank of colonel.\n\n\nGPS developer Roger L. Easton received the National Medal of Technology on February 13, 2006.[63]\n\nFrancis X. Kane (Col. USAF, ret.) was inducted into the U.S. Air Force Space and Missile Pioneers Hall of Fame at Lackland A.F.B., San Antonio, Texas, March 2, 2010 for his role in space technology development and the engineering design concept of GPS conducted as part of Project 621B.\n\nIn 1998, GPS technology was inducted into the Space Foundation Space Technology Hall of Fame.[64]\n\nOn October 4, 2011, the International Astronautical Federation (IAF) awarded the Global Positioning System (GPS) its 60th Anniversary Award, nominated by IAF member, the American Institute for Aeronautics and Astronautics (AIAA). The IAF Honors and Awards Committee recognized the uniqueness of the GPS program and the exemplary role it has played in building international collaboration for the benefit of humanity.[65]\n\nGladys West was inducted into the Air Force Space and Missile Pioneers Hall of Fame in 2018 for recognition of her computational work which led to breakthroughs for GPS technology.[66]\n\nOn February 12, 2019, four founding members of the project were awarded the Queen Elizabeth Prize for Engineering with the chair of the awarding board stating \"Engineering is the foundation of civilisation; there is no other foundation; it makes things happen. And that's exactly what today's Laureates have done - they've made things happen. They've re-written, in a major way, the infrastructure of our world.\" [67]\n\n\nBasic concept of GPS[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Global Positioning System\" – news · newspapers · books · scholar · JSTOR  (March 2015) (Learn how and when to remove this template message)\n\n\n\nFundamentals[edit]\n\nThe GPS concept is based on time and the known position of GPS specialized satellites. The satellites carry very stable atomic clocks that are synchronized with one another and with the ground clocks. Any drift from true time maintained on the ground is corrected daily. In the same manner, the satellite locations are known with great precision. GPS receivers have clocks as well, but they are less stable and less precise.\n\nEach GPS satellite continuously transmits a radio signal containing the current time and data about its position.  Since the speed of radio waves is constant and independent of the satellite speed, the time delay between when the satellite transmits a signal and the receiver receives it is proportional to the distance from the satellite to the receiver.  A GPS receiver monitors multiple satellites and solves equations to determine the precise position of the receiver and its deviation from true time. At a minimum, four satellites must be in view of the receiver for it to compute four unknown quantities (three position coordinates and clock deviation from satellite time).\n\n\nMore detailed description[edit]\n\nEach GPS satellite continually broadcasts a signal (carrier wave with modulation) that includes:\n\n\n\tA pseudorandom code (sequence of ones and zeros) that is known to the receiver. By time-aligning a receiver-generated version and the receiver-measured version of the code, the time of arrival (TOA) of a defined point in the code sequence, called an epoch, can be found in the receiver clock time scale\n\tA message that includes the time of transmission (TOT) of the code epoch (in GPS time scale) and the satellite position at that time\n\n\nConceptually, the receiver measures the TOAs (according to its own clock) of four satellite signals. From the TOAs and the TOTs, the receiver forms four time of flight (TOF) values, which are (given the speed of light) approximately equivalent to receiver-satellite ranges. The receiver then computes its three-dimensional position and clock deviation from the four TOFs.\n\nIn practice the receiver position (in three dimensional Cartesian coordinates with origin at the Earth's center) and the offset of the receiver clock relative to the GPS time are computed simultaneously, using the navigation equations to process the TOFs.\n\nThe receiver's Earth-centered solution location is usually converted to latitude, longitude and height relative to an ellipsoidal Earth model. The height may then be further converted to height relative to the geoid, which is essentially mean sea level. These coordinates may be displayed, such as on a moving map display, or recorded or used by some other system, such as a vehicle guidance system.\n\n\nUser-satellite geometry[edit]\n\nAlthough usually not formed explicitly in the receiver processing, the conceptual time differences of arrival (TDOAs) define the measurement geometry. Each TDOA corresponds to a hyperboloid of revolution (see Multilateration). The line connecting the two satellites involved (and its extensions) forms the axis of the hyperboloid. The receiver is located at the point where three hyperboloids intersect.[68][69]\n\nIt is sometimes incorrectly said that the user location is at the intersection of three spheres. While simpler to visualize, this is the case only if the receiver has a clock synchronized with the satellite clocks (i.e., the receiver measures true ranges to the satellites rather than range differences). There are marked performance benefits to the user carrying a clock synchronized with the satellites. Foremost is that only three satellites are needed to compute a position solution. If it were an essential part of the GPS concept that all users needed to carry a synchronized clock, a smaller number of satellites could be deployed, but the cost and complexity of the user equipment would increase.\n\n\nReceiver in continuous operation[edit]\n\nThe description above is representative of a receiver start-up situation. Most receivers have a track algorithm, sometimes called a tracker, that combines sets of satellite measurements collected at different times—in effect, taking advantage of the fact that successive receiver positions are usually close to each other. After a set of measurements are processed, the tracker predicts the receiver location corresponding to the next set of satellite measurements. When the new measurements are collected, the receiver uses a weighting scheme to combine the new measurements with the tracker prediction. In general, a tracker can (a) improve receiver position and time accuracy, (b) reject bad measurements, and (c) estimate receiver speed and direction.\n\nThe disadvantage of a tracker is that changes in speed or direction can be computed only with a delay, and that derived direction becomes inaccurate when the distance traveled between two position measurements drops below or near the random error of position measurement. GPS units can use measurements of the Doppler shift of the signals received to compute velocity accurately.[70] More advanced navigation systems use additional sensors like a compass or an inertial navigation system to complement GPS.\n\n\nNon-navigation applications[edit]\n\nFor a list of applications, see  § Applications.\n\nGPS requires four or more satellites to be visible for accurate navigation. The solution of the navigation equations gives the position of the receiver along with the difference between the time kept by the receiver's on-board clock and the true time-of-day, thereby eliminating the need for a more precise and possibly impractical receiver based clock. Applications for GPS such as time transfer, traffic signal timing, and synchronization of cell phone base stations, make use of this cheap and highly accurate timing. Some GPS applications use this time for display, or, other than for the basic position calculations, do not use it at all.\n\nAlthough four satellites are required for normal operation, fewer apply in special cases. If one variable is already known, a receiver can determine its position using only three satellites. For example, a ship or aircraft may have known elevation. Some GPS receivers may use additional clues or assumptions such as reusing the last known altitude, dead reckoning, inertial navigation, or including information from the vehicle computer, to give a (possibly degraded) position when fewer than four satellites are visible.[71][72][73]\n\n\nStructure[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Global Positioning System\" – news · newspapers · books · scholar · JSTOR  (March 2015) (Learn how and when to remove this template message)\n\n\n\nThe current GPS consists of three major segments. These are the space segment, a control segment, and a user segment.[74] The U.S. Air Force develops, maintains, and operates the space and control segments. GPS satellites broadcast signals from space, and each GPS receiver uses these signals to calculate its three-dimensional location (latitude, longitude, and altitude) and the current time.[75]\n\n\nSpace segment[edit]\n\nSee also: GPS (satellite) and List of GPS satellites\n\n  \nUnlaunched GPS block II-A satellite on display at the San Diego Air & Space Museum\n\n\n\n  \nA visual example of a 24 satellite GPS constellation in motion with the Earth rotating. Notice how the number of satellites in view from a given point on the Earth's surface changes with time. The point in this example is in Golden, Colorado, USA (39.7469° N, 105.2108° W).\n\n\n\nThe space segment (SS) is composed of 24 to 32 satellites, or Space Vehicles (SV), in medium Earth orbit, and also includes the payload adapters to the boosters required to launch them into orbit. The GPS design originally called for 24 SVs, eight each in three approximately circular orbits,[76] but this was modified to six orbital planes with four satellites each.[77] The six orbit planes have approximately 55° inclination (tilt relative to the Earth's equator) and are separated by 60° right ascension of the ascending node (angle along the equator from a reference point to the orbit's intersection).[78] The orbital period is one-half a sidereal day, i.e., 11 hours and 58 minutes so that the satellites pass over the same locations[79] or almost the same locations[80] every day. The orbits are arranged so that at least six satellites are always within line of sight from everywhere on the Earth's surface (see animation at right).[81] The result of this objective is that the four satellites are not evenly spaced (90°) apart within each orbit. In general terms, the angular difference between satellites in each orbit is 30°, 105°, 120°, and 105° apart, which sum to 360°.[82]\n\nOrbiting at an altitude of approximately 20,200 km (12,600 mi); orbital radius of approximately 26,600 km (16,500 mi),[83] each SV makes two complete orbits each sidereal day, repeating the same ground track each day.[84] This was very helpful during development because even with only four satellites, correct alignment means all four are visible from one spot for a few hours each day. For military operations, the ground track repeat can be used to ensure good coverage in combat zones.\n\nAs of February 2019[update],[85] there are 31 satellites in the GPS constellation, 27 of which are in use at a given time with the rest allocated as stand-bys. A 32nd was launched in 2018. As of July 2019[update], this last is still in evaluation. More decommissioned satellites are in orbit and available as spares. The additional satellites over 24 improve the precision of GPS receiver calculations by providing redundant measurements. With the increased number of satellites, the constellation was changed to a nonuniform arrangement. Such an arrangement was shown to improve accuracy but also improves reliability and availability of the system, relative to a uniform system, when multiple satellites fail.[86] With the expanded constellation, 9 satellites are usually visible from any point on the ground at any one time, ensuring considerable redundancy over the minimum 4 satellites needed for a position.\n\n\nControl segment[edit]\n\n  \nGround monitor station used from 1984 to 2007, on display at the Air Force Space & Missile Museum.\n\n\n\nThe control segment (CS) is composed of:\n\n\n\ta master control station (MCS),\n\tan alternative master control station,\n\tfour dedicated ground antennas, and\n\tsix dedicated monitor stations.\n\n\nThe MCS can also access U.S. Air Force Satellite Control Network (AFSCN) ground antennas (for additional command and control capability) and NGA (National Geospatial-Intelligence Agency) monitor stations. The flight paths of the satellites are tracked by dedicated U.S. Air Force monitoring stations in Hawaii, Kwajalein Atoll, Ascension Island, Diego Garcia, Colorado Springs, Colorado and Cape Canaveral, along with shared NGA monitor stations operated in England, Argentina, Ecuador, Bahrain, Australia and Washington DC.[87] The tracking information is sent to the Air Force Space Command MCS at Schriever Air Force Base 25 km (16 mi) ESE of Colorado Springs, which is operated by the 2nd Space Operations Squadron (2 SOPS) of the U.S. Air Force. Then 2 SOPS contacts each GPS satellite regularly with a navigational update using dedicated or shared (AFSCN) ground antennas (GPS dedicated ground antennas are located at Kwajalein, Ascension Island, Diego Garcia, and Cape Canaveral). These updates synchronize the atomic clocks on board the satellites to within a few nanoseconds of each other, and adjust the ephemeris of each satellite's internal orbital model. The updates are created by a Kalman filter that uses inputs from the ground monitoring stations, space weather information, and various other inputs.[88]\n\nSatellite maneuvers are not precise by GPS standards—so to change a satellite's orbit, the satellite must be marked unhealthy, so receivers don't use it. After the satellite maneuver, engineers track the new orbit from the ground, upload the new ephemeris, and mark the satellite healthy again.\n\nThe operation control segment (OCS) currently serves as the control segment of record. It provides the operational capability that supports GPS users and keeps the GPS operational and performing within specification.\n\nOCS successfully replaced the legacy 1970s-era mainframe computer at Schriever Air Force Base in September 2007. After installation, the system helped enable upgrades and provide a foundation for a new security architecture that supported U.S. armed forces.\n\nOCS will continue to be the ground control system of record until the new segment, Next Generation GPS Operation Control System[5] (OCX), is fully developed and functional. The new capabilities provided by OCX will be the cornerstone for revolutionizing GPS's mission capabilities, enabling[89] Air Force Space Command to greatly enhance GPS operational services to U.S. combat forces, civil partners and myriad domestic and international users. The GPS OCX program also will reduce cost, schedule and technical risk. It is designed to provide 50%[90] sustainment cost savings through efficient software architecture and Performance-Based Logistics. In addition, GPS OCX is expected to cost millions less than the cost to upgrade OCS while providing four times the capability.\n\nThe GPS OCX program represents a critical part of GPS modernization and provides significant information assurance improvements over the current GPS OCS program.\n\n\n\tOCX will have the ability to control and manage GPS legacy satellites as well as the next generation of GPS III satellites, while enabling the full array of military signals.\n\tBuilt on a flexible architecture that can rapidly adapt to the changing needs of today's and future GPS users allowing immediate access to GPS data and constellation status through secure, accurate and reliable information.\n\tProvides the warfighter with more secure, actionable and predictive information to enhance situational awareness.\n\tEnables new modernized signals (L1C, L2C, and L5) and has M-code capability, which the legacy system is unable to do.\n\tProvides significant information assurance improvements over the current program including detecting and preventing cyber attacks, while isolating, containing and operating during such attacks.\n\tSupports higher volume near real-time command and control capabilities and abilities.\n\n\nOn September 14, 2011,[91] the U.S. Air Force announced the completion of GPS OCX Preliminary Design Review and confirmed that the OCX program is ready for the next phase of development.\n\nThe GPS OCX program has missed major milestones and is pushing its launch into 2021, 5 years past the original deadline. According to the Government Accounting Office, even this new deadline looks shaky.[92]\n\n\nUser segment[edit]\n\nFurther information: GPS navigation device\n\n  \nGPS receivers come in a variety of formats, from devices integrated into cars, phones, and watches, to dedicated devices such as these.\n\n\n\n  \nThe first portable GPS unit, Leica WM 101 displayed at the Irish National Science Museum at Maynooth.\n\n\n\nThe user segment (US) is composed of hundreds of thousands of U.S. and allied military users of the secure GPS Precise Positioning Service, and tens of millions of civil, commercial and scientific users of the Standard Positioning Service (see GPS navigation devices). In general, GPS receivers are composed of an antenna, tuned to the frequencies transmitted by the satellites, receiver-processors, and a highly stable clock (often a crystal oscillator). They may also include a display for providing location and speed information to the user. A receiver is often described by its number of channels: this signifies how many satellites it can monitor simultaneously. Originally limited to four or five, this has progressively increased over the years so that, as of 2007[update], receivers typically have between 12 and 20 channels.  Though there are many receiver manufacturers, they almost all use one of the chipsets produced for this purpose.[citation needed]\n\n\n  \nA typical OEM GPS receiver module measuring 15 mm × 17 mm (0.6 in × 0.7 in)\n\n\n\nGPS receivers may include an input for differential corrections, using the RTCM SC-104 format. This is typically in the form of an RS-232 port at 4,800 bit/s speed. Data is actually sent at a much lower rate, which limits the accuracy of the signal sent using RTCM.[citation needed] Receivers with internal DGPS receivers can outperform those using external RTCM data.[citation needed] As of 2006[update], even low-cost units commonly include Wide Area Augmentation System (WAAS) receivers.\n\n\n  \nA typical GPS receiver with integrated antenna.\n\n\n\nMany GPS receivers can relay position data to a PC or other device using the NMEA 0183 protocol. Although this protocol is officially defined by the National Marine Electronics Association (NMEA),[93] references to this protocol have been compiled from public records, allowing open source tools like gpsd to read the protocol without violating intellectual property laws.[clarification needed] Other proprietary protocols exist as well, such as the SiRF and MTK protocols. Receivers can interface with other devices using methods including a serial connection, USB, or Bluetooth.\n\n\nApplications[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Global Positioning System\" – news · newspapers · books · scholar · JSTOR  (March 2015) (Learn how and when to remove this template message)\n\n\n\nMain article: GNSS applications\n\nSee also: GPS navigation device\n\nWhile originally a military project, GPS is considered a dual-use technology, meaning it has significant civilian applications as well.\n\nGPS has become a widely deployed and useful tool for commerce, scientific uses, tracking, and surveillance. GPS's accurate time facilitates everyday activities such as banking, mobile phone operations, and even the control of power grids by allowing well synchronized hand-off switching.[75]\n\n\nCivilian[edit]\n\n  \nThis antenna is mounted on the roof of a hut containing a scientific experiment needing precise timing.\n\n\n\nMany civilian applications use one or more of GPS's three basic components: absolute location, relative movement, and time transfer.\n\n\n\tAstronomy: both positional and clock synchronization data is used in astrometry and celestial mechanics. GPS is also used in both amateur astronomy with small telescopes as well as by professional observatories for finding extrasolar planets.\n\tAutomated vehicle: applying location and routes for cars and trucks to function without a human driver.\n\tCartography: both civilian and military cartographers use GPS extensively.\n\tCellular telephony: clock synchronization enables time transfer, which is critical for synchronizing its spreading codes with other base stations to facilitate inter-cell handoff and support hybrid GPS/cellular position detection for mobile emergency calls and other applications. The first handsets with integrated GPS launched in the late 1990s. The U.S. Federal Communications Commission (FCC) mandated the feature in either the handset or in the towers (for use in triangulation) in 2002 so emergency services could locate 911 callers. Third-party software developers later gained access to GPS APIs from Nextel upon launch, followed by Sprint in 2006, and Verizon soon thereafter.\n\tClock synchronization: the accuracy of GPS time signals (±10 ns)[94] is second only to the atomic clocks they are based on, and is used in applications such as GPS disciplined oscillators.\n\tDisaster relief/emergency services: many emergency services depend upon GPS for location and timing capabilities.\n\tGPS-equipped radiosondes and dropsondes: measure and calculate the atmospheric pressure, wind speed and direction up to 27 km (89,000 ft) from the Earth's surface.\n\tRadio occultation for weather and atmospheric science applications.[95]\n\tFleet tracking: used to identify, locate and maintain contact reports with one or more fleet vehicles in real-time.\n\tGeofencing: vehicle tracking systems, person tracking systems, and pet tracking systems use GPS to locate devices that are attached to or carried by a person, vehicle, or pet. The application can provide continuous tracking and send notifications if the target leaves a designated (or \"fenced-in\") area.[96]\n\tGeotagging: applies location coordinates to digital objects such as photographs (in Exif data) and other documents for purposes such as creating map overlays with devices like Nikon GP-1\n\tGPS aircraft tracking\n\tGPS for mining: the use of RTK GPS has significantly improved several mining operations such as drilling, shoveling, vehicle tracking, and surveying. RTK GPS provides centimeter-level positioning accuracy.\n\tGPS data mining: It is possible to aggregate GPS data from multiple users to understand movement patterns, common trajectories and interesting locations.[97]\n\tGPS tours: location determines what content to display; for instance, information about an approaching point of interest.\n\tNavigation: navigators value digitally precise velocity and orientation measurements.\n\tPhasor measurements: GPS enables highly accurate timestamping of power system measurements, making it possible to compute phasors.\n\tRecreation: for example, Geocaching, Geodashing, GPS drawing, waymarking, and other kinds of location based mobile games.\n\tRobotics: self-navigating, autonomous robots using a GPS sensors, which calculate latitude, longitude, time, speed, and heading.\n\tSport: used in football and rugby for the control and analysis of the training load.[98]\n\tSurveying: surveyors use absolute locations to make maps and determine property boundaries.\n\tTectonics: GPS enables direct fault motion measurement of earthquakes. Between earthquakes GPS can be used to measure crustal motion and deformation[99] to estimate seismic strain buildup for creating seismic hazard maps.\n\tTelematics: GPS technology integrated with computers and mobile communications technology in automotive navigation systems.\n\n\nRestrictions on civilian use[edit]\n\nThe U.S. government controls the export of some civilian receivers. All GPS receivers capable of functioning above 18 km (59,000 ft) above sea level and 515 m/s (1,000 kn; 2,000 km/h; 1,000 mph), or designed or modified for use with unmanned missiles and aircraft, are classified as munitions (weapons)—which means they require State Department export licenses.[100]\n\nThis rule applies even to otherwise purely civilian units that only receive the L1 frequency and the C/A (Coarse/Acquisition) code.\n\nDisabling operation above these limits exempts the receiver from classification as a munition. Vendor interpretations differ. The rule refers to operation at both the target altitude and speed, but some receivers stop operating even when stationary. This has caused problems with some amateur radio balloon launches that regularly reach 30 km (100,000 feet).\n\nThese limits only apply to units or components exported from the United States. A growing trade in various components exists, including GPS units from other countries. These are expressly sold as ITAR-free.\n\n\nMilitary[edit]\n\n  \nAttaching a GPS guidance kit to a dumb bomb, March 2003.\n\n\n\n  \nM982 Excalibur GPS-guided artillery shell.\n\n\n\nAs of 2009, military GPS applications include:\n\n\n\tNavigation: Soldiers use GPS to find objectives, even in the dark or in unfamiliar territory, and to coordinate troop and supply movement. In the United States armed forces, commanders use the Commander's Digital Assistant and lower ranks use the Soldier Digital Assistant.[101]\n\tTarget tracking: Various military weapons systems use GPS to track potential ground and air targets before flagging them as hostile.[citation needed] These weapon systems pass target coordinates to precision-guided munitions to allow them to engage targets accurately. Military aircraft, particularly in air-to-ground roles, use GPS to find targets.\n\tMissile and projectile guidance: GPS allows accurate targeting of various military weapons including ICBMs, cruise missiles, precision-guided munitions and artillery shells. Embedded GPS receivers able to withstand accelerations of 12,000 g or about 118 km/s2 (260,000 mph/s) have been developed for use in 155-millimeter (6.1 in) howitzer shells.[102]\n\tSearch and rescue.\n\tReconnaissance: Patrol movement can be managed more closely.\n\tGPS satellites carry a set of nuclear detonation detectors consisting of an optical sensor called a bhangmeter, an X-ray sensor, a dosimeter, and an electromagnetic pulse (EMP) sensor (W-sensor), that form a major portion of the United States Nuclear Detonation Detection System.[103][104] General William Shelton has stated that future satellites may drop this feature to save money.[105]\n\n\nGPS type navigation was first used in war in the 1991 Persian Gulf War, before GPS was fully developed in 1995, to assist Coalition Forces to navigate and perform maneuvers in the war.  The war also demonstrated the vulnerability of GPS to being jammed, when Iraqi forces installed jamming devices on likely targets that emitted radio noise, disrupting reception of the weak GPS signal.[106]\n\nGPS's vulnerability to jamming is a threat that continues to grow as jamming equipment and experience grows.[107][108] GPS signals have been reported to have been jammed many times over the years for military purposes. Russia seems to have several objectives for this behavior, such as intimidating neighbors while undermining confidence in their reliance on American systems, promoting their GLONASS alternative, disrupting Western military exercises, and protecting assets from drones.[109] China uses jamming to discourage US surveillance aircraft near the contested Spratly Islands.[110] North Korea has mounted several major jamming operations near its border with South Korea and offshore, disrupting flights, shipping and fishing operations.[111]\n\n\nCommunication[edit]\n\nMain article: GPS signals\n\nThe navigational signals transmitted by GPS satellites encode a variety of information including satellite positions, the state of the internal clocks, and the health of the network. These signals are transmitted on two separate carrier frequencies that are common to all satellites in the network. Two different encodings are used: a public encoding that enables lower resolution navigation, and an encrypted encoding used by the U.S. military.\n\n\nMessage format[edit]\n\n\tGPS message format\n\tSubframes\tDescription\n\n\t1\tSatellite clock,\nGPS time relationship\n\n\t2–3\tEphemeris\n(precise satellite orbit)\n\n\t4–5\tAlmanac component\n(satellite network synopsis,\nerror correction)\n\n\n\n\n\nEach GPS satellite continuously broadcasts a navigation message on L1 (C/A and P/Y) and L2 (P/Y) frequencies at a rate of 50 bits per second (see bitrate). Each complete message takes 750 seconds (12 1/2 minutes) to complete. The message structure has a basic format of a 1500-bit-long frame made up of five subframes, each subframe being 300 bits (6 seconds) long. Subframes 4 and 5 are subcommutated 25 times each, so that a complete data message requires the transmission of 25 full frames. Each subframe consists of ten words, each 30 bits long. Thus, with 300 bits in a subframe times 5 subframes in a frame times 25 frames in a message, each message is 37,500 bits long. At a transmission rate of 50-bit/s, this gives 750 seconds to transmit an entire almanac message (GPS). Each 30-second frame begins precisely on the minute or half-minute as indicated by the atomic clock on each satellite.[112]\n\nThe first subframe of each frame encodes the week number and the time within the week,[113] as well as the data about the health of the satellite. The second and the third subframes contain the ephemeris – the precise orbit for the satellite. The fourth and fifth subframes contain the almanac, which contains coarse orbit and status information for up to 32 satellites in the constellation as well as data related to error correction. Thus, to obtain an accurate satellite location from this transmitted message, the receiver must demodulate the message from each satellite it includes in its solution for 18 to 30 seconds. To collect all transmitted almanacs, the receiver must demodulate the message for 732 to 750 seconds or 12 1/2 minutes.[114]\n\nAll satellites broadcast at the same frequencies, encoding signals using unique code division multiple access (CDMA) so receivers can distinguish individual satellites from each other. The system uses two distinct CDMA encoding types: the coarse/acquisition (C/A) code, which is accessible by the general public, and the precise (P(Y)) code, which is encrypted so that only the U.S. military and other NATO nations who have been given access to the encryption code can access it.[115]\n\nThe ephemeris is updated every 2 hours and is generally valid for 4 hours, with provisions for updates every 6 hours or longer in non-nominal conditions. The almanac is updated typically every 24 hours. Additionally, data for a few weeks following is uploaded in case of transmission updates that delay data upload.[citation needed]\n\n\nSatellite frequencies[edit]\n\n\tGPS frequency overview[116]:607\n\tBand\tFrequency\tDescription\n\n\tL1\t1575.42 MHz\tCoarse-acquisition (C/A) and encrypted precision (P(Y)) codes, plus the L1 civilian (L1C) and military (M) codes on future Block III satellites.\n\n\tL2\t1227.60 MHz\tP(Y) code, plus the L2C and military codes on the Block IIR-M and newer satellites.\n\n\tL3\t1381.05 MHz\tUsed for nuclear detonation (NUDET) detection.\n\n\tL4\t1379.913 MHz\tBeing studied for additional ionospheric correction.\n\n\tL5\t1176.45 MHz\tProposed for use as a civilian safety-of-life (SoL) signal.\n\n\n\n\n\nAll satellites broadcast at the same two frequencies, 1.57542 GHz (L1 signal) and 1.2276 GHz (L2 signal). The satellite network uses a CDMA spread-spectrum technique[116]:607 where the low-bitrate message data is encoded with a high-rate pseudo-random (PRN) sequence that is different for each satellite. The receiver must be aware of the PRN codes for each satellite to reconstruct the actual message data. The C/A code, for civilian use, transmits data at 1.023 million chips per second, whereas the P code, for U.S. military use, transmits at 10.23 million chips per second. The actual internal reference of the satellites is 10.22999999543 MHz to compensate for relativistic effects[117][118] that make observers on the Earth perceive a different time reference with respect to the transmitters in orbit. The L1 carrier is modulated by both the C/A and P codes, while the L2 carrier is only modulated by the P code.[82] The P code can be encrypted as a so-called P(Y) code that is only available to military equipment with a proper decryption key. Both the C/A and P(Y) codes impart the precise time-of-day to the user.\n\nThe L3 signal at a frequency of 1.38105 GHz is used to transmit data from the satellites to ground stations. This data is used by the United States Nuclear Detonation (NUDET) Detection System (USNDS) to detect, locate, and report nuclear detonations (NUDETs) in the Earth's atmosphere and near space.[119] One usage is the enforcement of nuclear test ban treaties.\n\nThe L4 band at 1.379913 GHz is being studied for additional ionospheric correction.[116]:607\n\nThe L5 frequency band at 1.17645 GHz was added in the process of GPS modernization. This frequency falls into an internationally protected range for aeronautical navigation, promising little or no interference under all circumstances. The first Block IIF satellite that provides this signal was launched in May 2010.[120] On February 5th 2016, the 12th and final Block IIF satellite was launched.[121] The L5 consists of two carrier components that are in phase quadrature with each other. Each carrier component is bi-phase shift key (BPSK) modulated by a separate bit train. \"L5, the third civil GPS signal, will eventually support safety-of-life applications for aviation and provide improved availability and accuracy.\"[122]\n\nIn 2011, a conditional waiver was granted to LightSquared to operate a terrestrial broadband service near the L1 band. Although LightSquared had applied for a license to operate in the 1525 to 1559 band as early as 2003 and it was put out for public comment, the FCC asked LightSquared to form a study group with the GPS community to test GPS receivers and identify issue that might arise due to the larger signal power from the LightSquared terrestrial network. The GPS community had not objected to the LightSquared (formerly MSV and SkyTerra) applications until November 2010, when LightSquared applied for a modification to its Ancillary Terrestrial Component (ATC) authorization. This filing (SAT-MOD-20101118-00239) amounted to a request to run several orders of magnitude more power in the same frequency band for terrestrial base stations, essentially repurposing what was supposed to be a \"quiet neighborhood\" for signals from space as the equivalent of a cellular network. Testing in the first half of 2011 has demonstrated that the impact of the lower 10 MHz of spectrum is minimal to GPS devices (less than 1% of the total GPS devices are affected). The upper 10 MHz intended for use by LightSquared may have some impact on GPS devices. There is some concern that this may seriously degrade the GPS signal for many consumer uses.[123][124] Aviation Week magazine reports that the latest testing (June 2011) confirms \"significant jamming\" of GPS by LightSquared's system.[125]\n\n\nDemodulation and decoding[edit]\n\n  \nDemodulating and Decoding GPS Satellite Signals using the Coarse/Acquisition Gold code.\n\n\n\nBecause all of the satellite signals are modulated onto the same L1 carrier frequency, the signals must be separated after demodulation. This is done by assigning each satellite a unique binary sequence known as a Gold code. The signals are decoded after demodulation using addition of the Gold codes corresponding to the satellites monitored by the receiver.[126][127]\n\nIf the almanac information has previously been acquired, the receiver picks the satellites to listen for by their PRNs, unique numbers in the range 1 through 32. If the almanac information is not in memory, the receiver enters a search mode until a lock is obtained on one of the satellites. To obtain a lock, it is necessary that there be an unobstructed line of sight from the receiver to the satellite. The receiver can then acquire the almanac and determine the satellites it should listen for. As it detects each satellite's signal, it identifies it by its distinct C/A code pattern. There can be a delay of up to 30 seconds before the first estimate of position because of the need to read the ephemeris data.\n\nProcessing of the navigation message enables the determination of the time of transmission and the satellite position at this time. For more information see Demodulation and Decoding, Advanced.\n\n\nNavigation equations[edit]\n\nFurther information: GNSS positioning calculation\n\nSee also: Pseudorange\n\nProblem description[edit]\n\nThe receiver uses messages received from satellites to determine the satellite positions and time sent. The x, y, and z components of satellite position and the time sent are designated as [xi, yi, zi, si] where the subscript i denotes the satellite and has the value 1, 2, ..., n, where n ≥ 4. When the time of message reception indicated by the on-board receiver clock is t̃i, the true reception time is ti = t̃i − b, where b is the receiver's clock bias from the much more accurate GPS clocks employed by the satellites. The receiver clock bias is the same for all received satellite signals (assuming the satellite clocks are all perfectly synchronized). The message's transit time is t̃i − b − si, where si is the satellite time. Assuming the message traveled at the speed of light, c, the distance traveled is (t̃i − b − si) c.\n\nFor n satellites, the equations to satisfy are:\n\n\n\t\n  \n    \n      \n        \n          d\n          \n            i\n          \n        \n        =\n        \n          (\n          \n            \n              \n                \n                  \n                    t\n                    ~\n                  \n                \n              \n              \n                i\n              \n            \n            −\n            b\n            −\n            \n              s\n              \n                i\n              \n            \n          \n          )\n        \n        c\n        ,\n        \n        i\n        =\n        1\n        ,\n        2\n        ,\n        …\n        ,\n        n\n      \n    \n    {\\displaystyle d_{i}=\\left({\\tilde {t}}_{i}-b-s_{i}\\right)c,\\;i=1,2,\\dots ,n}\n  \n\n\n\nwhere di is the geometric distance or range between receiver and satellite i (the values without subscripts are the x, y, and z components of receiver position):\n\n\n\t\n  \n    \n      \n        \n          d\n          \n            i\n          \n        \n        =\n        \n          \n            (\n            x\n            −\n            \n              x\n              \n                i\n              \n            \n            \n              )\n              \n                2\n              \n            \n            +\n            (\n            y\n            −\n            \n              y\n              \n                i\n              \n            \n            \n              )\n              \n                2\n              \n            \n            +\n            (\n            z\n            −\n            \n              z\n              \n                i\n              \n            \n            \n              )\n              \n                2\n              \n            \n          \n        \n      \n    \n    {\\displaystyle d_{i}={\\sqrt {(x-x_{i})^{2}+(y-y_{i})^{2}+(z-z_{i})^{2}}}}\n  \n\n\n\nDefining pseudoranges as \n  \n    \n      \n        \n          p\n          \n            i\n          \n        \n        =\n        \n          (\n          \n            \n              \n                \n                  \n                    t\n                    ~\n                  \n                \n              \n              \n                i\n              \n            \n            −\n            \n              s\n              \n                i\n              \n            \n          \n          )\n        \n        c\n      \n    \n    {\\displaystyle p_{i}=\\left({\\tilde {t}}_{i}-s_{i}\\right)c}\n  \n, we see they are biased versions of the true range:\n\n\n\t\n  \n    \n      \n        \n          p\n          \n            i\n          \n        \n        =\n        \n          d\n          \n            i\n          \n        \n        +\n        b\n        c\n        ,\n        \n        i\n        =\n        1\n        ,\n        2\n        ,\n        .\n        .\n        .\n        ,\n        n\n      \n    \n    {\\displaystyle p_{i}=d_{i}+bc,\\;i=1,2,...,n}\n  \n .[128][129]\n\n\nSince the equations have four unknowns [x, y, z, b]—the three components of GPS receiver position and the clock bias—signals from at least four satellites are necessary to attempt solving these equations. They can be solved by algebraic or numerical methods. Existence and uniqueness of GPS solutions are discussed by Abell and Chaffee.[68] When n is greater than 4 this system is overdetermined and a fitting method must be used.\n\nThe amount of error in the results varies with the received satellites' locations in the sky, since certain configurations (when the received satellites are close together in the sky) cause larger errors.  Receivers usually calculate a running estimate of the error in the calculated position. This is done by multiplying the basic resolution of the receiver by quantities called the geometric dilution of position (GDOP) factors, calculated from the relative sky directions of the satellites used.[130] The receiver location is expressed in a specific coordinate system, such as latitude and longitude using the WGS 84 geodetic datum or a country-specific system.[131]\n\n\nGeometric interpretation[edit]\n\nThe GPS equations can be solved by numerical and analytical methods. Geometrical interpretations can enhance the understanding of these solution methods.\n\n\nSpheres[edit]\n\nThe measured ranges, called pseudoranges, contain clock errors. In a simplified idealization in which the ranges are synchronized, these true ranges represent the radii of spheres, each centered on one of the transmitting satellites. The solution for the position of the receiver is then at the intersection of the surfaces of these spheres. Signals from at minimum three satellites are required, and their three spheres would typically intersect at two points.[132] One of the points is the location of the receiver, and the other moves rapidly in successive measurements and would not usually be on Earth's surface.\n\nIn practice, there are many sources of inaccuracy besides clock bias, including random errors as well as the potential for precision loss from subtracting numbers close to each other if the centers of the spheres are relatively close together. This means that the position calculated from three satellites alone is unlikely to be accurate enough. Data from more satellites can help because of the tendency for random errors to cancel out and also by giving a larger spread between the sphere centers. But at the same time, more spheres will not generally intersect at one point. Therefore, a near intersection gets computed, typically via least squares. The more signals available, the better the approximation is likely to be.\n\n\nHyperboloids[edit]\n\nIf the pseudorange between the receiver and satellite i and the pseudorange between the receiver and satellite j are subtracted, pi − pj, the common receiver clock bias (b) cancels out, resulting in a difference of distances di − dj. The locus of points having a constant difference in distance to two points (here, two satellites) is a hyperbola on a plane and a hyperboloid of revolution in 3D space (see Multilateration). Thus, from four pseudorange measurements, the receiver can be placed at the intersection of the surfaces of three hyperboloids each with foci at a pair of satellites. With additional satellites, the multiple intersections are not necessarily unique, and a best-fitting solution is sought instead.[68][69][133][134][135]\n\n\nInscribed sphere[edit]\n\nThe receiver position can be interpreted as the center of an inscribed sphere (insphere) of radius bc, given by the receiver clock bias b (scaled by the speed of light c).  The insphere location is such that it touches other spheres (see Problem of Apollonius#Applications).  The circumscribing spheres are centered at the GPS satellites, whose radii equal the measured pseudoranges pi. This configuration is distinct from the one described in section #Spheres, in which the spheres' radii were the unbiased or geometric ranges di.[135][136]\n\n\nSpherical cones[edit]\n\nThe clock in the receiver is usually not of the same quality as the ones in the satellites and will not be accurately synchronised to them. This produces large errors in the computed distances to the satellites. Therefore, in practice, the time difference between the receiver clock and the satellite time is defined as an unknown clock bias b. The equations are then solved simultaneously for the receiver position and the clock bias.  The solution space [x, y, z, b] can be seen as a four-dimensional geometric space, and signals from at minimum four satellites are needed. In that case each of the equations describes a spherical cone,[137] with the cusp located at the satellite, and the base a sphere around the satellite. The receiver is at the intersection of four or more of such cones.\n\n\nSolution methods[edit]\n\nLeast squares[edit]\n\nWhen more than four satellites are available, the calculation can use the four best, or more than four simultaneously (up to all visible satellites), depending on the number of receiver channels, processing capability, and geometric dilution of precision (GDOP).\n\nUsing more than four involves an over-determined system of equations with no unique solution; such a system can be solved by a least-squares or weighted least squares method.[128]\n\n\n\t\n  \n    \n      \n        \n          (\n          \n            \n              \n                \n                  x\n                  ^\n                \n              \n            \n            ,\n            \n              \n                \n                  y\n                  ^\n                \n              \n            \n            ,\n            \n              \n                \n                  z\n                  ^\n                \n              \n            \n            ,\n            \n              \n                \n                  b\n                  ^\n                \n              \n            \n          \n          )\n        \n        =\n        \n          \n            \n              arg\n              ⁡\n              min\n            \n            \n              (\n              \n                x\n                ,\n                y\n                ,\n                z\n                ,\n                b\n              \n              )\n            \n          \n        \n        \n          ∑\n          \n            i\n          \n        \n        \n          \n            (\n            \n              \n                \n                  (\n                  x\n                  −\n                  \n                    x\n                    \n                      i\n                    \n                  \n                  \n                    )\n                    \n                      2\n                    \n                  \n                  +\n                  (\n                  y\n                  −\n                  \n                    y\n                    \n                      i\n                    \n                  \n                  \n                    )\n                    \n                      2\n                    \n                  \n                  +\n                  (\n                  z\n                  −\n                  \n                    z\n                    \n                      i\n                    \n                  \n                  \n                    )\n                    \n                      2\n                    \n                  \n                \n              \n              +\n              b\n              c\n              −\n              \n                p\n                \n                  i\n                \n              \n            \n            )\n          \n          \n            2\n          \n        \n      \n    \n    {\\displaystyle \\left({\\hat {x}},{\\hat {y}},{\\hat {z}},{\\hat {b}}\\right)={\\underset {\\left(x,y,z,b\\right)}{\\arg \\min }}\\sum _{i}\\left({\\sqrt {(x-x_{i})^{2}+(y-y_{i})^{2}+(z-z_{i})^{2}}}+bc-p_{i}\\right)^{2}}\n  \n\n\n\nIterative[edit]\n\nBoth the equations for four satellites, or the least squares equations for more than four, are non-linear and need special solution methods. A common approach is by iteration on a linearized form of the equations, such as the Gauss–Newton algorithm.\n\nThe GPS was initially developed assuming use of a numerical least-squares solution method—i.e., before closed-form solutions were found.\n\n\nClosed-form[edit]\n\nOne closed-form solution to the above set of equations was developed by S. Bancroft.[129][138] Its properties are well known;[68][69][139] in particular, proponents claim it is superior in low-GDOP situations, compared to iterative least squares methods.[138]\n\nBancroft's method is algebraic, as opposed to numerical, and can be used for four or more satellites. When four satellites are used, the key steps are inversion of a 4x4 matrix and solution of a single-variable quadratic equation. Bancroft's method provides one or two solutions for the unknown quantities. When there are two (usually the case), only one is a near-Earth sensible solution.[129]\n\nWhen a receiver uses more than four satellites for a solution, Bancroft uses the generalized inverse (i.e., the pseudoinverse) to find a solution. A case has been made that iterative methods, such as the Gauss–Newton algorithm approach for solving over-determined non-linear least squares (NLLS) problems, generally provide more accurate solutions.[140]\n\nLeick et al. (2015) states that \"Bancroft's (1985) solution is a very early, if not the first, closed-form solution.\"[141]\nOther closed-form solutions were published afterwards,[142][143] although their adoption in practice is unclear.\n\n\nError sources and analysis[edit]\n\nMain article: Error analysis for the Global Positioning System\n\nGPS error analysis examines error sources in GPS results and the expected size of those errors. GPS makes corrections for receiver clock errors and other effects, but some residual errors remain uncorrected. Error sources include signal arrival time measurements, numerical calculations, atmospheric effects (ionospheric/tropospheric delays), ephemeris and clock data, multipath signals, and natural and artificial interference. Magnitude of residual errors from these sources depends on geometric dilution of precision. Artificial errors may result from jamming devices and threaten ships and aircraft[144] or from intentional signal degradation through selective availability, which limited accuracy to ≈ 6–12 m (20–40 ft), but has been switched off since May 1, 2000.[145][146]\n\n\nAccuracy enhancement and surveying[edit]\n\nMain article: GNSS enhancement\n\n\t\n\tThis article duplicates the scope of other articles, specifically, GNSS enhancement. Please discuss this issue on the talk page and edit it to conform with Wikipedia's Manual of Style.  (November 2013)\n\n\n\nAugmentation[edit]\n\nIntegrating external information into the calculation process can materially improve accuracy. Such augmentation systems are generally named or described based on how the information arrives. Some systems transmit additional error information (such as clock drift, ephemera, or ionospheric delay), others characterize prior errors, while a third group provides additional navigational or vehicle information.\n\nExamples of augmentation systems include the Wide Area Augmentation System (WAAS), European Geostationary Navigation Overlay Service (EGNOS), Differential GPS (DGPS), inertial navigation systems (INS) and Assisted GPS. The standard accuracy of about 15 meters (49 feet) can be augmented to 3–5 meters (9.8–16.4 ft) with DGPS, and to about 3 meters (9.8 feet) with WAAS.[147]\n\n\nPrecise monitoring[edit]\n\nAccuracy can be improved through precise monitoring and measurement of existing GPS signals in additional or alternative ways.\n\nThe largest remaining error is usually the unpredictable delay through the ionosphere. The spacecraft broadcast ionospheric model parameters, but some errors remain. This is one reason GPS spacecraft transmit on at least two frequencies, L1 and L2. Ionospheric delay is a well-defined function of frequency and the total electron content (TEC) along the path, so measuring the arrival time difference between the frequencies determines TEC and thus the precise ionospheric delay at each frequency.\n\nMilitary receivers can decode the P(Y) code transmitted on both L1 and L2. Without decryption keys, it is still possible to use a codeless technique to compare the P(Y) codes on L1 and L2 to gain much of the same error information. This technique is slow, so it is currently available only on specialized surveying equipment. In the future, additional civilian codes are expected to be transmitted on the L2 and L5 frequencies (see GPS modernization). All users will then be able to perform dual-frequency measurements and directly compute ionospheric delay errors.\n\nA second form of precise monitoring is called Carrier-Phase Enhancement (CPGPS). This corrects the error that arises because the pulse transition of the PRN is not instantaneous, and thus the correlation (satellite–receiver sequence matching) operation is imperfect. CPGPS uses the L1 carrier wave, which has a period of \n  \n    \n      \n        \n          \n            \n              1\n              \n              \n                s\n              \n            \n            \n              1575.42\n              ×\n              \n                10\n                \n                  6\n                \n              \n            \n          \n        \n        =\n        0.63475\n        \n        \n          n\n          s\n        \n        ≈\n        1\n        \n        \n          n\n          s\n        \n         \n      \n    \n    {\\displaystyle {\\frac {1\\,\\mathrm {s} }{1575.42\\times 10^{6}}}=0.63475\\,\\mathrm {ns} \\approx 1\\,\\mathrm {ns} \\ }\n  \n, which is about one-thousandth of the C/A Gold code bit period of \n  \n    \n      \n        \n          \n            \n              1\n              \n              \n                s\n              \n            \n            \n              1023\n              ×\n              \n                10\n                \n                  3\n                \n              \n            \n          \n        \n        =\n        977.5\n        \n        \n          n\n          s\n        \n        ≈\n        1000\n        \n        \n          n\n          s\n        \n         \n      \n    \n    {\\displaystyle {\\frac {1\\,\\mathrm {s} }{1023\\times 10^{3}}}=977.5\\,\\mathrm {ns} \\approx 1000\\,\\mathrm {ns} \\ }\n  \n, to act as an additional clock signal and resolve the uncertainty. The phase difference error in the normal GPS amounts to 2–3 meters (7–10 ft) of ambiguity. CPGPS working to within 1% of perfect transition reduces this error to 3 centimeters (1.2 in) of ambiguity. By eliminating this error source, CPGPS coupled with DGPS normally realizes between 20–30 centimeters (8–12 in) of absolute accuracy.\n\nRelative Kinematic Positioning (RKP) is a third alternative for a precise GPS-based positioning system. In this approach, determination of range signal can be resolved to a precision of less than 10 centimeters (4 in). This is done by resolving the number of cycles that the signal is transmitted and received by the receiver by using a combination of differential GPS (DGPS) correction data, transmitting GPS signal phase information and ambiguity resolution techniques via statistical tests—possibly with processing in real-time (real-time kinematic positioning, RTK).\n\n\nTimekeeping [edit]\n\nLeap seconds[edit]\n\nWhile most clocks derive their time from Coordinated Universal Time (UTC), the atomic clocks on the satellites are set to GPS time (GPST; see the page of United States Naval Observatory). The difference is that GPS time is not corrected to match the rotation of the Earth, so it does not contain leap seconds or other corrections that are periodically added to UTC. GPS time was set to match UTC in 1980, but has since diverged. The lack of corrections means that GPS time remains at a constant offset with International Atomic Time (TAI) (TAI − GPS = 19 seconds). Periodic corrections are performed to the on-board clocks to keep them synchronized with ground clocks.[148]\n\nThe GPS navigation message includes the difference between GPS time and UTC. As of January 2017,[update] GPS time is 18 seconds ahead of UTC because of the leap second added to UTC on December 31, 2016.[149] Receivers subtract this offset from GPS time to calculate UTC and specific timezone values. New GPS units may not show the correct UTC time until after receiving the UTC offset message. The GPS-UTC offset field can accommodate 255 leap seconds (eight bits).\n\n\nAccuracy[edit]\n\nGPS time is theoretically accurate to about 14 nanoseconds, due to the clock drift that atomic clocks experience in GPS transmitters, relative to International Atomic Time.[150] Most receivers lose accuracy in the interpretation of the signals and are only accurate to 100 nanoseconds.[151][152]\n\n\nFormat[edit]\n\nAs opposed to the year, month, and day format of the Gregorian calendar, the GPS date is expressed as a week number and a seconds-into-week number. The week number is transmitted as a ten-bit field in the C/A and P(Y) navigation messages, and so it becomes zero again every 1,024 weeks (19.6 years). GPS week zero started at 00:00:00 UTC (00:00:19 TAI) on January 6, 1980, and the week number became zero again for the first time at 23:59:47 UTC on August 21, 1999 (00:00:19 TAI on August 22, 1999). It happened the second time at 23:59:42 UTC on April 6, 2019. To determine the current Gregorian date, a GPS receiver must be provided with the approximate date (to within 3,584 days) to correctly translate the GPS date signal. To address this concern in the future the modernized GPS civil navigation (CNAV) message will use a 13-bit field that only repeats every 8,192 weeks (157 years), thus lasting until 2137 (157 years after GPS week zero).\n\nSee article GPS Week Number Rollover for more information.\n\n\nCarrier phase tracking (surveying)[edit]\n\nAnother method that is used in surveying applications is carrier phase tracking. The period of the carrier frequency multiplied by the speed of light gives the wavelength, which is about 0.19 m (7.5 in) for the L1 carrier. Accuracy within 1% of wavelength in detecting the leading edge reduces this component of pseudorange error to as little as 2 mm (0.079 in). This compares to 3 m (9.8 ft) for the C/A code and 0.3 m (11.8 in) for the P code.\n\nTwo-millimeter (0.079 in) accuracy requires measuring the total phase—the number of waves multiplied by the wavelength plus the fractional wavelength, which requires specially equipped receivers. This method has many surveying applications. It is accurate enough for real-time tracking of the very slow motions of tectonic plates, typically 0–100 mm (0–4 inches) per year.\n\nTriple differencing followed by numerical root finding, and a mathematical technique called least squares can estimate the position of one receiver given the position of another. First, compute the difference between satellites, then between receivers, and finally between epochs. Other orders of taking differences are equally valid. Detailed discussion of the errors is omitted.\n\nThe satellite carrier total phase can be measured with ambiguity as to the number of cycles. Let \n  \n    \n      \n         \n        ϕ\n        (\n        \n          r\n          \n            i\n          \n        \n        ,\n        \n          s\n          \n            j\n          \n        \n        ,\n        \n          t\n          \n            k\n          \n        \n        )\n      \n    \n    {\\displaystyle \\ \\phi (r_{i},s_{j},t_{k})}\n  \n denote the phase of the carrier of satellite j measured by receiver i at time \n  \n    \n      \n         \n         \n        \n          t\n          \n            k\n          \n        \n      \n    \n    {\\displaystyle \\ \\ t_{k}}\n  \n. This notation shows the meaning of the subscripts i, j, and k. The receiver (r), satellite (s), and time (t) come in alphabetical order as arguments of \n  \n    \n      \n         \n        ϕ\n      \n    \n    {\\displaystyle \\ \\phi }\n  \n and to balance readability and conciseness, let \n  \n    \n      \n         \n        \n          ϕ\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n        =\n        ϕ\n        (\n        \n          r\n          \n            i\n          \n        \n        ,\n        \n          s\n          \n            j\n          \n        \n        ,\n        \n          t\n          \n            k\n          \n        \n        )\n      \n    \n    {\\displaystyle \\ \\phi _{i,j,k}=\\phi (r_{i},s_{j},t_{k})}\n  \n be a concise abbreviation. Also we define three functions, :\n  \n    \n      \n         \n        \n          Δ\n          \n            r\n          \n        \n        ,\n        \n          Δ\n          \n            s\n          \n        \n        ,\n        \n          Δ\n          \n            t\n          \n        \n      \n    \n    {\\displaystyle \\ \\Delta ^{r},\\Delta ^{s},\\Delta ^{t}}\n  \n, which return differences between receivers, satellites, and time points, respectively. Each function has variables with three subscripts as its arguments. These three functions are defined below. If \n  \n    \n      \n         \n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n      \n    \n    {\\displaystyle \\ \\alpha _{i,j,k}}\n  \n is a function of the three integer arguments, i, j, and k then it is a valid argument for the functions, :\n  \n    \n      \n         \n        \n          Δ\n          \n            r\n          \n        \n        ,\n        \n          Δ\n          \n            s\n          \n        \n        ,\n        \n          Δ\n          \n            t\n          \n        \n      \n    \n    {\\displaystyle \\ \\Delta ^{r},\\Delta ^{s},\\Delta ^{t}}\n  \n, with the values defined as\n\n\n\t\n  \n    \n      \n         \n        \n          Δ\n          \n            r\n          \n        \n        (\n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n        )\n        =\n        \n          α\n          \n            i\n            +\n            1\n            ,\n            j\n            ,\n            k\n          \n        \n        −\n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n      \n    \n    {\\displaystyle \\ \\Delta ^{r}(\\alpha _{i,j,k})=\\alpha _{i+1,j,k}-\\alpha _{i,j,k}}\n  \n,\n\t\n  \n    \n      \n         \n        \n          Δ\n          \n            s\n          \n        \n        (\n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n        )\n        =\n        \n          α\n          \n            i\n            ,\n            j\n            +\n            1\n            ,\n            k\n          \n        \n        −\n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n      \n    \n    {\\displaystyle \\ \\Delta ^{s}(\\alpha _{i,j,k})=\\alpha _{i,j+1,k}-\\alpha _{i,j,k}}\n  \n, and\n\t\n  \n    \n      \n         \n        \n          Δ\n          \n            t\n          \n        \n        (\n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n        )\n        =\n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n            +\n            1\n          \n        \n        −\n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n      \n    \n    {\\displaystyle \\ \\Delta ^{t}(\\alpha _{i,j,k})=\\alpha _{i,j,k+1}-\\alpha _{i,j,k}}\n  \n .\n\n\nAlso if \n  \n    \n      \n         \n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n         \n        a\n        n\n        d\n         \n        \n          β\n          \n            l\n            ,\n            m\n            ,\n            n\n          \n        \n      \n    \n    {\\displaystyle \\ \\alpha _{i,j,k}\\ and\\ \\beta _{l,m,n}}\n  \n are valid arguments for the three functions and a and b are constants then\n\n  \n    \n      \n         \n        (\n        a\n         \n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n        +\n        b\n         \n        \n          β\n          \n            l\n            ,\n            m\n            ,\n            n\n          \n        \n        )\n      \n    \n    {\\displaystyle \\ (a\\ \\alpha _{i,j,k}+b\\ \\beta _{l,m,n})}\n  \n is a valid argument with values defined as\n\n\n\t\n  \n    \n      \n         \n        \n          Δ\n          \n            r\n          \n        \n        (\n        a\n         \n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n        +\n        b\n         \n        \n          β\n          \n            l\n            ,\n            m\n            ,\n            n\n          \n        \n        )\n        =\n        a\n         \n        \n          Δ\n          \n            r\n          \n        \n        (\n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n        )\n        +\n        b\n         \n        \n          Δ\n          \n            r\n          \n        \n        (\n        \n          β\n          \n            l\n            ,\n            m\n            ,\n            n\n          \n        \n        )\n      \n    \n    {\\displaystyle \\ \\Delta ^{r}(a\\ \\alpha _{i,j,k}+b\\ \\beta _{l,m,n})=a\\ \\Delta ^{r}(\\alpha _{i,j,k})+b\\ \\Delta ^{r}(\\beta _{l,m,n})}\n  \n,\n\t\n  \n    \n      \n         \n        \n          Δ\n          \n            s\n          \n        \n        (\n        a\n         \n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n        +\n        b\n         \n        \n          β\n          \n            l\n            ,\n            m\n            ,\n            n\n          \n        \n        )\n        =\n        a\n         \n        \n          Δ\n          \n            s\n          \n        \n        (\n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n        )\n        +\n        b\n         \n        \n          Δ\n          \n            s\n          \n        \n        (\n        \n          β\n          \n            l\n            ,\n            m\n            ,\n            n\n          \n        \n        )\n      \n    \n    {\\displaystyle \\ \\Delta ^{s}(a\\ \\alpha _{i,j,k}+b\\ \\beta _{l,m,n})=a\\ \\Delta ^{s}(\\alpha _{i,j,k})+b\\ \\Delta ^{s}(\\beta _{l,m,n})}\n  \n, and\n\t\n  \n    \n      \n         \n        \n          Δ\n          \n            t\n          \n        \n        (\n        a\n         \n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n        +\n        b\n         \n        \n          β\n          \n            l\n            ,\n            m\n            ,\n            n\n          \n        \n        )\n        =\n        a\n         \n        \n          Δ\n          \n            t\n          \n        \n        (\n        \n          α\n          \n            i\n            ,\n            j\n            ,\n            k\n          \n        \n        )\n        +\n        b\n         \n        \n          Δ\n          \n            t\n          \n        \n        (\n        \n          β\n          \n            l\n            ,\n            m\n            ,\n            n\n          \n        \n        )\n      \n    \n    {\\displaystyle \\ \\Delta ^{t}(a\\ \\alpha _{i,j,k}+b\\ \\beta _{l,m,n})=a\\ \\Delta ^{t}(\\alpha _{i,j,k})+b\\ \\Delta ^{t}(\\beta _{l,m,n})}\n  \n .\n\n\nReceiver clock errors can be approximately eliminated by differencing the phases measured from satellite 1 with that from satellite 2 at the same epoch.[153] This difference is designated as \n  \n    \n      \n         \n        \n          Δ\n          \n            s\n          \n        \n        (\n        \n          ϕ\n          \n            1\n            ,\n            1\n            ,\n            1\n          \n        \n        )\n        =\n        \n          ϕ\n          \n            1\n            ,\n            2\n            ,\n            1\n          \n        \n        −\n        \n          ϕ\n          \n            1\n            ,\n            1\n            ,\n            1\n          \n        \n      \n    \n    {\\displaystyle \\ \\Delta ^{s}(\\phi _{1,1,1})=\\phi _{1,2,1}-\\phi _{1,1,1}}\n  \n\n\nDouble differencing[154] computes the difference of receiver 1's satellite difference from that of receiver 2. This approximately eliminates satellite clock errors. This double difference is:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  Δ\n                  \n                    r\n                  \n                \n                (\n                \n                  Δ\n                  \n                    s\n                  \n                \n                (\n                \n                  ϕ\n                  \n                    1\n                    ,\n                    1\n                    ,\n                    1\n                  \n                \n                )\n                )\n                \n              \n              \n                \n                =\n                \n                \n                  Δ\n                  \n                    r\n                  \n                \n                (\n                \n                  ϕ\n                  \n                    1\n                    ,\n                    2\n                    ,\n                    1\n                  \n                \n                −\n                \n                  ϕ\n                  \n                    1\n                    ,\n                    1\n                    ,\n                    1\n                  \n                \n                )\n              \n              \n                =\n                \n                \n                  Δ\n                  \n                    r\n                  \n                \n                (\n                \n                  ϕ\n                  \n                    1\n                    ,\n                    2\n                    ,\n                    1\n                  \n                \n                )\n                −\n                \n                  Δ\n                  \n                    r\n                  \n                \n                (\n                \n                  ϕ\n                  \n                    1\n                    ,\n                    1\n                    ,\n                    1\n                  \n                \n                )\n              \n              \n                \n                =\n                \n                (\n                \n                  ϕ\n                  \n                    2\n                    ,\n                    2\n                    ,\n                    1\n                  \n                \n                −\n                \n                  ϕ\n                  \n                    1\n                    ,\n                    2\n                    ,\n                    1\n                  \n                \n                )\n                −\n                (\n                \n                  ϕ\n                  \n                    2\n                    ,\n                    1\n                    ,\n                    1\n                  \n                \n                −\n                \n                  ϕ\n                  \n                    1\n                    ,\n                    1\n                    ,\n                    1\n                  \n                \n                )\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}\\Delta ^{r}(\\Delta ^{s}(\\phi _{1,1,1}))\\,&=\\,\\Delta ^{r}(\\phi _{1,2,1}-\\phi _{1,1,1})&=\\,\\Delta ^{r}(\\phi _{1,2,1})-\\Delta ^{r}(\\phi _{1,1,1})&=\\,(\\phi _{2,2,1}-\\phi _{1,2,1})-(\\phi _{2,1,1}-\\phi _{1,1,1})\\end{aligned}}}\n  \n\n\n\nTriple differencing[155] subtracts the receiver difference from time 1 from that of time 2. This eliminates the ambiguity associated with the integral number of wavelengths in carrier phase provided this ambiguity does not change with time. Thus the triple difference result eliminates practically all clock bias errors and the integer ambiguity. Atmospheric delay and satellite ephemeris errors have been significantly reduced. This triple difference is:\n\n\n\t\n  \n    \n      \n         \n        \n          Δ\n          \n            t\n          \n        \n        (\n        \n          Δ\n          \n            r\n          \n        \n        (\n        \n          Δ\n          \n            s\n          \n        \n        (\n        \n          ϕ\n          \n            1\n            ,\n            1\n            ,\n            1\n          \n        \n        )\n        )\n        )\n      \n    \n    {\\displaystyle \\ \\Delta ^{t}(\\Delta ^{r}(\\Delta ^{s}(\\phi _{1,1,1})))}\n  \n\n\n\nTriple difference results can be used to estimate unknown variables. For example, if the position of receiver 1 is known but the position of receiver 2 unknown, it may be possible to estimate the position of receiver 2 using numerical root finding and least squares. Triple difference results for three independent time pairs may be sufficient to solve for receiver 2's three position components. This may require a numerical procedure.[156][157] An approximation of receiver 2's position is required to use such a numerical method. This initial value can probably be provided from the navigation message and the intersection of sphere surfaces. Such a reasonable estimate can be key to successful multidimensional root finding. Iterating from three time pairs and a fairly good initial value produces one observed triple difference result for receiver 2's position. Processing additional time pairs can improve accuracy, overdetermining the answer with multiple solutions. Least squares can estimate an overdetermined system. Least squares determines the position of receiver 2 that best fits the observed triple difference results for receiver 2 positions under the criterion of minimizing the sum of the squares.\n\n\nRegulatory spectrum issues concerning GPS receivers[edit]\n\nIn the United States, GPS receivers are regulated under the Federal Communications Commission's (FCC) Part 15 rules. As indicated in the manuals of GPS-enabled devices sold in the United States, as a Part 15 device, it \"must accept any interference received, including interference that may cause undesired operation.\"[158] With respect to GPS devices in particular, the FCC states that GPS receiver manufacturers, \"must use receivers that reasonably discriminate against reception of signals outside their allocated spectrum.\"[159] For the last 30 years, GPS receivers have operated next to the Mobile Satellite Service band, and have discriminated against reception of mobile satellite services, such as Inmarsat, without any issue.\n\nThe spectrum allocated for GPS L1 use by the FCC is 1559 to 1610 MHz, while the spectrum allocated for satellite-to-ground use owned by Lightsquared is the Mobile Satellite Service band.[160] Since 1996, the FCC has authorized licensed use of the spectrum neighboring the GPS band of 1525 to 1559 MHz to the Virginia company LightSquared. On March 1, 2001, the FCC received an application from LightSquared's predecessor, Motient Services, to use their allocated frequencies for an integrated satellite-terrestrial service.[161] In 2002, the U.S. GPS Industry Council came to an out-of-band-emissions (OOBE) agreement with LightSquared to prevent transmissions from LightSquared's ground-based stations from emitting transmissions into the neighboring GPS band of 1559 to 1610 MHz.[162] In 2004, the FCC adopted the OOBE agreement in its authorization for LightSquared to deploy a ground-based network ancillary to their satellite system – known as the Ancillary Tower Components (ATCs) – \"We will authorize MSS ATC subject to conditions that ensure that the added terrestrial component remains ancillary to the principal MSS offering. We do not intend, nor will we permit, the terrestrial component to become a stand-alone service.\"[163] This authorization was reviewed and approved by the U.S. Interdepartment Radio Advisory Committee, which includes the U.S. Department of Agriculture, U.S. Air Force, U.S. Army, U.S. Coast Guard, Federal Aviation Administration, National Aeronautics and Space Administration, Interior, and U.S. Department of Transportation.[164]\n\nIn January 2011, the FCC conditionally authorized LightSquared's wholesale customers—such as Best Buy, Sharp, and C Spire—to only purchase an integrated satellite-ground-based service from LightSquared and re-sell that integrated service on devices that are equipped to only use the ground-based signal using LightSquared's allocated frequencies of 1525 to 1559 MHz.[165] In December 2010, GPS receiver manufacturers expressed concerns to the FCC that LightSquared's signal would interfere with GPS receiver devices[166] although the FCC's policy considerations leading up to the January 2011 order did not pertain to any proposed changes to the maximum number of ground-based LightSquared stations or the maximum power at which these stations could operate. The January 2011 order makes final authorization contingent upon studies of GPS interference issues carried out by a LightSquared led working group along with GPS industry and Federal agency participation. On February 14, 2012, the FCC initiated proceedings to vacate LightSquared's Conditional Waiver Order based on the NTIA's conclusion that there was currently no practical way to mitigate potential GPS interference.\n\nGPS receiver manufacturers design GPS receivers to use spectrum beyond the GPS-allocated band. In some cases, GPS receivers are designed to use up to 400 MHz of spectrum in either direction of the L1 frequency of 1575.42 MHz, because mobile satellite services in those regions are broadcasting from space to ground, and at power levels commensurate with mobile satellite services.[167] As regulated under the FCC's Part 15 rules, GPS receivers are not warranted protection from signals outside GPS-allocated spectrum.[159] This is why GPS operates next to the Mobile Satellite Service band, and also why the Mobile Satellite Service band operates next to GPS. The symbiotic relationship of spectrum allocation ensures that users of both bands are able to operate cooperatively and freely.\n\nThe FCC adopted rules in February 2003 that allowed Mobile Satellite Service (MSS) licensees such as LightSquared to construct a small number of ancillary ground-based towers in their licensed spectrum to \"promote more efficient use of terrestrial wireless spectrum.\"[168] In those 2003 rules, the FCC stated \"As a preliminary matter, terrestrial [Commercial Mobile Radio Service (“CMRS”)] and MSS ATC are expected to have different prices, coverage, product acceptance and distribution; therefore, the two services appear, at best, to be imperfect substitutes for one another that would be operating in predominantly different market segments... MSS ATC is unlikely to compete directly with terrestrial CMRS for the same customer base...\". In 2004, the FCC clarified that the ground-based towers would be ancillary, noting that \"We will authorize MSS ATC subject to conditions that ensure that the added terrestrial component remains ancillary to the principal MSS offering. We do not intend, nor will we permit, the terrestrial component to become a stand-alone service.\"[163] In July 2010, the FCC stated that it expected LightSquared to use its authority to offer an integrated satellite-terrestrial service to \"provide mobile broadband services similar to those provided by terrestrial mobile providers and enhance competition in the mobile broadband sector.\"[169] GPS receiver manufacturers have argued that LightSquared's licensed spectrum of 1525 to 1559 MHz was never envisioned as being used for high-speed wireless broadband based on the 2003 and 2004 FCC ATC rulings making clear that the Ancillary Tower Component (ATC) would be, in fact, ancillary to the primary satellite component.[170] To build public support of efforts to continue the 2004 FCC authorization of LightSquared's ancillary terrestrial component vs. a simple ground-based LTE service in the Mobile Satellite Service band, GPS receiver manufacturer Trimble Navigation Ltd. formed the \"Coalition To Save Our GPS.\"[171]\n\nThe FCC and LightSquared have each made public commitments to solve the GPS interference issue before the network is allowed to operate.[172][173] According to Chris Dancy of the Aircraft Owners and Pilots Association, airline pilots with the type of systems that would be affected \"may go off course and not even realize it.\"[174] The problems could also affect the Federal Aviation Administration upgrade to the air traffic control system, United States Defense Department guidance, and local emergency services including 911.[174]\n\nOn February 14, 2012, the U.S. Federal Communications Commission (FCC) moved to bar LightSquared's planned national broadband network after being informed by the National Telecommunications and Information Administration (NTIA), the federal agency that coordinates spectrum uses for the military and other federal government entities, that \"there is no practical way to mitigate potential interference at this time\".[175][176] LightSquared is challenging the FCC's action.\n\n\nOther systems[edit]\n\nMain article: Satellite navigation\n\n  \nComparison of geostationary, GPS, GLONASS, Galileo, Compass (MEO), International Space Station, Hubble Space Telescope, Iridium constellation and graveyard orbits, with the Van Allen radiation belts and the Earth to scale.[a] The Moon's orbit is around 9 as large as geostationary orbit.[b] (In the SVG file, hover over an orbit or its label to highlight it; click to load its article.)\n\n\n\nOther notable satellite navigation systems in use or various states of development include:\n\n\n\tBeidou – system deployed and operated by the People's Republic of China's, initiating global services in 2019.[177][178]\n\tGalileo – a global system being developed by the European Union and other partner countries, which began operation in 2016,[179] and is expected to be fully deployed by 2020.\n\tGLONASS – Russia's global navigation system. Fully operational worldwide.\n\tIRNSS – A regional navigation system developed by the Indian Space Research Organisation.\n\tQZSS – A regional navigation system receivable in the Asia-Oceania regions, with a focus on Japan.\n\n\nSee also[edit]\n\n\n\tGladys West\n\tGPS/INS\n\tGPS navigation software\n\tGPS navigation device\n\tGPS spoofing\n\tGPS signals\n\tIndoor positioning system\n\tList of GPS satellites\n\tLocal Area Augmentation System\n\tLocal positioning system\n\tMilitary invention\n\tMobile phone tracking\n\tNavigation paradox\n\tNotice Advisory to Navstar Users\n\tS-GPS\n\tTrilateration\n\tWide Area Augmentation System\n\n\n\n\nNotes[edit]\n\n\n\t^ Orbital periods and speeds are calculated using the relations 4π2R3 = T2GM and V2R = GM, where R = radius of orbit in metres, T = orbital period in seconds, V = orbital speed in m/s, G = gravitational constant ≈ 6.673×10−11 Nm2/kg2, M = mass of Earth ≈ 5.98×1024 kg.\n\n\t^ Approximately 8.6 times (in radius and length) when the moon is nearest (363 104 km ÷ 42 164 km) to 9.6 times when the moon is farthest (405 696 km ÷ 42 164 km).\n\n\n\n\n\nReferences[edit]\n\n\n\t^ \"GPS: Global Positioning System (or Navstar Global Positioning System)\" Wide Area Augmentation System (WAAS) Performance Standard, Section B.3, Abbreviations and Acronyms. [1] Archived April 27, 2017, at the Wayback Machine\n\n\t^ \"Global Positioning System Standard Positioning Service Performance Standard : 4th Edition, September 2008\" (PDF). Archived (PDF) from the original on April 27, 2017. Retrieved April 21, 2017.\n\n\t^ \"What is a GPS?\". Archived from the original on January 31, 2018. Retrieved January 28, 2018.\n\n\n\t^ Real Engineering (June 19, 2017). \"Why The US Military Made GPS Free-To-Use\". Archived from the original on December 31, 2018. Retrieved August 16, 2018 – via YouTube.\n\n\n\t^ a b \"Factsheets : GPS Advanced Control Segment (OCX)\". Losangeles.af.mil. October 25, 2011. Archived from the original on May 3, 2012. Retrieved November 6, 2011.\n\n\n\t^ \"GPS.gov: GPS Accuracy\". www.gps.gov. Archived from the original on January 4, 2018. Retrieved January 17, 2018.\n\n\n\t^ Srivastava, Ishan (April 5, 2014). \"How Kargil spurred India to design own GPS\". The Times of India. Archived from the original on December 15, 2016. Retrieved December 9, 2014.\n\n\n\t^ \"Russia Launches Three More GLONASS-M Space Vehicles\". Inside GNSS. Archived from the original on February 6, 2009. Retrieved December 26, 2008.\n\n\n\t^ \"index.php\". Clove Blog. January 10, 2012. Archived from the original on March 10, 2016. Retrieved October 29, 2016.\n\n\n\t^ Kriening, Torsten (January 23, 2019). \"Japan Prepares for GPS Failure with Quasi-Zenith Satellites\". SpaceWatch.Global. Retrieved August 10, 2019.\n\n\n\t^ \"GPS will be accurate within one foot in some phones next year\". The Verge. Archived from the original on January 18, 2018. Retrieved January 17, 2018.\n\n\n\t^ \"Superaccurate GPS Chips Coming to Smartphones in 2018\". IEEE Spectrum: Technology, Engineering, and Science News. September 21, 2017. Archived from the original on January 18, 2018. Retrieved January 17, 2018.\n\n\n\t^ National Research Council (U.S.). Committee on the Future of the Global Positioning System; National Academy of Public Administration (1995). The global positioning system: a shared national asset: recommendations for technical improvements and enhancements. National Academies Press. p. 16. ISBN 978-0-309-05283-2. Retrieved August 16, 2013.\n, https://books.google.com/books?id=FAHk65slfY4C&pg=PA16\n\n\t^ O'Leary, Beth Laura; Darrin, Ann Garrison (2009). Handbook of Space Engineering, Archaeology, and Heritage. Hoboken: CRC Press. pp. 239–240. ISBN 978-1-4200-8432-0.\n\n\n\t^ Butterly, Amelia (May 20, 2018). \"The woman who paved the way for GPS\". Archived from the original on February 13, 2019. Retrieved January 17, 2019 – via www.bbc.com.\n\n\n\t^ Relativistische Zeitdilatation eines künstlichen Satelliten (Relativistic time dilation of an artificial satellite. Astronautica Acta II (in German) (25). Retrieved 19 October 2014. Archived from the original on July 3, 2014. Retrieved October 20, 2014.\n\n\n\t^ Guier, William H.; Weiffenbach, George C. (1997). \"Genesis of Satellite Navigation\" (PDF). Johns Hopkins APL Technical Digest. 19 (1): 178–181. Archived from the original (PDF) on May 12, 2012. Retrieved April 9, 2012.\n\n\n\t^ Steven Johnson (2010), Where good ideas come from, the natural history of innovation, New York: Riverhead Books\n\n\n\t^ Helen E. Worth; Mame Warren (2009). Transit to Tomorrow. Fifty Years of Space Research at The Johns Hopkins University Applied Physics Laboratory (PDF).\n\n\n\t^ a b Catherine Alexandrow (April 2008). \"The Story of GPS\". Archived from the original on February 24, 2013.\n\n\n\t^ DARPA: 50 Years of Bridging the Gap. April 2008. Archived from the original on May 6, 2011.\n\n\n\t^ Howell, Elizabeth. \"Navstar: GPS Satellite Network\". SPACE.com. Archived from the original on February 17, 2013. Retrieved February 14, 2013.\n\n\n\t^ Jerry Proc. \"Omega\". Jproc.ca. Archived from the original on January 5, 2010. Retrieved December 8, 2009.\n\n\n\t^ \"Why Did the Department of Defense Develop GPS?\". Trimble Navigation Ltd. Archived from the original on October 18, 2007. Retrieved January 13, 2010.\n\n\n\t^ \"Charting a Course Toward Global Navigation\". The Aerospace Corporation. Archived from the original on November 1, 2002. Retrieved October 14, 2013.\n\n\n\t^ \"A Guide to the Global Positioning System (GPS) – GPS Timeline\". Radio Shack. Archived from the original on February 13, 2010. Retrieved January 14, 2010.\n\n\n\t^ \"GEODETIC EXPLORER-A Press Kit\" (PDF). NASA. October 29, 1965. Archived (PDF) from the original on February 11, 2014. Retrieved October 20, 2015.\n\n\n\t^ \"SECOR Chronology\". Mark Wade's Encyclopedia Astronautica. Archived from the original on January 16, 2010. Retrieved January 19, 2010.\n\n\n\t^ Jury, H L, 1973, Application of Kalman Filter to Real-Time Navigation using Synchronous Satellites, Proceeding of the 10th International Symposium on Space Technology and Science, Tokyo, 945–952.\n\n\t^ \"MX Deployment Reconsidered.\" Retrieved: 7 June 2013.\n\n\t^ Dick, Steven; Launius, Roger (2007). Societal Impact of Spaceflight (PDF). Washington, DC: US Government Printing Office. p. 331. ISBN 978-0-16-080190-7. Archived (PDF) from the original on March 3, 2013. Retrieved July 20, 2019.\n\n\n\t^ Michael Russell Rip; James M. Hasik (2002). The Precision Revolution: GPS and the Future of Aerial Warfare. Naval Institute Press. p. 65. ISBN 978-1-55750-973-4. Retrieved January 14, 2010.\n\n\n\t^ a b Hegarty, Christopher J.; Chatre, Eric (December 2008). \"Evolution of the Global Navigation SatelliteSystem (GNSS)\". Proceedings of the IEEE. 96 (12): 1902–1917. doi:10.1109/JPROC.2008.2006090.\n\n\n\t^ \"ION Fellow - Mr. John A. Klobuchar\". www.ion.org. Archived from the original on October 4, 2017. Retrieved June 17, 2017.\n\n\n\t^ http://harveycohen.net/crcss Archived May 29, 2017, at the Wayback Machine \"GPS Signal Science\"\n\n\t^ \"ICAO Completes Fact-Finding Investigation\". International Civil Aviation Organization. Archived from the original on May 17, 2008. Retrieved September 15, 2008.\n\n\n\t^ \"United States Updates Global Positioning System Technology\". America.gov. February 3, 2006. Archived from the original on October 9, 2013. Retrieved June 17, 2019.\n\n\n\t^ Rumerman, Judy A. (2009). NASA Historical Data Book, Volume VII (PDF). NASA. p. 136. Archived (PDF) from the original on December 25, 2017. Retrieved July 12, 2017.\n\n\n\t^ The Global Positioning System\nAssessing National Policies, by Scott Pace, Gerald P. Frost, Irving Lachow, David R. Frelinger, Donna Fossum, Don Wassem, Monica M. Pinto, Rand Corporation, 1995,Appendix B Archived March 4, 2016, at the Wayback Machine, GPS History, Chronology, and Budgets\n\n\t^ \"GPS & Selective Availability Q&A\" (PDF). NOAA]. Archived from the original (PDF) on September 21, 2005. Retrieved May 28, 2010.\n\n\n\t^ \"GPS Accuracy\". GPS.gov. GPS.gov. Archived from the original on April 16, 2015. Retrieved May 4, 2015.\n\n\n\t^ E. Steitz, David. \"National Positioning, Navigation and Timing Advisory Board Named\". Archived from the original on January 13, 2010. Retrieved March 22, 2007.\n\n\n\t^ GPS Wing Reaches GPS III IBR Milestone Archived May 23, 2013, at the Wayback Machine in Inside GNSS November 10, 2008\n\n\t^ \"GPS Constellation Status for 08/26/2015\". Archived from the original on September 5, 2015. Retrieved August 26, 2015.\n\n\n\t^ \"Recap story: Three Atlas 5 launch successes in one month\". Archived from the original on November 1, 2015. Retrieved October 31, 2015.\n\n\n\t^ \"GPS almanacs\". Navcen.uscg.gov. Archived from the original on September 23, 2010. Retrieved October 15, 2010.\n\n\n\t^ \"Origin of Global Positioning System (GPS)\". Rewire Security. Archived from the original on February 11, 2017. Retrieved February 9, 2017.\n\n\n\t^ Dietrich Schroeer; Mirco Elena (2000). Technology Transfer. Ashgate. p. 80. ISBN 978-0-7546-2045-7. Retrieved May 25, 2008.\n\n\n\t^ Michael Russell Rip; James M. Hasik (2002). The Precision Revolution: GPS and the Future of Aerial Warfare. Naval Institute Press. ISBN 978-1-55750-973-4. Retrieved May 25, 2008.\n\n\n\t^ \"AF Space Command Chronology\". USAF Space Command. Archived from the original on August 17, 2011. Retrieved June 20, 2011.\n\n\n\t^ \"FactSheet: 2nd Space Operations Squadron\". USAF Space Command. Archived from the original on June 11, 2011. Retrieved June 20, 2011.\n\n\n\t^ The Global Positioning System: Assessing National Policies Archived December 30, 2015, at the Wayback Machine, p.245. RAND corporation\n\n\t^ a b \"USNO NAVSTAR Global Positioning System\". U.S. Naval Observatory. Archived from the original on January 26, 2011. Retrieved January 7, 2011.\n\n\n\t^ National Archives and Records Administration. U.S. Global Positioning System Policy Archived April 6, 2006, at the Wayback Machine. March 29, 1996.\n\n\t^ \"National Executive Committee for Space-Based Positioning, Navigation, and Timing\". Pnt.gov. Archived from the original on May 28, 2010. Retrieved October 15, 2010.\n\n\n\t^ \"Assisted-GPS Test Calls for 3G WCDMA Networks\". 3g.co.uk. November 10, 2004. Archived from the original on November 27, 2010. Retrieved November 24, 2010.\n\n\n\t^ \"Press release: First Modernized GPS Satellite Built by Lockheed Martin Launched Successfully by the U.S. Air Force – Sep 26, 2005\". Lockheed Martin. Archived from the original on August 10, 2017. Retrieved August 9, 2017.\n\n\n\t^ 010907 (September 17, 2007). \"losangeles.af.mil\". losangeles.af.mil. Archived from the original on May 11, 2011. Retrieved October 15, 2010.\n\n\n\t^ Johnson, Bobbie (May 19, 2009). \"GPS system 'close to breakdown'\". The Guardian. London. Archived from the original on September 26, 2013. Retrieved December 8, 2009.\n\n\n\t^ Coursey, David (May 21, 2009). \"Air Force Responds to GPS Outage Concerns\". ABC News. Archived from the original on May 23, 2009. Retrieved May 22, 2009.\n\n\n\t^ \"Air Force GPS Problem: Glitch Shows How Much U.S. Military Relies On GPS\". Huffingtonpost.comm. June 1, 2010. Archived from the original on June 4, 2010. Retrieved October 15, 2010.\n\n\n\t^ \"Contract Award for Next Generation GPS Control Segment Announced\". Archived from the original on July 23, 2013. Retrieved December 14, 2012.\n\n\n\t^ United States Naval Research Laboratory. National Medal of Technology for GPS Archived October 11, 2007, at the Wayback Machine. November 21, 2005\n\n\t^ \"Space Technology Hall of Fame, Inducted Technology: Global Positioning System (GPS)\". Archived from the original on June 12, 2012.\n\n\n\t^ \"GPS Program Receives International Award\". GPS.gov. October 5, 2011. Archived from the original on May 13, 2017. Retrieved December 24, 2018.\n\n\n\t^ Danielle, Britni (December 21, 2018). \"Dr. Gladys West, Another 'Hidden Figure,' Inducted Into Air Force Hall Of Fame\". Essence. Archived from the original on December 22, 2018. Retrieved December 24, 2018.\n\n\n\t^ Amos, Jonathan (February 12, 2019). \"QE Engineering Prize lauds GPS pioneers\". Archived from the original on April 6, 2019. Retrieved April 6, 2019 – via www.bbc.co.uk.\n\n\n\t^ a b c d Abel, J.S. and Chaffee, J.W., \"Existence and uniqueness of GPS solutions\", IEEE Transactions on Aerospace and Electronic Systems, vol. 26, no. 6, pp. 748–53, Sept. 1991.\n\n\t^ a b c Fang, B.T., \"Comments on \"Existence and uniqueness of GPS solutions\" by J.S. Abel and J.W. Chaffee\", IEEE Transactions on Aerospace and Electronic Systems, vol. 28, no. 4, Oct. 1992.\n\n\t^ Grewal, Mohinder S.; Weill, Lawrence R.; Andrews, Angus P. (2007). Global Positioning Systems, Inertial Navigation, and Integration (2nd ed.). John Wiley & Sons. pp. 92–93. ISBN 978-0-470-09971-1.\n, https://books.google.com/books?id=6P7UNphJ1z8C&pg=PA92\n\n\t^ Georg zur Bonsen; Daniel Ammann; Michael Ammann; Etienne Favey; Pascal Flammant (April 1, 2005). \"Continuous Navigation Combining GPS with Sensor-Based Dead Reckoning\". GPS World. Archived from the original on November 11, 2006.\n\n\n\t^ \"NAVSTAR GPS User Equipment Introduction\" (PDF). United States Government. Archived (PDF) from the original on September 10, 2008. Retrieved August 22, 2008.\n Chapter 7\n\n\t^ \"GPS Support Notes\" (PDF). January 19, 2007. Archived from the original (PDF) on March 27, 2009. Retrieved November 10, 2008.\n\n\n\t^ John Pike. \"GPS III Operational Control Segment (OCX)\". Globalsecurity.org. Archived from the original on September 7, 2009. Retrieved December 8, 2009.\n\n\n\t^ a b \"Global Positioning System\". Gps.gov. Archived from the original on July 30, 2010. Retrieved June 26, 2010.\n\n\n\t^ Daly, P. (December 1993). \"Navstar GPS and GLONASS: global satellite navigation systems\". Electronics & Communication Engineering Journal. 5 (6): 349–357. doi:10.1049/ecej:19930069.\n\n\n\t^ Dana, Peter H. (August 8, 1996). \"GPS Orbital Planes\". Archived from the original (GIF) on January 26, 2018. Retrieved February 27, 2006.\n\n\n\t^ GPS Overview from the NAVSTAR Joint Program Office Archived November 16, 2007, at the Wayback Machine. Retrieved December 15, 2006.\n\n\t^ What the Global Positioning System Tells Us about Relativity Archived January 4, 2007, at the Wayback Machine. Retrieved January 2, 2007.\n\n\t^ \"Archived copy\". Archived from the original on October 22, 2011. Retrieved 2011-10-27.CS1 maint: archived copy as title (link)\n. Retrieved October 27, 2011\n\n\t^ \"USCG Navcen: GPS Frequently Asked Questions\". Archived from the original on April 30, 2011. Retrieved January 31, 2007.\n\n\n\t^ a b Thomassen, Keith. \"How GPS Works\". avionicswest.com. Archived from the original on March 30, 2016. Retrieved April 22, 2014.\n\n\n\t^ Samama, Nel (2008). Global Positioning: Technologies and Performance. John Wiley & Sons. p. 65. ISBN 978-0-470-24190-5.\n, https://books.google.com/books?id=EyFrcnSRFFgC&pg=PA65\n\n\t^ Agnew, D.C.; Larson, K.M. (2007). \"Finding the repeat times of the GPS constellation\". GPS Solutions. 11 (1): 71–76. doi:10.1007/s10291-006-0038-4.\n This article from author's web site Archived February 16, 2008, at the Wayback Machine, with minor correction.\n\n\t^ \"Space Segment\". GPS.gov. Archived from the original on July 18, 2019. Retrieved July 27, 2019.\n\n\n\t^ Massatt, Paul; Wayne Brady (Summer 2002). \"Optimizing performance through constellation management\" (PDF). Crosslink: 17–21. Archived from the original on January 25, 2012.\n\n\n\t^ United States Coast Guard General GPS News 9–9–05[permanent dead link]\n\n\t^ USNO NAVSTAR Global Positioning System Archived February 8, 2006, at the Wayback Machine. Retrieved May 14, 2006.\n\n\t^ \"GPS III Operational Control Segment (OCX)\". GlobalSecurity.org. Archived from the original on December 31, 2006. Retrieved January 3, 2007.\n\n\n\t^ \"The USA's GPS-III Satellites\". Defense Industry Daily. October 13, 2011. Archived from the original on October 18, 2011. Retrieved October 27, 2011.\n\n\n\t^ \"GPS Completes Next Generation Operational Control System PDR\". Air Force Space Command News Service. September 14, 2011. Archived from the original on October 2, 2011.\n\n\n\t^ \"GLOBAL POSITIONING SYSTEM: Updated Schedule Assessment Could Help Decision Makers Address Likely Delays Related to New Ground Control System\" (PDF). US Government Accounting Office. May 2019.\n\n\n\t^ \"Publications and Standards from the National Marine Electronics Association (NMEA)\". National Marine Electronics Association. Archived from the original on August 4, 2009. Retrieved June 27, 2008.\n\n\n\t^ \"Common View GPS Time Transfer\". nist.gov. Archived from the original on October 28, 2012. Retrieved July 23, 2011.\n\n\n\t^ \"Using GPS to improve tropical cyclone forecasts\". ucar.edu. Archived from the original on May 28, 2015. Retrieved May 28, 2015.\n\n\n\t^ \"Spotlight GPS pet locator\". Spotlightgps.com. Archived from the original on October 16, 2015. Retrieved October 15, 2010.\n\n\n\t^ Khetarpaul, S., Chauhan, R., Gupta, S. K., Subramaniam, L. V., Nambiar, U. (2011). Mining GPS data to determine interesting locations. Proceedings of the 8th International Workshop on Information Integration on the Web.CS1 maint: multiple names: authors list (link)\n\n\n\t^ \"The Use of GPS Tracking Technology in Australian Football\". Archived from the original on September 27, 2016. Retrieved September 25, 2016.\n\n\n\t^ \"The Pacific Northwest Geodetic Array\". cwu.edu. Archived from the original on September 11, 2014. Retrieved October 10, 2014.\n\n\n\t^ Arms Control Association.Missile Technology Control Regime Archived September 16, 2008, at the Wayback Machine. Retrieved May 17, 2006.\n\n\t^ Sinha, Vandana (July 24, 2003). \"Commanders and Soldiers' GPS-receivers\". Gcn.com. Archived from the original on September 21, 2009. Retrieved October 13, 2009.\n\n\n\t^ \"XM982 Excalibur Precision Guided Extended Range Artillery Projectile\". GlobalSecurity.org. May 29, 2007. Archived from the original on September 4, 2006. Retrieved September 26, 2007.\n\n\n\t^ Sandia National Laboratory's Nonproliferation programs and arms control technology Archived September 28, 2006, at the Wayback Machine.\n\n\t^ Dennis D. McCrady. \"The GPS Burst Detector W-Sensor\" (PDF). Sandia National Laboratories.\n\n\n\t^ \"US Air Force Eyes Changes To National Security Satellite Programs\". Aviationweek.com. January 18, 2013. Archived from the original on September 22, 2013. Retrieved September 28, 2013.\n\n\n\t^ Greenemeier, Larry. \"GPS and the World's First \"Space War\"\". Scientific American. Archived from the original on February 8, 2016. Retrieved February 8, 2016.\n\n\n\t^ \"GPS jamming is a growing threat to satellite navigation, positioning, and precision timing\". www.militaryaerospace.com. Archived from the original on March 6, 2019. Retrieved March 3, 2019.\n\n\n\t^ https://www.nbcnews.com/news/us-news/gps-under-attack-crooks-rogue-workers-wage-electronic-war-n618761 Archived March 6, 2019, at the Wayback Machine GPS Under Attack as Crooks, Rogue Workers Wage Electronic War\n\n\t^ Editor (April 30, 2018). \"Russia Undermining World's Confidence in GPS\". Archived from the original on March 6, 2019. Retrieved March 3, 2019.\n\n\n\t^ \"China Jamming US Forces' GPS\". September 26, 2016. Archived from the original on March 6, 2019. Retrieved March 3, 2019.\n\n\n\t^ Mizokami, Kyle (April 5, 2016). \"North Korea Is Jamming GPS Signals\". Popular Mechanics. Archived from the original on March 6, 2019. Retrieved March 3, 2019.\n\n\n\t^ \"Satellite message format\". Gpsinformation.net. Archived from the original on November 1, 2010. Retrieved October 15, 2010.\n\n\n\t^ Peter H. Dana. \"GPS Week Number Rollover Issues\". Archived from the original on February 25, 2013. Retrieved August 12, 2013.\n\n\n\t^ \"Interface Specification IS-GPS-200, Revision D: Navstar GPS Space Segment/Navigation User Interfaces\" (PDF). Navstar GPS Joint Program Office. p. 103. Archived from the original (PDF) on September 8, 2012.\n\n\n\t^ Richharia, Madhavendra; Westbrook, Leslie David (2011). Satellite Systems for Personal Applications: Concepts and Technology. John Wiley & Sons. p. 443. ISBN 978-1-119-95610-5. Archived from the original on July 4, 2014. Retrieved February 28, 2017.\n\n\n\t^ a b c Penttinen, Jyrki T.J. (2015). The Telecommunications Handbook: Engineering Guidelines for Fixed, Mobile and Satellite Systems. John Wiley & Sons. ISBN 978-1-119-94488-1.\n\n\n\t^ Misra, Pratap; Enge, Per (2006). Global Positioning System. Signals, Measurements and Performance (2nd ed.). Ganga-Jamuna Press. p. 115. ISBN 978-0-9709544-1-1. Retrieved August 16, 2013.\n\n\n\t^ Borre, Kai; M. Akos, Dennis; Bertelsen, Nicolaj; Rinder, Peter; Jensen, Søren Holdt (2007). A Software-Defined GPS and Galileo Receiver. A single-Frequency Approach. Springer. p. 18. ISBN 978-0-8176-4390-4.\n\n\n\t^ TextGenerator Version 2.0. \"United States Nuclear Detonation Detection System (USNDS)\". Fas.org. Archived from the original on October 10, 2011. Retrieved November 6, 2011.\n\n\n\t^ \"First Block 2F GPS Satellite Launched, Needed to Prevent System Failure\". DailyTech. Archived from the original on May 30, 2010. Retrieved May 30, 2010.\n\n\n\t^ \"United Launch Alliance Successfully Launches GPS IIF-12 Satellite for U.S. Air Force\". www.ulalaunch.com. Archived from the original on February 28, 2018. Retrieved February 27, 2018.\n\n\n\t^ \"Air Force Successfully Transmits an L5 Signal From GPS IIR-20(M) Satellite\". LA AFB News Release. Archived from the original on May 21, 2011. Retrieved June 20, 2011.\n\n\n\t^ \"Federal Communications Commission Presented Evidence of GPS Signal Interference\". GPS World. Archived from the original on October 11, 2011. Retrieved November 6, 2011.\n\n\n\t^ \"Coalition to Save Our GPS\". Saveourgps.org. Archived from the original on October 30, 2011. Retrieved November 6, 2011.\n\n\n\t^ \"LightSquared Tests Confirm GPS Jamming\". Aviation Week. Archived from the original on August 12, 2011. Retrieved June 20, 2011.\n\n\n\t^ \"GPS Almanacs, NANUS, and Ops Advisories (including archives)\". GPS Almanac Information. United States Coast Guard. Archived from the original on July 12, 2010. Retrieved September 9, 2009.\n\n\n\t^ \"George, M., Hamid, M., and Miller A. Gold Code Generators in Virtex Devices at the Internet Archive PDF\n\n\t^ a b section 4 beginning on page 15 Geoffery Blewitt: Basics of the GPS Techique Archived September 22, 2013, at the Wayback Machine\n\n\t^ a b c \"Global Positioning Systems\" (PDF). Archived from the original (PDF) on July 19, 2011. Retrieved October 15, 2010.\n\n\n\t^ Dana, Peter H. \"Geometric Dilution of Precision (GDOP) and Visibility\". University of Colorado at Boulder. Archived from the original on August 23, 2005. Retrieved July 7, 2008.\n\n\n\t^ Peter H. Dana. \"Receiver Position, Velocity, and Time\". University of Colorado at Boulder. Archived from the original on August 23, 2005. Retrieved July 7, 2008.\n\n\n\t^ \"Modern navigation\". math.nus.edu.sg. Archived from the original on December 26, 2017. Retrieved December 4, 2018.\n\n\n\t^ Gilbert Strang; Kai Borre (1997). Linear Algebra, Geodesy, and GPS. SIAM. pp. 448–449. ISBN 978-0-9614088-6-2.\n\n\n\t^ Audun Holme (2010). Geometry: Our Cultural Heritage. Springer Science & Business Media. p. 338. ISBN 978-3-642-14441-7.\n\n\n\t^ a b B. Hofmann-Wellenhof; K. Legat; M. Wieser (2003). Navigation. Springer Science & Business Media. p. 36. ISBN 978-3-211-00828-7.\n\n\n\t^ Hoshen J (1996). \"The GPS Equations and the Problem of Apollonius\". IEEE Transactions on Aerospace and Electronic Systems. 32 (3): 1116–1124. Bibcode:1996ITAES..32.1116H. doi:10.1109/7.532270.\n\n\n\t^ Grafarend, Erik W. (2002). \"GPS Solutions: Closed Forms, Critical and Special Configurations of P4P\". GPS Solutions. 5 (3): 29–41. doi:10.1007/PL00012897.\n\n\n\t^ a b Bancroft, S. (January 1985). \"An Algebraic Solution of the GPS Equations\". IEEE Transactions on Aerospace and Electronic Systems. AES-21 (1): 56–59. Bibcode:1985ITAES..21...56B. doi:10.1109/TAES.1985.310538.\n\n\n\t^ Chaffee, J. and Abel, J., \"On the Exact Solutions of Pseudorange Equations\", IEEE Transactions on Aerospace and Electronic Systems, vol:30, no:4, pp: 1021–1030, 1994\n\n\t^ Sirola, Niilo (March 2010). \"Closed-form algorithms in mobile positioning: Myths and misconceptions\". 7th Workshop on Positioning Navigation and Communication. WPNC 2010. pp. 38–44. doi:10.1109/WPNC.2010.5653789.\n\n\n\t^ \"GNSS Positioning Approaches\". GNSS Positioning Approaches – GPS Satellite Surveying, Fourth Edition – Leick. Wiley Online Library. 2015. pp. 257–399. doi:10.1002/9781119018612.ch6. ISBN 9781119018612.\n\n\n\t^ Alfred Kleusberg, \"Analytical GPS Navigation Solution\", University of Stuttgart Research Compendium,1994\n\n\t^ Oszczak, B., \"New Algorithm for GNSS Positioning Using System of Linear Equations,\" Proceedings of the 26th International Technical Meeting of The Satellite Division of the Institute of Navigation (ION GNSS+ 2013), Nashville, TN, September 2013, pp. 3560–3563.\n\n\t^ Attewill, Fred. (2013-02-13) Vehicles that use GPS jammers are big threat to aircraft Archived February 16, 2013, at the Wayback Machine. Metro.co.uk. Retrieved on 2013-08-02.\n\n\t^ \"Frequently Asked Questions About Selective Availability\". National Coordination Office for Space-Based Positioning, Navigation, and Timing (PNT). October 2001. Archived from the original on June 16, 2015. Retrieved June 13, 2015. Selective Availability ended a few minutes past midnight EDT after the end of May 1, 2000. The change occurred simultaneously across the entire satellite constellation.\n\n\n\t^ https://blackboard.vuw.ac.nz/bbcswebdav/pid-1444805-dt-content-rid-2193398_1/courses/2014.1.ESCI203/Esci203_2014_GPS_1.pdf  (subscription required)\n\n\t^ McNamara, Joel (2008). GPS For Dummies. John Wiley & Sons. p. 59. ISBN 978-0-470-45785-6. Archived from the original on July 4, 2014. Retrieved May 22, 2018.\n\n\n\t^ \"NAVSTAR GPS User Equipment Introduction\" (PDF). Archived (PDF) from the original on September 10, 2008. Retrieved August 22, 2008.\n Section 1.2.2\n\n\t^ \"Notice Advisory to Navstar Users (NANU) 2016069\". GPS Operations Center. Archived from the original on May 25, 2017. Retrieved June 25, 2017.\n\n\n\t^ David W. Allan (1997). \"The Science of Timekeeping\" (PDF). Hewlett Packard. Archived (PDF) from the original on October 25, 2012. Cite journal requires |journal= (help)\n\n\n\t^ \"The Role of GPS in Precise Time and Frequency Dissemination\" (PDF). GPSworld. July–August 1990. Archived (PDF) from the original on December 15, 2012. Retrieved April 27, 2014. Cite journal requires |journal= (help)\n\n\n\t^ \"GPS time accurate to 100 nanoseconds\". Galleon. Archived from the original on May 14, 2012. Retrieved October 12, 2012.\n\n\n\t^ \"Between-Satellite Differencing\". Gmat.unsw.edu.au. Archived from the original on March 6, 2011. Retrieved October 15, 2010.\n\n\n\t^ \"Double differencing\". Gmat.unsw.edu.au. Archived from the original on March 6, 2011. Retrieved October 15, 2010.\n\n\n\t^ \"Triple differencing\". Gmat.unsw.edu.au. Archived from the original on March 6, 2011. Retrieved October 15, 2010.\n\n\n\t^ chapter on root finding and nonlinear sets of equations\n\n\t^ William H. Press (2007). Numerical Recipes 3rd Edition: The Art of Scientific Computing. Cambridge University Press. p. 959. ISBN 978-0-521-88068-8. Archived from the original on November 20, 2016. Retrieved February 6, 2018.\n\n\n\t^ \"2011 John Deere StarFire 3000 Operator Manual\" (PDF). John Deere. Archived from the original (PDF) on January 5, 2012. Retrieved November 13, 2011.\n\n\n\t^ a b \"Federal Communications Commission Report and Order In the Matter of Fixed and Mobile Services in the Mobile Satellite Service Bands at 1525–1559 MHz and 1626.5–1660.5 MHz\" (PDF). FCC.gov. April 6, 2011. Archived (PDF) from the original on December 16, 2011. Retrieved December 13, 2011.\n\n\n\t^ \"Federal Communications Commission Table of Frequency Allocations\" (PDF). FCC.gov. November 18, 2011. Archived (PDF) from the original on December 16, 2011. Retrieved December 13, 2011.\n\n\n\t^ \"FCC Docket File Number: SATASG2001030200017, \"Mobile Satellite Ventures LLC Application for Assignment and Modification of Licenses and for Authority to Launch and Operate a Next-Generation Mobile Satellite System\"\". FCC.gov. March 1, 2001. p. 9. Archived from the original on January 14, 2012. Retrieved December 14, 2011.\n\n\n\t^ \"U.S. GPS Industry Council Petition to the FCC to adopt OOBE limits jointly proposed by MSV and the Industry Council\". FCC.gov. September 4, 2003. Retrieved December 13, 2011.\n\n\n\t^ a b \"Order on Reconsideration\" (PDF). July 3, 2003. Archived (PDF) from the original on October 20, 2011. Retrieved October 20, 2015.\n\n\n\t^ \"Statement of Julius P. Knapp, Chief, Office of Engineering and Technology, Federal Communications Commission\" (PDF). gps.gov. September 15, 2011. p. 3. Archived (PDF) from the original on December 16, 2011. Retrieved December 13, 2011.\n\n\n\t^ \"FCC Order, Granted LightSquared Subsidiary LLC, a Mobile Satellite Service licensee in the L-Band, a conditional waiver of the Ancillary Terrestrial Component \"integrated service\" rule\" (PDF). Federal Communications Commission. FCC.Gov. January 26, 2011. Archived (PDF) from the original on December 16, 2011. Retrieved December 13, 2011.\n\n\n\t^ \"Data Shows Disastrous GPS Jamming from FCC-Approved Broadcaster\". gpsworld.com. February 1, 2011. Archived from the original on February 6, 2011. Retrieved February 10, 2011.\n\n\n\t^ \"Javad Ashjaee GPS World webinar\". gpsworld.com. December 8, 2011. Archived from the original on November 26, 2011. Retrieved December 13, 2011.\n\n\n\t^ \"FCC Order permitting mobile satellite services providers to provide an ancillary terrestrial component (ATC) to their satellite systems\" (PDF). Federal Communications Commission. FCC.gov. February 10, 2003. Archived (PDF) from the original on December 16, 2011. Retrieved December 13, 2011.\n\n\n\t^ \"Federal Communications Commission Fixed and Mobile Services in the Mobile Satellite Service\". Federal Communications Commission. FCC.gov. July 15, 2010. Archived from the original on May 27, 2012. Retrieved December 13, 2011.\n\n\n\t^ [2] Archived December 13, 2012, at the Wayback Machine\n\n\t^ \"Coalition to Save Our GPS\". Saveourgps.org. Archived from the original on October 24, 2011. Retrieved November 6, 2011.\n\n\n\t^ Jeff Carlisle (June 23, 2011). \"Testimony of Jeff Carlisle, LightSquared Executive Vice President of Regulatory Affairs and Public Policy to U.S. House Subcommittee on Aviation and Subcommittee on Coast Guard and Maritime Transportation\" (PDF). Archived from the original (PDF) on September 29, 2011. Retrieved December 13, 2011.\n\n\n\t^ Julius Genachowski (May 31, 2011). \"FCC Chairman Genachowski Letter to Senator Charles Grassley\" (PDF). Archived from the original (PDF) on January 13, 2012. Retrieved December 13, 2011.\n\n\n\t^ a b Tessler, Joelle (April 7, 2011). \"Internet network may jam GPS in cars, jets\". The Sun News. Archived from the original on May 1, 2011. Retrieved April 7, 2011.\n\n\n\t^ FCC press release \"Spokesperson Statement on NTIA Letter – LightSquared and GPS\" Archived April 23, 2012, at the Wayback Machine. February 14, 2012. Accessed 2013-03-03.\n\n\t^ Paul Riegler, FBT. \"FCC Bars LightSquared Broadband Network Plan\" Archived September 22, 2013, at the Wayback Machine. February 14, 2012. Retrieved February 14, 2012.\n\n\t^ PTI, K. J. M. Varma (December 27, 2018). \"China's BeiDou navigation satellite, rival to US GPS, starts global services\". livemint.com. Retrieved December 27, 2018.\n\n\n\t^ \"The BDS-3 Preliminary System Is Completed to Provide Global Services\". news.dwnews.com. Retrieved December 27, 2018.\n\n\n\t^ \"Galileo navigation satellite system goes live\". dw.com. Archived from the original on October 18, 2017. Retrieved December 17, 2016.\n\n\n\n\n\n\nFurther reading[edit]\n\n\t\"NAVSTAR GPS User Equipment Introduction\" (PDF). United States Coast Guard. September 1996.\n\n\tParkinson; Spilker (1996). The global positioning system. American Institute of Aeronautics and Astronautics. ISBN 978-1-56347-106-3.\n\n\tJaizki Mendizabal; Roc Berenguer; Juan Melendez (2009). GPS and Galileo. McGraw Hill. ISBN 978-0-07-159869-9.\n\n\tNathaniel Bowditch (2002). The American Practical Navigator – Chapter 11 Satellite Navigation . United States government.\n\n\tGlobal Positioning System Open Courseware from MIT, 2012\n\tGreg Milner (2016). Pinpoint: How GPS is Changing Technology, Culture, and Our Minds. W. W. Norton. ISBN 978-0-393-08912-7.\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Global Positioning System.\n\n\n\tGlobal Positioning System at Curlie\n\tFAA GPS FAQ\n\tGPS.gov – General public education website created by the U.S. Government\n\tU.S. Army Corps of Engineers manual: \"NAVSTAR HTML\". Archived from the original on August 22, 2008. Retrieved 2010-06-06.CS1 maint: BOT: original-url status unknown (link)\n  and\"PDF (22.6 MB, 328 pages)\" (PDF). Archived from the original on June 25, 2008. Retrieved 2010-06-06.CS1 maint: BOT: original-url status unknown (link)\n\n\tNational Geodetic Survey Orbits for the Global Positioning System satellites in the Global Navigation Satellite System\n\tGPS and GLONASS Simulation (Java applet) Simulation and graphical depiction of space vehicle motion including computation of dilution of precision (DOP)\n\tRelativity Science Calculator – Explaining Global Positioning System\n\n\n\t\tv\n\tt\n\te\n\n\nNAVSTAR Global Positioning System satellites\n\n\tList of GPS satellites\n\n\tBlock I\t\n\t1\n\t2\n\t3\n\t4\n\t5\n\t6\n\t7†\n\t8\n\t9\n\t10\n\t11\n\n\n\n\n\tBlock II\t\n\t1\n\t2\n\t3\n\t4\n\t5\n\t6\n\t7\n\t8\n\t9\n\n\n\n\n\tBlock IIA\t\n\t1\n\t2\n\t3\n\t4\n\t5\n\t6\n\t7\n\t8\n\t9\n\t10\n\t11\n\t12\n\t13\n\t14\n\t15\n\t16\n\t17\n\t18\n\t19\n\n\n\n\n\tBlock IIR\t\n\t1†\n\t2\n\t3\n\t4\n\t5\n\t6\n\t7\n\t8\n\t9\n\t10\n\t11\n\t12\n\t13\n\t14\n\t15\n\t16\n\t17\n\t18\n\t19\n\t20\n\t21\n\n\n\n\n\tBlock IIRM\t\n\t1\n\t2\n\t3\n\t4\n\t5\n\t6\n\t7\n\t8\n\n\n\n\n\tBlock IIF\t\n\t1\n\t2\n\t3\n\t4\n\t5\n\t6\n\t7\n\t8\n\t9\n\t10\n\t11\n\t12\n\n\n\n\n\tBlock IIIA\t\n\t01\n\t02\n\t03\n\t04\n\t05\n\t06\n\t07\n\t08\n\t09\n\t10\n\n\n\n\n\tBlock IIIF\t\n\t01\n\t02\n\t03\n\t04\n\t05\n\t06\n\t07\n\t08\n\t09\n\t10\n\t11\n\t12\n\t13\n\t14\n\t15\n\t16\n\t17\n\t18\n\t19\n\t20\n\t21\n\t22\n\n\n\n\n\tItalics indicate future missions. Signs † indicate launch failures.\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSatellite navigation systems\n\n\tOperational\t\n\tBeiDou\n\tDORIS\n\tGalileo\n\tGLONASS\n\tGPS / NavStar\n\tIRNSS / NAVIC\n\n\n\n\n\tHistorical\t\n\tBDS / BeiDou-1\n\tTransit\n\tTimation\n\tTsiklon\n\n\n\n\n\tGNSS augmentation\t\n\tEGNOS\n\tGAGAN\n\tGPS·C (retired)\n\tJPALS\n\tLAAS\n\tMSAS\n\tNTRIP\n\tQZSS / Michibiki\n\tStarFire\n\tWAAS\n\n\n\n\n\tRelated topics\t\n\tGNSS reflectometry\n\tKalman filter\n\tWavelet\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nTime signal stations\n\n\tLongwave\t\n\tBPC\n\tBPL\n\tBSF\n\tDCF77\n\tJJY\n\tRBU\n\tRJH (Beta)\n\tRNS (CHAYKA)\n\tRTZ\n\tMSF\n\tTDF\n\tWWVB\n\n\n\n\n\tShortwave\t\n\tBPM\n\tCHU\n\tEBC\n\tHD2IOA\n\tHLA\n\tJN53DV\n\tLOL\n\tRWM\n\tWWV\n\tWWVH (Hawaii, USA)\n\tYVTO\n\n\n\n\n\tVHF/FM/UHF\t\n\tRDS CT\n\n\n\n\n\tSatellite\t\n\tGPS\n\tBeiDou\n\tGalileo\n\tGLONASS\n\tIRNSS\n\tQZSS\n\n\n\n\n\tDefunct\t\n\tATA\n\tBSF (Shortwave)\n\tHBG\n\tNAA\n\tWWVL\n\tOMA\n\tOLB5\n\tVNG\n\tY3S\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSystems science\n\n\tSystems types\t\n\tAnatomical\n\tArt\n\tBiological\n\tComplex\n\tComplex adaptive\n\tConceptual\n\tCoupled human–environment\n\tDatabase\n\tDynamical\n\tEcological\n\tEconomic\n\tEnergy\n\tFormal\n\tHolarchic\n\tInformation\n\tLegal\n\tMeasurement\n\tMetric\n\tMulti-agent\n\tNervous\n\tNonlinear\n\tOperating\n\tPhysical\n\tPlanetary\n\tPolitical\n\tSensory\n\tSocial\n\tStar\n\tWriting\n\n\n\n\n\tConcepts\t\n\tDoubling time\n\tLeverage points\n\tLimiting factor\n\tNegative feedback\n\tPositive feedback\n\n\n\n\n\tTheoretical fields\t\n\t\n\tChaos theory\n\tComplex systems\n\tControl theory\n\tCybernetics\n\tEarth system science\n\tLiving systems\n\tSociotechnical system\n\tSystemics\n\tUrban metabolism\n\tWorld-systems theory\n\n\n\n\n\t\n\tAnalysis\n\tBiology\n\tDynamics\n\tEcology\n\tEngineering\n\tNeuroscience\n\tPharmacology\n\tPsychology\n\tTheory\n\tThinking\n\n\n\n\n\n\n\n\tSystems scientists\t\n\tAlexander Bogdanov\n\tRussell L. Ackoff\n\tWilliam Ross Ashby\n\tRuzena Bajcsy\n\tBéla H. Bánáthy\n\tGregory Bateson\n\tAnthony Stafford Beer\n\tRichard E. Bellman\n\tLudwig von Bertalanffy\n\tMargaret Boden\n\tKenneth E. Boulding\n\tMurray Bowen\n\tKathleen Carley\n\tMary Cartwright\n\tC. West Churchman\n\tManfred Clynes\n\tGeorge Dantzig\n\tEdsger W. Dijkstra\n\tFred Emery\n\tHeinz von Foerster\n\tStephanie Forrest\n\tJay Wright Forrester\n\tBarbara Grosz\n\tCharles A. S. Hall\n\tLydia Kavraki\n\tJames J. Kay\n\tFaina M. Kirillova\n\tGeorge Klir\n\tAllenna Leonard\n\tEdward Norton Lorenz\n\tNiklas Luhmann\n\tHumberto Maturana\n\tMargaret Mead\n\tDonella Meadows\n\tMihajlo D. Mesarovic\n\tJames Grier Miller\n\tRadhika Nagpal\n\tHoward T. Odum\n\tTalcott Parsons\n\tIlya Prigogine\n\tQian Xuesen\n\tAnatol Rapoport\n\tPeter Senge\n\tClaude Shannon\n\tKatia Sycara\n\tEric Trist\n\tFrancisco Varela\n\tManuela M. Veloso\n\tKevin Warwick\n\tNorbert Wiener\n\tJennifer Wilby\n\tAnthony Wilden\n\n\n\n\n\tApplications\t\n\tSystems theory in anthropology\n\tSystems theory in archaeology\n\tSystems theory in political science\n\n\n\n\n\tOrganizations\t\n\tList\n\tPrincipia Cybernetica\n\n\n\n\n\t\n\t Category\n\t Portal\n\t Commons\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nFlight instruments\n\n\tPitot-static\t\n\tAltimeter\n\tAirspeed indicator\n\tMachmeter\n\tVariometer\n\n\n\n\n\tGyroscopic\t\n\tAttitude indicator\n\tHeading indicator\n\tHorizontal situation indicator\n\tTurn and slip indicator\n\tTurn coordinator\n\tTurn indicator\n\n\n\n\n\tNavigational\t\n\tCourse deviation indicator\n\tHorizontal situation indicator\n\tInertial navigation system\n\tMagnetic compass\n\tSatellite navigation\n\tSIGI\n\n\n\n\n\tRelated topics\t\n\tAir data inertial reference unit\n\tECAM\n\tEFIS\n\tGlass cockpit\n\tPrimary flight display\n\tV speeds\n\tYaw string\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nAutomotive design\n\n\tPart of a series of articles on cars\n\n\tBody\t\n\tFramework\t\n\tBackbone chassis\n\tBeltline\n\tBody-on-frame\n\tBumper\n\tCabrio coach\n\tChassis\n\tContinental tire\n\tCrumple zone\n\tDagmar bumpers\n\tFender\n\tFender skirts\n\tGrille\n\tHood\n\tHood scoop\n\tMonocoque\n\tOverhang\n\tPillar\n\tPlatform\n\tPontoon fenders\n\tQuarter panel\n\tRoof rack\n\tShaker scoop\n\tSpoiler\n\tStressed member engine\n\tSubframe\n\tTonneau\n\tTrunk lid\n\n\n\n\n\tCompartments\t\n\tTrunk/boot/dickie\n\tHood/bonnet\n\n\n\n\n\tDoors\t\n\tButterfly\n\tCanopy\n\tGull-wing\n\tScissor\n\tSliding\n\tSuicide\n\n\n\n\n\tGlass\t\n\tGreenhouse\n\tPower window\n\tQuarter glass\n\tOpera window\n\tSunroof\n\tWindshield/windscreen\n\tWindshield/windscreen wiper\n\n\n\n\n\tOther elements\t\n\tBumper sticker\n\tCurb feeler\n\tFront-end bra\n\tHood ornament\n\tJapan black\n\tNerf bar\n\tOmniview technology\n\tRun-flat tire\n\tSpare tire\n\tTire/tyre\n\tTow hitch\n\tTruck accessory\n\tWindow deflector\n\n\n\n\n\tGeometry\t\n\tApproach and departure angles\n\tBreakover angle\n\tOverhang\n\tRide height\n\tRoll center\n\tTurning radius\n\tWeight distribution\n\n\n\n\n\n\n\n\tExterior\nequipment\n\t\n\tLighting\t\n\tDaytime running lamp\n\tHeadlamp\n\tsealed beam\n\thigh-intensity discharge lamp\n\n\n\tHidden headlamps\n\tTurn signals\n\ttrafficators\n\n\n\tRear position lamps\n\tStop lamps\n\tReversing lamps\n\tSafety reflector\n\tretroreflector\n\n\n\n\n\n\n\tOther elements\t\n\tHorn\n\tRegistration plate\n\tvanity plate\n\n\n\tWindshield/windscreen washer fluid\n\tWing mirror\n\tpower side-view mirror\n\n\n\n\n\n\n\tLegal\t\n\tIdentification number\n\tTheft\n\n\n\n\n\n\n\n\t\n\t Category\n\t Commons\n\t Portal\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n1962–present United States Air Force space vehicle designations\n\n\tSLV series\t\n\tSLV-1\n\tSLV-2\n\tSLV-3\n\tSLV-4\n\tSLV-5\n\n\n\n\n\tSB series\t\n\tSB-1\n\tSB-2\n\tSB-3\n\tSB-4\n\tSB-5\n\tSB-6\n\tSSB-7\n\tSSB-8\n\tSSB-9\n\tSSB-10\n\tASB-11\n\n\n\n\n\tSatellites\t\n\tWS-1\n\tWS-2\n\tLS-3\n\tES-4\n\tES-5\n\tLS-6\n\tNS-7\n\tES-8\n\tLS-9\n\tLS-10 (I)\n\tXSS-10 (II)\n\tXSS-112\n\tXSS-12\n\tS-131\n\tES-14\n\tLS-153\n\tLS-163\n\tES-17\n\n\n\n\n\t\n\t1 Not assigned\n\t2 Unofficial designation\n\t3 Designation believed to be this type but unconfirmed\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nEquipment of the United States Air Force\n\n\tActive service &\nAircraft designation\t\n\tA - Attack\t\n\tA/OA-10A/C Thunderbolt II\n\tAC-130H/U/J/W Spectre/Spooky II/Ghostrider/Stinger II\n\n\n\n\n\tB - Strategic bomber\t\n\tB-1B Lancer\n\tB-2A Spirit\n\tB-52H Stratofortress\n\n\n\n\n\tC - Cargo transport\t\n\tC-5C Galaxy\n\tC-5M Super Galaxy\n\tC-12C/D/F Huron\n\tC-17A Globemaster III\n\tC-20B Gulfstream III\n\tC-20H Gulfstream IV\n\tC-21A Learjet\n\tC-37A Gulfstream V\n\tC-40B/C Clipper\n\tC-130E/H/J/J-30 Hercules\n\tCV-22B Osprey\n\n\n\n\n\tE - Special electronic\t\n\tE-3B/C Sentry\n\tE-4B\n\tE-8C Joint STARS\n\tE-9A Widget\n\tE-11A BACN\n\tEC-130H Compass Call\n\tEC-130J Commando Solo\n\n\n\n\n\tF - Fighter\t\n\tF-15C/D Eagle\n\tF-15E Strike Eagle\n\tF-16C/D Fighting Falcon\n\tF-22A Raptor\n\n\tF-35A Lightning II\n\n\n\n\n\tH - Search and rescue\t\n\tHC-130P/N King\n\tHC-130J Combat King II\n\tHH-60G/MH-60G Pave Hawk\n\n\n\n\n\tK - Tanker\t\n\tKC-10A Extender\n\tKC-46 Pegasus\n\tKC-135E/R/T Stratotanker\n\n\n\n\n\tL - Cold weather\t\n\tLC-130H\n\n\n\n\n\tM - Multi-mission\t\n\tCV-22 Osprey\n\tMC-130E/H/J/P Combat Talon I/Combat Talon II/Commando II/Combat Shadow\n\tMC-12W Liberty\n\n\n\n\n\tO - Observation\t\n\tOC-135B Open Skies\n\n\n\n\n\tQ - Remotely Piloted\t\n\tMQ-9 Reaper\n\tRQ-4A Global Hawk\n\tRQ-11B Raven\n\tRQ-170 Sentinel\n\tRQ-180\n\n\n\n\n\tR - Reconnaissance\t\n\tRC-26B Condor\n\tRC-135S/U/V/W COBRA BALL/Combat Sent/Rivet Joint\n\tScan Eagle\n\tRU-2S Dragon Lady\n\tWasp III\n\n\n\n\n\tT - Trainer\t\n\tT-1A Jayhawk\n\tT-6A Texan II\n\t(A)T-38A/B/C Talon II\n\tTG-10B/C/D\n\tTG-15A/B\n\tDiamond T-52A\n\n\n\n\n\tU - Utility\t\n\tUH-1N Iroquois\n\tUH-1H/N/V Huey\n\tUV-18A/B Twin Otter\n\tU-28A\n\n\n\n\n\tV – VIP/staff transport\t\n\tVC-25A (Air Force One)\n\tC-32A/B (Air Force Two)\n\tC-40B/C Clipper\n\n\n\n\n\tW – Weather reconnaissance\t\n\tWC-130J Hercules\n\tWC-135W Constant Phoenix\n\n\n\n\n\tOther/undesignated\t\n\tAn-26  (6th SOS)\n\tCN-235-100  (427th SOS)\n\tMi-8  (6th SOS)\n\n\n\n\n\n\n\n\tSpace\nsystems\t\n\tLaunch vehicle\t\n\tAtlas V\n\tDelta IV\n\n\n\n\t\n\n\tSatellite\t\n\tAdvanced Extremely High Frequency (AEHF)\n\tDefense Meteorological Satellite Program (DMSP)\n\tDefense Satellite Communications System (DSCS)\n\tDefense Support Program (DSP)\n\tGlobal Positioning System (GPS)\n\tMilstar Satellite Communications System\n\tSpace-Based Infrared System (SBIRS)\n\tWideband Global SATCOM\n\n\n\n\n\n\n\n\tGround\nsystems\t\n\tC2\t\n\tAN/USQ-163 Falconer\n\tAN/GSQ-272 Sentinel\n\n\n\n\n\tGround-based\nradar\t\n\tAN/FPQ-16 Perimeter Acquisition Attack Characterization System (PARCS)\n\tAN/FPS-123 Early Warning Radar (EWR)\n\tAN/FPS-132 Upgraded Early Warning Radar (UEWR)\n\tAN/FPS-85\n\tAN/FPS-133 Air Force Space Surveillance System (AFSSS)\n\tAN/FSQ-114 Ground-Based Electro-Optical Deep Space Surveillance (GEODSS)\n\tAN/FSQ-224 Morón Optical Space Surveillance (MOSS)\n\tRapid Attack, Identification, Detection, and Reporting System (RAIDRS)\n\n\n\n\n\tGround vehicle\t\n\tHMMWV\n\tLSSV\n\tR-5 Refueler\n\tR-9 Refueler\n\tR-11 Refueler\n\tC300\n\n\n\n\n\n\n\n\tMunitions\t\n\tBomb\t\n\tMk-82\n\tMk-84\n\tGBU-8\n\tGBU-10 Paveway II\n\tGBU-12 Paveway II\n\tGBU-15\n\tGBU-24 Paveway III\n\tGBU-27 Paveway III\n\tGBU-28\n\tGBU-31 JDAM\n\tGBU-32 JDAM\n\tGBU-38 JDAM\n\tGBU-39 Small Diameter Bomb\n\tGBU-44/B Viper Strike\n\tGBU-53/B Small Diameter Bomb II\n\tGBU-54 Laser JDAM\n\tCBU-87 Combined Effects Munition\n\tCBU-89 Gator\n\tCBU-97 Sensor Fuzed Weapon\n\tBLU-109/B Bomb\n\tBLU-116 Bunker Buster\n\tB61 Nuclear Bomb\n\tB83 Nuclear Bomb\n\n\n\n\n\tGun\t\n\tGAU-8 Avenger\n\tM61 Vulcan\n\tGAU-12\n\tGAU-13\n\tGAU-19\n\tM240\n\tL/60 Bofors\n\tM102\n\tATK GAU-23/A\n\tM2 Browning\n\tMinigun\n\n\n\n\n\tMissile\t\n\tAIM-7M Sparrow\n\tAIM-9M/X Sidewinder\n\tLGM-30G Minuteman III\n\tAGM-65A/B/D/E/G/G2/H/K Maverick\n\tAGM-84 Harpoon\n\tAGM-84E Standoff Land Attack Missile\n\tAGM-84H/K Standoff Land Attack Missile - Expanded Response\n\tAGM-86B/C/D Air-Launched Cruise Missile (ALCM)\n\tAGM-88A/B/C High-speed Anti-radiation Missile (HARM)\n\tAGM-114 Hellfire Air-to-Surface Missile (ASM)\n\tAIM-120B/C Advanced Medium-Range Air-to-Air Missile (AMRAAM)\n\tAGM-130 Powered Standoff Weapon\n\tAGM-154A Joint Standoff Weapon (JSOW)\n\tAGM-158 Joint Air-to-Surface Stand-off Missile (JASSM)\n\tAGM-176 Griffin\n\tZuni rocket\n\n\n\n\n\tTarget\t\n\tBQM-34 Firebee\n\tBQM-167 Subscale Aerial Target\n\tMQM-107 Streaker\n\tQF-4 Aerial Target\n\n\n\n\n\n\n\n\tSmall arms\t\n\tSidearm/PDW\t\n\tM11 Pistol\n\tM9 Pistol\n\tM17 Pistol\n\tMP5 submachine gun\n\tUSAF Pilot's Survival Knife\n\n\n\n\n\tRifle/Carbine\t\n\tGUU-5/P Carbine\n\tM4 carbine\n\tM14 Stand-off Munitions Disruptor (SMUD)\n\tM16A2 Rifle\n\tM24 Sniper Weapon System\n\tM107 Long Range Sniper Rifle\n\tMk 14 Mod 0 Enhanced Battle Rifle\n\n\n\n\n\tSupport/CQB\t\n\tM60 machine gun\n\tM2HB Browning machine gun\n\tM240B Medium Machine Gun\n\tM249 light machine gun\n\tM1014 shotgun\n\tRemington 870 MCS shotgun\n\n\n\n\n\tOrdnance\t\n\tM136 AT4 Light Anti-tank Weapon\n\tM18A1 Claymore Mine\n\tM67 Fragmentation Grenade\n\tM72 Light Anti-tank Weapon (LAW)\n\tM79 grenade launcher\n\tMK-19 automatic grenade launcher\n\n\n\n\n\n\n\n\tUniforms &\nother equipment\t\n\tAirman Battle Uniform (ABU)\n\tAirman Combat Uniform (ACU)\n\tFlight Suit\n\tPhysical Training Uniform\n\tService Dress Uniform\n\tMess dress\n\tCMU – 33A/P22P-18\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nOrienteering\n\n\t\n\tHistory of orienteering\n\tList of orienteering events\n\n\n\n\n\tSport disciplines\t\n\tIOF-governed\t\n\tFoot orienteering\n\tMountain bike orienteering\n\tSki orienteering\n\tTrail orienteering\n\n\n\n\n\tIARU-governed\t\n\tAmateur radio direction finding\n\tFox Oring\n\tRadio Orienteering in a Compact Area\n\n\n\n\n\n\n\tOther sports\t\n\tCanoe orienteering\n\tCar orienteering\n\tMountain marathon\n\tMounted orienteering\n\tRogaining\n\n\n\n\n\tRelated\t\n\tAdventure racing\n\tAlleycat race\n\tFell running\n\tRelay race\n\tTransmitter hunting\n\n\n\n\n\n\n\n\tEquipment\t\n\tEvent\t\n\tControl point\n\tCourse\n\tMap\n\n\n\n\n\tPersonal\t\n\tCompass\n\thand\n\tprotractor\n\tthumb\n\n\n\tEye protectors\n\tGaiters\n\tHeadlamp\n\n\n\n\n\tExceptions\t\n\tBackpacking\n\tGPS\n\tWhistle\n\n\n\n\n\n\n\n\tFundamentals\t\n\tMap\n\torienteering map\n\n\n\tNavigation\n\tcardinal direction\n\tresection\n\troute choice\n\twayfinding\n\twaypoint\n\n\n\tRacing\n\thiking\n\trunning\n\twalking\n\tskiing\n\tmountain biking\n\n\n\n\n\n\n\tOrganisations / lists\t\n\tInternational Orienteering Federation\n\tmembers\n\n\n\tList of clubs\n\tList of orienteers\n\tby country\n\tinnovators\n\n\n\tList of events\n\n\n\n\n\tNon-sport related\t\n\tAdventure travel\n\tBicycle touring\n\tClimbing\n\tHiking\n\tHunting\n\tLocation-based game\n\tgeocaching\n\tpoker run\n\n\n\tScoutcraft orienteering\n\tBackpacking\n\twilderness\n\n\n\n\n\n\n\tCompetitions\t\n\tFoot orienteering\t\n\tWorld Championships\n\tJunior\n\tMasters\n\tUniversity\n\n\n\tWorld Cup\n\tWorld Games\n\tEuropean Championships\n\tYouth\n\tUniversity\n\n\n\tOpen events\n\tO-Ringen\n\tJukola\n\tTiomila\n\tKainuu Orienteering Week\n\tJan Kjellström Festival\n\n\n\n\n\n\n\tSki orienteering\t\n\tWorld Championships\n\tJunior\n\n\n\tWorld Cup\n\n\n\n\n\tMountain bike orienteering\t\n\tWorld Championships\n\n\n\n\n\tTrail orienteering\t\n\tWorld Championships\n\n\n\n\n\n\n\n\t\n\t Category\n\t WikiProject\n\n\n\n\n\n\n\n\tSpaceflight portal\n\tGeography portal\n\tNautical portal\n\tUnited States portal\n\n\n\n\tAuthority control \t\n\tGND: 4216824-7\n\tLCCN: sh86003934\n\tNARA: 10638667\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Global_Positioning_System&oldid=917890871\"\n\n\t\t\n\t\tCategories: \tGlobal Positioning System\n\t20th-century inventions\n\n\nHidden categories: \tWebarchive template wayback links\n\tCS1 maint: archived copy as title\n\tAll articles with dead external links\n\tArticles with dead external links from September 2016\n\tArticles with permanently dead external links\n\tCS1 maint: multiple names: authors list\n\tCS1: long volume value\n\tPages containing links to subscription-only content\n\tCS1 errors: missing periodical\n\tArticles with short description\n\tUse mdy dates from January 2013\n\tArticles with hAudio microformats\n\tArticles needing additional references from March 2015\n\tAll articles needing additional references\n\tArticles containing potentially dated statements from February 2019\n\tAll articles containing potentially dated statements\n\tArticles containing potentially dated statements from July 2019\n\tArticles containing potentially dated statements from 2007\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from May 2017\n\tArticles with unsourced statements from August 2011\n\tArticles containing potentially dated statements from 2006\n\tWikipedia articles needing clarification from February 2013\n\tArticles with unsourced statements from November 2007\n\tArticles with unsourced statements from March 2013\n\tDuplicate articles\n\tArticles containing potentially dated statements from January 2017\n\tArticles with Curlie links\n\tCS1 maint: BOT: original-url status unknown\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NARA identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAragonés\n\tAsturianu\n\tAzərbaycanca\n\tتۆرکجه\n\tবাংলা\n\tBân-lâm-gú\n\tБашҡортса\n\tБеларуская\n\tБългарски\n\tBosanski\n\tBrezhoneg\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEstremeñu\n\tEuskara\n\tفارسی\n\tFøroyskt\n\tFrançais\n\tFrysk\n\tGaeilge\n\tGalego\n\t贛語\n\tGĩkũyũ\n\tગુજરાતી\n\t客家語/Hak-kâ-ngî\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tJawa\n\tಕನ್ನಡ\n\tKapampangan\n\tქართული\n\tҚазақша\n\tKiswahili\n\tKreyòl ayisyen\n\tLatina\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tLingála\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tमराठी\n\tმარგალური\n\tمصرى\n\tBahasa Melayu\n\tMirandés\n\tМонгол\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tNouormand\n\tOccitan\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tپښتو\n\tPatois\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tसंस्कृतम्\n\tScots\n\tShqip\n\tසිංහල\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tТатарча/tatarça\n\tไทย\n\tТоҷикӣ\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t吴语\n\tייִדיש\n\tYorùbá\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 26 September 2019, at 00:07 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "21", "dc:title": "Global Positioning System - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/3/3c/NAVSTAR_GPS_logo.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-global_positioning_system", "title": "Global Positioning System - Wikipedia"}}