{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGravitational acceleration - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tGravitational acceleration\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tFor broader coverage of this topic, see Classical mechanics.\n\n\t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Gravitational acceleration\" – news · newspapers · books · scholar · JSTOR  (December 2010) (Learn how and when to remove this template message)\n\n\n\nIn physics, gravitational acceleration is the acceleration on an object caused by the force of gravitation. Neglecting friction such as air resistance, all small bodies accelerate in a gravitational field at the same rate relative to the center of mass.[1] This equality is true regardless of the masses or compositions of the bodies.\n\nAt different points on Earth, objects fall with an acceleration  between 9.764 m/s2 and 9.834 m/s2[2] depending on altitude and latitude, with a conventional standard value of exactly 9.80665 m/s2 (approximately 32.17405 ft/s2). This does not take into account other effects, such as buoyancy or drag.\n\n\nContents\n\n\n\t1 For point masses\n\t2 Gravity model for Earth\n\t3 General relativity\n\t4 See also\n\t5 References\n\n\n\n\n\nFor point masses[edit]\n\nNewton's law of universal gravitation states that there is a gravitational force between any two masses that is equal in magnitude for each mass, and is aligned to draw the two masses toward each other.  The formula is:\n\n\n\t\n  \n    \n      \n        F\n        =\n        G\n        \n          \n            \n              \n                m\n                \n                  1\n                \n              \n              \n                m\n                \n                  2\n                \n              \n            \n            \n              r\n              \n                2\n              \n            \n          \n        \n         \n      \n    \n    {\\displaystyle F=G{\\frac {m_{1}m_{2}}{r^{2}}}\\ }\n  \n\n\n\nwhere \n  \n    \n      \n        \n          m\n          \n            1\n          \n        \n      \n    \n    {\\displaystyle m_{1}}\n  \n and \n  \n    \n      \n        \n          m\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle m_{2}}\n  \n are the two masses, \n  \n    \n      \n        G\n      \n    \n    {\\displaystyle G}\n  \n is the gravitational constant, and \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n  \n is the distance between the two masses.  The formula was derived for planetary motion where the distances between the planets and the Sun made it reasonable to consider the bodies to be point masses.  (For a satellite in orbit, the 'distance' refers to the distance from the mass centers rather than, say, the altitude above a planet's surface.)\n\nIf one of the masses is much larger than the other, it is convenient to define a gravitational field around the larger mass as follows:[3]\n\n\n\t\n  \n    \n      \n        \n          g\n        \n        =\n        −\n        \n          \n            \n              G\n              M\n            \n            \n              r\n              \n                2\n              \n            \n          \n        \n        \n          \n            \n              r\n              ^\n            \n          \n        \n      \n    \n    {\\displaystyle \\mathbf {g} =-{GM \\over r^{2}}\\mathbf {\\hat {r}} }\n  \n\n\n\nwhere \n  \n    \n      \n        M\n      \n    \n    {\\displaystyle M}\n  \n is the mass of the larger body, and \n  \n    \n      \n        \n          \n            \n              r\n              ^\n            \n          \n        \n      \n    \n    {\\displaystyle \\mathbf {\\hat {r}} }\n  \n is a unit vector directed from the large mass to the smaller mass.  The negative sign indicates that the force is an attractive force.\n\nIn that way, the force acting upon the smaller mass can be calculated as:\n\n\n\t\n  \n    \n      \n        \n          F\n        \n        =\n        m\n        \n          g\n        \n      \n    \n    {\\displaystyle \\mathbf {F} =m\\mathbf {g} }\n  \n\n\n\nwhere \n  \n    \n      \n        \n          F\n        \n      \n    \n    {\\displaystyle \\mathbf {F} }\n  \n is the force vector, \n  \n    \n      \n        m\n      \n    \n    {\\displaystyle m}\n  \n is the smaller mass, and \n  \n    \n      \n        \n          g\n        \n      \n    \n    {\\displaystyle \\mathbf {g} }\n  \n is a vector pointing toward the larger body. \n  \n    \n      \n        \n          g\n        \n      \n    \n    {\\displaystyle \\mathbf {g} }\n  \n has units of acceleration and is a vector function of location relative to the large body, independent of the magnitude (or even the presence) of the smaller mass.\n\nThis model represents the \"far-field\" gravitational acceleration associated with a massive body.  When the dimensions of a body are not trivial compared to the distances of interest, the principle of superposition can be used for differential masses for an assumed density distribution throughout the body in order to get a more detailed model of the \"near-field\" gravitational acceleration.  For satellites in orbit, the far-field model is sufficient for rough calculations of altitude versus period, but not for precision estimation of future location after multiple orbits.\n\nThe more detailed models include (among other things) the bulging at the equator for the Earth, and irregular mass concentrations (due to meteor impacts) for the Moon.  The Gravity Recovery And Climate Experiment (GRACE) mission launched in 2002 consists of two probes, nicknamed \"Tom\" and \"Jerry\", in polar orbit around the Earth measuring differences in the distance between the two probes in order to more precisely determine the gravitational field around the Earth, and to track changes that occur over time.  Similarly, the Gravity Recovery and Interior Laboratory (GRAIL) mission from 2011-2012 consisted of two probes (\"Ebb\" and \"Flow\") in polar orbit around the Moon to more precisely determine the gravitational field for future navigational purposes, and to infer information about the Moon's physical makeup.\n\n\nGravity model for Earth[edit]\n\nMain article: Gravity of Earth\n\nFurther information: Theoretical gravity\n\nThe type of gravity model used for the Earth depends upon the degree of fidelity required for a given problem.  For many problems such as aircraft simulation, it may be sufficient to consider gravity to be a constant, defined as:[4]\n\n\n\t\n  \n    \n      \n        g\n        =\n      \n    \n    {\\displaystyle g=}\n  \n 9.80665 metres (32.1740 ft) per s2\n\n\nbased upon data from World Geodetic System 1984 (WGS-84), where \n  \n    \n      \n        g\n      \n    \n    {\\displaystyle g}\n  \n is understood to be pointing 'down' in the local frame of reference.\n\nIf it is desirable to model an object's weight on Earth as a function of latitude, one could use the following ([4] p. 41):\n\n\n\t\n  \n    \n      \n        g\n        =\n        \n          g\n          \n            45\n          \n        \n        −\n        \n          \n            \n              1\n              2\n            \n          \n        \n        (\n        \n          g\n          \n            \n              p\n              o\n              l\n              e\n              s\n            \n          \n        \n        −\n        \n          g\n          \n            \n              e\n              q\n              u\n              a\n              t\n              o\n              r\n            \n          \n        \n        )\n        cos\n        ⁡\n        \n          (\n          \n            2\n            \n            φ\n            ⋅\n            \n              \n                π\n                180\n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle g=g_{45}-{\\tfrac {1}{2}}(g_{\\mathrm {poles} }-g_{\\mathrm {equator} })\\cos \\left(2\\,\\varphi \\cdot {\\frac {\\pi }{180}}\\right)}\n  \n\n\n\nwhere\n\n\n\t\n  \n    \n      \n        \n          g\n          \n            \n              p\n              o\n              l\n              e\n              s\n            \n          \n        \n      \n    \n    {\\displaystyle g_{\\mathrm {poles} }}\n  \n = 9.832 metres (32.26 ft) per s2\n\t\n  \n    \n      \n        \n          g\n          \n            45\n          \n        \n      \n    \n    {\\displaystyle g_{45}}\n  \n = 9.806 metres (32.17 ft) per s2\n\t\n  \n    \n      \n        \n          g\n          \n            \n              e\n              q\n              u\n              a\n              t\n              o\n              r\n            \n          \n        \n      \n    \n    {\\displaystyle g_{\\mathrm {equator} }}\n  \n = 9.780 metres (32.09 ft) per s2\n\t\n  \n    \n      \n        φ\n      \n    \n    {\\displaystyle \\varphi }\n  \n = latitude, between −90 and 90 degrees\n\n\nNeither of these accounts for changes in gravity with changes in altitude, but the model with the cosine function does take into account the centrifugal relief that is produced by the rotation of the Earth.  For the mass attraction effect by itself, the gravitational acceleration at the equator is about 0.18% less than that at the poles due to being located farther from the mass center.  When the rotational component is included (as above), the gravity at the equator is about 0.53% less than that at the poles, with gravity at the poles being unaffected by the rotation.  So the rotational component of change due to latitude (0.35%) is about twice as significant as the mass attraction change due to latitude (0.18%), but both reduce strength of gravity at the equator as compared to gravity at the poles.\n\nNote that for satellites, orbits are decoupled from the rotation of the Earth so the orbital period is not necessarily one day, but also that errors can accumulate over multiple orbits so that accuracy is important.  For such problems, the rotation of the Earth would be immaterial unless variations with longitude are modeled.  Also, the variation in gravity with altitude becomes important, especially for highly elliptical orbits.\n\nThe Earth Gravitational Model 1996 (EGM96) contains 130,676 coefficients that refine the model of the Earth's gravitational field ([4] p. 40).  The most significant correction term is about two orders of magnitude more significant than the next largest term ([4] p. 40).  That coefficient is referred to as the \n  \n    \n      \n        \n          J\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle J_{2}}\n  \n term, and accounts for the flattening of the poles, or the oblateness, of the Earth.  (A shape elongated on its axis of symmetry, like an American football, would be called prolate.)  A gravitational potential function can be written for the change in potential energy for a unit mass that is brought from infinity into proximity to the Earth.  Taking partial derivatives of that function with respect to a  coordinate system will then resolve the directional components of the gravitational acceleration vector, as a function of location.  The component due to the Earth's rotation can then be included, if appropriate, based on a sidereal day relative to the stars (≈366.24 days/year) rather than on a solar day (≈365.24 days/year). That component is perpendicular to the axis of rotation rather than to the surface of the Earth.\n\nA similar model adjusted for the geometry and gravitational field for Mars can be found in publication NASA SP-8010.[5]\n\nThe barycentric gravitational acceleration at a point in space is given by:\n\n\n\t\n  \n    \n      \n        \n          g\n        \n        =\n        −\n        \n          \n            \n              G\n              M\n            \n            \n              r\n              \n                2\n              \n            \n          \n        \n        \n          \n            \n              r\n              ^\n            \n          \n        \n      \n    \n    {\\displaystyle \\mathbf {g} =-{GM \\over r^{2}}\\mathbf {\\hat {r}} }\n  \n\n\n\nwhere:\n\nM is the mass of the attracting object, \n  \n    \n      \n        \n          \n            \n              \n                r\n                ^\n              \n            \n          \n        \n      \n    \n    {\\displaystyle \\scriptstyle \\mathbf {\\hat {r}} }\n  \n is the unit vector from center-of-mass of the attracting object to the center-of-mass of the object being accelerated, r is the distance between the two objects, and G is the gravitational constant.\n\nWhen this calculation is done for objects on the surface of the Earth, or aircraft that rotate with the Earth, one has to account for the fact that the Earth is rotating and the centrifugal acceleration has to be subtracted from this.  For example, the equation above gives the acceleration at 9.820 m/s2, when GM = 3.986×1014 m3/s2, and R=6.371×106 m.  The centripetal radius is r = R cos(φ), and the centripetal time unit is approximately (day / 2π), reduces this, for r = 5×106 metres, to 9.79379 m/s2, which is closer to the observed value.[citation needed]\n\n\nGeneral relativity[edit]\n\nSee also: Gravitational field § General relativity, and Gravitational potential § General relativity\n\nIn Einstein's theory of general relativity, gravitation is an attribute of curved spacetime instead of being due to a force propagated between bodies. In Einstein's theory, masses distort spacetime in their vicinity, and other particles move in trajectories determined by the geometry of spacetime. The gravitational force is a fictitious force.  There is no gravitational acceleration, in that the proper acceleration and hence four-acceleration of objects in free fall are zero. Rather than undergoing an acceleration, objects in free fall travel along straight lines (geodesics) on the curved spacetime.\n\n\nSee also[edit]\n\n\tAir track\n\tGravimetry\n\tGravity of Earth\n\tNewton's law of universal gravitation\n\tStandard gravity\n\n\nReferences[edit]\n\n\n\t^ \nGerald James Holton and Stephen G. Brush (2001). Physics, the human adventure: from Copernicus to Einstein and beyond (3rd ed.). Rutgers University Press. p. 113. ISBN 978-0-8135-2908-0.\n\n\t^ \nHirt, C.; Claessens, S.; Fecher, T.; Kuhn, M.; Pail, R.; Rexer, M. (2013). \"New ultrahigh-resolution picture of Earth's gravity field\". Geophysical Research Letters. 40 (16): 4279–4283. Bibcode:2013GeoRL..40.4279H. doi:10.1002/grl.50838.\n\n\n\t^ \nFredrick J. Bueche (1975). Introduction to Physics for Scientists and Engineers, 2nd Ed. USA: Von Hoffmann Press. ISBN 978-0-07-008836-8.\n\n\n\t^ a b c d \nBrian L. Stevens; Frank L. Lewis (2003). Aircraft Control And Simulation, 2nd Ed. Hoboken, New Jersey: John Wiley & Sons, Inc. ISBN 978-0-471-37145-8.\n\n\n\t^ \nRichard B. Noll; Michael B. McElroy (1974), Models of Mars' Atmosphere [1974], Greenbelt, Maryland: NASA Goddard Space Flight Center, SP-8010.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Gravitational_acceleration&oldid=919027212\"\n\n\t\t\n\t\tCategories: \tGravimetry\n\tGravity\n\tAcceleration\n\n\nHidden categories: \tArticles needing additional references from December 2010\n\tAll articles needing additional references\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from February 2019\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBosanski\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tفارسی\n\tFrançais\n\tGaeilge\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tҚазақша\n\tKurdî\n\tКыргызча\n\tLatviešu\n\tLimburgs\n\tМакедонски\n\tमराठी\n\tМонгол\n\tNederlands\n\t日本語\n\tNordfriisk\n\tNorsk\n\tNorsk nynorsk\n\tភាសាខ្មែរ\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tŚlůnski\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tதமிழ்\n\tТатарча/tatarça\n\tతెలుగు\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t吴语\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 October 2019, at 12:57 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "Gravitational acceleration - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-gravitational_acceleration", "title": "Gravitational acceleration - Wikipedia"}}