{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGravity well - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tGravity well\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tPhysical theory\n\n\n{{multiple issues \n\n\n\t\n\tThis article does not cite any sources. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.  (October 2007) (Learn how and when to remove this template message)\n\n\n\n\t\n\tThis article may require cleanup to meet Wikipedia's quality standards. No cleanup reason has been specified. Please help improve this article if you can.  (July 2010) (Learn how and when to remove this template message)\n\n\n\n}}\n\nA gravity well or gravitational well is a conceptual model of the gravitational field surrounding a body in space – the more massive the body, the deeper and more extensive the gravity well associated with it. The Sun is very massive, relative to other bodies in the Solar System, so the corresponding gravity well that surrounds it appears \"deep\" and far-reaching. The gravity wells of asteroids and small moons, conversely, are often depicted as very shallow. Anything at the center of mass of a planet or moon is considered to be at the bottom of that celestial body's gravity well, and so escaping the effects of gravity from such a planet or moon (to enter outer space) is sometimes called \"climbing out of the gravity well\". The deeper a gravity well is, the more energy any space-bound \"climber\" must use to escape it.\n\nIn astrophysics, a gravity well is specifically the gravitational potential field around a massive body. Other types of potential wells include electrical and magnetic potential wells. Physical models of gravity wells are sometimes used to illustrate orbital mechanics. Gravity wells are frequently confused with embedding diagrams used in general relativity theory, but the two concepts are distinctly separate and not directly related.\n\n\nContents\n\n\n\t1 Details\n\t2 Physical gravity wells\n\t3 The rubber-sheet model\n\t4 Gravity wells and general relativity\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nDetails[edit]\n\n  \nPlot of a two-dimensional slice of the gravitational potential in and around a uniformly dense, spherically symmetric body.\n\n\n\n  \nThis image shows the four trajectory categories with the gravitational potential well (gravity well) of the central mass's field of potential energy shown in black and the height of the kinetic energy of the moving body shown in red extending above that, correlating to changes in speed as distance changes according to Kepler's laws.\n\n\n\n  \nThis image shows how the gravitational force vector field is inter-related with the gravity well. This shows how it is only a 2‑dimensional slice of the gravity field that is represented in the gravity well. The z axis is no longer a spatial dimension, but now represents energy.\n\n\n\nIf G is the universal gravitational constant (G = 6.67×10−11 m3 kg−1 s−2), the external gravitational potential of a spherically symmetric body of mass M is given by the formula:\n\n\n\t\n  \n    \n      \n        Φ\n        (\n        \n          x\n        \n        )\n        =\n        −\n        \n          \n            \n              G\n              M\n            \n            \n              \n                |\n              \n              \n                x\n              \n              \n                |\n              \n            \n          \n        \n        .\n      \n    \n    {\\displaystyle \\Phi (\\mathbf {x} )=-{\\frac {GM}{|\\mathbf {x} |}}.}\n  \n\n\n\nA plot of this function in two dimensions is shown in the figure. This plot has been completed with an interior potential proportional to |x|2, corresponding to an object of uniform density, but this interior potential is generally irrelevant since the orbit of a test particle cannot intersect the body.\n\nThe potential function has a hyperbolic cross section; the sudden dip in the center is the origin of the name \"gravity well\". A black hole would not have this \"closing\" dip due to its size being only determined by its event horizon.\n\n\nPhysical gravity wells[edit]\n\nIn a uniform gravitational field, the gravitational potential at a point is proportional to the height. Thus if the graph of a gravitational potential Φ(x,y) is constructed as a physical surface and placed in a uniform gravitational field so that the actual field points in the −Φ direction, then each point on the surface will have an actual gravitational potential proportional to the value of Φ at that point. As a result, an object constrained to move on the surface will have roughly the same equation of motion as an object moving in the potential field Φ itself. Gravity wells constructed on this principle can be found in many science museums.\n\nThere are several sources of inaccuracy in this model:\n\n\n\tThe friction between the object and the surface has no analogue in vacuum. This effect can be reduced by using a rolling ball instead of a sliding block.\n\tThe object's vertical motion contributes kinetic energy which has no analogue. This effect can be reduced by making the gravity well shallower (i.e. by choosing a smaller scaling factor for the Φ axis).\n\tA rolling ball's rotational kinetic energy has no analogue. This effect can be reduced by concentrating the ball's mass near its center so that the moment of inertia is small compared to mr².\n\tA ball's center of mass is not located on the surface but at a fixed distance r, which changes its potential energy by an amount depending on the slope of the surface at that point. For balls of a fixed size, this effect can be eliminated by constructing the surface so that the center of the ball, rather than the surface itself, lies on the graph of Φ.\n\n\nThe rubber-sheet model[edit]\n\nConsider an idealized rubber sheet suspended in a uniform gravitational field normal to the sheet. In equilibrium, the elastic tension in each part of the sheet must be equal and opposite to the gravitational pull on that part of the sheet; that is,\n\n\n\t\n  \n    \n      \n        k\n        \n          ∇\n          \n            2\n          \n        \n        h\n        =\n        −\n        g\n        ρ\n      \n    \n    {\\displaystyle k\\nabla ^{2}h=-g\\rho }\n  \n\n\n\nwhere k is the elastic constant of the rubber, h(x) is the upward displacement of the sheet (assumed to be small), g is the strength of the gravitational field, and ρ(x) is the mass density of the sheet. The mass density may be viewed as intrinsic to the sheet or as belonging to objects resting on top of the sheet.\nThis equilibrium condition is identical in form to the gravitational Poisson equation\n\n\n\t\n  \n    \n      \n        \n          ∇\n          \n            2\n          \n        \n        Φ\n        =\n        4\n        π\n        G\n        ρ\n      \n    \n    {\\displaystyle \\nabla ^{2}\\Phi =4\\pi G\\rho }\n  \n\n\n\nwhere Φ(x) is the gravitational potential and ρ(x) is the mass density. Thus, to a first approximation, a massive object placed on a rubber sheet will deform the sheet into a correctly shaped gravity well, and (as in the rigid case) a second test object placed near the first will gravitate toward it in an approximation of the correct force law.\n\n\nGravity wells and general relativity[edit]\n\n  \nA type of embedding diagram that depicts general relativity's curvature of space.  Although analogous, this does not depict the Sun's gravity well.\n\n\n\nBoth the rigid gravity well and the rubber-sheet model are frequently misidentified as models of general relativity due to an accidental resemblance to general relativistic embedding diagrams,[citation needed] and perhaps Einstein's employment of gravitational \"curvature\" bending the path of light he described as a prediction of general relativity.  The embedding diagram most commonly found in textbooks, an isometric embedding of a constant-time equatorial slice of the Schwarzschild metric in Euclidean 3-dimensional space, superficially resembles a gravity well. However, embedding diagrams fundamentally differ from gravity wells.\n\nEmbedding takes merely a shape, but a potential plot has a distinguished \"downward\" direction. Turning a gravity well \"upside down\" by negating the potential of the attractive force, turns it into a repulsive force. However, turning a Schwarzschild embedding upside down, by rotating it, has no effect, since it leaves its intrinsic geometry unchanged. Also, geodesics following across the Schwarzschild surface would bend toward the central mass like a ball rolling in a gravity well, but for entirely different reasons. There is no analogy of the Schwarzschild embedding for a repulsive field though such a field is modeled in general relativity, the spatial geometry cannot be embedded in three dimensions.[citation needed]\n\nThe Schwarzschild embedding is commonly drawn with a hyperbolic cross section like the potential well, but in fact it has a parabolic cross section which, unlike the gravity well, does not approach a planar asymptote. See Flamm's paraboloid.[citation needed]\n\n\nSee also[edit]\n\n\tGeodetic effect\n\tSphere of influence (astrodynamics)\n\tVortex\n\n\nReferences[edit]\n\n\n\n\nExternal links[edit]\n\n\tIllustration of gravity wells of some bodies of the Solar System\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Gravity_well&oldid=917814714\"\n\n\t\t\n\t\tCategories: \tGravity\n\n\nHidden categories: \tArticles with short description\n\tUse American English from March 2019\n\tAll Wikipedia articles written in American English\n\tArticles lacking sources from October 2007\n\tAll articles lacking sources\n\tArticles needing cleanup from July 2010\n\tAll pages needing cleanup\n\tCleanup tagged articles without a reason field from July 2010\n\tWikipedia pages needing cleanup from July 2010\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from January 2011\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCatalà\n\tČeština\n\tEspañol\n\tفارسی\n\tFrançais\n\tItaliano\n\tPortuguês\n\tСрпски / srpski\n\tTürkçe\n\tУкраїнська\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 25 September 2019, at 16:30 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "9", "dc:title": "Gravity well - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-gravity_well", "title": "Gravity well - Wikipedia"}}