{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGravity gradiometry - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tGravity gradiometry\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Gravity gradient)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tGravity gradiometry is the study and measurement of variations in the acceleration due to gravity. The gravity gradient is the spatial rate of change of gravitational acceleration.\n\nGravity gradiometry is used by oil and mineral prospectors to measure the density of the subsurface, effectively by measuring the rate of change of gravitational acceleration (or jerk) due to underlying rock properties. From this information it is possible to build a picture of subsurface anomalies which can then be used to more accurately target oil, gas and mineral deposits. It is also used to image water column density, when locating submerged objects, or determining water depth (bathymetry). Physical scientists use gravimeters to determine the exact size and shape of the earth and they contribute to the gravity compensations applied to inertial navigation systems.\n\n\nContents\n\n\n\t1 Measuring the gravity gradient\n\t1.1 Units\n\t1.2 Gravity gradient tensor\n\t1.3 Comparison to gravity\n\n\n\n\t2 Dynamic survey environments (airborne and marine)\n\t3 Applications\n\t4 Gravity gradiometers\n\t4.1 Lockheed Martin gravity gradiometers\n\t4.2 Other gravity gradiometers\n\n\n\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nMeasuring the gravity gradient[edit]\n\nGravity measurements are a reflection of the earth’s gravitational attraction, its centripetal force, tidal accelerations due to the sun, moon, and planets, and other applied forces. Gravity gradiometers measure the spatial derivatives of the gravity vector. The most frequently used and intuitive component is the vertical gravity gradient, Gzz, which represents the rate of change of vertical gravity (gz) with height (z). It can be deduced by differencing the value of gravity at two points separated by a small vertical distance, l, and dividing by this distance.\n\n\n\t\n  \n    \n      \n        \n          G\n          \n            z\n            z\n          \n        \n        =\n        \n          \n            \n              ∂\n              \n                g\n                \n                  z\n                \n              \n            \n            \n              ∂\n              z\n            \n          \n        \n        ≈\n        \n          \n            \n              \n                g\n                \n                  z\n                \n              \n              \n                \n                  (\n                \n              \n              z\n              +\n              \n                \n                  \n                    l\n                    2\n                  \n                \n              \n              \n                \n                  )\n                \n              \n              −\n              \n                g\n                \n                  z\n                \n              \n              \n                \n                  (\n                \n              \n              z\n              −\n              \n                \n                  \n                    l\n                    2\n                  \n                \n              \n              \n                \n                  )\n                \n              \n            \n            l\n          \n        \n      \n    \n    {\\displaystyle G_{zz}={\\partial g_{z} \\over \\partial z}\\approx {g_{z}{\\bigl (}z+{\\tfrac {l}{2}}{\\bigr )}-g_{z}{\\bigl (}z-{\\tfrac {l}{2}}{\\bigr )} \\over l}}\n  \n\n\n\nThe two gravity measurements are provided by accelerometers which are matched and aligned to a high level of accuracy.\n\n\nUnits[edit]\n\nThe unit of gravity gradient is the eotvos (abbreviated as E), which is equivalent to 10−9 s−2 (or 10−4 mGal/m). A person walking past at a distance of 2 metres would provide a gravity gradient signal approximately one E. Mountains can give signals of several hundred Eotvos.\n\n\nGravity gradient tensor[edit]\n\nFull tensor gradiometers measure the rate of change of the gravity vector in all three perpendicular directions giving rise to a gravity gradient tensor (Fig 1).\n\n\n  \nFig 1. Conventional gravity measures ONE component of the gravity field in the vertical direction Gz (LHS), Full tensor gravity gradiometry measures ALL components of the gravity field (RHS)\n\n\n\nComparison to gravity[edit]\n\nBeing the derivatives of gravity, the spectral power of gravity gradient signals is pushed to higher frequencies. This generally makes the gravity gradient anomaly more localised to the source than the gravity anomaly. The table (below) and graph (Fig 2) compare the gz and Gzz responses from a point source.\n\n\n\t\n\tGravity (gz)\n\tGravity gradient (Gzz)\n\n\tSignal\n\t\n  \n    \n      \n        \n          \n            \n              G\n              M\n              \n              z\n            \n            \n              \n                (\n                \n                  \n                    r\n                    \n                      2\n                    \n                  \n                  +\n                  \n                    z\n                    \n                      2\n                    \n                  \n                \n                )\n              \n              \n                \n                  3\n                  2\n                \n              \n            \n          \n        \n        ×\n        \n          10\n          \n            5\n          \n        \n        \n        \n          [\n          \n            mGal\n          \n          ]\n        \n      \n    \n    {\\displaystyle {GM\\,z \\over \\left(r^{2}+z^{2}\\right)^{\\frac {3}{2}}}\\times 10^{5}\\;\\left[{\\text{mGal}}\\right]}\n  \n\n\t\n  \n    \n      \n        \n          \n            \n              G\n              M\n              \n                (\n                \n                  \n                    r\n                    \n                      2\n                    \n                  \n                  −\n                  2\n                  \n                    z\n                    \n                      2\n                    \n                  \n                \n                )\n              \n            \n            \n              \n                (\n                \n                  \n                    r\n                    \n                      2\n                    \n                  \n                  +\n                  \n                    z\n                    \n                      2\n                    \n                  \n                \n                )\n              \n              \n                \n                  5\n                  2\n                \n              \n            \n          \n        \n        ×\n        \n          10\n          \n            9\n          \n        \n        \n        \n          [\n          \n            E\n          \n          ]\n        \n      \n    \n    {\\displaystyle {GM\\left(r^{2}-2z^{2}\\right) \\over \\left(r^{2}+z^{2}\\right)^{\\frac {5}{2}}}\\times 10^{9}\\;\\left[{\\text{E}}\\right]}\n  \n\n\n\tPeak signal (r = 0)\n\t\n  \n    \n      \n        \n          \n            \n              G\n              M\n            \n            \n              z\n              \n                2\n              \n            \n          \n        \n        ×\n        \n          10\n          \n            5\n          \n        \n      \n    \n    {\\displaystyle {GM \\over z^{2}}\\times 10^{5}}\n  \n\n\t\n  \n    \n      \n        \n          \n            \n              2\n              G\n              M\n            \n            \n              z\n              \n                3\n              \n            \n          \n        \n        ×\n        \n          10\n          \n            9\n          \n        \n      \n    \n    {\\displaystyle {2GM \\over z^{3}}\\times 10^{9}}\n  \n\n\n\tFull width at half maximum\n\t\n  \n    \n      \n        1.53\n        \n        z\n      \n    \n    {\\displaystyle 1.53\\,z}\n  \n\n\t\n  \n    \n      \n        ≈\n        z\n      \n    \n    {\\displaystyle \\approx z}\n  \n\n\n\tWavelength (λ)\n\t\n  \n    \n      \n        3.07\n        \n        z\n      \n    \n    {\\displaystyle 3.07\\,z}\n  \n\n\t\n  \n    \n      \n        2\n        \n        z\n      \n    \n    {\\displaystyle 2\\,z}\n  \n\n\n\n\n  \nFig 2. Vertical gravity and gravity gradient signals from a point source buried at 1 km depth\n\n\n\nConversely, gravity measurements have more signal power at low frequency therefore making them more sensitive to regional signals and deeper sources.\n\n\nDynamic survey environments (airborne and marine)[edit]\n\nThe derivative measurement sacrifices the overall energy in the signal, but significantly reduces the noise due to motional disturbance. On a moving platform, the acceleration disturbance measured by the two accelerometers is the same so that when forming the difference, it cancels in the gravity gradient measurement. This is the principal reason for deploying gradiometers in airborne and marine surveys where the acceleration levels are orders of magnitude greater than the signals of interest. The signal to noise ratio benefits most at high frequency (above 0.01 Hz), where the airborne acceleration noise is largest.\n\n\nApplications[edit]\n\nGravity gradiometry has predominately been used to image subsurface geology to aid hydrocarbon and mineral exploration. Over 2.5 million line km has now been surveyed using the technique.[1] The surveys highlight gravity anomalies that can be related to geological features such as Salt diapirs, Fault systems, Reef structures, Kimberlite pipes, etc. Other applications include tunnel and bunker detection[2]\nand the recent GOCE mission that aims to improve the knowledge of ocean circulation.\n\n\nGravity gradiometers[edit]\n\nLockheed Martin gravity gradiometers[edit]\n\nDuring the 1970s, as an executive in the US Dept. of Defense, John Brett initiated the development of the gravity gradiometer to support the Trident 2 system. A committee was commissioned to seek commercial applications for the Full Tensor Gradient (FTG) system that was developed by Bell Aerospace (later acquired by Lockheed Martin) and was being deployed on US Navy Ohio-class Trident submarines designed to aid covert navigation. As the Cold War came to a close, the US Navy released the classified technology and opened the door for full commercialization of the technology.   The existence of the gravity gradiometer was famously exposed in the film The Hunt for Red October released in 1990.\n\nThere are two types of Lockheed Martin gravity gradiometers currently in operation: the 3D Full Tensor Gravity Gradiometer (FTG; deployed in either a fixed wing aircraft or a ship) and the FALCON gradiometer (a partial tensor system with 8 accelerometers and deployed in a fixed wing aircraft or a helicopter).  The 3D FTG system contains three gravity gradiometry instruments (GGIs), each consisting of two opposing pairs of accelerometers arranged on a spinning disc with measurement direction in the spin direction.\n\n\nOther gravity gradiometers[edit]\n\n\tElectrostatic gravity gradiometer\n\tThis is the gravity gradiometer deployed on the European Space Agency's GOCE mission. It is a three-axis diagonal gradiometer based on three pairs of electrostatic servo-controlled accelerometers.\n\tARKeX Exploration gravity gradiometer\n\tAn evolution of technology originally developed for European Space Agency, the Exploration Gravity Gradiometer (EGG), developed by ARKeX (a corporation that is now defunct), uses two key principles of superconductivity to deliver its performance: the Meissner effect, which provides levitation of the EGG proof masses and flux quantization, which gives the EGG its inherent stability. The EGG has been specifically designed for high dynamic survey environments.\n\tRibbon sensor gradiometer\n\tThe Gravitec gravity gradiometer sensor consists of a single sensing element (a ribbon) that responds to gravity gradient forces. It is designed for borehole applications.\n\tUWA gravity gradiometer\n\tThe University of Western Australia (aka VK-1) Gravity Gradiometer is a superconducting instrument which uses an orthogonal quadrupole responder (OQR) design based on pairs of micro-flexure supported balance beams.\n\tGedex gravity gradiometer\n\tThe Gedex gravity gradiometer (AKA High-Definition Airborne Gravity Gradiometer, HD-AGG) is also a superconducting OQR-type gravity gradiometer, based on technology developed at the University of Maryland.\n\n\nSee also[edit]\n\n\tGravity-gradient stabilization\n\tRobert L. Forward#Forward Mass Detector\n\tAccelerometer\n\tEquivalence principle\n\tGravimeter\n\tInstrumentation\n\n\nReferences[edit]\n\n\n\t^ Gravity Gradiometry Today and Tomorrow (PDF), South African Geophysical Association, archived from the original (PDF) on 2011-02-22, retrieved 2011-06-27 \n\n\t^ Using Gravity to Detect Underground Threats, Lockheed Martin, archived from the original on 2013-06-03, retrieved 2013-06-14\n \n\n\n\n\n\nExternal links[edit]\n\n\tAdvances and Challenges in the Development and Deployment of Gravity Gradiometer Systems\n\tGOCE mission payload\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Gravity_gradiometry&oldid=918559266\"\n\n\t\t\n\t\tCategories: \tGeophysical survey\n\tGeodesy\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCatalà\n\tDeutsch\n\tEspañol\n\tҚазақша\n\t日本語\n\tРусский\n\tУкраїнська\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 29 September 2019, at 07:53 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "3", "dc:title": "Gravity gradiometry - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-gravity_gradient", "title": "Gravity gradiometry - Wikipedia"}}