{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHall-effect thruster - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tHall-effect thruster\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \n2 kW Hall thruster in operation as part of the Hall Thruster Experiment at the Princeton Plasma Physics Laboratory\n\n\n\nIn spacecraft propulsion, a Hall-effect thruster (HET) is a type of ion thruster in which the propellant is accelerated by an electric field. Hall-effect thrusters use a magnetic field to limit the electrons' axial motion and then use them to ionize propellant, efficiently accelerate the ions to produce thrust, and neutralize the ions in the plume. Hall-effect thrusters (based on the discovery by Edwin Hall) are sometimes referred to as Hall thrusters or Hall-current thrusters. The Hall-effect thruster is classed as a moderate specific impulse (1,600 s) space propulsion technology and has benefited from considerable theoretical and experimental research since the 1960s.[1]\n\n\n  \n6-kW Hall thruster in operation at the NASA Jet Propulsion Laboratory.\n\n\n\nHall thrusters operate on a variety of propellants, the most common being xenon and krypton.  Other propellants of interest include argon, bismuth, iodine, magnesium and zinc.\n\nHall thrusters are able to accelerate their exhaust to speeds between 10 and 80 km/s (1,000–8,000 s specific impulse), with most models operating between 15 and 30 km/s (1,500–3,000 s specific impulse). The thrust produced depends on the power level. Devices operating at 1.35 kW produce about 83 mN of thrust. High-power models have demonstrated up to 5.4 N in the laboratory.[2] Power levels up to 100 kW have been demonstrated for xenon Hall thrusters.\n\nAs of 2009[update], Hall-effect thrusters ranged in input power levels from 1.35 to 10 kilowatts and had exhaust velocities of 10–50 kilometers per second, with thrust of 40–600 millinewtons and efficiency in the range of 45–60 percent.[3]\n\nThe applications of Hall-effect thrusters include control of the orientation and position of orbiting satellites and use as a main propulsion engine for medium-size robotic space vehicles.[3]\n\n\nContents\n\n\n\t1 History\n\t2 Operation\n\t3 Cylindrical Hall thrusters\n\t4 External discharge Hall thruster\n\t5 Applications\n\t6 In development\n\t7 References\n\t8 External links\n\n\n\n\n\nHistory[edit]\n\nHall thrusters were studied independently in the United States and the Soviet Union.  They were first described publicly in the US in the early 1960s.[4][5][6] However, the Hall thruster was first developed into an efficient propulsion device in the Soviet Union.  In the US, scientists focused instead on developing gridded ion thrusters.\n\nTwo types of Hall thrusters were developed in the Soviet Union:\n\n\n\tthrusters with wide acceleration zone, SPT (Russian: СПД, стационарный плазменный двигатель; English: SPT, Stationary Plasma Thruster) at Design Bureau Fakel\n\tthrusters with narrow acceleration zone, DAS (Russian: ДАС, двигатель с анодным слоем; English: TAL, Thruster with Anode Layer), at the Central Research Institute for Machine Building (TsNIIMASH).\n\n\n  \nSoviet and Russian SPT thrusters\n\n\n\nThe SPT design was largely the work of A. I. Morozov.[7][8] The first SPT to operate in space, an SPT-50 aboard a Soviet Meteor spacecraft, was launched December 1971. They were mainly used for satellite stabilization in North-South and in East-West directions. Since then until the late 1990s 118 SPT engines completed their mission and some 50 continued to be operated. Thrust of the first generation of SPT engines, SPT-50 and SPT-60 was 20 and 30 mN respectively. In 1982, SPT-70 and SPT-100 were introduced, their thrusts being 40 and 83 mN, respectively. In the post-Soviet Russia high-power (a few kilowatts) SPT-140, SPT-160, SPT-200, T-160  and low-power (less than 500 W) SPT-35 were introduced.[9]\n\nSoviet and Russian TAL-type thrusters include the D-38, D-55, D-80, and D-100.[9]\n\nSoviet-built thrusters were introduced to the West in 1992 after a team of electric propulsion specialists from NASA's Jet Propulsion Laboratory, Glenn Research Center, and the Air Force Research Laboratory, under the support of the Ballistic Missile Defense Organization, visited Russian laboratories and experimentally evaluated the SPT-100 (i.e., a 100 mm diameter SPT thruster). Over 200 Hall thrusters have been flown on Soviet/Russian satellites in the past thirty years. No failures have ever occurred on orbit.  Hall thrusters continue to be used on Russian spacecraft and have also flown on European and American spacecraft.  Space Systems/Loral, an American commercial satellite manufacturer, now flies Fakel SPT-100's on their GEO communications spacecraft.\n\nSince their introduction to the west in the early 1990s, Hall thrusters have been the subject of a large number of research efforts throughout the United States, France, Italy, Japan, and Russia (with many smaller efforts scattered in various countries across the globe).  Hall thruster research in the US is conducted at several government laboratories, universities and private companies. Government and government funded centers include NASA's Jet Propulsion Laboratory, NASA's Glenn Research Center, the Air Force Research Laboratory (Edwards AFB, CA), and The Aerospace Corporation.  Universities include the US Air Force Institute of Technology,[10] University of Michigan, Stanford University, The Massachusetts Institute of Technology, Princeton University, Michigan Technological University, and Georgia Tech. A considerable amount of development is being conducted in industry, such as IHI Corporation in Japan, Aerojet and Busek in the US, SNECMA in France, LAJP in Ukraine, and SITAEL in Italy.\n\nThe first use of Hall thrusters on lunar orbit was the European Space Agency (ESA) lunar mission SMART-1 in 2003.\n\nOn a western satellite Hall thrusters were first demonstrated on the Naval Research Laboratory (NRL) STEX spacecraft, which flew the Russian D-55.  The first American Hall thruster to fly in space was the Busek BHT-200 on TacSat-2 technology demonstration spacecraft.  The first flight of an American Hall thruster on an operational mission, was the Aerojet BPT-4000, which launched August 2010 on the military Advanced Extremely High Frequency GEO communications satellite. At 4.5 kW, the BPT-4000 is also the highest power Hall thruster ever flown in space.  Besides the usual stationkeeping tasks, the BPT-4000 is also providing orbit raising capability to the spacecraft.  Several countries worldwide continue efforts to qualify Hall thruster technology for commercial uses.\n\n\nOperation[edit]\n\nThe essential working principle of the Hall thruster is that it uses an electrostatic potential to accelerate ions up to high speeds.  In a Hall thruster, the attractive negative charge is provided by an electron plasma at the open end of the thruster instead of a grid.  A radial magnetic field of about 100–300 G (0.01–0.03 T) is used to confine the electrons, where the combination of the radial magnetic field and axial electric field cause the electrons to drift in azimuth thus forming the Hall current from which the device gets its name.\n\n\n  \nHall thruster. Hall thrusters are largely axially symmetric. This is a cross-section containing that axis.\n\n\n\nA schematic of a Hall thruster is shown in the adjacent image. An electric potential between 150 and 800 volts is applied between the anode and cathode.\n\nThe central spike forms one pole of an electromagnet and is surrounded by an annular space, and around that is the other pole of the electromagnet, with a radial magnetic field in between.\n\nThe propellant, such as xenon gas, is fed through the anode, which has numerous small holes in it to act as a gas distributor.  Xenon propellant is used because of its high atomic weight and low ionization potential.  As the neutral xenon atoms diffuse into the channel of the thruster, they are ionized by collisions with circulating high-energy electrons (typically 10–40 eV, or about 10% of the discharge voltage).  Once ionized, the xenon ions typically have a charge of +1, though a small fraction (~20%) have +2.\n\nThe xenon ions are then accelerated by the electric field between the anode and the cathode.  For discharge voltages of 300 V, the ions reach speeds of around 15 km/s (9.3 mps) for a specific impulse of 1,500 seconds (15 kN·s/kg).  Upon exiting, however, the ions pull an equal number of electrons with them, creating a plasma plume with no net charge.\n\nThe radial magnetic field is designed to be strong enough to substantially deflect the low-mass electrons, but not the high-mass ions, which have a much larger gyroradius and are hardly impeded.  The majority of electrons are thus stuck orbiting in the region of high radial magnetic field near the thruster exit plane, trapped in E×B (axial electric field and radial magnetic field).  This orbital rotation of the electrons is a circulating Hall current, and it is from this that the Hall thruster gets its name.  Collisions with other particles and walls, as well as plasma instabilities, allow some of the electrons to be freed from the magnetic field, and they drift towards the anode.\n\nAbout 20–30% of the discharge current is an electron current, which does not produce thrust, thus limiting the energetic efficiency of the thruster; the other 70–80% of the current is in the ions.  Because the majority of electrons are trapped in the Hall current, they have a long residence time inside the thruster and are able to ionize almost all of the xenon propellant, allowing mass use of 90–99%.  The mass use efficiency of the thruster is thus around 90%, while the discharge current efficiency is around 70%, for a combined thruster efficiency of around 63% (= 90% × 70%).  Modern Hall thrusters have achieved efficiencies as high as 75% through advanced designs.\n\nCompared to chemical rockets, the thrust is very small, on the order of 83 mN for a typical thruster operating at 300 V, 1.5 kW.  For comparison, the weight of a coin like the U.S. quarter or a 20-cent Euro coin is approximately 60 mN.  As with all forms of electrically powered spacecraft propulsion, thrust is limited by available power, efficiency, and specific impulse.\n\nHowever, Hall thrusters operate at the high specific impulses that is typical for electric propulsion. One particular advantage of Hall thrusters, as compared to a gridded ion thruster, is that the generation and acceleration of the ions takes place in a quasi-neutral plasma, so there is no Child-Langmuir charge (space charge) saturated current limitation on the thrust density.  This allows much smaller thrusters compared to gridded ion thrusters.\n\nAnother advantage is that these thrusters can use a wider variety of propellants supplied to the anode, even oxygen, although something easily ionized is needed at the cathode.[11]\n\n\nCylindrical Hall thrusters[edit]\n\nAlthough conventional (annular) Hall thrusters are efficient in the kilowatt power regime, they become inefficient when scaled to small sizes.  This is due to the difficulties associated with holding the performance scaling parameters constant while decreasing the channel size and increasing the applied magnetic field strength. This led to the design of the cylindrical Hall thruster.  The cylindrical Hall thruster can be more readily scaled to smaller sizes due to its nonconventional discharge-chamber geometry and associated magnetic field profile.[12][13][14] The cylindrical Hall thruster more readily lends itself to miniaturization and low-power operation than a conventional (annular) Hall thruster. The primary reason for cylindrical Hall thrusters is that it is difficult to achieve a regular Hall thruster that operates over a broad envelope from ~1 kW down to ~100 W while maintaining an efficiency of 45-55%.[15]\n\n\nExternal discharge Hall thruster[edit]\n\nSputtering erosion of discharge channel walls and pole pieces that protect the magnetic circuit causes failure of thruster operation. Therefore, annular and cylindrical Hall thrusters have limited lifetime. Although magnetic shielding has been shown to dramatically reduce discharge channel wall erosion, pole piece erosion is still a concern.[16] As an alternative, an unconventional Hall thruster design called external discharge Hall thruster or external discharge plasma thruster (XPT) has been introduced.[17][18][19] External discharge Hall thruster does not possess any discharge channel walls or pole pieces. Plasma discharge is produced and sustained completely in open space outside the thruster structure, and thus erosion free operation is achieved.\n\n\nApplications[edit]\n\nHall thrusters have been flying in space since December 1971 when the Soviets launched an SPT-50 on a Meteor satellite.[20]  Over 240 thrusters have flown in space since that time with a 100% success rate.[21] Hall thrusters are now routinely flown on commercial LEO and GEO communications satellites where they are used for orbital insertion and stationkeeping.\n\nThe first[failed verification] Hall thruster to fly on a western satellite was a Russian D-55 built by TsNIIMASH, on the NRO's STEX spacecraft, launched on October 3, 1998.[22]\n\nThe solar electric propulsion system of the European Space Agency's SMART-1 spacecraft used a Snecma PPS-1350-G Hall thruster.[23]  SMART-1 was a technology demonstration mission that orbited the Moon.  This use of the PPS-1350-G, starting on September 28, 2003, was the first use of a Hall thruster outside geosynchronous earth orbit (GEO).  Like most Hall thruster propulsion systems used in commercial applications, the Hall thruster on SMART-1 could be throttled over a range of power, specific impulse, and thrust.[24] It has a discharge power range of  0.46–1.19 kW, a specific impulse of 1,100–1,600 s and thrust of 30–70 mN.\n\n\nIn development[edit]\n\nThe largest planned Hall-effect thruster is NASA's 40 kW Advanced Electric Propulsion System (AEPS), meant to propel large-scale science missions and cargo transportation in deep space.[25]\n\n\nReferences[edit]\n\n\n\t^ Hofer, Richard R. \"Development and Characterization of High-Efficiency, High-Specific Impulse Xenon Hall Thrusters\". NASA/CR—2004-21309. NASA STI Program. Retrieved 17 October 2011.\n\n\t^ \"Ion Thruster Prototype Breaks Records in Tests, Could Send Humans to Mars\". space.com. Archived from the original on 20 March 2018. Retrieved 27 April 2018.\n\n\n\t^ a b Choueiri, Edgar Y. (2009). \"New Dawn for Electric Rockets\". Scientific American. 300: 58–65. Bibcode:2009SciAm.300b..58C. doi:10.1038/scientificamerican0209-58.\n\n\n\t^ Janes, G.; Dotson, J.; Wilson, T. (1962). Momentum transfer through magnetic fields. Proceedings of third symposium on advanced propulsion concepts. 2. Cincinnati, OH, USA. pp. 153–175.\n\n\n\t^ Meyerand, RG. (1962). Momentum Transfer Through the Electric Fields. Proceedings of Third Symposium on Advanced Propulsion Concepts. 1. Cincinnati, OH, USA. pp. 177–190.\n\n\n\t^ Seikel, GR. (1962). Generation of Thrust – Electromagnetic Thrusters. Proceedings of the NASA-University Conference on the Science and Technology of Space Exploration. 2. Chicago, IL, USA. pp. 171–176.\n\n\n\t^ \"Hall thrusters\". 2004-01-14. Archived from the original on February 28, 2004.\n\n\n\t^ Morozov, A.I. (March 2003). \"The conceptual development of stationary plasma thrusters\". Plasma Physics Reports. Nauka/Interperiodica. 29 (3): 235–250. Bibcode:2003PlPhR..29..235M. doi:10.1134/1.1561119.\n\n\n\t^ a b \"Native Electric Propulsion Engines Today\" (in Russian). Novosti Kosmonavtiki. 1999. Archived from the original on 6 June 2011.\n\n\n\t^ http://www.afit.edu/PA/news.cfm?article=101&a=news\n\n\t^ \"Hall-Effect Stationary Plasma thrusters\". Electric Propulsion for Inter-Orbital Vehicles. Archived from the original on 2013-07-17. Retrieved 2014-06-16.\n[1] Archived 2007-10-10 at the Wayback Machine\n\n\t^ Y. Raitses; N. J. Fisch. \"Parametric Investigations of a Nonconventional Hall Thruster\" (PDF). Physics of Plasmas, 8, 2579 (2001). Archived (PDF) from the original on 2010-05-27.\n\n\n\t^ A. Smirnov; Y. Raitses; N.J. Fisch. \"Experimental and theoretical studies of cylindrical Hall thrusters\" (PDF). Physics of Plasmas 14, 057106 (2007). Archived (PDF) from the original on 2010-05-27.\n\n\n\t^ Polzin, K. A.; Raitses, Y.; Gayoso, J. C.; Fisch, N. J. \"Comparisons in Performance of Electromagnet and Permanent-Magnet Cylindrical Hall-Effect Thrusters\". NASA Technical Reports Server. Marchall Space Flight Center. Retrieved 17 October 2011.\n\n\n\t^ Polzin, K. A.; Raitses, Y.; Merino, E.; Fisch, N. J. \"Preliminary Results of Performance Measurements on a Cylindrical Hall-Effect Thruster with Magnetic Field Generated by Permanent Magnets\". NASA Technical Reports Server. Princeton Plasma Physics Laboratory. Retrieved 17 October 2011.\n\n\n\t^ \"Pole-piece Interactions with the Plasma in a Magnetically Shielded Hall Thruster\".\n\n\n\t^ \"Preliminary Investigation of an External Discharge Plasma Thruster\".\n\n\n\t^ \"Numerical Investigation of an External Discharge Hall Thruster Design Utilizing Plasma-lens Magnetic Field\" (PDF). Archived (PDF) from the original on 2017-08-14.\n\n\n\t^ \"Low–voltage External Discharge Plasma Thruster and Hollow Cathodes Plasma Plume Diagnostics Utilising Electrostatic Probes and Retarding Potential Analyser\". Archived from the original on 2017-08-29.\n\n\n\t^ Turner, Martin J. L. (5 November 2008). Rocket and Spacecraft Propulsion: Principles, Practice and New Developments, page 197. Springer Science & Business Media. Retrieved 28 October 2015.\n\n\n\t^  This article incorporates public domain material from the National Aeronautics and Space Administration document \"\"In-space propulsion systems roadmap.\" (April 2012).\" by Meyer, Mike, et al.\n\n\t^ \"National Reconnaissance Office Satellite Successfully Launched\" (PDF). Naval Research Laboratory (Press Release). October 3, 1998. Archived (PDF) from the original on November 13, 2011.\n\n\n\t^ Cornu, Nicolas; Marchandise, Frédéric; Darnon, Franck; Estublier, Denis (2007). PPS®1350 Qualification Demonstration: 10500 hrs on the Ground and 5000 hrs in Flight. 43rd AIAA/ASME/SAE/ASEE Joint Propulsion Conference & Exhibit. Cincinnati, OH, USA. doi:10.2514/6.2007-5197.\n\n\n\t^ \"Ion engine gets SMART-1 to the Moon: Electric Propulsion Subsystem\". ESA. August 31, 2006. Archived from the original on January 29, 2011. Retrieved 2011-07-25.\n\n\n\t^ Overview of the Development and Mission Application of the Advanced Electric Propulsion System (AEPS). (PDF). Daniel A. Herman, Todd A. Tofil, Walter Santiago, Hani Kamhawi, James E. Polk, John S. Snyder, Richard R. Hofer, Frank Q. Picha, Jerry Jackson and May Allen. NASA; NASA/TM—2018-219761. 35th International Electric Propulsion Conference. Atlanta, Georgia, October 8–12, 2017. Accessed: 27 July 2018.\n\n\n\n\nExternal links[edit]\n\n\tEdgar Y. (2009). New dawn of electric rocket. The Hall thruster\n\tSITAEL S.p.A. (Italy) – Page presenting Hall effect thruster products & data sheets.\n\tSnecma SA (France) page on PPS-1350 Hall thruster\n\tElectric Propulsion Sub-Systems (PDF)\n\tStationary plasma thrusters (PDF)\n\tESA page on Hall thrusters\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft propulsion\n\n\tChemical\nrockets\t\n\tState\t\n\tLiquid-propellant rocket\n\tSolid-propellant rocket\n\tHybrid-propellant rocket\n\n\n\n\n\tPropellants\t\n\tLiquid propellant\n\tCryogenic\n\tHypergolic\n\n\n\tMonopropellant\n\tBipropellant\n\tStaged combustion cycle\n\tExpander cycle\n\tGas-generator cycle\n\tTap-off cycle\n\tPressure-fed engine\n\tPump-fed engine\n\tElectric-pump-fed engine\n\n\n\tTripropellant\n\n\n\n\n\n\n\n\tElectrical\nthrusters\t\n\tElectrostatic\t\n\tColloid thruster\n\tIon thruster\n\tGridded\n\tHall-effect thruster\n\tField-emission electric propulsion\n\n\n\n\n\n\n\tElectromagnetic\t\n\tPulsed inductive thruster\n\tMagnetoplasmadynamic thruster\n\tElectrodeless plasma thruster\n\n\n\n\n\tElectrothermal\t\n\tPulsed plasma thruster\n\tHelicon double-layer thruster\n\tArcjet rocket\n\tResistojet rocket\n\tVASIMR\n\n\n\n\n\tOther\t\n\tAtmosphere-breathing electric propulsion\n\tHigh Power Electric Propulsion\n\tMagBeam\n\tMass driver\n\n\n\n\n\n\n\n\tNuclear\npropulsion\t\n\tClosed system\t\n\tDirect Fusion Drive\n\tNuclear electric rocket\n\tNuclear thermal rocket\n\tRadioisotope\n\tSalt-water\n\tGas core\n\t\"Lightbulb\"\n\n\n\n\n\n\n\tOpen system\t\n\tNuclear pulse propulsion\n\tAntimatter-catalyzed\n\n\n\tPulsed nuclear thermal rocket‎\n\tFusion rocket\n\tBussard ramjet\n\n\n\tFission-fragment rocket\n\tFission sail\n\n\n\tNuclear photonic rocket\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tBeam-powered propulsion\n\tCold gas thruster\n\tGravity assist\n\tSolar sail\n\tElectric sail\n\tMagnetic sail\n\n\n\tSolar thermal rocket\n\tTethers\n\tSteam thruster\n\n\n\n\n\tSpaceflight portal\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Hall-effect_thruster&oldid=916988865\"\n\n\t\t\n\t\tCategories: \tHall effect\n\tMagnetic propulsion devices\n\tIon engines\n\n\nHidden categories: \tCS1 Russian-language sources (ru)\n\tWebarchive template wayback links\n\tWikipedia articles incorporating text from NASA\n\tArticles containing potentially dated statements from 2009\n\tAll articles containing potentially dated statements\n\tArticles containing Russian-language text\n\tArticles containing explicitly cited English-language text\n\tAll articles with failed verification\n\tArticles with failed verification from December 2015\n\tUse American English from January 2014\n\tAll Wikipedia articles written in American English\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tБългарски\n\tČeština\n\tDeutsch\n\tEspañol\n\tفارسی\n\tFrançais\n\t한국어\n\tItaliano\n\t日本語\n\tPolski\n\tРусский\n\tSlovenčina\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 21 September 2019, at 18:42 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "Hall-effect thruster - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/4/4f/HallThruster_2.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-hall-effect_thruster", "title": "Hall-effect thruster - Wikipedia"}}