{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIonizing radiation - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tIonizing radiation\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Hard radiation)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tRadiation that carries enough light energy to liberate electrons from atoms or molecules\n\n  \nIonizing radiation hazard symbol\n\n\n\nIonizing radiation (ionising radiation) is radiation that carries sufficient energy to detach electrons from atoms or molecules, thereby ionizing them. Ionizing radiation is made up of energetic subatomic particles, ions or atoms moving at high speeds (usually greater than 1% of the speed of light), and electromagnetic waves on the high-energy end of the electromagnetic spectrum.\n\nGamma rays, X-rays, and the higher ultraviolet part of the electromagnetic spectrum are ionizing, whereas the lower ultraviolet part of the electromagnetic spectrum and all the spectrum below UV, including visible light (including nearly all types of laser light), infrared, microwaves, and radio waves are considered non-ionizing radiation. The boundary between ionizing and non-ionizing electromagnetic radiation that occurs in the ultraviolet is not sharply defined, since different molecules and atoms ionize at different energies. Conventional definition places the boundary at a photon energy between 10 eV and 33 eV in the ultraviolet (see definition boundary section below).\n\nTypical ionizing subatomic particles from radioactive decay include alpha particles, beta particles and neutrons. Almost all products of radioactive decay are ionizing because the energy of radioactive decay is typically far higher than that required to ionize. Other subatomic ionizing particles which occur naturally are muons, mesons, positrons, and other particles that constitute the secondary cosmic rays that are produced after primary cosmic rays interact with Earth's atmosphere.[1][2] Cosmic rays are generated by stars and certain celestial events such as supernova explosions. Cosmic rays may also produce radioisotopes on Earth (for example, carbon-14), which in turn decay and produce ionizing radiation. Cosmic rays and the decay of radioactive isotopes are the primary sources of natural ionizing radiation on Earth referred to as background radiation. Ionizing radiation can also be generated artificially by X-ray tubes, particle accelerators, and any of the various methods that produce radioisotopes artificially.\n\nIonizing radiation is not detectable by human senses, so radiation detection instruments such as Geiger counters must be used to indicate its presence and measure it. However, high intensities can cause emission of visible light upon interaction with matter, such as in Cherenkov radiation and radioluminescence. Ionizing radiation is used in a wide variety of fields such as medicine, nuclear power, research, manufacturing, construction, and many other areas, but presents a health hazard if proper measures against undesired exposure are not followed. Exposure to ionizing radiation causes damage to living tissue, and can result in radiation burns, cell damage, radiation sickness, cancer, and death.\n\n\nContents\n\n\n\t1 Types\n\t1.1 Directly ionizing\n\t1.1.1 Alpha particles\n\t1.1.2 Beta particles\n\t1.1.3 Positrons and other types of antimatter\n\t1.1.4 Charged nuclei\n\n\n\n\t1.2 Indirectly ionizing\n\t1.2.1 Photon radiation\n\t1.2.2 Definition boundary for lower-energy photons\n\t1.2.3 Neutrons\n\n\n\n\n\n\n\t2 Physical effects\n\t2.1 Nuclear effects\n\t2.2 Chemical effects\n\t2.3 Electrical effects\n\n\n\n\t3 Health effects\n\t4 Measurement\n\t5 Uses\n\t6 Sources of radiation\n\t6.1 Background radiation\n\t6.1.1 Cosmic radiation\n\t6.1.2 External terrestrial sources\n\t6.1.3 Internal radiation sources\n\t6.1.4 Radon\n\n\n\n\n\n\n\t7 Radiation exposure\n\t7.1 Occupational exposure\n\t7.2 Public exposure\n\t7.2.1 Spaceflight\n\t7.2.2 Air travel\n\n\n\n\t7.3 Radiation hazard warning signs\n\n\n\n\t8 See also\n\t9 References\n\t10 Literature\n\t11 External links\n\n\n\n\n\nTypes[edit]\n\nMain article: Particle radiation\n\n  \nAlpha (α) radiation consists of a fast-moving helium-4 (4\nHe\n) nucleus and is stopped by a sheet of paper. Beta (β) radiation, consisting of electrons, is halted by an aluminium plate. Gamma (γ) radiation, consisting of energetic photons, is eventually absorbed as it penetrates a dense material. Neutron (n) radiation consists of free neutrons that are blocked by light elements, like hydrogen, which slow and/or capture them. Not shown: galactic cosmic rays that consist of energetic charged nuclei such as protons, helium nuclei, and high-charged nuclei called HZE ions.\n\n\n\n  \nCloud chambers are one of few ways of visualizing ionizing radiation. They were employed mainly in research in the early days of particle physics, but remain an important education tool today.\n\n\n\nIonizing radiation is categorized by the nature of the particles or electromagnetic waves that create the ionizing effect. These have different ionization mechanisms, and may be grouped as directly or indirectly ionizing.\n\n\nDirectly ionizing[edit]\n\nAny charged massive particle can ionize atoms directly by fundamental interaction through the Coulomb force if it carries sufficient kinetic energy. This includes atomic nuclei, electrons, muons, charged pions, protons, and energetic charged nuclei stripped of their electrons. When moving at relativistic speeds these particles have enough kinetic energy to be ionizing, but relativistic speeds are not required. For example, a typical alpha particle is ionizing, but moves at about 5% c, and an electron with 33 eV (enough to ionize) moves at about 1% c.\n\nThe first two ionizing sources to be recognized were given special names used today: Helium nuclei ejected from atomic nuclei are called alpha particles, and electrons ejected usually (but not always) at relativistic speeds, are called beta particles.\n\nNatural cosmic rays are made up primarily of relativistic protons but also include heavier atomic nuclei like helium ions and HZE ions. In the atmosphere such particles are often stopped by air molecules, and this produces short-lived charged pions, which soon decay to muons, a primary type of cosmic ray radiation that reaches the ground (and also penetrates it to some extent). Pions can also be produced in large amounts in particle accelerators.\n\n\nAlpha particles[edit]\n\nMain article: Alpha particle\n\nAlpha particles consist of two protons and two neutrons bound together into a particle identical to a helium nucleus. Alpha particle emissions are generally produced in the process of alpha decay, but may also be produced in other ways. Alpha particles are named after the first letter in the Greek alphabet, α. The symbol for the alpha particle is α or α2+. Because they are identical to helium nuclei, they are also sometimes written as He2+\n or 4\n2He2+\n indicating a Helium ion with a +2 charge (missing its two electrons). If the ion gains electrons from its environment, the alpha particle can be written as a normal (electrically neutral) helium atom 4\n2He.\n\nAlpha particles are a hugely ionizing form of particle radiation. When they result from radioactive alpha decay they have low penetration depth. In this case they can be absorbed by a few centimeters of air, or by the skin. More powerful, long range alpha particles from ternary fission are three times as energetic, and penetrate proportionately farther in air. The helium nuclei that form 10-12% of cosmic rays, are also usually of much higher energy than those produced by nuclear decay processes, and when encountered in space, are thus able to traverse the human body and dense shielding. However, this type of radiation is significantly attenuated by the Earth's atmosphere, which is a radiation shield equivalent to about 10 meters of water.[3]\n\n\nBeta particles[edit]\n\nMain article: Beta particles\n\nBeta particles are high-energy, high-speed electrons or positrons emitted by certain types of radioactive nuclei, such as potassium-40. The production of beta particles is termed beta decay. They are designated by the Greek letter beta (β).\nThere are two forms of beta decay, β− and β+, which respectively give rise to the electron and the positron.[4]\n\nWhen something is said to have radioactive contamination, it often means that there are beta particles being emitted from its surface, detectable with a Geiger counter or other radiation detector. When brought into proximity to the beta emitter, the detector will indicate a dramatic increase in radioactivity. When the detector probe is covered with a shield to block the beta rays, the indication will be reduced dramatically.\n\nHigh-energy beta particles may produce X-rays known as bremsstrahlung (\"braking radiation\") or secondary electrons (delta ray) as they pass through matter. Both of these can cause an indirect ionization effect.\n\nBremsstrahlung is of concern when shielding beta emitters, as the interaction of beta particles with the shielding material produces Bremsstrahlung. This effect is greater with material of high atomic numbers, so material with low atomic numbers is used for beta source shielding.\n\n\nPositrons and other types of antimatter[edit]\n\nMain articles: Positron and Antimatter\n\nThe positron or antielectron is the antiparticle or the antimatter counterpart of the electron. When a low-energy positron collides with a low-energy electron, annihilation occurs, resulting in their conversion into the energy of two or more gamma ray photons (see electron–positron annihilation).\n\nPositrons can be generated by positron emission nuclear decay (through weak interactions), or by pair production from a sufficiently energetic photon. Positrons are common artificial sources of ionizing radiation used in medical positron emission tomography (PET) scans.\n\nAs positrons are positively charged particles they can also directly ionize an atom through Coulomb interactions.\n\n\nCharged nuclei[edit]\n\nCharged nuclei are characteristic of galactic cosmic rays and solar particle events and except for alpha particles (charged helium nuclei) have no natural sources on the earth. In space, however, very high energy protons, helium nuclei, and HZE ions can be initially stopped by relatively thin layers of shielding, clothes, or skin. However, the resulting interaction will generate secondary radiation and cause cascading biological effects. If just one atom of tissue is displaced by an energetic proton, for example, the collision will cause further interactions in the body. This is called \"linear energy transfer\" (LET), which utilizes elastic scattering.\n\nLET can be visualized as a billiard ball hitting another in the manner of the conservation of momentum, sending both away with the energy of the first ball divided between the two unequally. When a charged nucleus strikes a relatively slow-moving nucleus of an object in space, LET occurs and neutrons, alpha particles, low-energy protons, and other nuclei will be released by the collisions and contribute to the total absorbed dose of tissue.[5]\n\n\nIndirectly ionizing[edit]\n\nIndirect ionizing radiation is electrically neutral and therefore does not interact strongly with matter. The bulk of the ionization effects are due to secondary ionizations.\n\nAn example of indirectly ionizing radiation is neutron radiation.\n\n\nPhoton radiation[edit]\n\nSee also: Gamma rays and X-rays\n\n  \nDifferent types of electromagnetic radiation\n\n\n\n  \nThe total absorption coefficient of lead (atomic number 82) for gamma rays, plotted versus gamma energy, and the contributions by the three effects. Here, the photoelectric effect dominates at low energy. Above 5 MeV, pair production starts to dominate.\n\n\n\nEven though photons are electrically neutral, they can ionize atoms directly through the photoelectric effect and the Compton effect. Either of those interactions will cause the ejection of an electron from an atom at relativistic speeds, turning that electron into a beta particle (secondary beta particle) that will ionize many other atoms. Since most of the affected atoms are ionized directly by the secondary beta particles, photons are called indirectly ionizing radiation.[6]\n\nPhoton radiation is called gamma rays if produced by a nuclear reaction, subatomic particle decay, or radioactive decay within the nucleus. It is otherwise called x-rays if produced outside the nucleus. The generic term photon is therefore used to describe both.[7][8][9]\n\nX-rays normally have a lower energy than gamma rays, and an older convention was to define the boundary as a wavelength of 10−11 m or a photon energy of 100 keV.[10] That threshold was driven by limitations of older X-ray tubes and low awareness of isomeric transitions. Modern technologies and discoveries have resulted in an overlap between X-ray and gamma energies. In many fields they are functionally identical, differing for terrestrial studies only in origin of the radiation. In astronomy, however, where radiation origin often cannot be reliably determined, the old energy division has been preserved, with X-rays defined as being between about 120 eV and 120 keV, and gamma rays as being of any energy above 100 to 120 keV, regardless of source. Most astronomical \"gamma-ray astronomy\" are known not to originate in nuclear radioactive processes but, rather, result from processes like those that produce astronomical X-rays, except driven by much more energetic electrons.\n\nPhotoelectric absorption is the dominant mechanism in organic materials for photon energies below 100 keV, typical of classical X-ray tube originated X-rays. At energies beyond 100 keV, photons ionize matter increasingly through the Compton effect, and then indirectly through pair production at energies beyond 5 MeV. The accompanying interaction diagram shows two Compton scatterings happening sequentially. In every scattering event, the gamma ray transfers energy to an electron, and it continues on its path in a different direction and with reduced energy.\n\n\nDefinition boundary for lower-energy photons[edit]\n\nSee also: Ultraviolet\n\nThe lowest ionization energy of any element is 3.89 eV, for caesium. However, US Federal Communications Commission material defines ionizing radiation as that with a photon energy greater than 10 eV (equivalent to a far ultraviolet wavelength of 124 nanometers).[11] Roughly, this corresponds to both the first ionization energy of oxygen, and the ionization energy of hydrogen, both about 14 eV.[12] In some Environmental Protection Agency references, the ionization of a typical water molecule at an energy of 33 eV is referenced[13] as the appropriate biological threshold for ionizing radiation: this value represents the so-called W-value, the colloquial name for the ICRU's mean energy expended in a gas per ion pair formed,[14] which combines ionization energy plus the energy lost to other processes such as excitation.[15] At 38 nanometers wavelength for electromagnetic radiation, 33 eV is close to the energy at the conventional 10 nm wavelength transition between extreme ultraviolet and X-ray radiation, which occurs at about 125 eV. Thus, X-ray radiation is always ionizing, but only extreme-ultraviolet radiation can be considered ionizing under all definitions.\n\nThe biological effect of ionizing radiation on cells somewhat resembles that of a broader spectrum of molecularly damaging radiation, which overlaps ionizing radiation and extends beyond, to somewhat lower energies into all regions of UV and sometimes visible light in some systems (such as photosynthetic systems in leaves). Although DNA is always susceptible to damage by ionizing radiation, the DNA molecule may also be damaged by radiation with enough energy to excite certain molecular bonds to form pyrimidine dimers. This energy may be less than ionizing, but near to it. A good example is ultraviolet spectrum energy which begins at about 3.1 eV (400 nm) at close to the same energy level which can cause sunburn to unprotected skin, as a result of photoreactions in collagen and (in the UV-B range) also damage in DNA (for example, pyrimidine dimers). Thus, the mid and lower ultraviolet electromagnetic spectrum is damaging to biological tissues as a result of electronic excitation in molecules which falls short of ionization, but produces similar non-thermal effects. To some extent, visible light and also ultraviolet A (UVA) which is closest to visible energies, have been proven to result in formation of reactive oxygen species in skin, which cause indirect damage since these are electronically excited molecules which can inflict reactive damage, although they do not cause sunburn (erythema).[16] Like ionization-damage, all these effects in skin are beyond those produced by simple thermal effects.\n\n\n  \nRadiation interaction: gamma rays are represented by wavy lines, charged particles and neutrons by straight lines. The small circles show where ionization occurs.\n\n\n\nNeutrons[edit]\n\nMain articles: Neutron and neutron radiation\n\nNeutrons have zero electrical charge and thus often do not directly cause ionization in a single step or interaction with matter. However, fast neutrons will interact with the protons in hydrogen via LET, and this mechanism scatters the nuclei of the materials in the target area, causing direct ionization of the hydrogen atoms. When neutrons strike the hydrogen nuclei, proton radiation (fast protons) results. These protons are themselves ionizing because they are of high energy, are charged, and interact with the electrons in matter.\n\nNeutrons that strike other nuclei besides hydrogen will transfer less energy to the other particle if LET does occur. But, for many nuclei struck by neutrons, inelastic scattering occurs. Whether elastic or inelastic scatter occurs is dependent on the speed of the neutron, whether fast or thermal or somewhere in between. It is also dependent on the nuclei it strikes and its neutron cross section.\n\nIn inelastic scattering, neutrons are readily absorbed in a type of nuclear reaction called neutron capture and attributes to the neutron activation of the nucleus. Neutron interactions with most types of matter in this manner usually produce radioactive nuclei. The abundant oxygen-16 nucleus, for example, undergoes neutron activation, rapidly decays by a proton emission forming nitrogen-16, which decays to oxygen-16. The short-lived nitrogen-16 decay emits a powerful beta ray. This process can be written as:\n\n\n16O (n,p) 16N (fast neutron capture possible with >11 MeV neutron)\n\n16N → 16O + β− (Decay t1/2 = 7.13 s)\n\n\nThis high-energy β− further interacts rapidly with other nuclei, emitting high-energy γ via Bremsstrahlung\n\n\nWhile not a favorable reaction, the 16O (n,p) 16N reaction is a major source of X-rays emitted from the cooling water of a pressurized water reactor and contributes enormously to the radiation generated by a water-cooled nuclear reactor while operating.\n\nFor the best shielding of neutrons, hydrocarbons that have an abundance of hydrogen are used.\n\nIn fissile materials, secondary neutrons may produce nuclear chain reactions, causing a larger amount of ionization from the daughter products of fission.\n\nOutside the nucleus, free neutrons are unstable and have a mean lifetime of 14 minutes, 42 seconds. Free neutrons decay by emission of an electron and an electron antineutrino to become a proton, a process known as beta decay:[17]\n\nIn the adjacent diagram, a neutron collides with a proton of the target material, and then becomes a fast recoil proton that ionizes in turn. At the end of its path, the neutron is captured by a nucleus in an (n,γ)-reaction that leads to the emission of a neutron capture photon. Such photons always have enough energy to qualify as ionizing radiation.\n\n\nPhysical effects[edit]\n\nMain article: Radiation damage\n\n  \nIonized air glows blue around a beam of particulate ionizing radiation from a cyclotron\n\n\n\nNuclear effects[edit]\n\nNeutron radiation, alpha radiation, and extremely energetic gamma (> ~20 MeV) can cause nuclear transmutation and induced radioactivity. The relevant mechanisms are neutron activation, alpha absorption, and photodisintegration. A large enough number of transmutations can change macroscopic properties and cause targets to become radioactive themselves, even after the original source is removed.\n\n\nChemical effects[edit]\n\nMain article: Radiation chemistry\n\nIonization of molecules can lead to radiolysis (breaking chemical bonds), and formation of highly reactive free radicals. These free radicals may then react chemically with neighbouring materials even after the original radiation has stopped. (e.g., ozone cracking of polymers by ozone formed by ionization of air). Ionizing radiation can also accelerate existing criminal reactions such as polymerization and corrosion, by contributing to the activation energy required for the reaction. Optical materials deteriorate under the effect of ionizing radiation.\n\nHigh-intensity ionizing radiation in air can produce a visible ionized air glow of telltale bluish-purple color. The glow can be observed, e.g., during criticality accidents, around mushroom clouds shortly after a nuclear explosion, or the inside of a damaged nuclear reactor like during the Chernobyl disaster.\n\nMonatomic fluids, e.g. molten sodium, have no chemical bonds to break and no crystal lattice to disturb, so they are immune to the chemical effects of ionizing radiation. Simple diatomic compounds with very negative enthalpy of formation, such as hydrogen fluoride will reform rapidly and spontaneously after ionization.\n\n\nElectrical effects[edit]\n\nIonization of materials temporarily increases their conductivity, potentially permitting damaging current levels. This is a particular hazard in semiconductor microelectronics employed in electronic equipment, with subsequent currents introducing operation errors or even permanently damaging the devices. Devices intended for high radiation environments such as the nuclear industry and extra-atmospheric (space) applications may be made radiation hard to resist such effects through design, material selection, and fabrication methods.\n\nProton radiation found in space can also cause single-event upsets in digital circuits.\n6\nThe electrical effects of ionizing radiation are exploited in gas-filled radiation detectors, e.g. the Geiger-Muller counter or the ion chamber.\n\n\nHealth effects[edit]\n\nMain article: Radiobiology\n\nIn general, ionizing radiation is harmful and potentially lethal to living beings but some types have medical applications in radiation therapy for the treatment of cancer and thyrotoxicosis.\n\nMost adverse health effects of exposure to ionizing radiation may be grouped in two general categories:\n\n\n\tdeterministic effects (harmful tissue reactions) due in large part to killing or malfunction of cells following high doses from radiation burns.\n\tstochastic effects, i.e., cancer and heritable effects involving either cancer development in exposed individuals owing to mutation of somatic cells or heritable disease in their offspring owing to mutation of reproductive (germ) cells.[18]\n\n\nThe most common impact is stochastic induction of cancer with a latent period of years or decades after exposure. For example, ionizing radiation is one cause of chronic myelogenous leukemia,[19][20][21] although most people with CML have not been exposed to radiation.[20][21] The mechanism by which this occurs is well understood, but quantitative models predicting the level of risk remain controversial. The most widely accepted model posits that the incidence of cancers due to ionizing radiation increases linearly with effective radiation dose at a rate of 5.5% per sievert.[22] If this linear model is correct, then natural background radiation is the most hazardous source of radiation to general public health, followed by medical imaging as a close second. Other stochastic effects of ionizing radiation are teratogenesis, cognitive decline, and heart disease.\n\n\nMeasurement[edit]\n\nThe table below shows radiation and dose quantities in SI and non-SI units. The relationships of the ICRP dose quantities are shown in the accompanying diagram.\n\n\n  \nGraphic showing relationships between radioactivity and detected ionizing radiation\n\n\n\n\tQuantity\tDetector\tCGS units\tSI units\tOther units\n\n\tDisintegration rate\t\tcurie\tbecquerel\t\n\n\tParticle flux\tGeiger counter, proportional counter, scintillator\tcounts/cm2 · second\tcounts/metre2 · second\tcounts per minute, particles per cm2 per second\n\n\tEnergy fluence\tthermoluminescent dosimeter, film badge dosimeter\tMeV/cm2\tjoule/metre2\t\n\n\tBeam energy\tproportional counter\telectronvolt\tjoule\t\n\n\tLinear energy transfer\tderived quantity\tMeV/cm\tJoule/metre\tkeV/μm\n\n\tKerma\tionization chamber, semiconductor detector, quartz fiber dosimeter, Kearny fallout meter\tesu/cm3\tgray\troentgen\n\n\tAbsorbed dose\tcalorimeter\trad\tgray\trep\n\n\tEquivalent dose\tderived quantity\trem\tsievert\t\n\n\tEffective dose\tderived quantity\trem\tsievert\tBRET\n\n\tCommitted dose\tderived quantity\trem\tsievert\tbanana equivalent dose\n\n\n\nUses[edit]\n\nMain articles: Nuclear technology and Radiobiology\n\nIonizing radiation has many industrial, military, and medical uses. Its usefulness must be balanced with its hazards, a compromise that has shifted over time. For example, at one time, assistants in shoe shops used X-rays to check a child's shoe size, but this practice was halted when the risks of ionizing radiation were better understood.[23]\n\nNeutron radiation is essential to the working of nuclear reactors and nuclear weapons. The penetrating power of x-ray, gamma, beta, and positron radiation is used for medical imaging, nondestructive testing, and a variety of industrial gauges. Radioactive tracers are used in medical and industrial applications, as well as biological and radiation chemistry. Alpha radiation is used in static eliminators and smoke detectors. The sterilizing effects of ionizing radiation are useful for cleaning medical instruments, food irradiation, and the sterile insect technique. Measurements of carbon-14, can be used to date the remains of long-dead organisms (such as wood that is thousands of years old).\n\n\nSources of radiation[edit]\n\nIonizing radiation is generated through nuclear reactions, nuclear decay, by very high temperature, or via acceleration of charged particles in electromagnetic fields. Natural sources include the sun, lightning and supernova explosions. Artificial sources include nuclear reactors, particle accelerators, and x-ray tubes.\n\nThe United Nations Scientific Committee on the Effects of Atomic Radiation (UNSCEAR) itemized types of human exposures.\n\n\nType of radiation exposures\n\tPublic exposure\n\n\tNatural Sources\tNormal occurrences\tCosmic radiation\n\n\tTerrestrial radiation\n\n\tEnhanced sources\tMetal mining and smelting\n\n\tPhosphate industry\n\n\tCoal mining and power production from coal\n\n\tOil and gas drilling\n\n\tRare earth and titanium dioxide industries\n\n\tZirconium and ceramics industries\n\n\tApplication of radium and thorium\n\n\tOther exposure situations\n\n\tMan-made sources\tPeaceful purposes\tNuclear power production\n\n\tTransport of nuclear and radioactive material\n\n\tApplication other than nuclear power\n\n\tMilitary purposes\tNuclear tests\n\n\tResidues in the environment. Nuclear fallout\n\n\tHistorical situations\n\n\tExposure from accidents\n\n\tOccupational radiation exposure\n\n\tNatural Sources\t\tCosmic ray exposures of aircrew and space crew\n\n\t\tExposures in extractive and processing industries\n\n\t\tGas and oil extraction industries\n\n\t\tRadon exposure in workplaces other than mines\n\n\tMan-made sources\tPeaceful purposes\tNuclear power industries\n\n\tMedical uses of radiation\n\n\tIndustrial uses of radiation\n\n\tMiscellaneous uses\n\n\tMilitary purposes\tOther exposed workers\n\n\tSource UNSCEAR 2008 Annex B retrieved 2011-7-4\n\n\n\nThe International Commission on Radiological Protection manages the International System of Radiological Protection, which sets recommended limits for dose uptake.\n\n\nBackground radiation[edit]\n\nMain article: Background radiation\n\nBackground radiation comes from both natural and man-made sources.\n\nThe global average exposure of humans to ionizing radiation is about 3 mSv (0.3 rem) per year, 80% of which comes from nature. The remaining 20% results from exposure to man-made radiation sources, primarily from medical imaging. Average man-made exposure is much higher in developed countries, mostly due to CT scans and nuclear medicine.\n\nNatural background radiation comes from five primary sources: cosmic radiation, solar radiation, external terrestrial sources, radiation in the human body, and radon.\n\nThe background rate for natural radiation varies considerably with location, being as low as 1.5 mSv/a (1.5 mSv per year) in some areas and over 100 mSv/a in others. The highest level of purely natural radiation recorded on the Earth's surface is 90 µGy/h (0.8 Gy/a) on a Brazilian black beach composed of monazite.[24] The highest background radiation in an inhabited area is found in Ramsar, primarily due to naturally radioactive limestone used as a building material. Some 2000 of the most exposed residents receive an average radiation dose of 10 mGy per year, (1 rad/yr) ten times more than the ICRP recommended limit for exposure to the public from artificial sources.[25] Record levels were found in a house where the effective radiation dose due to external radiation was 135 mSv/a, (13.5 rem/yr) and the committed dose from radon was 640 mSv/a (64.0 rem/yr).[26] This unique case is over 200 times higher than the world average background radiation. Despite the high levels of background radiation that the residents of Ramsar receive there is no compelling evidence that they experience a greater health risks. The ICRP recommendations are conservative limits and may represent an over representation of the actual health risk. Generally radiation safety organization recommend the most conservative limits assuming it is best to err on the side of caution. This level of caution is appropriate but should not be used to create fear about background radiation danger. Radiation danger from background radiation may be a serious threat but is more likely a small overall risk compared to all other factors in the environment.\n\n\nCosmic radiation[edit]\n\nSee also: Cosmic ray\n\nThe Earth, and all living things on it, are constantly bombarded by radiation from outside our solar system. This cosmic radiation consists of relativistic particles: positively charged nuclei (ions) from 1 amu protons (about 85% of it) to 26 amu iron nuclei and even beyond. (The high-atomic number particles are called HZE ions.) The energy of this radiation can far exceed that which humans can create, even in the largest particle accelerators (see ultra-high-energy cosmic ray). This radiation interacts in the atmosphere to create secondary radiation that rains down, including x-rays, muons, protons, antiprotons, alpha particles, pions, electrons, positrons, and neutrons.\n\nThe dose from cosmic radiation is largely from muons, neutrons, and electrons, with a dose rate that varies in different parts of the world and based largely on the geomagnetic field, altitude, and solar cycle. The cosmic-radiation dose rate on airplanes is so high that, according to the United Nations UNSCEAR 2000 Report (see links at bottom), airline flight crew workers receive more dose on average than any other worker, including those in nuclear power plants. Airline crews receive more cosmic rays if they routinely work flight routes that take them close to the North or South pole at high altitudes, where this type of radiation is maximal.\n\nCosmic rays also include high-energy gamma rays, which are far beyond the energies produced by solar or human sources.\n\n\nExternal terrestrial sources[edit]\n\nMost materials on Earth contain some radioactive atoms, even if in small quantities. Most of the dose received from these sources is from gamma-ray emitters in building materials, or rocks and soil when outside. The major radionuclides of concern for terrestrial radiation are isotopes of potassium, uranium, and thorium. Each of these sources has been decreasing in activity since the formation of the Earth.\n\n\nInternal radiation sources[edit]\n\nSee also: Committed dose\n\nAll earthly materials that are the building-blocks of life contain a radioactive component. As humans, plants, and animals consume food, air, and water, an inventory of radioisotopes builds up within the organism (see banana equivalent dose). Some radionuclides, like potassium-40, emit a high-energy gamma ray that can be measured by sensitive electronic radiation measurement systems. These internal radiation sources contribute to an individual's total radiation dose from natural background radiation.\n\n\nRadon[edit]\n\nSee also: Health effects of radon\n\nAn important source of natural radiation is radon gas, which seeps continuously from bedrock but can, because of its high density, accumulate in poorly ventilated houses.\n\nRadon-222 is a gas produced by the decay of radium-226. Both are a part of the natural uranium decay chain. Uranium is found in soil throughout the world in varying concentrations. Among non-smokers, radon is the largest cause of lung cancer and, overall, the second-leading cause.[27]\n\n\nRadiation exposure[edit]\n\n  \nVarious doses of radiation in sieverts, ranging from trivial to lethal.\n\n\n\nMain article: Radiation protection\n\nThere are three standard ways to limit exposure:\n\n\n\tTime: For people exposed to radiation in addition to natural background radiation, limiting or minimizing the exposure time will reduce the dose from the radiation source.\n\tDistance: Radiation intensity decreases sharply with distance, according to an inverse-square law (in an absolute vacuum).[28]\n\tShielding: Air or skin can be sufficient to substantially attenuate alpha and beta radiation. Barriers of lead, concrete, or water are often used to give effective protection from more penetrating particles such as gamma rays and neutrons. Some radioactive materials are stored or handled underwater or by remote control in rooms constructed of thick concrete or lined with lead. There are special plastic shields that stop beta particles, and air will stop most alpha particles. The effectiveness of a material in shielding radiation is determined by its half-value thicknesses, the thickness of material that reduces the radiation by half. This value is a function of the material itself and of the type and energy of ionizing radiation. Some generally accepted thicknesses of attenuating material are 5 mm of aluminum for most beta particles, and 3 inches of lead for gamma radiation.\n\n\nThese can all be applied to natural and man-made sources. For man-made sources the use of Containment is a major tool in reducing dose uptake and is effectively a combination of shielding and isolation from the open environment. Radioactive materials are confined in the smallest possible space and kept out of the environment such as in a hot cell (for radiation) or glove box (for contamination). Radioactive isotopes for medical use, for example, are dispensed in closed handling facilities, usually gloveboxes, while nuclear reactors operate within closed systems with multiple barriers that keep the radioactive materials contained. Work rooms, hot cells and gloveboxes have slightly reduced air pressures to prevent escape of airborne material to the open environment.\n\nIn nuclear conflicts or civil nuclear releases civil defense measures can help reduce exposure of populations by reducing ingestion of isotopes and occupational exposure . One is the issue of potassium iodide (KI) tablets, which blocks the uptake of radioactive iodine (one of the major radioisotope products of nuclear fission) into the human thyroid gland.\n\n\nOccupational exposure[edit]\n\nOccupationally exposed individuals are controlled within the regulatory framework of the country they work in, and in accordance with any local nuclear licence constraints. These are usually based on the recommendations of the ICRP.\nThe International Commission on Radiological Protection recommends limiting artificial irradiation. For occupational exposure, the limit is 50 mSv in a single year with a maximum of 100 mSv in a consecutive five-year period.[22]\n\nThe radiation exposure of these individuals is carefully monitored with the use of dosimeters and other radiological protection instruments which will measure radioactive particulate concentrations, area gamma dose readings and radioactive contamination. A legal record of dose is kept.\n\nExamples of activities where occupational exposure is a concern include:\n\n\n\tAirline crew (the most exposed population)\n\tIndustrial radiography\n\tMedical radiology and nuclear medicine[29][30]\n\tUranium mining\n\tNuclear power plant and nuclear fuel reprocessing plant workers\n\tResearch laboratories (government, university and private)\n\n\nSome human-made radiation sources affect the body through direct radiation, known as effective dose (radiation) while others take the form of radioactive contamination and irradiate the body from within. The latter is known as committed dose.\n\n\nPublic exposure[edit]\n\nMedical procedures, such as diagnostic X-rays, nuclear medicine, and radiation therapy are by far the most significant source of human-made radiation exposure to the general public. Some of the major radionuclides used are I-131, Tc-99m, Co-60, Ir-192, and Cs-137. The public also is exposed to radiation from consumer products, such as tobacco (polonium-210), combustible fuels (gas, coal, etc.), televisions, luminous watches and dials (tritium), airport X-ray systems, smoke detectors (americium), electron tubes, and gas lantern mantles (thorium).\n\nOf lesser magnitude, members of the public are exposed to radiation from the nuclear fuel cycle, which includes the entire sequence from processing uranium to the disposal of the spent fuel. The effects of such exposure have not been reliably measured due to the extremely low doses involved. Opponents use a cancer per dose model to assert that such activities cause several hundred cases of cancer per year, an application of the widely accepted Linear no-threshold model (LNT).\n\nThe International Commission on Radiological Protection recommends limiting artificial irradiation to the public to an average of 1 mSv (0.001 Sv) of effective dose per year, not including medical and occupational exposures.[22]\n\nIn a nuclear war, gamma rays from both the initial weapon explosion and fallout would be the sources of radiation exposure.\n\n\nSpaceflight[edit]\n\nMassive particles are a concern for astronauts outside the earth's magnetic field who would receive solar particles from solar proton events (SPE) and galactic cosmic rays from cosmic sources. These high-energy charged nuclei are blocked by Earth's magnetic field but pose a major health concern for astronauts traveling to the moon and to any distant location beyond the earth orbit. Highly charged HZE ions in particular are known to be extremely damaging, although protons make up the vast majority of galactic cosmic rays. Evidence indicates past SPE radiation levels that would have been lethal for unprotected astronauts.[31]\n\n\nAir travel[edit]\n\nAir travel exposes people on aircraft to increased radiation from space as compared to sea level, including cosmic rays and from solar flare events.[32][33] Software programs such as Epcard, CARI, SIEVERT, PCAIRE are attempts to simulate exposure by aircrews and passengers.[33] An example of a measured dose (not simulated dose) is 6 μSv per hour from London Heathrow to Tokyo Narita on a high-latitude polar route.[33] However, dosages can vary, such as during periods of high solar activity.[33] The United States FAA requires airlines to provide flight crew with information about cosmic radiation, and an International Commission on Radiological Protection recommendation for the general public is no more than 1 mSv per year.[33] In addition, many airlines do not allow pregnant flightcrew members, to comply with a European Directive.[33] The FAA has a recommended limit of 1 mSv total for a pregnancy, and no more than 0.5 mSv per month.[33] Information originally based on Fundamentals of Aerospace Medicine published in 2008.[33]\n\n\nRadiation hazard warning signs[edit]\n\nSee also: Ionizing radiation symbol\n\nHazardous levels of ionizing radiation are signified by the trefoil sign on a yellow background. These are usually posted at the boundary of a radiation controlled area or in any place where radiation levels are significantly above background due to human intervention.\n\nThe red ionizing radiation warning symbol (ISO 21482) was launched in 2007, and is intended for IAEA Category 1, 2 and 3 sources defined as dangerous sources capable of death or serious injury, including food irradiators, teletherapy machines for cancer treatment and industrial radiography units. The symbol is to be placed on the device housing the source, as a warning not to dismantle the device or to get any closer. It will not be visible under normal use, only if someone attempts to disassemble the device. The symbol will not be located on building access doors, transportation packages or containers.[34]\n\n\n\t\n\t\t\t\n\n\n\t\t\t\nIonizing radiation hazard symbol\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\n2007 ISO radioactivity danger symbol intended for IAEA Category 1, 2 and 3 sources defined as dangerous sources capable of death or serious injury.[34]\n\n\n\t\t\t\n\n\t\t\n\n\n\nSee also[edit]\n\n\n\tEnergy portal\n\tNuclear technology portal\n\n\n\n\n\tEuropean Committee on Radiation Risk\n\tInternational Commission on Radiological Protection – manages the International System of Radiological Protection\n\tIonometer\n\tIrradiated mail\n\tNational Council on Radiation Protection and Measurements – US national organisation\n\tNuclear safety\n\tNuclear semiotics\n\tRadiant energy\n\tExposure (radiation)\n\tRadiation hormesis\n\tRadiation physics\n\tRadiation protection\n\tRadiation Protection Convention, 1960\n\tRadiation protection of patients\n\tSievert\n\tTreatment of infections after accidental or hostile exposure to ionizing radiation\n\n\n\n\nReferences[edit]\n\n\n\t^ Woodside, Gayle (1997). Environmental, Safety, and Health Engineering. US: John Wiley & Sons. p. 476. ISBN 978-0471109327. Archived from the original on 2015-10-19.\n\n\t^ Stallcup, James G. (2006). OSHA: Stallcup's High-voltage Telecommunications Regulations Simplified. US: Jones & Bartlett Learning. p. 133. ISBN 978-0763743475. Archived from the original on 2015-10-17.\n\n\n\t^ One kg of water per cm squared is 10 meters of water Archived 2016-01-01 at the Wayback Machine\n\n\t^ \"Beta Decay\". Lbl.gov. 9 August 2000. Archived from the original on 3 March 2016.\n\n\n\t^ Contribution of High Charge and Energy (HZE) Ions During Solar-Particle Event of September 29, 1989 Kim, Myung-Hee Y.; Wilson, John W.; Cucinotta, Francis A.; Simonsen, Lisa C.; Atwell, William; Badavi, Francis F.; Miller, Jack, NASA Johnson Space Center; Langley Research Center, May 1999.\n\n\t^ European Centre of Technological Safety. \"Interaction of Radiation with Matter\" (PDF). Radiation Hazard. Archived (PDF) from the original on 12 May 2013. Retrieved 5 November 2012.\n\n\n\t^ Feynman, Richard; Robert Leighton; Matthew Sands (1963). The Feynman Lectures on Physics, Vol.1. USA: Addison-Wesley. pp. 2–5. ISBN 978-0-201-02116-5.\n\n\n\t^ L'Annunziata, Michael; Mohammad Baradei (2003). Handbook of Radioactivity Analysis. Academic Press. p. 58. ISBN 978-0-12-436603-9.\n\n\n\t^ Grupen, Claus; G. Cowan; S. D. Eidelman; T. Stroh (2005). Astroparticle Physics. Springer. p. 109. ISBN 978-3-540-25312-9.\n\n\n\t^ Charles Hodgman, Ed. (1961). CRC Handbook of Chemistry and Physics, 44th Ed. USA: Chemical Rubber Co. p. 2850.\n\n\n\t^ Robert F. Cleveland, Jr.; Jerry L. Ulcek (August 1999). \"Questions and Answers about Biological Effects and Potential Hazards of Radiofrequency Electromagnetic Fields\" (PDF) (4th ed.). Washington, D.C.: OET (Office of Engineering and Technology) Federal Communications Commission. Archived (PDF) from the original on 2011-10-20. Retrieved 2011-12-07.\n\n\n\t^ Jim Clark (2000). \"Ionisation Energy\". Archived from the original on 2011-11-26. Retrieved 2011-12-07.\n\n\n\t^ \"Ionizing & Non-Ionizing Radiation\". Radiation Protection. EPA. 2014-07-16. Archived from the original on 2015-02-12. Retrieved 2015-01-09.\n\n\n\t^ \"Fundamental Quantities and Units for Ionizing Radiation (ICRU Report 85)\". Journal of the ICRU. 11 (1). 2011. Archived from the original on 2012-04-20.\n\n\n\t^ Hao Peng. \"Gas Filled Detectors\" (PDF). Lecture notes for MED PHYS 4R06/6R03 - Radiation & Radioisotope Methodology. MacMaster University, Department of Medical Physics and Radiation Sciences. Archived from the original (PDF) on 2012-06-17.\n\n\n\t^ Liebel F, Kaur S, Ruvolo E, Kollias N, Southall MD (2012). \"Irradiation of skin with visible light induces reactive oxygen species and matrix-degrading enzymes\". J. Invest. Dermatol. 132 (7): 1901–1907. doi:10.1038/jid.2011.476. PMID 22318388.\n\n\n\t^ W.-M. Yao;  et al. (2007). \"Particle Data Group Summary Data Table on Baryons\" (PDF). J. Phys. G. 33 (1). Archived from the original (PDF) on 2011-09-10. Retrieved 2012-08-16.\n\n\n\t^ ICRP 2007, paragraph 55.\n\n\t^ Huether, Sue E.; McCance, Kathryn L. (2016-01-22). Understanding pathophysiology (6th ed.). St. Louis, Missouri: Elsevier. p. 530. ISBN 9780323354097. OCLC 740632205.\n\n\n\t^ a b \"Chronic myeloid leukemia (CML)\". Leukemia & Lymphoma Society. Retrieved 22 September 2019.\n\n\n\t^ a b \"Chronic myelogenous leukemia (CML) Chronic myelogenous leukemia (CML)\". Medline Plus Medical Encyclopedia. U.S. National Library of Medicine. Retrieved 22 September 2019.\n\n\n\t^ a b c ICRP 2007.\n\n\t^ Lewis, Leon; Caplan, Paul E (January 1, 1950). \"The Shoe-fitting Fluoroscope as a Radiation Hazard\". California Medicine. 72 (1): 26–30 [27]. PMC 1520288. PMID 15408494.\n\n\n\t^ United Nations Scientific Committee on the Effects of Atomic Radiation (2000). \"Annex B\". Sources and Effects of Ionizing Radiation. vol. 1. United Nations. p. 121. Archived from the original on 4 August 2012. Retrieved 11 November 2012.\n\n\n\t^ Mortazavi, S.M.J.; P.A. Karamb (2005). \"Apparent lack of radiation susceptibility among residents of the high background radiation area in Ramsar, Iran: can we relax our standards?\". Radioactivity in the Environment. 7: 1141–1147. doi:10.1016/S1569-4860(04)07140-2. ISBN 9780080441375. ISSN 1569-4860.\n\n\n\t^ Sohrabi, Mehdi; Babapouran, Mozhgan (2005). \"New public dose assessment from internal and external exposures in low- and elevated-level natural radiation areas of Ramsar, Iran\". Proceedings of the 6th International Conference on High Levels of Natural Radiation and Radon Areas. 1276: 169–174. doi:10.1016/j.ics.2004.11.102.\n\n\n\t^ \"Health Risks\". Radon. EPA. Archived from the original on 2008-10-20. Retrieved 2012-03-05.\n\n\n\t^ Camphausen KA, Lawrence RC. \"Principles of Radiation Therapy\" Archived 2009-05-15 at the Wayback Machine in Pazdur R, Wagman LD, Camphausen KA, Hoskins WJ (Eds) Cancer Management: A Multidisciplinary Approach Archived 2013-10-04 at the Wayback Machine. 11 ed. 2008.\n\n\t^ Pattison JE, Bachmann DJ, Beddoe AH (1996). \"Gamma Dosimetry at Surfaces of Cylindrical Containers\". Journal of Radiological Protection. 16 (4): 249–261. Bibcode:1996JRP....16..249P. doi:10.1088/0952-4746/16/4/004.\n\n\n\t^ Pattison, J.E. (1999). \"Finger Doses Received during Samarium-153 Injections\". Health Physics. 77 (5): 530–5. doi:10.1097/00004032-199911000-00006. PMID 10524506.\n\n\n\t^ \"Superflares could kill unprotected astronauts\". New Scientist. 21 March 2005. Archived from the original on 27 March 2015.\n\n\n\t^ \"Effective Dose Rate\". NAIRAS (Nowcast of Atmospheric Ionizing Radiation System). Archived from the original on 2016-03-05.\n\n\n\t^ a b c d e f g h Jeffrey R. Davis; Robert Johnson; Jan Stepanek (2008). Fundamentals of Aerospace Medicine. pp. 221–230. ISBN 9780781774666 – via Google Books.\n\n\n\t^ a b \"New Symbol Launched to Warn Public About Radiation Dangers\". International Atomic Energy Agency. February 15, 2007. Archived from the original on 2007-02-17.\n\n\n\n\n\nLiterature[edit]\n\n\tICRP (2007). The 2007 Recommendations of the International Commission on Radiological Protection. Annals of the ICRP. ICRP publication 103. 37. ISBN 978-0-7020-3048-2. Archived from the original on 16 November 2012. Retrieved 17 May 2012.\n\n\n\nExternal links[edit]\n\n\tThe Nuclear Regulatory Commission regulates most commercial radiation sources and non-medical exposures in the US:\n\tNLM Hazardous Substances Databank – Ionizing Radiation\n\tUnited Nations Scientific Committee on the Effects of Atomic Radiation 2000 Report Volume 1: Sources, Volume 2: Effects\n\tBeginners Guide to Ionising Radiation Measurement\n\tMike Hanley. \"XrayRisk.com : Radiation Risk Calculator. Calculate Radiation Dose and Cancer Risk\".\n (from CT scans and xrays).\n\tFree Radiation Safety Course\n\tHealth Physics Society Public Education Website\n\tOak Ridge Reservation Basic Radiation Facts\n\n\n\t\tv\n\tt\n\te\n\n\nRadiation (physics and health)\n\n\tMain articles\t\n\tNon-ionizing radiation\t\n\tAcoustic radiation force\n\tInfrared\n\tLight\n\tStarlight\n\tSunlight\n\tMicrowave\n\tRadio waves\n\tUltraviolet\n\n\n\n\n\tIonizing radiation\t\n\tRadioactive decay\n\tCluster decay\n\tBackground radiation\n\tAlpha particle\n\tBeta particle\n\tGamma ray\n\tCosmic ray\n\tNeutron radiation\n\tNuclear fission\n\tNuclear fusion\n\tNuclear reactors\n\tNuclear weapons\n\tParticle accelerators\n\tRadioactive materials\n\tX-ray\n\n\n\n\n\t\n\tEarth's energy budget\n\tElectromagnetic radiation\n\tSynchrotron radiation\n\tThermal radiation\n\tBlack-body radiation\n\tParticle radiation\n\tGravitational Radiation\n\tCosmic background radiation\n\tCherenkov radiation\n\tAskaryan radiation\n\tBremsstrahlung\n\tUnruh radiation\n\tDark radiation\n\n\n\n\n\n\n\n\tRadiation \nand health\t\n\tRadiation syndrome\n\tacute\n\tchronic\n\n\n\tHealth physics\n\tDosimetry\n\tElectromagnetic radiation and health\n\tLaser safety\n\tLasers and aviation safety\n\tMedical radiography\n\tMobile phone radiation and health\n\tRadiation protection\n\tRadiation therapy\n\tRadioactivity in the life sciences\n\tRadioactive contamination\n\tRadiobiology\n\tBiological dose units and quantities\n\tWireless electronic devices and health\n\tRadiation Heat-transfer\n\n\n\n\n\tRelated articles\t\n\tHalf-life\n\tNuclear physics\n\tRadioactive source\n\tRadiation hardening\n\tList of civilian radiation accidents\n\t1996 Costa Rica accident\n\t1987 Goiânia accident\n\t1984 Moroccan accident\n\t1990 Zaragoza accident\n\n\n\n\n\tSee also: the categories Radiation effects, Radioactivity, Radiobiology, and Radiation protection.\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nCancer-causing materials and agents (carcinogens)\n\n\t\n\tCancer\n\tCancer cells\n\n\n\n\n\tProminent human carcinogens\t\n\tAcetaldehyde\n\tArsenic\n\tAsbestos\n\tBacteria\n\tHelicobacter Pylori\n\n\n\tBenzo[a]pyrene\n\t1,3-Butadiene\n\tDiethylstilbestrol\n\tFormaldehyde\n\tIonizing radiation (e.g., from isotopes of plutonium and radium)\n\tTobacco smoke\n\tUltraviolet light\n\tViruses\n\tEpstein–Barr\n\tHepatitis B\n\tHepatitis C\n\tHuman papillomavirus\n\n\n\n\n\n\n\tIARC lists\t\n\tGroup 1\n\tGroup 2A\n\tGroup 2B\n\tGroup 3\n\tCaprolactam (Group 4)\n\n\n\n\n\t\n\t#WHO-EM\n\t‡Withdrawn from market\n\tClinical trials:\n\t†Phase III\n\t§Never to phase III\n\n\n\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNuclear technology\n\n\t\n\tScience\t\n\tChemistry\n\tEngineering\n\tPhysics\n\tAtomic nucleus\n\tFission\n\tFusion\n\tRadiation\n\tionizing\n\tbraking\n\n\n\n\n\n\n\tFuel\t\n\tTritium\n\tDeuterium\n\tHelium-3\n\tFertile material\n\tFissile material\n\tIsotope separation\n\tNuclear material\n\tUranium\n\tenriched\n\tdepleted\n\n\n\tPlutonium\n\tThorium\n\n\n\n\n\n\n\tNeutron\t\n\tActivation\n\tCapture\n\tPoison\n\tCross section\n\tGenerator\n\tRadiation\n\tReflector\n\tTemperature\n\tThermal\n\tFast\n\tFusion\n\n\n\n\n\tPower\t\n\tby country\n\tPower plant\n\tEconomics\n\tMulti-Mission Radioisotope Thermoelectric Generator\n\tAccidents and incidents\n\tPolicy\n\tFusion\n\tRadioisotope thermoelectric (RTG)\n\tPropulsion\n\trocket\n\n\n\tSafety and security\n\n\n\n\n\tMedicine\t\n\tImaging\t\n\tRadBall\n\tScintigraphy\n\tSingle-photon emission (SPECT)\n\tPositron-emission tomography (PET)\n\n\n\n\n\tTherapy\t\n\tFast-neutron\n\tNeutron capture therapy of cancer\n\tTargeted alpha-particle\n\tProton-beam\n\tTomotherapy\n\tBrachytherapy\n\tRadiation therapy\n\tRadiosurgery\n\tRadiopharmacology\n\n\n\n\n\n\n\n\tWeapons\t\n\tTopics\t\n\tArms race\n\tDelivery\n\tDesign\n\tDisarmament\n\tEthics\n\tExplosion\n\teffects\n\n\n\tHistory\n\tProliferation\n\tTesting\n\thigh-altitude\n\tunderground\n\n\n\tWarfare\n\tYield\n\tTNTe\n\n\n\n\n\n\n\tLists\t\n\tEstimated death tolls from attacks\n\tStates with nuclear weapons\n\tHistorical stockpiles and tests\n\tTests\n\tTests in the United States\n\n\n\tWMD treaties\n\tWeapon-free zones\n\tWeapons\n\n\n\n\n\n\n\n\tWaste\t\n\tProducts\t\n\tActinide\n\tReprocessed uranium\n\tReactor-grade plutonium\n\tMinor actinide\n\n\n\tActivation\n\tFission\n\tLLFP\n\n\n\tActinide chemistry\n\n\n\n\n\tDisposal\t\n\tFuel cycle\n\tHigh-level (HLW)\n\tLow-level (LLW)\n\tRepository\n\tReprocessing\n\tSpent fuel\n\tpool\n\tcask\n\n\n\tTransmutation\n\n\n\n\n\n\n\n\tDebate\t\n\tNuclear power\n\tNuclear weapons\n\tBlue Ribbon Commission on America's Nuclear Future\n\tAnti-nuclear movement\n\tUranium mining\n\tNuclear power phase-out\n\n\n\n\n\n\n\n\t\n\tNuclear reactors\n\n\t\n\tFission\n\n\tModerator\n\n\n\tLight water\t\n\tAqueous homogeneous\n\tBoiling\n\tBWR\n\tABWR\n\tESBWR\n\tKerena\n\n\n\tPressurized\n\tAP1000\n\tAPR-1400\n\tAPR+\n\tAPWR\n\tATMEA1\n\tCAP1400\n\tCPR-1000\n\tEPR\n\tHPR-1000\n\tACPR1000\n\tACP1000\n\n\n\tVVER\n\tmany others\n\n\n\tSupercritical (SCWR)\n\tNatural fission\n\n\n\n\n\tHeavy water\t\n\tD2O\t\n\tPressurized\n\tCANDU\n\tCANDU 6\n\tCANDU 9\n\tEC6\n\tAFCR\n\tACR-1000\n\n\n\tAHWR\n\tCVTR\n\tIPHWR-X\n\tPHWR KWU\n\tMZFR\n\tR3\n\tR4 Marviken\n\n\n\n\n\n\n\tH2O\t\n\tHWLWR\n\tATR\n\tHW BLWR 250\n\n\n\tSteam-generating (SGHWR)\n\n\n\n\n\tOrganic\t\n\tWR-1\n\n\n\n\n\tCO2\t\n\tHWGCR\n\tEL-4\n\tKKN\n\tKS 150\n\tLucens\n\n\n\n\n\n\n\n\n\n\tGraphite \nby coolant\n\t\n\tWater\t\n\tH2O\t\n\tAM-1\n\tAMB-X\n\tEGP-6\n\tRBMK\n\n\n\n\n\n\n\n\tGas\t\n\tCO2\t\n\tUranium Naturel Graphite Gaz (UNGG)\n\tMagnox\n\tAdvanced gas-cooled (AGR)\n\n\n\n\n\tHe\t\n\tGTMHR\n\tMHR-T\n\n\n\tUHTREX\n\tVHTR (HTGR)\n\tPBR (PBMR)\n\tAVR\n\tHTR-10\n\tHTR-PM\n\tTHTR-300\n\n\n\tPMR\n\n\n\n\n\n\n\n\n\n\tMolten-salt\t\n\tFluorides\t\n\tFuji MSR\n\tLiquid-fluoride thorium reactor (LFTR)\n\tMolten-Salt Reactor Experiment (MSRE)\n\tIntegral Molten Salt Reactor (IMSR)\n\tThorCon\n\n\n\n\n\n\n\n\n\n\n\tNone\n\n(fast-neutron)\n\t\n\t\n\tBreeder (FBR)\n\tIntegral (IFR)\n\tLiquid-metal-cooled (LMFR)\n\tSmall sealed transportable autonomous (SSTAR)\n\tTraveling-wave (TWR)\n\tEnergy Multiplier Module (EM2)\n\tReduced-moderation (RMWR)\n\tFast Breeder Test Reactor (FBTR)\n\tDual fluid reactor (DFR)\n\n\n\n\n\tGeneration IV\t\n\tSodium (SFR)\n\tBN-350\n\tBN-600\n\tBN-800\n\tBN-1200\n\tCFR-600\n\tPhénix\n\tSuperphénix\n\tPFBR\n\tCEFR\n\tPFR\n\tPRISM\n\n\n\tLead\n\tHelium gas (GFR)\n\n\n\n\n\n\n\n\tOthers\t\n\tOrganic nuclear reactor\n\tArbus\n\tPiqua\n\n\n\tAircraft Reactor Experiment\n\n\n\n\n\n\n\n\tFusion\n\n\tby confinement\n\n\tMagnetic\t\n\tField-reversed configuration\n\tLevitated dipole\n\tReversed field pinch\n\tSpheromak\n\tStellarator\n\tTokamak\n\n\n\n\n\tInertial\t\n\tBubble (acoustic)\n\tFusor\n\telectrostatic\n\n\n\tLaser-driven\n\tMagnetized-target\n\tZ-pinch\n\n\n\n\n\tOther\t\n\tDense plasma focus\n\tMigma\n\tMuon-catalyzed\n\tPolywell\n\tPyroelectric\n\n\n\n\n\n\n\n\n\n\n\t\n\t Category\n\t Commons\n\t Portal\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nRadiation poisoning\n\n\tGeneral\t\n\tAcute\n\tChronic\n\tAccidents\n\tExperiments\n\tBiological timeline\n\n\n\n\n\tConditions\t\n\tRadiation burn\n\tRadiation-induced cancer\n\tRadiation-induced cognitive decline\n\tRadiation-induced lung injury\n\n\n\n\n\tTreatments\t\n\tDose fractionation\n\tRadioresistance\n\tRadiation protection\n\tRadiation dose reconstruction\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nRadiation protection\n\n\tMain articles\t\n\tBackground radiation\n\tDosimetry\n\tHealth physics\n\tIonizing radiation\n\tInternal dosimetry\n\tRadioactive contamination\n\tRadioactive sources\n\tRadiobiology\n\n\n\n\n\tMeasurement \nquantities & units\t\n\tAbsorbed dose\n\tBecquerel\n\tCommitted dose\n\tComputed tomography dose index\n\tCounts per minute\n\tEffective dose\n\tEquivalent dose\n\tGray\n\tMean glandular dose\n\tMonitor unit\n\tRad\n\tRoentgen\n\tRem\n\tSievert\n\n\n\n\n\tInstruments and \nmeasurement techniques\t\n\tAirborne radioactive particulate monitoring\n\tDosimeter\n\tGeiger counter\n\tIon chamber\n\tScintillation counter\n\tProportional counter\n\n\n\tRadiation monitoring\n\tSemiconductor detector\n\tSurvey meter\n\tWhole-body counting\n\n\n\n\n\tProtection techniques\t\n\tLead shielding\n\tGlovebox\n\tPotassium iodide\n\tRadon mitigation\n\tRespirators\n\n\n\n\n\tOrganisations\t\n\tEuratom\n\tHPS (USA)\n\tIAEA\n\tICRU\n\tICRP\n\tIRPA\n\tSRP (UK)\n\tUNSCEAR\n\n\n\n\n\tRegulation\t\n\tIRR (UK)\n\tNRC (USA)\n\tONR (UK)\n\tRadiation Protection Convention, 1960\n\n\n\n\n\tRadiation effects\t\n\tAcute radiation syndrome\n\tRadiation-induced cancer\n\n\n\n\n\tSee also: the categories Medical physics, Radiation effects, Radioactivity, Radiobiology, and Radiation protection.\n\n\n\n\n\n\tAuthority control \t\n\tBNE: XX527268\n\tBNF: cb119445559 (data)\n\tGND: 4027633-8\n\tLCCN: sh85067827\n\tNARA: 10646158\n\tNDL: 00563523\n\tSUDOC: 027393674\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Ionizing_radiation&oldid=917232535\"\n\n\t\t\n\t\tCategories: \tIonizing radiation\n\tCarcinogens\n\tMutagens\n\tRadioactivity\n\tRadiobiology\n\tRadiation health effects\n\tRadiation protection\n\n\nHidden categories: \tWebarchive template wayback links\n\tCS1: long volume value\n\tArticles with short description\n\tWikipedia articles with BNE identifiers\n\tWikipedia articles with BNF identifiers\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NARA identifiers\n\tWikipedia articles with NDL identifiers\n\tWikipedia articles with SUDOC identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tქართული\n\tҚазақша\n\tKreyòl ayisyen\n\tКыргызча\n\tLatina\n\tLatviešu\n\tLietuvių\n\tMagyar\n\tBahasa Melayu\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOromoo\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tPolski\n\tPortuguês\n\tРусский\n\tScots\n\tසිංහල\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tТатарча/tatarça\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 22 September 2019, at 22:03 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "20", "dc:title": "Ionizing radiation - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Radioactive.svg/1200px-Radioactive.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-hard_radiation", "title": "Ionizing radiation - Wikipedia"}}