{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHemispherical resonator gyroscope - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tHemispherical resonator gyroscope\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nHemispherical Resonator Gyroscope (HRG)\n\n\n\nThe Hemispherical Resonator Gyroscope (HRG), also called wine-glass gyroscope or mushroom gyro, is a compact, low noise, high performance angular rate or rotation sensor.  An HRG is made using a thin solid-state hemispherical shell, anchored by a thick stem. This shell is driven to a flexural resonance by electrostatic forces generated by electrodes which are deposited directly onto separate fused-quartz structures that surround the shell. The gyroscopic effect is obtained from the inertial property of the flexural standing waves. Although the HRG is a mechanical system, it has no moving parts, and can be very compact.\n\n\nContents\n\n\n\t1 Operation\n\t2 Advantages\n\t3 Disadvantages\n\t4 Applications\n\t5 Specific uses\n\t6 See also\n\t7 References\n\t8 Bibliography\n\n\n\n\n\nOperation[edit]\n\nThe HRG makes use of a small thin solid-state hemispherical shell, anchored by a thick stem. This shell is driven to a flexural resonance by dedicated electrostatic forces generated by electrodes which are deposited directly onto separate fused quartz structures that surround the shell.\n\nFor a single-piece design (i.e., the hemispherical shell and stem form a monolithic part[1]) made from high-purity fused quartz, it is possible to reach a Q-factor of over 30-50 million in vacuum, thus the corresponding random walks are extremely low. The Q-factor is limited by the coating (extremely thin film of gold or platinum) and by fixture losses.[2] Such resonators have to be fine-tuned by ion-beam micro-erosion of the glass or by laser ablation in order to be perfectly dynamically balanced. When coated, tuned and assembled within the housing, the Q-factor remains over 10 million.\n\nIn application to the HRG shell, Coriolis forces cause a precession of vibration patterns around the axis of rotation. It causes a slow precession of a standing wave around this axis, with an angular rate that differs from input one. This is the wave inertia effect, discovered in 1890 by British scientist George Hartley Bryan (1864–1928).[3]  Therefore, when subject to rotation around the shell symmetry axis, the standing wave does not rotate exactly with the shell, but the difference between both rotations is nevertheless perfectly proportional to the input rotation. The device is then able to sense rotation.\n\nThe electronics which sense the standing waves are also able to drive them. Therefore, the gyros can operate in either a “whole angle mode” that sense the standing waves' position or a “force rebalance mode” that holds the standing wave in a fixed orientation with respect to the gyro.\n\nOriginally used in space applications (Attitude and Orbit Control Systems for spacecrafts)[4], HRG is now used in advanced Inertial navigation system, in Attitude and Heading Reference System and gyrocompass.[5]\n\n\nAdvantages[edit]\n\nThe HRG is extremely reliable[6][7] because of its very simple hardware (two or three pieces of machined fused quartz). It has no moving parts; its core is made of a monolithic part which includes the hemispherical shell and its stem.[8] They demonstrated outstanding reliability since their initial use in 1996 on the NEAR_Shoemaker spacecraft.[9][10]\n\nThe HRG is highly accurate[11][12] and is not sensitive to external environmental perturbations. The resonating shell weighs only a few grams and it is perfectly balanced which makes it insensitive to vibrations, accelerations and shocks.\n\nThe HRG exhibits superior SWAP (Size, Weight & Power) characteristics compared to other gyroscope technologies.\n\nThe HRG generates neither acoustic nor radiated noise because the resonating shell is perfectly balanced and operates under vacuum.\n\nThe material of the resonator, the fused quartz, is naturally radiation hard in any space environment. This confers intrinsic immunity to deleterious space radiation effects to the HRG resonator.   \n\nThanks to the extremely high Q-factor of the resonating shell, the HRG has an ultra-low low angular random walk[13] and extremely low power dissipation.\n\nThe HRG, unlike optical gyros (FOG and RLG), has inertial memory: if the power is lost for a short period of time (typically few seconds), the sensitive element integrates the input motion (angular rate) so that when the power returns, the HRG signals the angle turned in the interval of power loss.\n\n\nDisadvantages[edit]\n\nThe HRG is a very high-tech device which requires sophisticated manufacturing tools and process. The control electronics required to sense and drive the standing waves, is somewhat sophisticated. This high level of sophistication strongly limits the dissemination of this technology and only few companies were able to develop it. Up to now, only three companies are manufacturing HRG in series: Northrop Grumman Corporation[14], Safran[15] and Raytheon Anschutz[16].\n\nClassical HRG is relatively expensive due to the cost of the precision ground and polished hollow quartz hemispheres. This manufacturing cost restricts its use to high added value applications such as satellite and spacecraft[17]. Nevertheless manufacturing costs can be dramatically reduced by design changes and engineering controls. Rather than depositing electrodes on an internal hemisphere that must perfectly match the shape of the outer resonating hemisphere, electrodes are deposited on a flat plate that matches the equatorial plan of the resonating hemisphere. In such configuration, HRG becomes very cost effective and is well suitable for high grade but cost sensitive applications.[18]\n\n\nApplications[edit]\n\n\tHRG are used in space applications (satellites and spacecraft)[8][19]\n\tHRG are used in Space launchers [20]\n\tHRG are used for marine maintenance-free gyrocompasses[21][22] as well as Attitude and Heading Reference Systems[23]\n\tHRG are used in Target locators[24], land navigation systems [22][25][26] and artillery pointing[27][28]\n\tHRG are used in naval navigation systems for both surface vessels and submarines [29]\n\tHRG are poised to be used in Commercial Air Transport navigation systems [30][31]\n\n\n\n\n\n\nSpecific uses[edit]\n\n\tJames Webb Space Telescope[32]\n\tInside the Spacecraft Bus (JWST)\n\n\n\n\nSee also[edit]\n\n\tRing laser gyroscope\n\tHRG gyrocompass\n\tFiber optic gyroscope\n\tGyroscope\n\tVibrating structure gyroscope\n\tQuantum gyroscope\n\tInertial measurement unit\n\n\nReferences[edit]\n\n\n\t^ https://airandspace.si.edu/collection-objects/resonator-hemispherical-resonator-gyro\n\n\t^ Sarapuloff S.A., Rhee H.-N., and Park S.-J. Avoidance of Internal Resonances in Hemispherical Resonator Assembly from Fused Quartz Connected by Indium Solder //Proceedings of the 23rd KSNVE (Korean Society for Noise & Vibration Engineering) Annual Spring Conference. Yeosu-city, 24–26 April 2013. – P.835-841.\n\n\t^ Bryan G.H. On the Beats in the Vibrations of a Revolving Cylinder or Bell //Proc. of Cambridge Phil. Soc. 1890, Nov. 24. Vol.VII. Pt.III. - P.101-111.\n\n\t^ https://airandspace.si.edu/collection-objects/housing-hemispherical-resonator-gyroscope-hrg\n\n\t^ http://www.publicnow.com/view/601813DEDD48CD206D9593E2722478364FBC1BB7?2017-05-03-12:01:11+01:00-xxx5199\n\n\t^ \"Northrop Grumman's Highly Reliable Resonator Gyro Achieves 25 Million Operating Hours in Space\". Northrop Grumman Newsroom. Retrieved 2018-12-06.\n\n\t^ \"Northrop Grumman's Hemispherical Resonator Gyro Achieves 50 Million Operating Hours in Space\". Northrop Grumman Newsroom. Retrieved 2019-08-14.\n\n\n\t^ a b The Hemispherical Resonator Gyro: From Wineglass to the Planets, David M. Rozelle\n\n\t^ Hemispherical Resonator Gyro\n\n\t^ https://www.azosensors.com/news.aspx?newsID=9185\n\n\t^ http://www.northropgrumman.com/Capabilities/HRG/Documents/hrg.pdf\n\n\t^ https://ieeexplore.ieee.org/document/8358163/\n\n\t^ \"SIRU - Scalable Inertial Reference Unit for Space\". Northrop Grumman. Retrieved 2018-12-06.\n\n\n\t^ http://www.northropgrumman.com/Capabilities/HRG/Pages/default.aspx\n\n\t^ https://www.safran-electronics-defense.com/hrg-crystal\n\n\t^ https://www.raytheon-anschuetz.com/products-systems/product-range/standard-30-mf-gyro-compass/\n\n\t^ \"SIRU - Scalable Inertial Reference Unit for Space\". Northrop Grumman. Retrieved 2018-12-06.\n\n\n\t^ \"HRG by Sagem from laboratory to mass production\". ResearchGate. Retrieved 2019-06-13.\n\n\n\t^ https://artes.esa.int/projects/regys-20\n\n\t^ https://www.safran-electronics-defense.com/media/safrans-spacenaute-navigation-system-chosen-new-ariane-6-launch-vehicle-20161130\n\n\t^ http://www.raytheon-anschuetz.com/product-range/product-detail/69/Horizon-MF-Gyro-Compass\n\n\t^ a b http://www.defenseworld.net/news/9978/Sagem_To_Highlight_Wide_Range_Of_Warfare_Products_At_Defexpo_2014\n\n\t^ http://www.navyrecognition.com/index.php?option=com_content&task=view&id=721\n\n\t^ www.vectronix.ch/html/en/news_press/current_news/vectronix_wins_innovation_award\n\n\t^ Sagem wins new order for SIGMA 20 navigators on MBDA surface-to-air weapon systems\n\n\t^ Sagem to Supply Seeker and Firing-Posts Optronics for MBDA’s New MMP Medium-Range Missile\n\n\t^ Tran, Pierre (2018-06-08). \"Eurosatory: This navigation system by Safran doesn't need GPS\". Defense News. Retrieved 2018-06-12.\n\n\n\t^ \"Safran reveals Geonyx inertial navigation system for assured PNT | Jane's 360\". www.janes.com. Retrieved 2018-10-29.\n\n\n\t^ https://www.navyrecognition.com/index.php/news/naval-exhibitions/2018/euronaval-2018/6621-euronaval-2018-new-family-of-naval-inertial-navigation-systems-by-safran.html\n\n\t^ Sagem unveil SkyNaute inertial navigation system\n\n\t^ https://www.safran-electronics-defense.com/media/20130617_sagem-carries-out-first-flight-test-hrg-based-navigation-system-commercial-aircraft\n\n\t^ [1]\n\n\n\n\n\nBibliography[edit]\n\n\tLynch D.D. HRG Development at Delco, Litton, and Northrop Grumman //Proceedings of Anniversary Workshop on Solid-State Gyroscopy (19–21 May 2008. Yalta, Ukraine). - Kyiv-Kharkiv. ATS of Ukraine. 2009.\n\tL.Rosellini, JM Caron - REGYS 20: A promising HRG-based IMU for space application - 7th International ESA Conference on Guidance, Navigation & Control Systems. 2–5 June 2008, Tralee, County Kerry, Ireland\n\tD. Roberfroid, Y. Folope, G. Remillieux (Sagem Défense Sécurité, Paris, FRANCE) - HRG and Inertial Navigation - Inertial Sensors and Systems – Symposium Gyro Technology 2012\n\tA Carre, L Rosellini, O Prat (Sagem Défense Sécurité, Paris,France) HRG and North Finding -17th Saint Petersburg International Conference on Integrated Navigation Systems 31 May – 2 June 2010, Russia\n\tAlain Jeanroy; Gilles Grosset; Jean-Claude Goudon; Fabrice Delhaye - HRG by Sagem from laboratory to mass production - 2016 IEEE International Symposium on Inertial Sensors and Systems\n\tAlexandre Lenoble, Thomas Rouilleault - SWAP-oriented IMUs for multiple applications- Inertial Sensors and Systems (ISS), 2016 DGON - Karlsruhe, Germany\n\tFabrice Delhaye - HRG by Safran - The game-changing technology - 2018 IEEE International Symposium on Inertial Sensors and Systems - Lake Como, Italy\n\tFabrice Delhaye; Jean-Philippe Girault - SpaceNaute®, HRG technological breakthrough for advanced space launcher inertial reference system - 25th Saint Petersburg International Conference on Integrated Navigation Systems 31 May – 29 May 2018, Russia\n\tB.Deleaux, Y.Lenoir - The world smallest, most accurate and reliable pure inertial navigator: ONYX™ - Inertial Sensors and Systems 2018, Braunschweig - 12 September 2018, Germany\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Hemispherical_resonator_gyroscope&oldid=911807674\"\n\n\t\t\n\t\tCategories: \tAerospace engineering\n\tAids to navigation\n\tAircraft instruments\n\tAvionics\n\tMissile guidance\n\tNavigational equipment\n\tSpacecraft components\n\tTechnology systems\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tעברית\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 21 August 2019, at 08:33 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "2", "dc:title": "Hemispherical resonator gyroscope - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/4/48/Hemispherical_Resonator_Gyroscope_%28HRG%29.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-hemispherical_resonator_gyroscope", "title": "Hemispherical resonator gyroscope - Wikipedia"}}