{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDirectional antenna - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tDirectional antenna\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from High-gain antenna)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\nA multi-element, log-periodic dipole array\n\n\nA 70-meter Cassegrain radio antenna at GDSCC, California\n\n\n\n\n\nA directional antenna or beam antenna is an antenna which radiates or receives greater power in specific directions allowing increased performance and reduced interference from unwanted sources. Directional antennas provide increased performance over dipole antennas—or omnidirectional antennas in general—when greater concentration of radiation in a certain direction is desired.\n\nA high-gain antenna (HGA) is a directional antenna with a focused, narrow radiowave beam width, permitting  more precise targeting of the radio signals. Most commonly referred to during space missions, these antennas are also in use all over Earth, most successfully in flat, open areas where there are no mountains to disrupt radiowaves. By contrast, a low-gain antenna (LGA) is an omnidirectional antenna with a broad radiowave beam width, that allows the signal to propagate reasonably well even in mountainous regions and is thus more reliable regardless of terrain. Low-gain antennas are often used in spacecraft as a backup to the high-gain antenna, which transmits a much narrower beam and is therefore susceptible to loss of signal.[1]\n\nAll practical antennas are at least somewhat directional, although usually only the direction in the plane parallel to the earth is considered, and practical antennas can easily be omnidirectional in one plane. The most common types are the Yagi antenna, the log-periodic antenna, and the corner reflector antenna, which are frequently combined and commercially sold as residential TV antennas. Cellular repeaters often make use of external directional antennas to give a far greater signal than can be obtained on a standard cell phone. Satellite Television receivers usually use parabolic antennas. For long and medium wavelength frequencies, tower arrays are used in most cases as directional antennas.\n\n\nContents\n\n\n\t1 Principle of operation\n\t2 Antenna gain\n\t3 Applications\n\t4 Gallery\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nPrinciple of operation[edit]\n\nWhen transmitting, a high-gain antenna allows more of the transmitted power to be sent in the direction of the receiver, increasing the received signal strength. When receiving, a high gain antenna captures more of the signal, again increasing signal strength. Due to reciprocity, these two effects are equal—an antenna that makes a transmitted signal 100 times stronger (compared to an isotropic radiator) will also capture 100 times as much energy as the isotropic antenna when used as a receiving antenna. As a consequence of their directivity, directional antennas also send less (and receive less) signal from directions other than the main beam. This property may be used to reduce interference.\n\nThere are many ways to make a high-gain antenna; the most common are parabolic antennas, helical antennas, yagi antennas, and phased arrays of smaller antennas of any kind. Horn antennas can also be constructed with high gain, but are less commonly seen. Still other configurations are possible—the Arecibo Observatory uses a combination of a line feed with an enormous spherical reflector (as opposed to a more usual parabolic reflector), to achieve extremely high gains at specific frequencies.\n\n\nAntenna gain[edit]\n\nAntenna gain is often quoted with respect to a hypothetical antenna that radiates equally in all directions, an isotropic radiator. This gain, when measured in decibels, is called dBi. Conservation of energy dictates that high gain antennas must have narrow beams. For example, if a high gain antenna makes a 1 watt transmitter look like a 100 watt transmitter, then the beam can cover at most ​1⁄100 of the sky (otherwise the total amount of energy radiated in all directions would sum to more than the transmitter power, which is not possible). In turn this implies that high-gain antennas must be physically large, since according to the diffraction limit, the narrower the beam desired, the larger the antenna must be (measured in wavelengths).\n\nAntenna gain can also be measured in dBd, which is gain in Decibels compared to the maximum intensity direction of a half wave dipole. In the case of Yagi type aerials this more or less equates to the gain one would expect from the aerial under test minus all its directors and reflector. It is important not to confuse dBi and dBd; the two differ by 2.15 dB, with the dBi figure being higher, since a dipole has 2.15 db of gain with respect to an isotropic antenna.\n\nGain is also dependent on the number of elements and the tuning of those elements. Antennas can be tuned to be resonant over a wider spread of frequencies but, all other things being equal, this will mean the gain of the aerial is lower than one tuned for a single frequency or a group of frequencies. For example, in the case of wideband TV antennas the fall off in gain is particularly large at the bottom of the TV transmitting band. In the UK this bottom third of the TV band is known as group A; see gain graph comparing grouped aerials to a wideband aerial of the same size/model.\n\nOther factors may also affect gain such as aperture (the area the antenna collects signal from, almost entirely related to the size of the antenna but for small antennas can be increased by adding a ferrite rod), and efficiency (again, affected by size, but also resistivity of the materials used and impedance matching). These factors are easy to improve without adjusting other features of the antennas or coincidentally improved by the same factors that increase directivity, and so are typically not emphasized.\n\n\nApplications[edit]\n\nHigh gain antennas are typically the largest component of deep space probes, and the highest gain radio antennas are physically enormous structures, such as the Arecibo Observatory. The Deep Space Network uses 35 m dishes at about 1 cm wavelengths. This combination gives the antenna gain of about 100,000,000 (or 80 dB, as normally measured), making the transmitter appear about 100 million times stronger, and a receiver about 100 million times more sensitive, provided the target is within the beam. This beam can cover at most one hundred millionth (10−8) of the sky, so very accurate pointing is required.\n\nUse of high gain and Millimeter-wave communication in WPAN gaining increases the probability of concurrent scheduling of non‐interfering transmissions in a localized area, which results in an immense increase in network throughput. However, the optimum scheduling of concurrent transmission is an NP-Hard problem [2].\n\n\nGallery[edit]\n\n\t\n\tThis section contains what may be an unencyclopedic or excessive gallery of images. Galleries containing indiscriminate images of the article subject are discouraged;  please help improve the section by reducing indiscriminate gallery sections or by moving relevant images beside adjacent text, in accordance with the Manual of Style on use of images. (January 2019) (Learn how and when to remove this template message)\n\n\n\n\t\n\t\t\t\n\n\n\t\t\t\nParabolic antenna - the 70 m antenna at Goldstone\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nHelical antenna\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nA Yagi-Uda antenna. From left to right, the elements mounted on the boom are called the reflector, driven element, and director. The reflector is easily identified as being a bit (5%) longer than the driven element, and the director a bit (5%) shorter.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nA giant phased-array radar in Alaska\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nHolmdel Horn Antenna in Holmdel, New Jersey Built to support the Echo satellite communication program,[3] it was later used in experiments that revealed the cosmic background radiation permeating the universe.[4]\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nVoyager 2 spacecraft. The HGA (a parabolic antenna) is the large bowl-shaped object.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nAn early example (1922) of a directional AM radio transmitter, built for WOR, then in New Jersey and targeting both New York City and Philadelphia.\n\n\n\t\t\t\n\n\t\t\n\n\n\nSee also[edit]\n\n\n\tAmateur radio direction finding\n\tAntenna gain\n\tCantenna\n\tCardioid\n\tCassegrain antenna\n\tCassegrain reflector\n\tLoop antenna\n\tOmnidirectional antenna\n\tParabolic antenna\n\tPhased array\n\tRadio direction finder\n\tRadio propagation model, Antenna subsection\n\n\n\n\nReferences[edit]\n\n\n\t^ \"Low-gain antenna - Oxford Reference\". Cite journal requires |journal= (help)\n\n\t^ Bilal, Muhammad;  et al. (2014). \"Time‐Slotted Scheduling Schemes for Multi‐hop Concurrent Transmission in WPANs with Directional Antenna\". ETRI Journal. 36 (3): 374–384. arXiv:1801.06018. doi:10.4218/etrij.14.0113.0703.\n\n\n\t^ Crawford, A.B. , D.C. Hogg and L.E. Hunt (July 1961). \"Project Echo: A Horn-Reflector Antenna for Space Communication\". The Bell System Technical Journal: 1095–1099.CS1 maint: multiple names: authors list (link)\n\n\n\t^ \"National Park Service: Astronomy and Astrophysics (Horn Antenna)\". 2001-11-05. Archived from the original on 2008-05-12. Retrieved 2008-05-23.\n\n\n\n\n\nExternal links[edit]\n\n\tWhat are high and low gain?\n\n\n\t\tv\n\tt\n\te\n\n\nAntenna types\n\n\tIsotropic\t\n\tIsotropic radiator\n\n\n\n\n\tOmnidirectional\t\n\tBatwing antenna\n\tBiconical antenna\n\tCage aerial\n\tChoke ring antenna\n\tCoaxial antenna\n\tCrossed field antenna\n\tDielectric resonator antenna\n\tDipole antenna\n\tDiscone antenna\n\tFolded unipole antenna\n\tFranklin antenna\n\tGround-plane antenna\n\tHalo antenna\n\tHelical antenna\n\tJ-pole antenna\n\tMast radiator\n\tMonopole antenna\n\tRandom wire antenna\n\tRubber ducky antenna\n\tTurnstile antenna\n\tT2FD antenna\n\tT-antenna\n\tUmbrella antenna\n\tWhip antenna\n\n\n\n\n\tDirectional\t\n\tAdcock antenna\n\tAS-2259 Antenna\n\tAWX antenna\n\tBeverage antenna\n\tCantenna\n\tCassegrain antenna\n\tCollinear antenna array\n\tConformal antenna\n\tCorner reflector antenna\n\tCurtain array\n\tDipole antenna\n\tFolded inverted conformal antenna\n\tFractal antenna\n\tG5RV antenna\n\tGizmotchy\n\tHelical antenna\n\tHorn antenna\n\tInverted-F antenna\n\tInverted vee antenna\n\tLog-periodic antenna\n\tLoop antenna\n\tMicrostrip antenna\n\tMoxon antenna\n\tOffset dish antenna\n\tPatch antenna\n\tPhased array\n\tPlanar array\n\tParabolic antenna\n\tPlasma antenna\n\tQuad antenna\n\tReflective array antenna\n\tRegenerative loop antenna\n\tRhombic antenna\n\tSector antenna\n\tShort backfire antenna\n\tSloper antenna\n\tSlot antenna\n\tSterba antenna\n\tVivaldi antenna\n\tWokFi\n\tYagi–Uda antenna\n\n\n\n\n\tApplication-specific\t\n\tALLISS\n\tCorner reflector (passive)\n\tEvolved antenna\n\tGround dipole\n\tReconfigurable antenna\n\tRectenna\n\tReference antenna\n\tWullenweber\n\tTelevision antenna\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Directional_antenna&oldid=916350797\"\n\n\t\t\n\t\tCategories: \tRadio frequency antenna types\n\tRadio frequency propagation\n\tAntennas (radio)\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tCS1 maint: multiple names: authors list\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tDeutsch\n\tEesti\n\tEspañol\n\tLietuvių\n\tPolski\n\tPortuguês\n\tSuomi\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 18 September 2019, at 13:16 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "3", "dc:title": "Directional antenna - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/0/03/LPDA-large.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-high-gain_antenna", "title": "Directional antenna - Wikipedia"}}