{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHubble Space Telescope - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\n\n\n\n\tHubble Space Telescope\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\"Hubble\" redirects here. For other uses, see Hubble (disambiguation).\n\nSpace telescope\n\n\n\n\n\nHubble Space Telescope\tThe Hubble Space Telescope in orbit as seen from the departing Space Shuttle Atlantis, flying Servicing Mission 4 (STS-125), the fifth and final Hubble mission\n\n\n\t\n\tMission type\tAstronomy\n\tOperator\tNASA · ESA · STScI\n\tCOSPAR ID\t1990-037B\n\tSATCAT no.\t20580\n\tWebsite\tnasa.gov/hubble \nhubblesite.org \nspacetelescope.org\n\tMission duration\tElapsed: 29 years, 5 months, 7 days\n\t\n\n\t\n\tSpacecraft properties\n\tManufacturer\tLockheed (spacecraft) \nPerkin-Elmer (optics)\n\tLaunch mass\t11,110 kg (24,490 lb)[1]\n\tDimensions\t13.2 m × 4.2 m (43.3 ft × 13.8 ft)[1]\n\tPower\t2,800 watts\n\t\n\n\t\n\tStart of mission\n\tLaunch date\tApril 24, 1990, 12:33:51 (1990-04-24UTC12:33:51) UTC[2]\n\tRocket\tSpace Shuttle Discovery (STS-31)\n\tLaunch site\tKennedy LC-39B\n\tDeployment date\tApril 25, 1990[1]\n\tEntered service\tMay 20, 1990[1]\n\t\n\n\t\n\tEnd of mission\n\tDecay date\testimated 2030–2040[3]\n\t\n\n\t\n\tOrbital parameters\n\tReference system\tGeocentric\n\tRegime\tLow Earth\n\tSemi-major axis\t6,917.1 km (4,298.1 mi)\n\tEccentricity\t0.000283\n\tPerigee altitude\t537.0 km (333.7 mi)\n\tApogee altitude\t540.9 km (336.1 mi)\n\tInclination\t28.47°\n\tPeriod\t95.42 minutes\n\tRAAN\t80.34°\n\tArgument of perigee\t64.90°\n\tMean anomaly\t23.78°\n\tMean motion\t15.09 rev/day\n\tVelocity\t7.59 km/s (4.72 mi/s)\n\tEpoch\tAugust 15, 2018, 21:40:27 UTC[4]\n\tRevolution no.\t35,441\n\t\n\n\t\n\tMain telescope\n\tType\tRitchey–Chrétien reflector\n\tDiameter\t2.4 m (7.9 ft)[5]\n\tFocal length\t57.6 m (189 ft)[5]\n\tFocal ratio\tf/24\n\tCollecting area\t4.525 m2 (48.7 sq ft)[5]\n\tWavelengths\tNear-infrared, visible light, ultraviolet\n\t\n\n\t\tInstruments\n\tNear Infrared Camera and Multi-Object Spectrometer\n\tACS\tAdvanced Camera for Surveys\n\tWFC3\tWide Field Camera 3\n\tCOS\tCosmic Origins Spectrograph\n\tSTIS\tSpace Telescope Imaging Spectrograph\n\tFGS\tFine Guidance Sensor\n\n\n\t \n\n\nThe Hubble Space Telescope (often referred to as HST or Hubble) is a space telescope that was launched into low Earth orbit in 1990 and remains in operation. It was not the first space telescope, but it is one of the largest and most versatile and is well known as both a vital research tool and a public relations boon for astronomy. The Hubble telescope is named after astronomer Edwin Hubble and is one of NASA's Great Observatories, along with the Compton Gamma Ray Observatory, the Chandra X-ray Observatory, and the Spitzer Space Telescope.[6]\n\nHubble features a 2.4-meter (7.9 ft) mirror, and its four main instruments observe in the ultraviolet, visible, and near infrared regions of the electromagnetic spectrum.  Hubble's orbit outside the distortion of Earth's atmosphere allows it to take extremely high-resolution images with substantially lower background light than ground-based telescopes. It has recorded some of the most detailed visible light images, allowing a deep view into space.  Many Hubble observations have led to breakthroughs in astrophysics, such as determining the rate of expansion of the universe.\n\nThe Hubble telescope was built by the United States space agency NASA with contributions from the European Space Agency.  The Space Telescope Science Institute (STScI) selects Hubble's targets and processes the resulting data, while the Goddard Space Flight Center controls the spacecraft.[7] Space telescopes were proposed as early as 1923. Hubble was funded in the 1970s, with a proposed launch in 1983, but the project was beset by technical delays, budget problems, and the Challenger disaster (1986). It was finally launched by Space Shuttle Discovery in 1990, but its main mirror had been ground incorrectly and created a spherical aberration, compromising the telescope's capabilities. The optics were corrected to their intended quality by a servicing mission in 1993.\n\nHubble is the only telescope designed to be maintained in space by astronauts. Five Space Shuttle missions have repaired, upgraded, and replaced systems on the telescope, including all five of the main instruments.  The fifth mission was canceled on safety grounds following the Columbia disaster (2003), but NASA administrator Michael D. Griffin approved the fifth servicing mission which was completed in 2009. The telescope is operating as of 2019[update], and could last until 2030–2040.[3] Its successor is the James Webb Space Telescope (JWST) which is scheduled to be launched in March 2021.[8]\n\n\nContents\n\n\n\t1 Conception, design and aim\n\t1.1 Proposals and precursors\n\t1.2 Quest for funding\n\t1.3 Construction and engineering\n\t1.4 Optical Telescope Assembly\n\t1.5 Spacecraft systems\n\t1.6 Computer systems and data processing\n\t1.7 Initial instruments\n\t1.8 Ground support\n\t1.9 Challenger disaster, delays, and eventual launch\n\n\n\n\t2 List of Hubble instruments\n\t3 Flawed mirror\n\t3.1 Origin of the problem\n\t3.2 Design of a solution\n\n\n\n\t4 Servicing missions and new instruments\n\t4.1 Servicing Mission 1\n\t4.2 Servicing Mission 2\n\t4.3 Servicing Mission 3A\n\t4.4 Servicing Mission 3B\n\t4.5 Servicing Mission 4\n\n\n\n\t5 Major projects\n\t5.1 Cosmic Assembly Near-infrared Deep Extragalactic Legacy Survey\n\t5.2 Frontier Fields program\n\t5.3 Cosmic Evolution Survey (COSMOS)\n\n\n\n\t6 Public use\n\t6.1 Policy\n\t6.2 Proposals\n\t6.3 Use by amateur astronomers\n\n\n\n\t7 Scientific results\n\t7.1 Key projects\n\t7.2 Important discoveries\n\t7.2.1 Age of the universe\n\t7.2.2 Expansion of the universe\n\t7.2.3 Black holes\n\t7.2.4 Extending visible wavelength images\n\t7.2.5 Solar system discoveries\n\t7.2.6 Supernova reappearance\n\t7.2.7 Mass and size of Milky Way\n\t7.2.8 Other discoveries\n\n\n\n\t7.3 Impact on astronomy\n\t7.4 Impact on aerospace engineering\n\n\n\n\t8 Hubble data\n\t8.1 Transmission to Earth\n\t8.2 Color images\n\t8.3 Archives\n\t8.4 Pipeline reduction\n\t8.5 Data analysis\n\n\n\n\t9 Outreach activities\n\t9.1 Celebration images\n\n\n\n\t10 Equipment failures\n\t10.1 Gyroscope rotation sensors\n\t10.2 Instruments and electronics\n\n\n\n\t11 Future\n\t11.1 Orbital decay and controlled reentry\n\t11.2 Possible commercial service missions\n\t11.3 Successors\n\n\n\n\t12 See also\n\t13 References\n\t13.1 Bibliography\n\n\n\n\t14 Further reading\n\t15 External links\n\n\n\n\n\nConception, design and aim[edit]\n\nProposals and precursors[edit]\n\n  \nAstronaut Owen Garriott works next to Skylab's manned solar space observatory, 1973\n\n\n\nIn 1923, Hermann Oberth—considered a father of modern rocketry, along with Robert H. Goddard and Konstantin Tsiolkovsky—published Die Rakete zu den Planetenräumen (\"The Rocket into Planetary Space\"), which mentioned how a telescope could be propelled into Earth orbit by a rocket.[9]\n\nThe history of the Hubble Space Telescope can be traced back as far as 1946, to the astronomer Lyman Spitzer's paper \"Astronomical advantages of an extraterrestrial observatory\".[10] In it, he discussed the two main advantages that a space-based observatory would have over ground-based telescopes. First, the angular resolution (the smallest separation at which objects can be clearly distinguished) would be limited only by diffraction, rather than by the turbulence in the atmosphere, which causes stars to twinkle, known to astronomers as seeing. At that time ground-based telescopes were limited to resolutions of 0.5–1.0 arcseconds, compared to a theoretical diffraction-limited resolution of about 0.05 arcsec for a telescope with a mirror 2.5 m (8.2 ft) in diameter. Second, a space-based telescope could observe infrared and ultraviolet light, which are strongly absorbed by the atmosphere.\n\nSpitzer devoted much of his career to pushing for the development of a space telescope. In 1962, a report by the US National Academy of Sciences recommended the development of a space telescope as part of the space program, and in 1965 Spitzer was appointed as head of a committee given the task of defining scientific objectives for a large space telescope.[11]\n\nSpace-based astronomy had begun on a very small scale following World War II, as scientists made use of developments that had taken place in rocket technology. The first ultraviolet spectrum of the Sun was obtained in 1946,[12] and the National Aeronautics and Space Administration (NASA) launched the Orbiting Solar Observatory (OSO) to obtain UV, X-ray, and gamma-ray spectra in 1962.[13] An orbiting solar telescope was launched in 1962 by the United Kingdom as part of the Ariel space program, and in 1966 NASA launched the first Orbiting Astronomical Observatory (OAO) mission. OAO-1's battery failed after three days, terminating the mission. It was followed by OAO-2, which carried out ultraviolet observations of stars and galaxies from its launch in 1968 until 1972, well beyond its original planned lifetime of one year.[14]\n\nThe OSO and OAO missions demonstrated the important role space-based observations could play in astronomy. In 1968, NASA developed firm plans for a space-based reflecting telescope with a mirror 3 m (9.8 ft) in diameter, known provisionally as the Large Orbiting Telescope or Large Space Telescope (LST), with a launch slated for 1979. These plans emphasized the need for manned maintenance missions to the telescope to ensure such a costly program had a lengthy working life, and the concurrent development of plans for the reusable Space Shuttle indicated that the technology to allow this was soon to become available.[15]\n\n\nQuest for funding[edit]\n\nThe continuing success of the OAO program encouraged increasingly strong consensus within the astronomical community that the LST should be a major goal. In 1970, NASA established two committees, one to plan the engineering side of the space telescope project, and the other to determine the scientific goals of the mission. Once these had been established, the next hurdle for NASA was to obtain funding for the instrument, which would be far more costly than any Earth-based telescope. The U.S. Congress questioned many aspects of the proposed budget for the telescope and forced cuts in the budget for the planning stages, which at the time consisted of very detailed studies of potential instruments and hardware for the telescope. In 1974, public spending cuts led to Congress deleting all funding for the telescope project.[16]\n\nIn response a nationwide lobbying effort was coordinated among astronomers. Many astronomers met congressmen and senators in person, and large scale letter-writing campaigns were organized. The National Academy of Sciences published a report emphasizing the need for a space telescope, and eventually the Senate agreed to half of the budget that had originally been approved by Congress.[17]\n\nThe funding issues led to something of a reduction in the scale of the project, with the proposed mirror diameter reduced from 3 m to 2.4 m, both to cut costs[18] and to allow a more compact and effective configuration for the telescope hardware. A proposed precursor 1.5 m (4.9 ft) space telescope to test the systems to be used on the main satellite was dropped, and budgetary concerns also prompted collaboration with the European Space Agency. ESA agreed to provide funding and supply one of the first generation instruments for the telescope, as well as the solar cells that would power it, and staff to work on the telescope in the United States, in return for European astronomers being guaranteed at least 15% of the observing time on the telescope.[19] Congress eventually approved funding of US$36 million for 1978, and the design of the LST began in earnest, aiming for a launch date of 1983.[17] In 1983 the telescope was named after Edwin Hubble,[20] who confirmed one of the greatest scientific breakthroughs of the 20th century made by Georges Lemaître that the universe is expanding.[21]\n\n\nConstruction and engineering[edit]\n\n  \nGrinding of Hubble's primary mirror at Perkin-Elmer, March 1979\n\n\n\nOnce the Space Telescope project had been given the go-ahead, work on the program was divided among many institutions. Marshall Space Flight Center (MSFC) was given responsibility for the design, development, and construction of the telescope, while Goddard Space Flight Center was given overall control of the scientific instruments and ground-control center for the mission.[22] MSFC commissioned the optics company Perkin-Elmer to design and build the Optical Telescope Assembly (OTA) and Fine Guidance Sensors for the space telescope. Lockheed was commissioned to construct and integrate the spacecraft in which the telescope would be housed.[23]\n\n\nOptical Telescope Assembly[edit]\n\nOptically, the HST is a Cassegrain reflector of Ritchey–Chrétien design, as are most large professional telescopes. This design, with two hyperbolic mirrors, is known for good imaging performance over a wide field of view, with the disadvantage that the mirrors have shapes that are hard to fabricate and test. The mirror and optical systems of the telescope determine the final performance, and they were designed to exacting specifications. Optical telescopes typically have mirrors polished to an accuracy of about a tenth of the wavelength of visible light, but the Space Telescope was to be used for observations from the visible through the ultraviolet (shorter wavelengths) and was specified to be diffraction limited to take full advantage of the space environment. Therefore, its mirror needed to be polished to an accuracy of 10 nanometers (0.4 microinches), or about 1/65 of the wavelength of red light.[24] On the long wavelength end, the OTA was not designed with optimum IR performance in mind—for example, the mirrors are kept at stable (and warm, about 15 °C) temperatures by heaters. This limits Hubble's performance as an infrared telescope.[25]\n\n\n  \nThe backup mirror, by Kodak; its inner support structure can be seen because it is not coated with a reflective surface\n\n\n\nPerkin-Elmer intended to use custom-built and extremely sophisticated computer-controlled polishing machines to grind the mirror to the required shape.[23] However, in case their cutting-edge technology ran into difficulties, NASA demanded that PE sub-contract to Kodak to construct a back-up mirror using traditional mirror-polishing techniques.[26] (The team of Kodak and Itek also bid on the original mirror polishing work. Their bid called for the two companies to double-check each other's work, which would have almost certainly caught the polishing error that later caused such problems.[27]) The Kodak mirror is now on permanent display at the National Air and Space Museum.[28][29] An Itek mirror built as part of the effort is now used in the 2.4 m telescope at the Magdalena Ridge Observatory.[30]\n\nConstruction of the Perkin-Elmer mirror began in 1979, starting with a blank manufactured by Corning from their ultra-low expansion glass. To keep the mirror's weight to a minimum it consisted of top and bottom plates, each one inch (25 mm) thick, sandwiching a honeycomb lattice. Perkin-Elmer simulated microgravity by supporting the mirror from the back with 130 rods that exerted varying amounts of force.[31] This ensured that the mirror's final shape would be correct and to specification when finally deployed. Mirror polishing continued until May 1981. NASA reports at the time questioned Perkin-Elmer's managerial structure, and the polishing began to slip behind schedule and over budget. To save money, NASA halted work on the back-up mirror and put the launch date of the telescope back to October 1984.[32] The mirror was completed by the end of 1981; it was washed using 2,400 US gallons (9,100 L) of hot, deionized water and then received a reflective coating of 65 nm-thick (2.6 μin) aluminum and a protective coating of 25 nm-thick (0.98 μin) magnesium fluoride.[25][33]\n\n\n  \nThe OTA, metering truss, and secondary baffle are visible in this image of Hubble during early construction.\n\n\n\nDoubts continued to be expressed about Perkin-Elmer's competence on a project of this importance, as their budget and timescale for producing the rest of the OTA continued to inflate. In response to a schedule described as \"unsettled and changing daily\", NASA postponed the launch date of the telescope until April 1985. Perkin-Elmer's schedules continued to slip at a rate of about one month per quarter, and at times delays reached one day for each day of work. NASA was forced to postpone the launch date until March and then September 1986. By this time, the total project budget had risen to US$1.175 billion.[34]\n\n\nSpacecraft systems[edit]\n\nThe spacecraft in which the telescope and instruments were to be housed was another major engineering challenge. It would have to withstand frequent passages from direct sunlight into the darkness of Earth's shadow, which would cause major changes in temperature, while being stable enough to allow extremely accurate pointing of the telescope. A shroud of multi-layer insulation keeps the temperature within the telescope stable and surrounds a light aluminum shell in which the telescope and instruments sit. Within the shell, a graphite-epoxy frame keeps the working parts of the telescope firmly aligned.[35] Because graphite composites are hygroscopic, there was a risk that water vapor absorbed by the truss while in Lockheed's clean room would later be expressed in the vacuum of space; resulting in the telescope's instruments being covered by ice. To reduce that risk, a nitrogen gas purge was performed before launching the telescope into space.[36]\n\nWhile construction of the spacecraft in which the telescope and instruments would be housed proceeded somewhat more smoothly than the construction of the OTA, Lockheed still experienced some budget and schedule slippage, and by the summer of 1985, construction of the spacecraft was 30% over budget and three months behind schedule. An MSFC report said that Lockheed tended to rely on NASA directions rather than take their own initiative in the construction.[37]\n\n\nComputer systems and data processing[edit]\n\n  \nDF-224 in Hubble, before it was replaced in 1999\n\n\n\nThe two initial, primary computers on the HST were the 1.25 MHz DF-224 system, built by Rockwell Autonetics, which contained three redundant CPUs, and two redundant NSSC-1 (NASA Standard Spacecraft Computer, Model 1) systems, developed by Westinghouse and GSFC using diode–transistor logic (DTL). A co-processor for the DF-224 was added during Servicing Mission 1 in 1993, which consisted of two redundant strings of an Intel-based 80386 processor with an 80387 math co-processor.[38] The DF-224 and its 386 co-processor were replaced by a 25 MHz Intel-based 80486 processor system during Servicing Mission 3A in 1999.[39] The new computer is 20 times faster, with six times more memory, than the DF-224 it replaced. It increases throughput by moving some computing tasks from the ground to the spacecraft and saves money by allowing the use of modern programming languages.[40]\n\nAdditionally, some of the science instruments and components had their own embedded microprocessor-based control systems. The MATs (Multiple Access Transponder) components, MAT-1 and MAT-2, utilize Hughes Aircraft CDP1802CD microprocessors.[41] The Wide Field and Planetary Camera (WFPC) also utilized an RCA 1802 microprocessor (or possibly the older 1801 version).[42] The WFPC-1 was replaced by the WFPC-2 during Servicing Mission 1 in 1993, which was then replaced by the Wide Field Camera 3 (WFC3) during Servicing Mission 4 in 2009.\n\n\nInitial instruments[edit]\n\n  \nExploded view of the Hubble Space Telescope\n\n\n\nMain articles: Wide Field and Planetary Camera, Goddard High Resolution Spectrograph, High Speed Photometer, Faint Object Camera, and Faint Object Spectrograph\n\nWhen launched, the HST carried five scientific instruments: the Wide Field and Planetary Camera (WF/PC), Goddard High Resolution Spectrograph (GHRS), High Speed Photometer (HSP), Faint Object Camera (FOC) and the Faint Object Spectrograph (FOS). WF/PC was a high-resolution imaging device primarily intended for optical observations. It was built by NASA's Jet Propulsion Laboratory, and incorporated a set of 48 filters isolating spectral lines of particular astrophysical interest. The instrument contained eight charge-coupled device (CCD) chips divided between two cameras, each using four CCDs.  Each CCD has a resolution of 0.64 megapixels.[43] The \"wide field camera\" (WFC) covered a large angular field at the expense of resolution, while the \"planetary camera\" (PC) took images at a longer effective focal length than the WF chips, giving it a greater magnification.[44]\n\nThe GHRS was a spectrograph designed to operate in the ultraviolet. It was built by the Goddard Space Flight Center and could achieve a spectral resolution of 90,000.[45] Also optimized for ultraviolet observations were the FOC and FOS, which were capable of the highest spatial resolution of any instruments on Hubble. Rather than CCDs these three instruments used photon-counting digicons as their detectors. The FOC was constructed by ESA, while the University of California, San Diego, and Martin Marietta Corporation built the FOS.[44]\n\nThe final instrument was the HSP, designed and built at the University of Wisconsin–Madison. It was optimized for visible and ultraviolet light observations of variable stars and other astronomical objects varying in brightness. It could take up to 100,000 measurements per second with a photometric accuracy of about 2% or better.[46]\n\nHST's guidance system can also be used as a scientific instrument. Its three Fine Guidance Sensors (FGS) are primarily used to keep the telescope accurately pointed during an observation, but can also be used to carry out extremely accurate astrometry; measurements accurate to within 0.0003 arcseconds have been achieved.[47]\n\n\nGround support[edit]\n\n  \nHubble Control Center at Goddard Space Flight Center, 1999\n\n\n\nMain article: Space Telescope Science Institute\n\nThe Space Telescope Science Institute (STScI) is responsible for the scientific operation of the telescope and the delivery of data products to astronomers. STScI is operated by the Association of Universities for Research in Astronomy (AURA) and is physically located in Baltimore, Maryland on the Homewood campus of Johns Hopkins University, one of the 39 US universities and seven international affiliates that make up the AURA consortium. STScI was established in 1981[48][49] after something of a power struggle between NASA and the scientific community at large. NASA had wanted to keep this function in-house, but scientists wanted it to be based in an academic establishment.[50][51] The Space Telescope European Coordinating Facility (ST-ECF), established at Garching bei München near Munich in 1984, provided similar support for European astronomers until 2011, when these activities were moved to the European Space Astronomy Centre.\n\n\n\nHubble's low orbit means many targets are visible for slightly more than half of an orbit's elapsed time, since they are blocked from view by the Earth for almost one-half of each orbit.\n\n\nAnimation of Hubble's orbit from October 31, 2018, to December 25, 2018. Earth is not shown.\n\n\n\n\n\nOne rather complex task that falls to STScI is scheduling observations for the telescope.[52] Hubble is in a low-Earth orbit to enable servicing missions, but this means that most astronomical targets are occulted by the Earth for slightly less than half of each orbit. Observations cannot take place when the telescope passes through the South Atlantic Anomaly due to elevated radiation levels, and there are also sizable exclusion zones around the Sun (precluding observations of Mercury), Moon and Earth. The solar avoidance angle is about 50°, to keep sunlight from illuminating any part of the OTA. Earth and Moon avoidance keeps bright light out of the FGSs, and keeps scattered light from entering the instruments. If the FGSs are turned off, however, the Moon and Earth can be observed. Earth observations were used very early in the program to generate flat-fields for the WFPC1 instrument. There is a so-called continuous viewing zone (CVZ), at roughly 90° to the plane of Hubble's orbit, in which targets are not occulted for long periods. Due to the precession of the orbit, the location of the CVZ moves slowly over a period of eight weeks. Because the limb of the Earth is always within about 30° of regions within the CVZ, the brightness of scattered earthshine may be elevated for long periods during CVZ observations.\n\nHubble orbits in low Earth orbit at an altitude of approximately 540 kilometers (340 mi) and an inclination of 28.5°.[4] The position along its orbit changes over time in a way that is not accurately predictable. The density of the upper atmosphere varies according to many factors, and this means that Hubble's predicted position for six weeks' time could be in error by up to 4,000 km (2,500 mi). Observation schedules are typically finalized only a few days in advance, as a longer lead time would mean there was a chance that the target would be unobservable by the time it was due to be observed.[53]\n\nEngineering support for HST is provided by NASA and contractor personnel at the Goddard Space Flight Center in Greenbelt, Maryland, 48 km (30 mi) south of the STScI. Hubble's operation is monitored 24 hours per day by four teams of flight controllers who make up Hubble's Flight Operations Team.[52]\n\n\nChallenger disaster, delays, and eventual launch[edit]\n\n  \nSTS-31 lifts off, carrying Hubble into orbit.\n\n\n\n  \nHubble being deployed from Discovery in 1990.\n\n\n\nBy early 1986, the planned launch date of October that year looked feasible, but the Challenger accident brought the U.S. space program to a halt, grounding the Space Shuttle fleet and forcing the launch of Hubble to be postponed for several years. The telescope had to be kept in a clean room, powered up and purged with nitrogen, until a launch could be rescheduled. This costly situation (about US$6 million per month) pushed the overall costs of the project even higher. This delay did allow time for engineers to perform extensive tests, swap out a possibly failure-prone battery, and make other improvements.[54] Furthermore, the ground software needed to control Hubble was not ready in 1986, and was barely ready by the 1990 launch.[55]\n\nEventually, following the resumption of shuttle flights in 1988, the launch of the telescope was scheduled for 1990. On April 24, 1990, Space Shuttle Discovery successfully launched the telescope into its planned orbit during the STS-31 mission.[56]\n\nFrom its original total cost estimate of about US$400 million, the telescope cost about US$4.7 billion by the time of its launch. Hubble's cumulative costs were estimated to be about US$10 billion in 2010, twenty years after launch.[57]\n\n\nList of Hubble instruments[edit]\n\nHubble accommodates five science instruments at a given time, plus the Fine Guidance Sensors, which are mainly used for aiming the telescope but are occasionally used for scientific astrometry measurements. Early instruments were replaced with more advanced ones during the Shuttle servicing missions. COSTAR was a corrective optics device rather than a science instrument, but occupied one of the five instrument bays.\n\nSince the final servicing mission in 2009, the four active instruments have been ACS, COS, STIS and WFC3. NICMOS is kept in hibernation, but may be revived if WFC3 were to fail in the future.\n\n\n\tAdvanced Camera for Surveys (ACS; 2002–present)\n\tCosmic Origins Spectrograph (COS; 2009–present)\n\tCorrective Optics Space Telescope Axial Replacement (COSTAR; 1993–2009)\n\tFaint Object Camera (FOC; 1990–2002)\n\tFaint Object Spectrograph (FOS; 1990–1997)\n\tFine Guidance Sensor (FGS; 1990–present)\n\tGoddard High Resolution Spectrograph (GHRS/HRS; 1990–1997)\n\tHigh Speed Photometer (HSP; 1990–1993)\n\tNear Infrared Camera and Multi-Object Spectrometer (NICMOS; 1997–present, hibernating since 2008)\n\tSpace Telescope Imaging Spectrograph (STIS; 1997–present (non-operative 2004–2009))\n\tWide Field and Planetary Camera (WFPC; 1990–1993)\n\tWide Field and Planetary Camera 2 (WFPC2; 1993–2009)\n\tWide Field Camera 3 (WFC3; 2009–present)\n\n\nOf the former instruments, three (COSTAR, FOS and WFPC2) are displayed in the Smithsonian National Air and Space Museum. The FOC is in the Dornier museum, Germany. The HSP is in the Space Place at the University of Wisconsin–Madison. The first WFPC was dismantled, and some components were then re-used in WFC3.\n\n\nFlawed mirror[edit]\n\n  \nAn extract from a WF/PC image shows the light from a star spread over a wide area instead of being concentrated on a few pixels.\n\n\n\nWithin weeks of the launch of the telescope, the returned images indicated a serious problem with the optical system. Although the first images appeared to be sharper than those of ground-based telescopes, Hubble failed to achieve a final sharp focus and the best image quality obtained was drastically lower than expected. Images of point sources spread out over a radius of more than one arcsecond, instead of having a point spread function (PSF) concentrated within a circle 0.1 arcsec in diameter as had been specified in the design criteria.[58][59]\n\nAnalysis of the flawed images showed that the cause of the problem was that the primary mirror had been polished to the wrong shape. Although it was probably the most precisely figured optical mirror ever made, smooth to about 10 nm (0.4 μin),[24] at the perimeter it was too flat by about 2,200 nanometers (2.2 micrometers; 87 microinches).[60] This difference was catastrophic, introducing severe spherical aberration, a flaw in which light reflecting off the edge of a mirror focuses on a different point from the light reflecting off its center.[61]\n\nThe effect of the mirror flaw on scientific observations depended on the particular observation—the core of the aberrated PSF was sharp enough to permit high-resolution observations of bright objects, and spectroscopy of point sources was only affected through a sensitivity loss. However, the loss of light to the large, out-of-focus halo severely reduced the usefulness of the telescope for faint objects or high-contrast imaging. This meant that nearly all of the cosmological programs were essentially impossible, since they required observation of exceptionally faint objects.[61] NASA and the telescope became the butt of many jokes, and the project was popularly regarded as a white elephant. For instance, in the 1991 comedy The Naked Gun 2½: The Smell of Fear, in a scene where high-profile disasters were displayed, Hubble was pictured with Lusitania, the Hindenburg, and the Edsel.[62] Nonetheless, during the first three years of the Hubble mission, before the optical corrections, the telescope still carried out a large number of productive observations of less demanding targets.[63] The error was well characterized and stable, enabling astronomers to partially compensate for the defective mirror by using sophisticated image processing techniques such as deconvolution.[64]\n\n\nOrigin of the problem[edit]\n\n  \nOptical evolution of Hubble's primary camera system. These images show spiral galaxy M100 as seen with WFPC1 in 1993 before corrective optics (left), with WFPC2 in 1994 after correction (center), and with WFC3 in 2018 (right).\n\n\n\nA commission headed by Lew Allen, director of the Jet Propulsion Laboratory, was established to determine how the error could have arisen. The Allen Commission found that a reflective null corrector, a testing device used to achieve a properly shaped non-spherical mirror, had been incorrectly assembled—one lens was out of position by 1.3 mm (0.051 in).[65]  During the initial grinding and polishing of the mirror, Perkin-Elmer analyzed its surface with two conventional refractive null correctors.  However, for the final manufacturing step (figuring), they switched to the custom-built reflective null corrector, designed explicitly to meet very strict tolerances. The incorrect assembly of this device resulted in the mirror being ground very precisely but to the wrong shape.  A few final tests, using the conventional null correctors, correctly reported spherical aberration.  But these results were dismissed, thus missing the opportunity to catch the error, because the reflective null corrector was considered more accurate.[66]\n\nThe commission blamed the failings primarily on Perkin-Elmer. Relations between NASA and the optics company had been severely strained during the telescope construction, due to frequent schedule slippage and cost overruns. NASA found that Perkin-Elmer did not review or supervise the mirror construction adequately, did not assign its best optical scientists to the project (as it had for the prototype), and in particular did not involve the optical designers in the construction and verification of the mirror. While the commission heavily criticized Perkin-Elmer for these managerial failings, NASA was also criticized for not picking up on the quality control shortcomings, such as relying totally on test results from a single instrument.[67]\n\n\nDesign of a solution[edit]\n\n  \nSome of the Carina nebula by WFC3\n\n\n\nThe design of the telescope had always incorporated servicing missions, and astronomers immediately began to seek potential solutions to the problem that could be applied at the first servicing mission, scheduled for 1993. While Kodak had ground a back-up mirror for Hubble, it would have been impossible to replace the mirror in orbit, and too expensive and time-consuming to bring the telescope back to Earth for a refit. Instead, the fact that the mirror had been ground so precisely to the wrong shape led to the design of new optical components with exactly the same error but in the opposite sense, to be added to the telescope at the servicing mission, effectively acting as \"spectacles\" to correct the spherical aberration.[68][69]\n\nThe first step was a precise characterization of the error in the main mirror. Working backwards from images of point sources, astronomers determined that the conic constant of the mirror as built was −1.01390±0.0002, instead of the intended −1.00230.[70][71] The same number was also derived by analyzing the null corrector used by Perkin-Elmer to figure the mirror, as well as by analyzing interferograms obtained during ground testing of the mirror.[72]\n\n\n  \nCOSTAR being removed in 2009\n\n\n\nBecause of the way the HST's instruments were designed, two different sets of correctors were required. The design of the Wide Field and Planetary Camera 2, already planned to replace the existing WF/PC, included relay mirrors to direct light onto the four separate charge-coupled device (CCD) chips making up its two cameras.  An inverse error built into their surfaces could completely cancel the aberration of the primary. However, the other instruments lacked any intermediate surfaces that could be figured in this way, and so required an external correction device.[73]\n\nThe Corrective Optics Space Telescope Axial Replacement (COSTAR) system was designed to correct the spherical aberration for light focused at the FOC, FOS, and GHRS. It consists of two mirrors in the light path with one ground to correct the aberration.[74] To fit the COSTAR system onto the telescope, one of the other instruments had to be removed, and astronomers selected the High Speed Photometer to be sacrificed.[73] By 2002, all of the original instruments requiring COSTAR had been replaced by instruments with their own corrective optics.[75] COSTAR was removed and returned to Earth in 2009 where it is exhibited at the National Air and Space Museum. The area previously used by COSTAR is now occupied by the Cosmic Origins Spectrograph.[76]\n\n\n\n\nServicing missions and new instruments[edit]\n\n\n\n\n\n\nHubble was designed to accommodate regular servicing and equipment upgrades while in orbit.  Instruments and limited life items were designed as orbital replacement units.[77] Five servicing missions (SM 1, 2, 3A, 3B, and 4) were flown by NASA space shuttles, the first in December 1993 and the last in May 2009.[78] Servicing missions were delicate operations that began with maneuvering to intercept the telescope in orbit and carefully retrieving it with the shuttle's mechanical arm. The necessary work was then carried out in multiple tethered spacewalks over a period of four to five days. After a visual inspection of the telescope, astronauts conducted repairs, replaced failed or degraded components, upgraded equipment, and installed new instruments. Once work was completed, the telescope was redeployed, typically after boosting to a higher orbit to address the orbital decay caused by atmospheric drag.[79]\n\n\nServicing Mission 1[edit]\n\nMain article: STS-61\n\n  \nAstronauts Musgrave and Hoffman install corrective optics during SM1\n\n\n\nAfter the problems with Hubble's mirror were discovered, the first servicing mission assumed greater importance, as the astronauts would need to do extensive work to install corrective optics. The seven astronauts for the mission were trained to use about a hundred specialized tools.[80] SM1 flew aboard Endeavour in December 1993, and involved installation of several instruments and other equipment over ten days.\n\nMost importantly, the High Speed Photometer was replaced with the COSTAR corrective optics package, and WFPC was replaced with the Wide Field and Planetary Camera 2 (WFPC2) with an internal optical correction system. The solar arrays and their drive electronics were also replaced, as well as four gyroscopes in the telescope pointing system, two electrical control units and other electrical components, and two magnetometers. The onboard computers were upgraded with added coprocessors, and Hubble's orbit was boosted.[60]\n\nOn January 13, 1994, NASA declared the mission a complete success and showed the first sharper images.[81] The mission was one of the most complex performed up until that date, involving five long extra-vehicular activity periods. Its success was a boon for NASA, as well as for the astronomers who now had a more capable space telescope.\n\n\nServicing Mission 2[edit]\n\nMain article: STS-82\n\n  \nHubble as seen from Discovery during its second servicing mission\n\n\n\nServicing Mission 2, flown by Discovery in February 1997, replaced the GHRS and the FOS with the Space Telescope Imaging Spectrograph (STIS) and the Near Infrared Camera and Multi-Object Spectrometer (NICMOS), replaced an Engineering and Science Tape Recorder with a new Solid State Recorder, and repaired thermal insulation.[82] NICMOS contained a heat sink of solid nitrogen to reduce the thermal noise from the instrument, but shortly after it was installed, an unexpected thermal expansion resulted in part of the heat sink coming into contact with an optical baffle. This led to an increased warming rate for the instrument and reduced its original expected lifetime of 4.5 years to about 2 years.[83]\n\n\nServicing Mission 3A[edit]\n\nMain article: STS-103\n\nServicing Mission 3A, flown by Discovery, took place in December 1999, and was a split-off from Servicing Mission 3 after three of the six onboard gyroscopes had failed. The fourth failed a few weeks before the mission, rendering the telescope incapable of performing scientific observations. The mission replaced all six gyroscopes, replaced a Fine Guidance Sensor and the computer, installed a Voltage/temperature Improvement Kit (VIK) to prevent battery overcharging, and replaced thermal insulation blankets.[84]\n\n\nServicing Mission 3B[edit]\n\nMain article: STS-109\n\nServicing Mission 3B flown by Columbia in March 2002 saw the installation of a new instrument, with the FOC (which, except for the Fine Guidance Sensors when used for astrometry, was the last of the original instruments) being replaced by the Advanced Camera for Surveys (ACS). This meant that COSTAR was no longer required, since all new instruments had built-in correction for the main mirror aberration.[75] The mission also revived NICMOS by installing a closed-cycle cooler[83] and replaced the solar arrays for the second time, providing 30 percent more power.[85]\n\n\n\n\nServicing Mission 4[edit]\n\nMain article: STS-125\n\n\n\nHubble during Servicing Mission 4\n\n\n\nHubble after release\n\n\n\n\n\nPlans called for Hubble to be serviced in February 2005, but the Columbia disaster in 2003, in which the orbiter disintegrated on re-entry into the atmosphere, had wide-ranging effects on the Hubble program. NASA Administrator Sean O'Keefe decided that all future shuttle missions had to be able to reach the safe haven of the International Space Station should in-flight problems develop. As no shuttles were capable of reaching both HST and the space station during the same mission, future crewed service missions were canceled.[86] This decision was criticised by numerous astronomers who felt that Hubble was valuable enough to merit the human risk.[87] HST's planned successor, the James Webb Telescope (JWST), was not expected to launch until at least 2021. A gap in space-observing capabilities between a decommissioning of Hubble and the commissioning of a successor was of major concern to many astronomers, given the significant scientific impact of HST.[88] The consideration that JWST will not be located in low Earth orbit, and therefore cannot be easily upgraded or repaired in the event of an early failure, only made concerns more acute. On the other hand, many astronomers felt strongly that the servicing of Hubble should not take place if the expense were to come from the JWST budget.\n\nIn January 2004, O'Keefe said he would review his decision to cancel the final servicing mission to HST, due to public outcry and requests from Congress for NASA to look for a way to save it. The National Academy of Sciences convened an official panel, which recommended in July 2004 that the HST should be preserved despite the apparent risks. Their report urged \"NASA should take no actions that would preclude a space shuttle servicing mission to the Hubble Space Telescope\".[89] In August 2004, O'Keefe asked Goddard Space Flight Center to prepare a detailed proposal for a robotic service mission. These plans were later canceled, the robotic mission being described as \"not feasible\".[90] In late 2004, several Congressional members, led by Senator Barbara Mikulski, held public hearings and carried on a fight with much public support (including thousands of letters from school children across the U.S.) to get the Bush Administration and NASA to reconsider the decision to drop plans for a Hubble rescue mission.[91]\n\n\n  \nNickel–hydrogen battery pack for Hubble\n\n\n\nThe nomination in April 2005 of a new NASA Administrator with an engineering rather than accounting background, Michael D. Griffin, changed the situation, as Griffin stated he would consider a manned servicing mission.[92] Soon after his appointment Griffin authorized Goddard to proceed with preparations for a manned Hubble maintenance flight, saying he would make the final decision after the next two shuttle missions. In October 2006 Griffin gave the final go-ahead, and the 11-day mission by Atlantis was scheduled for October 2008. Hubble's main data-handling unit failed in September 2008,[93] halting all reporting of scientific data until its back-up was brought online on October 25, 2008.[94] Since a failure of the backup unit would leave the HST helpless, the service mission was postponed to incorporate a replacement for the primary unit.[93]\n\nServicing Mission 4 (SM4), flown by Atlantis in May 2009, was the last scheduled shuttle mission for HST.[76][95] SM4 installed the replacement data-handling unit, repaired the ACS and STIS systems, installed improved nickel hydrogen batteries, and replaced other components. SM4 also installed two new observation instruments—Wide Field Camera 3 (WFC3) and the Cosmic Origins Spectrograph (COS)[96]—and the Soft Capture and Rendezvous System, which will enable the future rendezvous, capture, and safe disposal of Hubble by either a crewed or robotic mission.[97] Except for the ACS's High Resolution Channel, which could not be repaired and was disabled,[98][99][100] the work accomplished during SM4 rendered the telescope fully functional,[76] and it remains so as of 2019[update].[101]\n\n\nMajor projects[edit]\n\n  \nOne of Hubble's most famous images, Pillars of Creation, shows stars forming in the Eagle Nebula (2014 image).\n\n\n\nSince the start of the program, a number of research projects have been carried out, some of them almost solely with Hubble, others coordinated facilities such as Chandra X-ray Observatory and ESO's Very Large Telescope.  Although the Hubble observatory is nearing the end of its life, there are still major projects scheduled for it.  One example is the upcoming Frontier Fields program,[102] inspired by the results of Hubble's deep observation of the galaxy cluster Abell 1689.[103]\n\n\nCosmic Assembly Near-infrared Deep Extragalactic Legacy Survey[edit]\n\nIn an August 2013 press release, CANDELS was referred to as \"the largest project in the history of Hubble\". The survey \"aims to explore galactic evolution in the early Universe, and the very first seeds of cosmic structure at less than one billion years after the Big Bang.\"[104] The CANDELS project site describes the survey's goals as the following:[105]\n\n\nThe Cosmic Assembly Near-IR Deep Extragalactic Legacy Survey is designed to document the first third of galactic evolution from z = 8 to 1.5 via deep imaging of more than 250,000 galaxies with WFC3/IR and ACS. It will also find the first Type Ia SNe beyond z > 1.5 and establish their accuracy as standard candles for cosmology. Five premier multi-wavelength sky regions are selected; each has multi-wavelength data from Spitzer and other facilities, and has extensive spectroscopy of the brighter galaxies. The use of five widely separated fields mitigates cosmic variance and yields statistically robust and complete samples of galaxies down to 109 solar masses out to z ~ 8.\n\n\nFrontier Fields program[edit]\n\n  \nThe Frontier Fields program studied MACS0416.1-2403\n\n\n\nThe program, officially named \"Hubble Deep Fields Initiative 2012\", is aimed to advance the knowledge of early galaxy formation by studying high-redshift galaxies in blank fields with the help of gravitational lensing to see the \"faintest galaxies in the distant universe.\"[102] The Frontier Fields web page describes the goals of the program being:\n\n\n\tto reveal hitherto inaccessible populations of z = 5–10 galaxies that are 10 to 50 times fainter intrinsically than any presently known\n\tto solidify our understanding of the stellar masses and star formation histories of sub-L* galaxies at the earliest times\n\tto provide the first statistically meaningful morphological characterization of star forming galaxies at z > 5\n\tto find z > 8 galaxies stretched out enough by cluster lensing to discern internal structure and/or magnified enough by cluster lensing for spectroscopic follow-up.[106]\n\n\nCosmic Evolution Survey (COSMOS)[edit]\n\nThe Cosmic Evolution Survey (COSMOS)[107] is an astronomical survey designed to probe the formation and evolution of galaxies as a function of both cosmic time (redshift) and the local galaxy environment.  The survey covers a 2 square degree equatorial field with spectroscopy and X-ray to radio imaging by most of the major space-based telescopes and a number of large ground based telescopes,[108] making it a key focus region of extragalactic astrophysics. COSMOS was launched in 2006 as the largest project pursued by the Hubble Space Telescope at the time, and still is the largest continuous area of sky covered for the purposes of mapping deep space in blank fields, 2.5 times the area of the moon on the sky and 17 times larger than the largest of the CANDELS regions.  The COSMOS scientific collaboration that was forged from the initial COSMOS survey is the largest and longest-running extragalactic collaboration, known for its collegiality and openness.  The study of galaxies in their environment can only be done with large areas of the sky, larger than a half square degree.[109]  Over 2 million galaxies are detected, spanning 90% of the age of the Universe. The COSMOS collaboration is led by Caitlin Casey, Jeyhan Kartaltepe, and Vernesa Smolcic and involves more than 200 scientists in a dozen countries.[107]\n\n\nPublic use[edit]\n\n  \nStar cluster Pismis 24 with nebula\n\n\n\nPolicy[edit]\n\nAnyone can apply for time on the telescope; there are no restrictions on nationality or academic affiliation, but funding for analysis is only available to US institutions.[110] Competition for time on the telescope is intense, with about one-fifth of the proposals submitted in each cycle earning time on the schedule.[111][112]\n\n\nProposals[edit]\n\nCalls for proposals are issued roughly annually, with time allocated for a cycle lasting about one year. Proposals are divided into several categories; \"general observer\" proposals are the most common, covering routine observations. \"Snapshot observations\" are those in which targets require only 45 minutes or less of telescope time, including overheads such as acquiring the target. Snapshot observations are used to fill in gaps in the telescope schedule that cannot be filled by regular GO programs.[113]\n\nAstronomers may make \"Target of Opportunity\" proposals, in which observations are scheduled if a transient event covered by the proposal occurs during the scheduling cycle. In addition, up to 10% of the telescope time is designated \"director's discretionary\" (DD) time. Astronomers can apply to use DD time at any time of year, and it is typically awarded for study of unexpected transient phenomena such as supernovae.[114]\n\nOther uses of DD time have included the observations that led to views of the Hubble Deep Field and Hubble Ultra Deep Field, and in the first four cycles of telescope time, observations that were carried out by amateur astronomers.\n\nPublic image processing of Hubble data is encouraged as most of the data in the archives has not been processed into color imagery.[115]\n\n\nUse by amateur astronomers[edit]\n\n  \nThe HST is sometimes visible from the ground, as in this 10-second exposure.\n\n\n\nThe first director of STScI, Riccardo Giacconi, announced in 1986 that he intended to devote some of his director discretionary time to allowing amateur astronomers to use the telescope. The total time to be allocated was only a few hours per cycle but excited great interest among amateur astronomers.[116]\n\nProposals for amateur time were stringently reviewed by a committee of amateur astronomers, and time was awarded only to proposals that were deemed to have genuine scientific merit, did not duplicate proposals made by professionals, and required the unique capabilities of the space telescope. Thirteen amateur astronomers were awarded time on the telescope, with observations being carried out between 1990 and 1997.[117] One such study was \"Transition Comets—UV Search for OH\". The very first proposal, \"A Hubble Space Telescope Study of Posteclipse Brightening and Albedo Changes on Io\", was published in Icarus,[118] a journal devoted to solar system studies.  A second study from another group of amateurs was also published in Icarus.[119] After that time, however, budget reductions at STScI made the support of work by amateur astronomers untenable, and no additional amateur programs have been carried out.[117][120]\n\n\n\n\nScientific results[edit]\n\nPlay media\n  \nHubble space telescope - Ultra deep field galaxies to Legacy field zoom out \n(video 00:50; May 2, 2019)\n\n\n\n\n\nKey projects[edit]\n\nIn the early 1980s, NASA and STScI convened four panels to discuss key projects. These were projects that were both scientifically important and would require significant telescope time, which would be explicitly dedicated to each project. This guaranteed that these particular projects would be completed early, in case the telescope failed sooner than expected. The panels identified three such projects: 1) a study of the nearby intergalactic medium using quasar absorption lines to determine the properties of the intergalactic medium and the gaseous content of galaxies and groups of galaxies;[121] 2) a medium deep survey using the Wide Field Camera to take data whenever one of the other instruments was being used[122] and 3) a project to determine the Hubble constant within ten percent by reducing the errors, both external and internal, in the calibration of the distance scale.[123]\n\n\nImportant discoveries[edit]\n\n  \nHubble's STIS UV and ACS visible light are combined to reveal Saturn's southern aurora.\n\n\n\nHubble has helped resolve some long-standing problems in astronomy, while also raising new questions. Some results have required new theories to explain them.\n\n\nAge of the universe[edit]\n\nAmong its primary mission targets was to measure distances to Cepheid variable stars more accurately than ever before, and thus constrain the value of the Hubble constant, the measure of the rate at which the universe is expanding, which is also related to its age. Before the launch of HST, estimates of the Hubble constant typically had errors of up to 50%, but Hubble measurements of Cepheid variables in the Virgo Cluster and other distant galaxy clusters provided a measured value with an accuracy of ±10%, which is consistent with other more accurate measurements made since Hubble's launch using other techniques.[124] The estimated age is now about 13.7 billion years, but before the Hubble Telescope, scientists predicted an age ranging from 10 to 20 billion years.[125]\n\n\nExpansion of the universe[edit]\n\nWhile Hubble helped to refine estimates of the age of the universe, it also cast doubt on theories about its future. Astronomers from the High-z Supernova Search Team and the Supernova Cosmology Project used ground-based telescopes and HST to observe distant supernovae and uncovered evidence that, far from decelerating under the influence of gravity, the expansion of the universe may in fact be accelerating.  Three members of these two groups have subsequently been awarded Nobel Prizes for their discovery.[126] The cause of this acceleration remains poorly understood;[127] the most common cause attributed is dark energy.[128]\n\n\n  \nBrown spots mark Comet Shoemaker–Levy 9 impact sites on Jupiter's southern hemisphere. Imaged by Hubble.\n\n\n\nBlack holes[edit]\n\nThe high-resolution spectra and images provided by the HST have been especially well-suited to establishing the prevalence of black holes in the nuclei of nearby galaxies. While it had been hypothesized in the early 1960s that black holes would be found at the centers of some galaxies, and astronomers in the 1980s identified a number of good black hole candidates, work conducted with Hubble shows that black holes are probably common to the centers of all galaxies.[129][130][131] The Hubble programs further established that the masses of the nuclear black holes and properties of the galaxies are closely related. The legacy of the Hubble programs on black holes in galaxies is thus to demonstrate a deep connection between galaxies and their central black holes.\n\n\nExtending visible wavelength images[edit]\n\n  \nHubble Extreme Deep Field image of space in the constellation Fornax\n\n\n\nA unique window on the Universe enabled by Hubble are the Hubble Deep Field, Hubble Ultra-Deep Field, and Hubble Extreme Deep Field images, which used Hubble's unmatched sensitivity at visible wavelengths to create images of small patches of sky that are the deepest ever obtained at optical wavelengths. The images reveal galaxies billions of light years away, and have generated a wealth of scientific papers, providing a new window on the early Universe. The Wide Field Camera 3 improved the view of these fields in the infrared and ultraviolet, supporting the discovery of some of the most distant objects yet discovered, such as MACS0647-JD.\n\nThe non-standard object SCP 06F6 was discovered by the Hubble Space Telescope in February 2006.[132][133]\n\nOn March 3, 2016, researchers using Hubble data announced the discovery of the farthest known galaxy to date: GN-z11. The Hubble observations occurred on February 11, 2015, and April 3, 2015, as part of the CANDELS/GOODS-North surveys.[134][135]\n\n\nSolar system discoveries[edit]\n\nHST has also been used to study objects in the outer reaches of the Solar System, including the dwarf planets Pluto[136] and Eris.[137]\n\nThe collision of Comet Shoemaker-Levy 9 with Jupiter in 1994 was fortuitously timed for astronomers, coming just a few months after Servicing Mission 1 had restored Hubble's optical performance. Hubble images of the planet were sharper than any taken since the passage of Voyager 2 in 1979, and were crucial in studying the dynamics of the collision of a comet with Jupiter, an event believed to occur once every few centuries.\n\nDuring June and July 2012, US astronomers using Hubble discovered a tiny fifth moon orbiting around Pluto.[138]\n\nIn March 2015, researchers announced that measurements of aurorae around Ganymede, one of Jupiter's moons, revealed that it has a subsurface ocean. Using Hubble to study the motion of its aurorae, the researchers determined that a large saltwater ocean was helping to suppress the interaction between Jupiter's magnetic field and that of Ganymede. The ocean is estimated to be 100 km (60 mi) deep, trapped beneath a 150 km (90 mi) ice crust.[139][140]\n\n\n  \nHubble and ALMA image of MACS J1149.5+2223.[141]\n\n\n\nSupernova reappearance[edit]\n\nOn December 11, 2015, Hubble captured an image of the first-ever predicted reappearance of a supernova, dubbed \"Refsdal\", which was calculated using different mass models of a galaxy cluster whose gravity is warping the supernova's light. The supernova was previously seen in November 2014 behind galaxy cluster MACS J1149.5+2223 as part of Hubble's Frontier Fields program. Astronomers spotted four separate images of the supernova in an arrangement known as an Einstein Cross. The light from the cluster has taken about five billion years to reach Earth, though the supernova exploded some 10 billion years ago. The detection of Refsdal's reappearance served as a unique opportunity for astronomers to test their models of how mass, especially dark matter, is distributed within this galaxy cluster.[142]\n\n\nMass and size of Milky Way[edit]\n\nIn March 2019, observations from Hubble and data from the European Space Agency's Gaia space observatory were combined to determine that the Milky Way Galaxy weighs approximately 1.5 trillion solar units and has a radius of 129,000 light years.[143]\n\n\nOther discoveries[edit]\n\nOther discoveries made with Hubble data include proto-planetary disks (proplyds) in the Orion Nebula;[144] evidence for the presence of extrasolar planets around Sun-like stars;[145] and the optical counterparts of the still-mysterious gamma-ray bursts.[146]\n\n\nImpact on astronomy[edit]\n\n  \nEvolution of detecting the early Universe\n\n\n\nMany objective measures show the positive impact of Hubble data on astronomy. Over 15,000 papers based on Hubble data have been published in peer-reviewed journals,[147] and countless more have appeared in conference proceedings. Looking at papers several years after their publication, about one-third of all astronomy papers have no citations, while only 2% of papers based on Hubble data have no citations. On average, a paper based on Hubble data receives about twice as many citations as papers based on non-Hubble data. Of the 200 papers published each year that receive the most citations, about 10% are based on Hubble data.[148]\n\nAlthough the HST has clearly helped astronomical research, its financial cost has been large. A study on the relative astronomical benefits of different sizes of telescopes found that while papers based on HST data generate 15 times as many citations as a 4 m (13 ft) ground-based telescope such as the William Herschel Telescope, the HST costs about 100 times as much to build and maintain.[149]\n\nDeciding between building ground- versus space-based telescopes is complex. Even before Hubble was launched, specialized ground-based techniques such as aperture masking interferometry had obtained higher-resolution optical and infrared images than Hubble would achieve, though restricted to targets about 108 times brighter than the faintest targets observed by Hubble.[150][151] Since then, advances in adaptive optics have extended the high-resolution imaging capabilities of ground-based telescopes to the infrared imaging of faint objects. The usefulness of adaptive optics versus HST observations depends strongly on the particular details of the research questions being asked. In the visible bands, adaptive optics can only correct a relatively small field of view, whereas HST can conduct high-resolution optical imaging over a wide field. Only a small fraction of astronomical objects are accessible to high-resolution ground-based imaging; in contrast Hubble can perform high-resolution observations of any part of the night sky, and on objects that are extremely faint.\n\n\nImpact on aerospace engineering[edit]\n\nIn addition to its scientific results, Hubble has also made significant contributions to aerospace engineering, in particular the performance of systems in low Earth orbit. These insights result from Hubble's long lifetime on orbit, extensive instrumentation, and return of assemblies to the Earth where they can be studied in detail. In particular, Hubble has contributed to studies of the behavior of graphite composite structures in vacuum, optical contamination from residual gas and human servicing, radiation damage to electronics and sensors, and the long term behavior of multi-layer insulation.[152] One lesson learned was that gyroscopes assembled using pressurized oxygen to deliver suspension fluid were prone to failure due to electric wire corrosion. Gyroscopes are now assembled using pressurized nitrogen.[153]\n\n\nHubble data[edit]\n\n  \nHubble precision stellar distance measurement has been extended 10 times further into the Milky Way.[154]\n\n\n\nTransmission to Earth[edit]\n\nHubble data was initially stored on the spacecraft. When launched, the storage facilities were old-fashioned reel-to-reel tape recorders, but these were replaced by solid state data storage facilities during servicing missions 2 and 3A. About twice daily, the Hubble Space Telescope radios data to a satellite in the geosynchronous Tracking and Data Relay Satellite System (TDRSS), which then downlinks the science data to one of two 60-foot (18-meter) diameter high-gain microwave antennas located at the White Sands Test Facility in White Sands, New Mexico.[155] From there they are sent to the Space Telescope Operations Control Center at Goddard Space Flight Center, and finally to the Space Telescope Science Institute for archiving.[155] Each week, HST downlinks approximately 140 gigabits of data.[1]\n\n\nColor images[edit]\n\n  \nData analysis of a spectrum reveals the chemistry of hidden clouds\n\n\n\nAll images from Hubble are monochromatic grayscale, taken through a variety of filters, each passing specific wavelengths of light, and incorporated in each camera. Color images are created by combining separate monochrome images taken through different filters. This process can also create false-color versions of images including infrared and ultraviolet channels, where infrared is typically rendered as a deep red and ultraviolet is rendered as a deep blue.[156][157][158]\n\n\nArchives[edit]\n\nAll Hubble data is eventually made available via the Mikulski Archive for Space Telescopes at STScI,[159] CADC[160] and ESA/ESAC.[161] Data is usually proprietary—available only to the principal investigator (PI) and astronomers designated by the PI—for six months after being taken. The PI can apply to the director of the STScI to extend or reduce the proprietary period in some circumstances.[162]\n\nObservations made on Director's Discretionary Time are exempt from the proprietary period, and are released to the public immediately. Calibration data such as flat fields and dark frames are also publicly available straight away. All data in the archive is in the FITS format, which is suitable for astronomical analysis but not for public use.[163] The Hubble Heritage Project processes and releases to the public a small selection of the most striking images in JPEG and TIFF formats.[164]\n\n\nPipeline reduction[edit]\n\nAstronomical data taken with CCDs must undergo several calibration steps before they are suitable for astronomical analysis. STScI has developed sophisticated software that automatically calibrates data when they are requested from the archive using the best calibration files available. This 'on-the-fly' processing means that large data requests can take a day or more to be processed and returned. The process by which data is calibrated automatically is known as 'pipeline reduction', and is increasingly common at major observatories. Astronomers may if they wish retrieve the calibration files themselves and run the pipeline reduction software locally. This may be desirable when calibration files other than those selected automatically need to be used.[165]\n\n\nData analysis[edit]\n\nHubble data can be analyzed using many different packages. STScI maintains the custom-made Space Telescope Science Data Analysis System (STSDAS) software, which contains all the programs needed to run pipeline reduction on raw data files, as well as many other astronomical image processing tools, tailored to the requirements of Hubble data. The software runs as a module of IRAF, a popular astronomical data reduction program.[166]\n\n\nOutreach activities[edit]\n\n  \nIn 2001, NASA polled internet users to find out what they would most like Hubble to observe; they overwhelmingly selected the Horsehead Nebula\n\n\n\n  \nA 1/4 scale model of the Hubble Space Telescope located at the courthouse in Marshfield, Missouri, a hometown of telescope namesake Edwin Hubble\n\n\n\nIt has always been important for the Space Telescope to capture the public's imagination, given the considerable contribution of taxpayers to its construction and operational costs.[167] After the difficult early years when the faulty mirror severely dented Hubble's reputation with the public, the first servicing mission allowed its rehabilitation as the corrected optics produced numerous remarkable images.\n\nSeveral initiatives have helped to keep the public informed about Hubble activities.\nIn the United States, outreach efforts are coordinated by the Space Telescope Science Institute (STScI) Office for Public Outreach, which was established in 2000 to ensure that U.S. taxpayers saw the benefits of their investment in the space telescope program. To that end, STScI operates the HubbleSite.org website. The Hubble Heritage Project, operating out of the STScI, provides the public with high-quality images of the most interesting and striking objects observed. The Heritage team is composed of amateur and professional astronomers, as well as people with backgrounds outside astronomy, and emphasizes the aesthetic nature of Hubble images. The Heritage Project is granted a small amount of time to observe objects which, for scientific reasons, may not have images taken at enough wavelengths to construct a full-color image.[164]\n\nSince 1999, the leading Hubble outreach group in Europe has been the Hubble European Space Agency Information Centre (HEIC).[168] This office was established at the Space Telescope European Coordinating Facility in Munich, Germany. HEIC's mission is to fulfill HST outreach and education tasks for the European Space Agency. The work is centered on the production of news and photo releases that highlight interesting Hubble results and images. These are often European in origin, and so increase awareness of both ESA's Hubble share (15%) and the contribution of European scientists to the observatory. ESA produces educational material, including a videocast series called Hubblecast designed to share world-class scientific news with the public.[169]\n\nThe Hubble Space Telescope has won two Space Achievement Awards from the Space Foundation, for its outreach activities, in 2001 and 2010.[170]\n\nA replica of the Hubble Space Telescope is on the courthouse lawn in Marshfield, Missouri, the hometown of namesake Edwin P. Hubble.\n\n\nCelebration images[edit]\n\nFurther information: List of Hubble anniversary images\n\n  \nA pillar of gas and dust in the Carina Nebula. This Wide Field Camera 3 image, dubbed Mystic Mountain, was released in 2010 to commemorate Hubble's 20th anniversary in space.\n\n\n\nThe Hubble Space Telescope celebrated its 20th anniversary in space on April 24, 2010. To commemorate the occasion, NASA, ESA, and the Space Telescope Science Institute (STScI) released an image from the Carina Nebula.[171]\n\nTo commemorate Hubble's 25th anniversary in space on April 24, 2015, STScI released images of the Westerlund 2 cluster, located about 20,000 light-years (6,100 pc) away in the constellation Carina, through its Hubble 25 website.[172] The European Space Agency created a dedicated 25th anniversary page on its website.[173] In April 2016, a special celebratory image of the Bubble Nebula was released for Hubble's 26th \"birthday\".[174]\n\n\nEquipment failures[edit]\n\nGyroscope rotation sensors[edit]\n\nHST uses gyroscopes to detect and measure any rotations so it can stabilize itself in orbit and point accurately and steadily at astronomical targets.  Three gyroscopes are normally required for operation; observations are still possible with two or one, but the area of sky that can be viewed would be somewhat restricted, and observations requiring very accurate pointing are more difficult.[175]  In 2018, the plan is to drop into one-gyroscope mode if less than three working gyroscopes are operational. The gyroscopes are part of the Pointing Control System, which uses five types of sensors (magnetic sensors, optical sensors, and the gyroscopes) and two types of actuators (reaction wheels and magnetic torquers).[176] Hubble carries six gyroscopes in total.\n\nAfter the Columbia disaster in 2003, it was unclear whether another servicing mission would be possible, and gyroscope life became a concern again, so engineers developed new software for two-gyroscope and one-gyroscope modes to maximize the potential lifetime. The development was successful, and in 2005, it was decided to switch to two-gyroscope mode for regular telescope operations as a means of extending the lifetime of the mission. The switch to this mode was made in August 2005, leaving Hubble with two gyroscopes in use, two on backup, and two inoperable.[177] One more gyroscope failed in 2007.[178]\n\nBy the time of the final repair mission in May 2009, during which all six gyroscopes were replaced (with two new pairs and one refurbished pair), only three gyroscopes were still working. Engineers determined that the gyroscope failures were caused by corrosion of electric wires powering the motor that was initiated by oxygen-pressurized air used to deliver the thick suspending fluid.[153] The new gyroscope models were assembled using pressurized nitrogen[153] and they should be much more reliable.[179] In the 2009 servicing mission all six gyroscopes were replaced, and after almost ten years only three gyroscopes failed, but only after exceeding the average expected run time for the design.[180]\n\nOf the six gyroscopes replaced in 2009, three were of the old design susceptible for flex-lead failure, and three were of the new design with a longer expected lifetime.  The first of the old-style gyroscopes failed in March 2014, and the second in April 2018. On October 5, 2018, the last of the old-style gyroscopes failed, and one of the new-style gyroscopes was powered-up from standby state. However, that reserve gyroscope did not immediately perform within operational limits, and so the observatory was placed into \"safe\" mode while scientists attempted to fix the problem.[181][182] NASA tweeted on October 22, 2018, that the \"rotation rates produced by the backup gyro have reduced and are now within a normal range. Additional tests [are] to be performed to ensure Hubble can return to science operations with this gyro.\"[183]\n\n\nThe solution that restored the backup new-style gyroscope to operational range was widely reported as \"turning it off and on again\".[184] A \"running restart\" of the gyroscope was performed, but this had no effect, and the final resolution to the failure was more complex. The failure was attributed to an inconsistency in the fluid surrounding the float within the gyroscope (e.g., an air bubble). On October 18, 2018, the Hubble Operations Team directed the spacecraft into a series of maneuvers – moving the spacecraft in opposite directions – in order to mitigate the inconsistency. Only after the maneuvers, and a subsequent set of maneuvers on October 19, did the gyroscope truly operate within its normal range.[185]\n  \nHubble views the Fomalhaut system. This false-color image was taken in October 2004 and July 2006 with the Advanced Camera for Surveys\n\n\n\nInstruments and electronics[edit]\n\nPast servicing missions have exchanged old instruments for new ones, avoiding failure and making new types of science possible. Without servicing missions, all of the instruments will eventually fail. In August 2004, the power system of the Space Telescope Imaging Spectrograph (STIS) failed, rendering the instrument inoperable. The electronics had originally been fully redundant, but the first set of electronics failed in May 2001.[186] This power supply was fixed during Servicing Mission 4 in May 2009.\n\nSimilarly, the Advanced Camera for Surveys (ACS) main camera primary electronics failed in June 2006, and the power supply for the backup electronics failed on January 27, 2007.[187] Only the instrument's Solar Blind Channel (SBC) was operable using the side-1 electronics. A new power supply for the wide angle channel was added during SM 4, but quick tests revealed this did not help the high resolution channel.[188] The Wide Field Channel (WFC) was returned to service by STS-125 in May 2009 but the High Resolution Channel (HRC) remains offline.[189]\n\nOn January 8, 2019, Hubble entered a partial safe mode following suspected hardware problems in its most advanced instrument, the Wide Field Camera 3 instrument. NASA later reported that the cause of the safe mode within the instrument was a detection of voltage levels out of a defined range. On January 15, 2019, NASA stated that the cause of the failure was a software problem. Engineering data within the telemetry circuits were not accurate. In addition, all other telemetry within those circuits also contained erroneous values indicating that this was a telemetry issue and not a power supply issue. After resetting the telemetry circuits and associated boards the instrument began functioning again. On January 17, 2019, the device was returned to normal operation and on the same day it completed its first science observations.[190][191]\n\n\nFuture[edit]\n\nOrbital decay and controlled reentry[edit]\n\n  \nIllustration of the Soft Capture Mechanism (SCM) installed on Hubble\n\n\n\nHubble orbits the Earth in the extremely tenuous upper atmosphere, and over time its orbit decays due to drag.  If not reboosted, it will re-enter the Earth's atmosphere within some decades, with the exact date depending on how active the Sun is and its impact on the upper atmosphere.  If Hubble were to descend in a completely uncontrolled re-entry, parts of the main mirror and its support structure would probably survive, leaving the potential for damage or even human fatalities.[192] In 2013, deputy project manager James Jeletic projected that Hubble could survive into the 2020s.[3] Based on solar activity and atmospheric drag, or lack thereof, a natural atmospheric reentry for Hubble will occur between 2028 and 2040.[3][193] In June 2016, NASA extended the service contract for Hubble until June 2021.[194]\n\nNASA's original plan for safely de-orbiting Hubble was to retrieve it using a space shuttle. Hubble would then have most likely been displayed in the Smithsonian Institution. This is no longer possible since the space shuttle fleet has been retired, and would have been unlikely in any case due to the cost of the mission and risk to the crew. Instead, NASA considered adding an external propulsion module to allow controlled re-entry.[195] Ultimately, in 2009, as part of Servicing Mission 4, the last servicing mission by the Space Shuttle, NASA installed the Soft Capture Mechanism (SCM), to enable deorbit by either a crewed or robotic mission. The SCM, together with the Relative Navigation System (RNS), mounted on the Shuttle to collect data to \"enable NASA to pursue numerous options for the safe de-orbit of Hubble\", constitute the Soft Capture and Rendezvous System (SCRS).[97][196]\n\n\nPossible commercial service missions[edit]\n\nAs of 2017[update], the Trump Administration is considering a proposal by the Sierra Nevada Corporation to use a manned version of its Dream Chaser spacecraft to service Hubble some time in the 2020s both as a continuation of its scientific capabilities and as insurance against any malfunctions in the to-be-launched James Webb Space Telescope.[197]\n\n\nSuccessors[edit]\n\nFurther information: James Webb Space Telescope\n\n\t Visible spectrum range \n\n\tColor\n\tWavelength\n\n\tviolet\n\t380–450 nm\n\n\tblue\n\t450–475 nm\n\n\tcyan\n\t476–495 nm\n\n\tgreen\n\t495–570 nm\n\n\tyellow\n\t570–590 nm\n\n\torange\n\t590–620 nm\n\n\tred\n\t620–750 nm\n\n\n\nThere is no direct replacement to Hubble as an ultraviolet and visible light space telescope, because near-term space telescopes do not duplicate Hubble's wavelength coverage (near-ultraviolet to near-infrared wavelengths), instead concentrating on the farther infrared bands. These bands are preferred for studying high redshift and low-temperature objects, objects generally older and farther away in the universe. These wavelengths are also difficult or impossible to study from the ground, justifying the expense of a space-based telescope. Large ground-based telescopes can image some of the same wavelengths as Hubble, sometimes challenge HST in terms of resolution by using adaptive optics (AO), have much larger light-gathering power, and can be upgraded more easily, but cannot yet match Hubble's excellent resolution over a wide field of view with the very dark background of space.\n\nPlans for a Hubble successor materialized as the Next Generation Space Telescope project, which culminated in plans for the James Webb Space Telescope (JWST), the formal successor of Hubble.[198] Very different from a scaled-up Hubble, it is designed to operate colder and farther away from the Earth at the L2 Lagrangian point, where thermal and optical interference from the Earth and Moon are lessened. It is not engineered to be fully serviceable (such as replaceable instruments), but the design includes a docking ring to enable visits from other spacecraft.[199] A main scientific goal of JWST is to observe the most distant objects in the universe, beyond the reach of existing instruments. It is expected to detect stars in the early Universe approximately 280 million years older than stars HST now detects.[200] The telescope is an international collaboration between NASA, the European Space Agency, and the Canadian Space Agency since 1996,[201] and is planned for launch on an Ariane 5 rocket.[202] Although JWST is primarily an infrared instrument, its coverage extends down to 600 nm wavelength light, or roughly orange in the visible spectrum. A typical human eye can see to about 750 nm wavelength light, so there is some overlap with the longest visible wavelength bands, including orange and red light.\n\n\n  \nHubble and JWST mirrors (4.5 m2 and 25 m2 respectively)\n\n\n\nA complementary telescope, looking at even longer wavelengths than Hubble or JWST, was the European Space Agency's Herschel Space Observatory, launched on May 14, 2009. Like JWST, Herschel was not designed to be serviced after launch, and had a mirror substantially larger than Hubble's, but observed only in the far infrared and submillimeter. It needed helium coolant, of which it ran out on April 29, 2013.\n\n\n\tSelected space telescopes and instruments[203]\n\n\tName\tYear\tWavelength\tAperture\n\n\tHuman eye\t–\t0.39–0.75 μm\t0.01 m\n\n\tSpitzer\t2003\t3–180 μm\t0.85 m\n\n\tHubble STIS\t1997\t0.115–1.03 μm\t2.4 m\n\n\tHubble WFC3\t2009\t0.2–1.7 μm\t2.4 m\n\n\tHerschel\t2009\t55–672 μm\t3.5 m\n\n\tJWST\tPlanned\t0.6–28.5 μm\t6.5 m\n\n\n\nFurther concepts for advanced 21st-century space telescopes include the Advanced Technology Large-Aperture Space Telescope,[204] a conceptualized 8 to 16.8 meters (310 to 660 inches) optical space telescope that if realized could be a more direct successor to HST, with the ability to observe and photograph astronomical objects in the visible, ultraviolet, and infrared wavelengths, with substantially better resolution than Hubble or the Spitzer Space telescope. This effort is being planned for the 2025–2035 time frame.\n\nExisting ground-based telescopes, and various proposed Extremely Large Telescopes, can exceed the HST in terms of sheer light-gathering power and diffraction limit due to larger mirrors, but other factors affect telescopes. In some cases, they may be able to match or beat Hubble in resolution by using adaptive optics (AO). However, AO on large ground-based reflectors will not make Hubble and other space telescopes obsolete. Most AO systems sharpen the view over a very narrow field—Lucky Cam, for example, produces crisp images just 10\" to 20\" wide, whereas Hubble's cameras produce crisp images across a 2½' (150\") field. Furthermore, space telescopes can study the universe across the entire electromagnetic spectrum, most of which is blocked by Earth's atmosphere. Finally, the background sky is darker in space than on the ground, because air absorbs solar energy during the day and then releases it at night, producing a faint—but nevertheless discernible—airglow that washes out low-contrast astronomical objects.[205]\n\n\nSee also[edit]\n\n\n\tAstronomy portal\n\tSpaceflight portal\n\n\n\n\tList of largest optical reflecting telescopes\n\tList of largest infrared telescopes\n\tList of space telescopes\n\tHubble (2010 documentary)\n\n\nReferences[edit]\n\n\n\t^ a b c d e \"Hubble Essentials: Quick Facts\". HubbleSite.org. Archived from the original on July 6, 2016.\n\n\t^ Ryba, Jeanne. \"STS-31\". NASA. Archived from the original on May 7, 2017. Retrieved May 7, 2017.\n\n\n\t^ a b c d Harwood, William (May 30, 2013). \"Four years after final service call, Hubble Space Telescope going strong\". CBS News. Retrieved June 3, 2013.\n\n\n\t^ a b \"Hubble Space Telescope – Orbit\". Heavens Above. August 15, 2018. Retrieved August 16, 2018.\n\n\n\t^ a b c Nelson, Buddy;  et al. (2009). \"Hubble Space Telescope: Servicing Mission 4 Media Reference Guide\" (PDF). NASA/Lockheed Martin. pp. 1–5.\n\n\n\t^ Canright, Shelley. \"NASA's Great Observatories\". NASA. Retrieved April 26, 2008.\n\n\n\t^ \"Hubble Essentials\". Hubblesite.org. Retrieved March 3, 2016.\n\n\n\t^ \"NASA Completes Webb Telescope Review, Commits to Launch in Early 2021\". National Aeronautics And Administration. June 27, 2018. Retrieved June 28, 2018.\n\n\n\t^ Oberth, Hermann (1923). Die Rakete zu den Planetenräumen. R. Oldenbourg-Verlay. p. 85.\n\n\n\t^ Spitzer, Lyman Jr., \"Report to Project Rand: Astronomical Advantages of an Extra-Terrestrial Observatory\", reprinted in NASA SP-2001-4407: Exploring the Unknown, Chapter 3, Document III-1, p. 546.\n\n\t^ \"About Lyman Spitzer, Jr\". Caltech. Archived from the original on March 27, 2008. Retrieved April 26, 2008.\n\n\n\t^ Baum, WA; Johnson, FS; Oberly, JJ; Rockwood, CC;  et al. (November 1946). \"Solar Ultraviolet Spectrum to 88 Kilometers\". Phys. Rev. American Physical Society. 70 (9–10): 781–782. Bibcode:1946PhRv...70..781B. doi:10.1103/PhysRev.70.781.\n\n\n\t^ \"The First Orbiting Solar Observatory\". heasarc.gsfc.nasa.gov. NASA Goddard Space Flight Center. June 26, 2003. Retrieved September 25, 2011.\n\n\n\t^ \"OAO\". NASA. Archived from the original on September 16, 2008. Retrieved April 26, 2008.\n\n\n\t^ Spitzer 1979, p. 32.\n\n\t^ Spitzer 1979, pp. 33–34.\n\n\t^ a b Spitzer 1979, p. 34.\n\n\t^ Andersen, Geoff (2007). The telescope: its history, technology, and future. Princeton University Press. p. 116. ISBN 978-0-691-12979-2.\n\n\n\t^ \"Memorandum of Understanding Between The European Space Agency and The United States National Aeronautics and Space Administration\", reprinted in NASA SP-2001-4407: Exploring the Unknown, Chapter 3, Document III-29, p. 671.\n\n\t^ Okolski, Gabriel. \"A Chronology of the Hubble Space Telescope\". NASA. Retrieved April 26, 2008.\n\n\n\t^ \"The Path to Hubble Space Telescope\". NASA. Archived from the original on May 24, 2008. Retrieved April 26, 2008.\n\n\n\t^ Dunar & Waring 1999, pp. 487–488.\n\n\t^ a b Dunar & Waring 1999, p. 489.\n\n\t^ a b Waldrop, MM (August 17, 1990). \"Hubble: The Case of the Single-Point Failure\". Science Magazine. 249 (4970): 735–736. Bibcode:1990Sci...249..735W. doi:10.1126/science.249.4970.735. PMID 17756776.\n\n\n\t^ a b Robberto, M.; Sivaramakrishnan, A.; Bacinski, J. J.; Calzetti, D.;  et al. (2000).  Breckinridge, James B; Jakobsen, Peter (eds.). \"The Performance of HST as an Infrared Telescope\" (PDF). Proc. SPIE. UV, Optical, and IR Space Telescopes and Instruments. 4013: 386–393. Bibcode:2000SPIE.4013..386R. doi:10.1117/12.394037.\n\n\n\t^ Allen et al. 1990, pp. 3–4.\n\n\t^ \"Losing Bid Offered 2 Tests on Hubble\". The New York Times. Associated Press. July 28, 1990. Retrieved April 26, 2008.\n\n\n\t^ Goddard Space Flight Center (September 21, 2001). \"Hubble Space Telescope Stand-in Gets Starring Role\" (Press release). Archived from the original on February 26, 2008. Retrieved April 26, 2008.\n\n\n\t^ \"Backup Mirror, Hubble Space Telescope\". National Air and Space Museum. Archived from the original on November 2, 2012. Retrieved November 4, 2012.\n\n\n\t^ Magdalena Ridge Observatory (January 1, 2008). 2.4m Observatory Technical Note (PDF) (Technical report). 1.6. p. 2. Retrieved January 21, 2013.\n\n\n\t^ McCarthy, Daniel J.; Facey, Terence A. (1982). Design and fabrication of the NASA 2.4-meter space telescope. Proc. SPIE 0330, Optical Systems Engineering II. International Society for Optics and Photonics. pp. 139–143. doi:10.1117/12.934268.\n\n\n\t^ Dunar & Waring 1999, p. 496.\n\n\t^ Ghitelman, David (1987). The Space Telescope. New York: Michael Friedman. p. 32. ISBN 978-0831779719.\n\n\n\t^ Dunar & Waring 1999, p. 504.\n\n\t^ \"Hubble Space Telescope Systems\". Goddard Space Flight Center. Archived from the original on March 17, 2003. Retrieved April 26, 2008.\n\n\n\t^ Ghitelman, David (1987). The Space Telescope. New York: Michael Friedman Publishing. p. 50.\n\n\t^ Dunar & Waring 1999, p. 508.\n\n\t^ \"Co-Processor\" (PDF). NASA Facts. NASA. June 1993. NF-193.\n\n\n\t^ \"Hubble Space Telescope Servicing Mission 3A: New Advanced Computer\" (PDF). NASA Facts. NASA. 1999. FS-1999-06-009-GSFC.\n\n\n\t^ Lockheed Martin Missiles and Space. Hubble Space Telescope Servicing Mission 3A Media Reference Guide (PDF) (Technical report). NASA. pp. 5–9 and Section 7.1.1. Retrieved April 27, 2008.\n\n\n\t^ Xapsos, M. A.; Stauffer, C.; Jordan, T.; Poivey, C.;  et al. (December 2014). \"How Long Can the Hubble Space Telescope Operate Reliably? – A Total Dose Perspective\" (PDF). IEEE Transactions on Nuclear Science. 61 (6): 3356–3362. Bibcode:2014ITNS...61.3356X. doi:10.1109/TNS.2014.2360827.\n\n\n\t^ Afshari, A. (January 1993). \"Hubble Space Telescope's Wide Field/Planetary Camera\" (PDF). Shutterbug. Archived from the original (PDF) on October 6, 2016.\n\n\n\t^ \"WFPC2\". STScI. Retrieved May 18, 2012.\n\n\n\t^ a b Hall, Donald N. B., ed. (1982). The Space Telescope Observatory (Technical report). NASA. CP-2244.\n 40 MB PDF file.\n\n\t^ Brandt, JC, Heap, SR, Beaver, EA, Boggess, A,  et al. (1994). \"The Goddard High Resolution Spectrograph: Instrument, goals, and science results\". Publications of the Astronomical Society of the Pacific. 106: 890–908. Bibcode:1994PASP..106..890B. doi:10.1086/133457.\n\n\n\t^ Bless, RC; Walter, LE; White RL (1992). High Speed Photometer Instrument Handbook v 3.0. STSci.\n\n\t^ Benedict, G. Fritz; McArthur, Barbara E. (2005).  DW Kurtz (ed.). High-precision stellar parallaxes from Hubble Space Telescope fine guidance sensors. IAU Colloquium #196. Transits of Venus: New Views of the Solar System and Galaxy. Cambridge University Press. pp. 333–346. Bibcode:2005tvnv.conf..333B. doi:10.1017/S1743921305001511.\n\n\n\t^ Edmondson, Frank K. (1997). AURA and Its US National Observatories. Cambridge University Press. p. 244. ISBN 9780521553452.\n\n\n\t^ \"About AURA\". AURA. Retrieved November 6, 2012.\n\n\n\t^ Dunar & Waring 1999, pp. 486–487.\n\n\t^ Roman, Nancy Grace. \"Exploring the Universe: Space-Based Astronomy and Astrophysics\", in NASA SP-2001-4407: Exploring the Unknown (PDF). NASA. Chapter 3, p. 536.\n\n\t^ a b \"Team Hubble\". STScI. Retrieved November 6, 2012.\n\n\n\t^ Strolger & Rose 2017, p. 46.\n\n\t^ Tatarewicz 1998, p. 371.\n\n\t^ Wilford, John (April 9, 1990). \"Telescope Is Set to Peer at Space and Time\". The New York Times. Retrieved January 19, 2009.\n\n\n\t^ \"STS-31\". NASA. Retrieved April 26, 2008.\n\n\n\t^ \"James Webb Space Telescope (JWST) Independent Comprehensive Review Panel (ICRP) Final Report\" (PDF). NASA. p. 32. Retrieved September 4, 2012.\n\n\n\t^ Burrows, Christopher J.; Holtzman, Jon A.; Faber, S. M.; Bely, Pierre Y.;  et al. (March 10, 1991). \"The imaging performance of the Hubble Space Telescope\". Astrophysical Journal Letters. 369: L21–L25. Bibcode:1991ApJ...369L..21B. doi:10.1086/185950.\n\n\n\t^ Heyer, Biretta;  et al. (2004). \"WFPC2 Instrument Handbook\". 9.0. Baltimore: STScI. Chapter 5.1. Retrieved April 26, 2008.\n\n\n\t^ a b \"Servicing Mission 1\". NASA. Archived from the original on April 20, 2008. Retrieved March 28, 2016.\n\n\n\t^ a b Tatarewicz 1998, p. 375.\n\n\t^ \"The Naked Gun 2½: The Smell of Fear\". Internet Movie Database. Retrieved April 26, 2008.\n\n\n\t^ Goodwin, Irwin; Cioffi, Denis F. (1994). \"Hubble repair improves vision and helps restore NASA's image\". Physics Today. 47 (3): 42. Bibcode:1994PhT....47c..42G. doi:10.1063/1.2808434.\n\n\n\t^ Dunar & Waring 1999, pp. 514–515.\n\n\t^ Allen et al. 1990, p. 7-1: The spacing of the field lens in the corrector was to have been done by laser measurements off the end of an invar bar. Instead of illuminating the end of the bar, however, the laser in fact was reflected from a worn spot on a black-anodized metal cap placed over the end of the bar to isolate its center (visible through a hole in the cap). The technician who performed the test noted an unexpected gap between the field lens and its supporting structure in the corrector and filled it in with an ordinary metal washer.\n\n\t^ Dunar & Waring 1999, p. 512: \"the firm's optical operations personnel dismissed the evidence as itself flawed. They believed the other two null correctors were less accurate than the reflective null corrector and so could not verify its reliability. Since they assumed the perfection of the mirror and reflective null corrector, they rejected falsifying information from independent tests, believed no problems existed, and reported only good news.\"\n\n\t^ Allen et al. 1990, p. 10-1.\n\n\t^ Chaisson, Eric (1994). The Hubble Wars; Astrophysics Meets Astropolitics in the Two-Billion-Dollar Struggle Over the Hubble Space Telescope. Harper Collins. \nISBN 0-06-017114-6, p. 184.\n\n\t^ Fisher, Arthur (October 1990). \"The Trouble with Hubble\". Popular Science: 100. Retrieved November 8, 2012.\n\n\n\t^ Litvac, M. M. (1991). Image inversion analysis of the HST OTA (Hubble Space Telescope Optical Telescope Assembly), phase A (Technical report). TRW, Inc. Space and Technology Group. Bibcode:1991trw..rept.....L.\n\n\n\t^ Redding, David C.; Sirlin, S.; Boden, A.; Mo, J.; Hanisch, B.; Furey, L. (July 1995). \"Optical Prescription of the HST\" (PDF). Calibrating Hubble Space Telescope. Post Servicing Mission. NASA JPL: 132. Bibcode:1995chst.conf..132R. hdl:2014/31621. Archived from the original (PDF) on May 1, 2015.\n\n\n\t^ Allen et al. 1990, pp. E-1.\n\n\t^ a b Tatarewicz 1998, p. 376.\n\n\t^ Jedrzejewski, RI; Hartig, G; Jakobsen, P; Ford, HC (1994). \"In-orbit performance of the COSTAR-corrected Faint Object Camera\". Astrophysical Journal Letters. 435: L7–L10. Bibcode:1994ApJ...435L...7J. doi:10.1086/187581.\n\n\n\t^ a b \"HST\". STScI. Corrective Optics Space Telescope Axial Replacement. Retrieved November 4, 2012.\n\n\n\t^ a b c \"Hubble Essentials\". STScI. Retrieved November 8, 2012.\n\n\n\t^ Orbital Replacement Units HST\n\n\t^ Treat, Jason; Scalamogna, Anna; Conant, Eve (2015). \"The Secret to Hubble's Success\". National Geographic. Retrieved April 25, 2015.\n\n\n\t^ Overbye, Jason; Corum, Jonathan; Drakeford, Jason (April 24, 2015). \"Hubble Reflects the Cosmos\". The New York Times. Retrieved April 25, 2015.\n\n\n\t^ Tatarewicz 1998, pp. 384–387.\n\n\t^ Trauger, J. T.; Ballester, G. E.; Burrows, C. J.; Casertano, S.;  et al. (1994). \"The on-orbit performance of WFPC2\". Astrophysical Journal Letters. 435: L3–L6. Bibcode:1994ApJ...435L...3T. doi:10.1086/187580.\n\n\n\t^ \"Servicing Mission 2\". NASA. Archived from the original on April 19, 2008. Retrieved April 26, 2008.\n\n\n\t^ a b \"NICMOS Thermal History\". STScI. Retrieved April 26, 2008.\n\n\n\t^ \"Servicing Mission 3A Overview\". NASA. Retrieved April 26, 2008.\n\n\n\t^ \"Servicing Mission 3\". NASA. Archived from the original on April 7, 2008. Retrieved April 26, 2008.\n\n\n\t^ \"Servicing Mission 4 Cancelled\". STScI. January 16, 2004. Archived from the original on May 30, 2012. Retrieved April 28, 2008.\n\n\n\t^ \"Assessment of Options for Extending the Life of the Hubble Space Telescope: Final Report\". The National Academies. 2005.\n Chapter 7, \"Given the intrinsic value of a serviced Hubble, and the high likelihood of success for a shuttle servicing mission, the committee judges that such a mission is worth the risk.\"\n\n\t^ \"2004 Annual Report\" (PDF). Astronomy and Astrophysics Advisory Committee. March 15, 2004. Section 3.1 – The Scientific Impact of the HST SM4 Cancellation. Retrieved November 5, 2012.\n\n\n\t^ Warren E. Leary (July 14, 2004). \"Panel Urges NASA to Save Hubble Space Telescope\". The New York Times. Retrieved November 8, 2012.\n\n\n\t^ Gugliotta, Guy (April 12, 2005). \"Nominee Backs a Review of NASA's Hubble Decision\". The Washington Post. Retrieved January 10, 2007.\n\n\n\t^ \"Mikulski Vows To Fight For Hubble\" (Press release). Barbara Mikulski. February 7, 2005. Archived from the original on April 30, 2008. Retrieved April 26, 2008.\n\n\n\t^ Boyle, Alan (October 31, 2006). \"NASA gives green light to Hubble rescue\". MSNBC. Retrieved January 10, 2007.\n\n\n\t^ a b Cowen, Ron (September 29, 2008). \"Hubble suddenly quiet\". ScienceNews. Retrieved November 8, 2012.\n\n\n\t^ Courtland, Rachel (October 28, 2008). \"Hubble re-opens an eye\". New Scientist. Archived from the original on October 29, 2008. Retrieved October 29, 2008.\n\n\n\t^ \"NASA Sets Target Shuttle Launch Date for Hubble Servicing Mission\". NASA. December 4, 2008. Retrieved December 5, 2008.\n\n\n\t^ \"Hubble Opens New Eyes on the Universe\". NASA. September 9, 2009. Retrieved May 28, 2012.\n\n\n\t^ a b \"The Soft Capture and Rendezvous System\". NASA. Retrieved May 20, 2009.\n\n\n\t^ Overbye, Dennis (September 9, 2009). \"After Hubble Repair, New Images From Space\". The New York Times. Retrieved August 1, 2015.\n\n\n\t^ Overbye, Dennis (May 17, 2009). \"After a Yank, 'Surgery' on Hubble Optics\". The New York Times. Retrieved August 1, 2015.\n\n\n\t^ \"Repair of the Advanced Camera for Surveys\". SpaceTelescope.org. Retrieved August 1, 2015.\n\n\n\t^ \"This week on HST\". Space Telescope Science Institute. January 2, 2017. Retrieved January 23, 2017.\n\n\n\t^ a b \"Hubble Deep Fields Initiative 2012 Science Working Group Report\" (PDF). STScI.edu. 2012. Retrieved June 29, 2015.\n\n\n\t^ \"New Hubble image of galaxy cluster Abell 1689\". SpaceTelescope.org. September 12, 2013. heic1317. Retrieved October 4, 2013.\n\n\n\t^ \"Hubble explores the origins of modern galaxies\". SpaceTelescope.org. August 15, 2013. heic1315. Retrieved October 4, 2013.\n\n\n\t^ \"Survey Description\". CANDELS. Archived from the original on October 20, 2013. Retrieved October 4, 2013 – via UCOLick.org.\n\n\n\t^ \"Hubble Space Telescope: Frontier Fields\". STScI.edu. Retrieved October 4, 2013.\n\n\n\t^ a b \"Cosmic Evolution Survey (COSMOS)\".\n\n\n\t^ \"COSMOS Data Description For Astronomers\".\n\n\n\t^ \"HUBBLE MAPS THE COSMIC WEB OF \"CLUMPY\" DARK MATTER IN 3-D\".\n\n\n\t^ Strolger & Rose 2017, p. 11.\n\n\t^ \"HST Overview\". NASA. June 21, 2010. Mission Operations and Observations. Retrieved November 4, 2012.\n\n\n\t^ \"Team Hubble\". STScI. Retrieved November 5, 2012. Each year more than 1,000 proposals are reviewed and approximately 200 are selected.\n\n\n\t^ Strolger & Rose 2017, p. 21.\n\n\t^ Strolger & Rose 2017, p. 37.\n\n\t^ \"Hubble Image Processors: Raiders of the Hubble Archive\". Hubblesite.org. Retrieved November 23, 2016.\n\n\n\t^ \"Amateur Astronomers Will Use NASA's Hubble Space Telescope\". STScI. September 10, 1992. Retrieved April 26, 2008.\n\n\n\t^ a b O'Meara, Stephen James (June 1997).  Aguirre, Edwin L. (ed.). \"The Demise of the HST Amateur Program\". Sky & Telescope. 96 (6): 97. Bibcode:1997S&T....93f..97O.\n\n\n\t^ Secosky, James J.; Potter, Michael (September 1994). \"A Hubble Space Telescope Study of Posteclipse Brightening and Albedo Changes on Io\". Icarus. 111 (1): 73–78. Bibcode:1994Icar..111...73S. doi:10.1006/icar.1994.1134.\n\n\n\t^ Storrs, Alex; Weiss, Ben; Zellner, Ben; Burleson, Win;  et al. (February 1999). \"Imaging Observations of Asteroids with Hubble Space Telescope\" (PDF). Icarus. 137 (2): 260–268. Bibcode:1999Icar..137..260S. doi:10.1006/icar.1999.6047. Archived from the original (PDF) on February 25, 2012.\n\n\n\t^ Walthert, Matthew (April 24, 2015). \"Open Mic Night at the Hubble Telescope\". Motherboard. Retrieved April 25, 2015.\n\n\n\t^ Bahcall, JN; Bergeron, J; Boksenberg, A; Hartig, GF; Jannuzi, BT; Kirhakos, S; Sargent, WLW; Savage, BD;  et al. (1993). \"The Hubble Space Telescope Quasar Absorption Line Key Project. I. First Observational Results, Including Lyman-Alpha and Lyman-Limit Systems\". The Astrophysical Journal Supplement Series. 87: 1–43. Bibcode:1993ApJS...87....1B. doi:10.1086/191797. ISSN 0067-0049.\n\n\n\t^ Ostrander, EJ; Nichol, RC; Ratnatunga, KU; Griffiths, RE (1998). \"The Hubble Space Telescope Medium Deep Survey Cluster Sample: Methodology and Data\". The Astronomical Journal. 116 (6): 2644–2658. arXiv:astro-ph/9808304. Bibcode:1998AJ....116.2644O. doi:10.1086/300627.\n\n\n\t^ Huchra, John. \"The Hubble Constant\". Retrieved January 11, 2011.\n\n\n\t^ Freedman, W. L.; Madore, B. F.; Gibson, B.K.; Ferrarese, L.; Kelson, D. D.; Sakai, S.; Mould, J. R.; Kennicutt, R. C. Jr.;  et al. (2001). \"Final Results from the Hubble Space Telescope Key Project to Measure the Hubble Constant\". The Astrophysical Journal. 553 (1): 47–72. arXiv:astro-ph/0012376. Bibcode:2001ApJ...553...47F. doi:10.1086/320638.\n Preprint available here.\n\n\t^ Palmer, Roxanne (April 24, 2015). \"25 of the Greatest Hubble Telescope Discoveries From the Past 25 Years\". World Science Festival. Archived from the original on March 6, 2016. Retrieved February 23, 2016.\n\n\n\t^ Weinberg, Steven (2008). Cosmology. Oxford University Press. ISBN 9780198526827.\n\n\n\t^ Clifton, Timothy; Ferreira, Pedro G (March 23, 2009). \"Does Dark Energy Really Exist?\". Scientific American. Retrieved June 16, 2009.\n\n\n\t^ Seife, Charles (June 20, 2003). \"Dark Energy Tiptoes Toward the Spotlight\". Science. 300 (5627): 1896–1897. doi:10.1126/science.300.5627.1896. PMID 12817137.\n\n\n\t^ \"Hubble Confirms Existence of Massive Black Hole at Heart of Active Galaxy\". Goddard Space Flight Center. May 25, 1994. Retrieved April 26, 2008.\n\n\n\t^ Gebhardt, K; Bender, R; Bower, G; Dressler, A;  et al. (2000). \"A Relationship between Nuclear Black Hole Mass and Galaxy Velocity Dispersion\". The Astrophysical Journal. 539 (1): L13–L16. arXiv:astro-ph/0006289. Bibcode:2000ApJ...539L..13G. doi:10.1086/312840.\n\n\n\t^ Ferrarese, Laura; Merritt, David (2000). \"A Fundamental Relationship between Supermassive Black Holes and their Host Galaxies\". The Astrophysical Journal. 539 (1): L9–L12. arXiv:astro-ph/0006053. Bibcode:2000ApJ...539L...9F. doi:10.1086/312838.\n\n\n\t^ Brumfiel, Geoff (September 19, 2008). \"How they wonder what you are\". Nature News. doi:10.1038/news.2008.1122. Retrieved November 4, 2012.\n\n\n\t^ Gänsicke, BT; Levan, AJ; Marsh, TR; Wheatley, PJ (2009). \"SCP06F6: A carbon-rich extragalactic transient at redshift z~0.14?\". The Astrophysical Journal. 697 (1): L129–L132. arXiv:0809.2562. Bibcode:2009ApJ...697L.129G. doi:10.1088/0004-637X/697/2/L129.\n\n\n\t^ \"Hubble Team Breaks Cosmic Distance Record\". HubbleSite.org. March 3, 2016. STScI-2016-07. Retrieved March 3, 2016.\n\n\n\t^ Klotz, Irene (March 3, 2016). \"Hubble Spies Most Distant, Oldest Galaxy Ever\". Discovery News. Retrieved March 3, 2016.\n\n\n\t^ Nemiroff, R.; Bonnell, J., eds. (March 11, 1996). \"Hubble Telescope Maps Pluto\". Astronomy Picture of the Day. NASA. Retrieved April 26, 2008.\n\n\n\t^ \"Astronomers Measure Mass of Largest Dwarf Planet\" (Press release). STScI. June 14, 2007. Retrieved April 26, 2008.\n\n\n\t^ \"Hubble discovers fifth and tiniest Pluto moon\". The Indian Express. July 12, 2012. Archived from the original on January 26, 2013.\n\n\n\t^ \"NASA's Hubble Observations Suggest Underground Ocean on Jupiter's Largest Moon\" (Press release). Space Telescope Science Institute. March 12, 2015. Retrieved March 13, 2015.\n\n\n\t^ Saur, Joachim; Duling, Stefan; Roth, Lorenz; Jia, Xianzhe;  et al. (March 2015). \"The search for a subsurface ocean in Ganymede with Hubble Space Telescope observations of its auroral ovals\". Journal of Geophysical Research. 120 (3): 1715–1737. Bibcode:2015JGRA..120.1715S. doi:10.1002/2014JA020778.\n\n\n\t^ \"ALMA and VLT Find Evidence for Stars Forming Just 250 Million Years After Big Bang\". www.eso.org. Retrieved May 18, 2018.\n\n\n\t^ \"Caught in the act: Hubble captures first-ever predicted exploding star\". Spacetelescope.org. December 16, 2015. Retrieved December 19, 2015.\n\n\n\t^ \"Hubble and Gaia accurately weigh the Milky Way\". Phys.org. March 7, 2019. Retrieved March 20, 2019.\n\n\n\t^ \"Hubble Confirms Abundance of Protoplanetary Disks around Newborn Stars\". STScI. June 13, 1994. Retrieved April 26, 2008.\n\n\n\t^ \"Hubble Finds Extrasolar Planets Far Across Galaxy\". NASA. October 4, 2006. Retrieved April 26, 2008.\n\n\n\t^ \"Autopsy of an Explosion\". NASA. March 26, 1999. Archived from the original on April 15, 2008. Retrieved April 26, 2008.\n\n\n\t^ \"HST Publication Statistics\". STScI. Retrieved December 26, 2017.\n\n\n\t^ Meylan, Georges; Madrid, Juan; Macchetto, Duccio (Spring 2003). \"Hubble Science Metrics\" (PDF). Newsletter. Space Telescope Science Institute. 20 (2).\n\n\n\t^ Benn, CR; Sánchez, SF (2001). \"Scientific Impact of Large Telescopes\". Publications of the Astronomical Society of the Pacific. 113 (781): 385–396. arXiv:astro-ph/0010304. Bibcode:2001PASP..113..385B. doi:10.1086/319325.\n\n\n\t^ Haniff, CA; Mackay, CD; Titterington, DJ; Sivia, D;  et al. (August 1987). \"The first images from optical aperture synthesis\". Nature. 328 (6132): 694–696. Bibcode:1987Natur.328..694H. doi:10.1038/328694a0.\n\n\n\t^ Buscher, DF; Baldwin, JE; Warner, PJ; Haniff, CA (July 1990). \"Detection of a bright feature on the surface of Betelgeuse\". Monthly Notices of the Royal Astronomical Society. 245: 7. Bibcode:1990MNRAS.245P...7B.\n\n\n\t^ Lallo, Matthew D. (January 2012). \"Experience with the Hubble Space Telescope: 20 years of an archetype\". Optical Engineering. 51 (1). 011011. arXiv:1203.0002. Bibcode:2012OptEn..51a1011L. doi:10.1117/1.OE.51.1.011011.\n\n\n\t^ a b c \"Gyroscopes\". ESA. Retrieved June 9, 2012.\n\n\n\t^ \"Hubble stretches the stellar tape measure ten times further\". ESA/Hubble Images. Retrieved April 12, 2014.\n\n\n\t^ a b \"Team Hubble\". STScI. Data Management. Retrieved November 5, 2012.\n\n\n\t^ Rosen, Raphael (July 24, 2013). \"The Secret Science of the Hubble Space Telescope's Amazing Images\". Space.com. Retrieved July 26, 2013.\n\n\n\t^ Iconic Space Images Are Actually Black-and-White. National Geographic. March 15, 2015. Retrieved March 27, 2015.\n\n\n\t^ Hester, Jeff (July 1, 2008). \"How Hubble Sees\". Nova ScienceNow. PBS. Retrieved August 17, 2015.\n\n\n\t^ \"The Hubble Telescope\". STScI. Retrieved April 26, 2008.\n\n\n\t^ \"CADC's Hubble Space Telescope Archive\". CADC. Retrieved April 26, 2008.\n\n\n\t^ \"European HST Archive at ESA/ESAC\". ESA/ESAC. Archived from the original on May 25, 2013. Retrieved February 14, 2013.\n\n\n\t^ Strolger & Rose 2017, p. 53.\n\n\t^ Rose 2017, p. 69.\n\n\t^ a b \"The Hubble Heritage Project\". STScI. Retrieved November 5, 2012.\n\n\n\t^ Rose 2017, pp. 67–69.\n\n\t^ Rose 2017, pp. 68–69.\n\n\t^ \"National Aeronautics and Space Administration 2003 Strategic Plan\" (PDF). NASA. Archived from the original (PDF) on November 16, 2012. Retrieved November 5, 2012.\n\n\n\t^ \"The European Homepage for the NASA/ESA Hubble Space Telescope\". European Space Agency. Retrieved April 26, 2008.\n\n\n\t^ \"Hubblecast\". European Space Agency. Retrieved April 26, 2015.\n\n\n\t^ \"Historic Hubble Space Telescope Repair Mission Team Honored by the Space Foundation with 2010 Space Achievement Award\" (Press release). 26th National Space Symposium. March 29, 2010. Archived from the original on March 6, 2012. Retrieved November 5, 2012.\n\n\n\t^ \"Starry-Eyed Hubble Celebrates 20 Years of Awe and Discovery\" (Press release). Space Telescope Science Institute. April 22, 2010. Retrieved November 4, 2012.\n\n\n\t^ \"25th Anniversary Image: Westerlund 2\". Space Telescope Science Institute. Retrieved April 24, 2015.\n\n\n\t^ \"Celebrating 25 years of the NASA/ESA Hubble Space Telescope\". European Space Agency. Retrieved April 24, 2015.\n\n\n\t^ \"Hubble captures birthday bubble\". SpaceTelescope.org. European Space Agency. April 21, 2016. Retrieved December 15, 2016.\n\n\n\t^ Sembach, K. R.;  et al. (October 2004). \"HST Two-Gyro Handbook\". 1.0. Baltimore: Space Telescope Science Institute.\n\n\n\t^ \"Hubble Space Telescope Pointing Control System\". NASA. Retrieved October 24, 2018.\n\n\n\t^ Beasley, Dolores; Hendrix, Susan; Weaver, Donna (August 31, 2005). \"Hubble Space Telescope Begins 'Two-Gyro' Science Operations\". NASA. Retrieved February 8, 2019.\n\n\n\t^ Hecht, Jeff (September 6, 2007). \"Hubble telescope loses another gyroscope\". New Scientist. Retrieved January 6, 2009.\n\n\n\t^ Harwood, William (October 30, 2008). \"Endeavour to go Nov. 14; Hubble slips deeper into '09\". Spaceflight Now. Retrieved January 6, 2009.\n\n\n\t^ Garner, Rob (October 8, 2018). \"Update on the Hubble Space Telescope Safe Mode\". NASA. Retrieved October 15, 2018.\n\n\n\t^ Rincon, Paul (October 8, 2018). \"Hubble telescope hit by mechanical failure\". BBC News. Retrieved October 10, 2018.\n\n\n\t^ Foust, Jeff (October 22, 2018). \"NASA makes progress on fixing Hubble gyro\". Space News.\n\n\n\t^ Molina, Brett (October 24, 2018). \"What fixed NASA's Hubble Space Telescope? Someone flipped a switch on and off\". USA Today. Retrieved February 8, 2019.\n\n\n\t^ Wang, Amy B. (October 24, 2018). \"No, NASA didn't fix the Hubble Telescope by just turning it off and on again\". The Washington Post. Retrieved February 8, 2019.\n\n\n\t^ Chou, Felicia (October 27, 2018). \"NASA's Hubble Space Telescope Returns to Science Operations\". NASA. Retrieved February 8, 2019.\n\n\n\t^ \"Space Telescope Imaging Spectrograph\". STScI. Retrieved April 26, 2008.\n\n\n\t^ \"Engineers Investigate Issue on One of Hubble's Science Instruments\". NASA. January 29, 2007. Retrieved April 26, 2008.\n\n\n\t^ \"Advanced Camera for Surveys\". STScI. Retrieved May 21, 2009.\n\n\n\t^ Harwood, William (May 17, 2009). \"Part of camera in newly repaired instrument revived\". Spaceflight Now. Archived from the original on May 20, 2009. Retrieved May 17, 2009.\n\n\n\t^ Gutro, Rob (January 17, 2019). \"Hubble's Wide Field Camera 3 Recovered, Collecting Science Data\". NASA.\n\n\n\t^ Kornfeld, Laurel (January 17, 2019). \"Hubble's Wide Field Camera 3 resumes operations\". Spaceflight Insider.\n\n\n\t^ Whitehouse, David (January 17, 2004). \"Why Hubble is being dropped\". BBC News. Retrieved January 10, 2007.\n\n\n\t^ Wall, Mike (April 24, 2015). \"How Will the Hubble Space Telescope Die?\". Space.com. Retrieved May 16, 2017.\n\n\n\t^ Northon, Karen (June 23, 2016). \"NASA Extends Hubble Space Telescope Science Operations Contract\" (Press release). NASA. Retrieved June 26, 2016.\n\n\n\t^ Cowing, Keith (July 22, 2005). \"NASA Considering Deletion of Hubble Deorbit Module\". SpaceRef. Retrieved January 10, 2007.\n\n\n\t^ \"Team Hubble: Servicing Missions\". HubbleSite.org. Retrieved October 24, 2018.\n\n\n\t^ Bennett, Jay (February 14, 2017). \"A New Spaceship Could Fly Astronauts to the Hubble Space Telescope for Repairs\". Popular Mechanics. Retrieved February 15, 2017.\n\n\n\t^ Matson, John (May 8, 2009). \"Last Dance with the Shuttle: What's in Store for the Final Hubble Servicing Mission\". Scientific American. Retrieved May 18, 2009.\n\n\n\t^ Berger, Brian (May 23, 2007). \"NASA Adds Docking Capability For Next Space Observatory\". Space.com. Retrieved June 4, 2012.\n\n\n\t^ \"NASA's Hubble Finds Most Distant Galaxy Candidate Ever Seen in Universe\" (Press release). NASA. January 26, 2011. Retrieved June 4, 2012.\n Visual representation.\n\n\t^ \"ESA JWST Timeline\". Sci.esa.int. June 30, 2003. Archived from the original on August 21, 2003. Retrieved June 4, 2012.\n\n\n\t^ \"About Webb's Launch\". NASA. Retrieved November 4, 2006.\n\n\n\t^ \"JPL: Herschel Space Observatory: Related Missions\". Herschel.jpl.nasa.gov. Retrieved June 4, 2012.\n\n\n\t^ \"What Will Astronomy Be Like in 35 Years?\". Astronomy. August 2008.\n\n\t^ Tresch Fienberg, Richard (September 14, 2007). \"Sharpening the 200-Inch\". Sky & Telescope. Retrieved July 1, 2008.\n\n\n\n\n\nBibliography[edit]\n\n\n\tStrolger, Louis-Gregory; Rose, Susan, eds. (January 2017). \"Hubble Space Telescope Call for Proposals for Cycle 25\" (PDF). Space Telescope Science Institute. Archived from the original (PDF) on May 27, 2008. Retrieved April 16, 2008.\n\n\tRose, Susan, ed. (January 2017). \"Hubble Space Telescope Primer for Cycle 25\" (PDF). Space Telescope Science Institute. Retrieved September 7, 2019.\n\n\tAllen, Lew; Angel, Roger; Mangus, John D.; Rodney, George A.;  et al. (November 1990). \"The Hubble Space Telescope Optical Systems Failure Report\". NASA Sti/Recon Technical Report N. NASA. 91: 12437. Bibcode:1990STIN...9112437. NASA TM-103443.\n The definitive report on the error in the Hubble mirror.\n\tDunar, Andrew J.; Waring, Stephen P. (1999). \"The Hubble Space Telescope\" (PDF). Power to Explore: History of Marshall Space Flight Center 1960–1990. NASA. ISBN 978-0-16-058992-8. Archived from the original (PDF) on June 12, 2003.\n Covers the development of the telescope.\n\tLogsdon, John M.; Snyder, Amy Paige; Launius, Roger D.; Garber, Stephen J.; Newport, Regan Anne, eds. (2001). Exploring the Unknown: Selected Documents in the History of the U.S. Civil Space Program. Volume V: Exploring the Cosmos (PDF). NASA History Series. NASA. ISBN 978-0-16-061774-4. NASA SP-2001-4407.\n Contains many of the primary documents such as Spitzer's 1946 article, the Wood's Hole report on STScI autonomy, and the ESA memorandum of understanding. Also includes other NASA astronomy programs.\n\tSpitzer, Lyman S. (March 1979). \"History of the Space Telescope\". Quarterly Journal of the Royal Astronomical Society. 20: 29–36. Bibcode:1979QJRAS..20...29S.\n Covers the early history of precursors and proposals.\n\tTatarewicz, Joseph N. (1998). \"The Hubble Space Telescope Servicing Mission\".  In Mack, Pamela E. (ed.). From Engineering Science to Big Science. NASA History Series. NASA. ISBN 978-0-16-049640-0. NASA SP-1998-4219.\n A detailed account of the first servicing mission.\n\n\n\n\nFurther reading[edit]\n\n\tBahcall, John N.; Barish, Barry C.; Hewitt, Jacqueline N.; McKee, Christopher F.;  et al. (August 2003). \"Report of the HST-JWST Transition Panel\" (PDF). NASA.\n\n\tPearce, Rohan (March 29, 2012). \"What went wrong with the Hubble Space Telescope (and what managers can learn from it)\". Techworld. Retrieved March 30, 2012.\n\n\tZimmerman, Robert F. (2010). The Universe in a Mirror: The Saga of the Hubble Space Telescope and the Visionaries Who Built It. Princeton University Press. ISBN 978-0-691-14635-5.\n\n\n\nExternal links[edit]\n\nListen to this article (info/dl)\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis audio file was created from a revision of the article \"Hubble Space Telescope\" dated 2006-05-29, and does not reflect subsequent edits to the article. (Audio help)\n\nMore spoken articles\n\n\n\n\t Media related to Hubble Space Telescope at Wikimedia Commons\n\tHubbleSite\n\tHubble Space Telescope at NASA.gov\n\tSpacetelescope.org, a Hubble outreach site by ESA\n\tThe Hubble Heritage Project and Hubble archives by STScI\n\tHubble archives by ESA\n\tHubble archives by CADC\n\tHubble current position by N2YO.com\n\n\n\t\tv\n\tt\n\te\n\n\nHubble Space Telescope\n\n\tCurrent instruments\t\n\tAdvanced Camera for Surveys (ACS)\n\tCosmic Origins Spectrograph (COS)\n\tFine Guidance Sensor (FGS)\n\tNear Infrared Camera and Multi-Object Spectrometer (NICMOS)\n\tSpace Telescope Imaging Spectrograph (STIS)\n\tWide Field Camera 3 (WFC3)\n\n\n\n\t\n\n\n\tPrevious instruments\t\n\tCorrective Optics Space Telescope Axial Replacement (COSTAR)\n\tFaint Object Camera (FOC)\n\tFaint Object Spectrograph (FOS)\n\tGoddard High Resolution Spectrograph (GHRS/HRS)\n\tHigh Speed Photometer (HSP)\n\tWide Field and Planetary Camera (WFPC)\n\tWide Field and Planetary Camera 2 (WFPC2)\n\n\n\n\n\tSpace Shuttle missions\t\n\tLaunch: STS-31 (1990, Discovery)\n\tServicing: STS-61 (1993, Endeavour)\n\tSTS-82 (1997, Discovery)\n\tSTS-103 (1999, Discovery)\n\tSTS-109 (2002, Columbia)\n\tSTS-125 (2009, Atlantis)\n\n\n\n\n\tSpecial fields and images\t\n\tPillars of Creation (1995)\n\tHubble Deep Field (1995)\n\tHubble Deep Field South (1998)\n\tHubble Ultra-Deep Field (2003–04)\n\tExtended Groth Strip (2004–05)\n\tSWEEPS (2006)\n\tMystic Mountain (2010)\n\tHubble eXtreme Deep Field (2012)\n\tHubble Legacy Field (2019)\n\tGreat Observatories Origins Deep Survey\n\tAnniversaries\n\n\n\n\n\tRelated\t\n\tGreat Observatories program\n\tEdwin Hubble\n\tHubble (2010 documentary)\n\tHubble Origins Probe\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpace observatories\n\n\tOperating\t\n\tAGILE (since 2007)\n\tAMS-02 (since 2011)\n\tAoi (since 2018)\n\tASTERIA (since 2017)\n\tAstrosat (since 2015)\n\tBRITE constellation (since 2013)\n\tCALET (since 2015)\n\tChandra (AXAF) (since 1999)\n\tDAMPE (since 2015)\n\tFermi (since 2008)\n\tGaia (since 2013)\n\tHXMT (Insight) (since 2017)\n\tHinode (Solar-B) (since 2006)\n\tHiRISE (since 2005)\n\tHisaki (SPRINT-A) (since 2013)\n\tHubble (since 1990)\n\tINTEGRAL (since 2002)\n\tIBEX (since 2008)\n\tIRIS (since 2013)\n\tISS-CREAM (since 2017)\n\tMAXI (since 2009)\n\tMikhailo Lomonosov (since 2016)\n\tMini-EUSO (since 2019)\n\tNCLE (since 2018)\n\tNEOSSat (since 2013)\n\tNICER (since 2017)\n\tNuSTAR (since 2012)\n\tOdin (since 2001)\n\tSDO (since 2010)\n\tSOHO (since 1995)\n\tSOLAR (since 2008)\n\tSpektr-RG (since 2019)\n\tSpitzer (since 2003)\n\tSTEREO (since 2006)\n\tSwift (since 2004)\n\tTESS (since 2018)\n\tWISE (since 2009)\n\tXMM-Newton (since 1999)\n\n\n\n\n\tPlanned\t\n\tCHEOPS (2019)\n\tiWF-MAXI (2019)\n\tPublic Telescope (PST) (2019)\n\tAstro-1 Telescope (2020)\n\tILO-1 (2020)\n\tLUCI (2020)\n\tNano-JASMINE (2020)\n\tORBIS (2020)\n\tSolar Orbiter (SolO) (2020)\n\tIXPE (2021)\n\tJames Webb (JWST) (2021)\n\tLORD (2021)\n\tSVOM (2021)\n\tXPoSat (2021)\n\tEuclid (2022)\n\tSpace Solar Telescope (2022)\n\tXRISM (2022)\n\tXuntian (2022)\n\tK-EUSO (2023)\n\tSolar-C (2023)\n\tSpektr-UV (2023)\n\tSPHEREx (2023)\n\tNear-Earth Object Surveillance Mission (2025+)\n\tWFIRST (2025+)\n\tPLATO (2026)\n\tSpektr-M (2026+)\n\tLiteBIRD (2027)\n\tARIEL (2028)\n\tATHENA (2031)\n\tLISA (2034)\n\n\n\n\n\tProposed\t\n\tArcus\n\tAstroSat-2\n\tEXCEDE\n\tFresnel Imager\n\tFOCAL\n\tHabEx\n\tHibari\n\tHypertelescope\n\tJEM-EUSO\n\tLUVOIR\n\tATLAST\n\tHDST\n\n\n\tLynx\n\tNautilus Deep Space Observatory\n\tNew Worlds Mission\n\tNRO donation to NASA\n\tOST\n\tPhoENiX\n\tSmall-JASMINE\n\tSolar-D\n\tSPICA\n\tTHEIA\n\tTHESEUS\n\n\n\n\n\tRetired\t\n\tAkari (Astro-F) (2006–2011)\n\tALEXIS (1993–2005)\n\tAlouette 1 (1962–1972)\n\tAriel 1 (1962, 1964)\n\tAriel 2 (1964)\n\tAriel 3 (1967–1969)\n\tAriel 4 (1971–1972)\n\tAriel 5 (1974–1980)\n\tAriel 6 (1979–1982)\n\tATM (1973–1974)\n\tASCA (Astro-D) (1993–2000)\n\tAstro-1 (1990)\n\tBBXRT\n\tHUT\n\n\n\tAstro-2 (HUT) (1995)\n\tAstron (1983–1989)\n\tANS (1974–1976)\n\tBeppoSAX (1996–2003)\n\tCHIPSat (2003–2008)\n\tCompton (CGRO) (1991–2000)\n\tCoRoT (2006–2013)\n\tCos-B (1975–1982)\n\tCOBE (1989–1993)\n\tDXS (1993)\n\tEPOCh (2008)\n\tEPOXI (2010)\n\tExplorer 11 (1961)\n\tEXOSAT (1983–1986)\n\tEUVE (1992–2001)\n\tFUSE (1999–2007)\n\tKvant-1 (1987–2001)\n\tGALEX (2003–2013)\n\tGamma (1990–1992)\n\tGinga (Astro-C) (1987–1991)\n\tGranat (1989–1998)\n\tHakucho (CORSA-b) (1979–1985)\n\tHALCA (MUSES-B) (1997–2005)\n\tHEAO-1 (1977–1979)\n\tHerschel (2009–2013)\n\tHinotori (Astro-A) (1981–1991)\n\tHEAO-2 (Einstein Obs.) (1978–1982)\n\tHEAO-3 (1979–1981)\n\tHETE-2 (2000–2008)\n\tHipparcos (1989–1993)\n\tIUE (1978–1996)\n\tIRAS (1983)\n\tIRTS (1995–1996)\n\tISO (1996–1998)\n\tIXAE (1996–2004)\n\tKepler (2009–2018)\n\tKristall (1990–2001)\n\tLEGRI (1997–2002)\n\tLISA Pathfinder (2015–2017)\n\tMOST (2003–2019)\n\tMSX (1996–1997)\n\tOAO-2 (1968–1973)\n\tOAO-3 (Copernicus) (1972–1981)\n\tOrbiting Solar Observatory\n\tOSO 1\n\tOSO 2/OSO B\n\tOSO 3\n\tOSO 4\n\tOSO 5\n\tOSO 6\n\tOSO 7\n\tOSO 8\n\n\n\tOrion 1 (1971)\n\tOrion 2 (1973)\n\tPAMELA (2006–2016)\n\tPicSat (2018)\n\tPlanck (2009–2013)\n\tRELIKT-1 (1983–1984)\n\tR/HESSI (2002–2018)\n\tROSAT (1990–1999)\n\tRXTE (1995–2012)\n\tSAMPEX (1992–2004)\n\tSAS-B (1972–1973)\n\tSAS-C (1975–1979)\n\tSolwind (1979–1985)\n\tSpektr-R (2011–2019)\n\tSuzaku (Astro-EII) (2005–2015)\n\tTaiyo (SRATS) (1975–1980)\n\tTenma (Astro-B) (1983–1985)\n\tUhuru (1970–1973)\n\tVanguard 3 (1959)\n\tWMAP (2001–2010)\n\tYokoh (Solar-A) (1991–2001)\n\n\n\n\n\tHibernating \n(Mission completed)\t\n\tSWAS (1998–2005)\n\tTRACE (1998–2010)\n\n\n\n\n\tLost\t\n\tOAO-1 (1966)\n\tOAO-B (1970)\n\tCORSA (1976)\n\tOSO C (1965)\n\tABRIXAS (1999)\n\tHETE-1 (1996)\n\tWIRE (1999)\n\tAstro-E (2000)\n\tTsubame (2014–2015)\n\tHitomi (Astro-H) (2016)\n\n\n\n\n\tCancelled\t\n\tAOSO\n\tAstro-G\n\tConstellation-X\n\tDarwin\n\tDestiny\n\tEChO\n\tEddington\n\tFAME\n\tFINESSE\n\tGEMS\n\tHOP\n\tIXO\n\tJDEM\n\tLOFT\n\tOSO J\n\tOSO K\n\tSentinel\n\tSIM & SIMlite\n\tSNAP\n\tSPOrt\n\tTAUVEX\n\tTPF\n\tXEUS\n\tXIPE\n\n\n\n\n\tSee also\t\n\tGreat Observatories program\n\tList of space telescopes\n\tList of proposed space observatories\n\tList of X-ray space telescopes\n\n\n\n\n\t\n\t Category\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nExoplanet search projects\n\n\t\n\tExoplanetology\n\tExoplanet\n\n\n\n\n\tGround-based\t\n\tAAPS\n\tAPF\n\tCORALIE\n\tEAPSNet\n\tELODIE\n\tEPICS\n\tESPRESSO\n\tFINDS Exo-Earths\n\tGeneva\n\tHARPS\n\tHARPS-N\n\n\n\tGPI\n\tHATNet\n\tHEK\n\tHiCIAO\n\tHIRES\n\tKELT\n\tLCES\n\tMagellan\n\tMARVELS\n\tMASCARA\n\tMEarth\n\tMicroFUN\n\tMINERVA\n\tAustralis\n\n\n\tMOA\n\tN2K\n\tNGTS\n\tNESSI\n\tOGLE\n\tOPSP\n\tPlanetPol\n\tProject 1640\n\tPARAS\n\tSEEDS\n\tSETI\n\tSOPHIE\n\tSPECULOOS\n\tSPHERE\n\tSuperWASP\n\tSystemic\n\tTrES\n\tXO Telescope\n\tZIMPOL/CHEOPS\n\n\n\n\t\n\n\n\n\tSpace missions\t\n\tPast\t\n\tMOST (2003–2019)\n\tSWEEPS using HST (2006)\n\tCoRoT (2006–2013)\n\tEPOXI using Deep Impact (2008–2013)\n\tKepler (2009–2018)\n\tdetected exoplanets\n\n\n\n\n\n\n\tCurrent\t\n\tGaia (2013–present)\n\tASTERIA (2017–present)\n\tTESS (2018–present)\n\n\n\n\n\tPlanned\t\n\tCHEOPS (2019)\n\tJames Webb Space Telescope (2021)\n\tPLATO (2026)\n\tARIEL (2028)\n\tWFIRST  (mid-2020s)\n\n\n\n\n\tProposed\t\n\tATLAST\n\tEXCEDE\n\tHabEx\n\tHDST\n\tLUVOIR\n\tNautilus Deep Space Observatory\n\tNew Worlds Mission\n\tOST\n\tPEGASE\n\n\n\n\n\tCancelled\t\n\tDarwin\n\tEChO\n\tEddington\n\tSpace Interferometry Mission\n\tTerrestrial Planet Finder\n\n\n\n\n\n\n\n\t\n\tDetection methods\n\tDiscoveries of exoplanets\n\tLists of exoplanets\n\tnearest\n\n\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nEuropean Space Agency\n\n\t\n\tSpaceports\t\n\tGuiana Space Centre\n\tEsrange\n\n\n\n\n\tLaunch vehicles\t\n\tAriane 5\n\tAriane 6\n\tArianespace Soyuz\n\tVega\n\n\n\n\n\tFacilities\t\n\tSpace Operations Centre\n\tSpace Research and Technology Centre\n\tESA Centre for Earth Observation\n\tEuropean Astronaut Centre\n\tSpace Astronomy Centre\n\tSpace Applications and Telecommunications Centre\n\tConcurrent Design Facility\n\tSpace Telescope European Coordinating Facility\n\n\n\n\n\tCommunications\t\n\tESTRACK\n\tEuropean Data Relay System\n\n\n\n\n\tProgrammes\t\n\tAurora\n\tATV\n\tCopernicus\n\tSentinel\n\n\n\tColumbus\n\tCryoSat\n\tEGNOS\n\tGALILEO\n\tELIPS\n\tExoMars\n\tFLPP\n\tLiving Planet Programme\n\tOrion\n\tSpace Situational Awareness Programme\n\tScience Programme\n\tHorizon 2000\n\tCosmic Vision\n\n\n\tPride\n\n\n\n\n\tPredecessors\t\n\tEuropean Launcher Development Organisation\n\tEuropean Space Research Organisation\n\n\n\n\n\tRelated topics\t\n\tArianespace\n\tESA Television\n\tEUMETSAT\n\tEuropean Space Camp\n\tGEWEX\n\tPlanetary Science Archive\n\n\n\n\n\n\n\n\t\n\tProjects and missions\n\n\tScience\t\n\tSolar physics\t\n\tISEE-2 (1977–87)\n\tUlysses (1990–2009)\n\tSOHO (1995–present)\n\tCluster II (2000–present)\n\tSolar Orbiter (2020)\n\tLagrange (2020s)\n\n\n\n\n\tPlanetary science\t\n\tGiotto (1985–92)\n\tHuygens (1997–2005)\n\tSMART-1 (2003–06)\n\tMars Express (2003–present)\n\tRosetta/Philae (2004–16)\n\tVenus Express (2005–14)\n\tExoMars Trace Gas Orbiter (2016–present)\n\tBepiColombo (2018–present)\n\tRosalind Franklin rover (2020)\n\tJupiter Icy Moons Explorer (2022)\n\tComet Interceptor (2028)\n\n\n\n\n\tAstronomy and\ncosmology\n\t\n\tCos-B (1975–82)\n\tIUE (1978–96)\n\tEXOSAT (1983–86)\n\tHipparcos (1989–93)\n\tHubble (1990–present)\n\tEureca (1992–93)\n\tISO (1995–98)\n\tXMM-Newton (1999–present)\n\tINTEGRAL (2002–present)\n\tCoRoT (2006–13)\n\tPlanck (2009–13)\n\tHerschel (2009–13)\n\tGaia (2013–present)\n\tCHEOPS (2019)\n\tJames Webb (2021)\n\tEuclid (2022)\n\tPLATO (2026)\n\tARIEL (2028)\n\tATHENA (2031)\n\tLISA (2034)\n\n\n\n\n\tEarth observation\t\n\tCopernicus (1988–)\n\tMeteosat First Generation (1977–97)\n\tERS-1 (1991–2000)\n\tERS-2 (1995–2011)\n\tMeteosat Second Generation (2002–present)\n\tEnvisat (2002–12)\n\tDouble Star (2003–07)\n\tMetOp (2006–present)\n\tGOCE (2009–13)\n\tSMOS (2009–present)\n\tCryoSat-2 (2010–present)\n\tSwarm (2013–present)\n\tSentinel-1 / 1A / 1B (2014–present)\n\tSentinel-2 / 2A / 2B (2015–present)\n\tSentinel-3 / 3A / 3B (2016–present)\n\tSentinel-5 Precursor (2017–present)\n\tADM-Aeolus (2018–present)\n\tMeteosat Third Generation (Sentinel-4) (2019)\n\tEarthCARE (2021)\n\tMetOp-SG-A (2021)\n\tBiomass (2022)\n\tMetOp-SG-B (2022)\n\tFLEX (2023)\n\tSMILE (2023)\n\tFORUM (2026)\n\n\n\n\n\n\n\n\tISS spaceflight\t\n\tISS contribution (1998–present)\n\tColumbus (2008–present)\n\tJules Verne (2008)\n\tCupola (2010–present)\n\tJohannes Kepler (2011)\n\tEdoardo Amaldi (2012)\n\tAlbert Einstein (2013)\n\tGeorges Lemaître (2014)\n\tEuropean Robotic Arm (2019)\n\n\n\n\n\n\n\n\tTelecommunications\t\n\tGEOS 2 (1978)\n\tOlympus-1 (1989–93)\n\tArtemis (2001–present)\n\tGIOVE-A (2005–present)\n\tGIOVE-B (2008–present)\n\tHYLAS-1 (2010–present)\n\tGalileo IOV (2011–present)\n\tGalileo FOC (2014–present)\n\tEGNOS\n\tEuropean Data Relay System (2016–present)\n\n\n\n\n\tTechnology\ndemonstrators\n\t\n\tARD (1998)\n\tPROBA-1 (2001–present)\n\tYES2 (2007)\n\tPROBA-2 (2009–present)\n\tPROBA-V (2013–present)\n\tIXV (2015)\n\tLISA Pathfinder (2015–17)\n\tOPS-SAT (2019)\n\tPROBA-3 (2020)\n\tAIDA (2023)\n\n\n\n\n\tCancelled and proposed\t\n\tALTIUS\n\tAriane 5 ME\n\tColumbus Man-Tended Free Flyer\n\tCSTS\n\tDarwin Mission\n\tDon Quijote\n\te.Deorbit\n\tEChO\n\tEddington\n\tEnVision\n\tEXPERT\n\tHermes\n\tHopper\n\tLOFT\n\tLuna 27\n\tLunar Lander\n\tMarco Polo\n\tMarcoPolo-R\n\tMars sample return mission\n\tODINUS\n\tSPICA\n\tSTE-QUEST\n\tTHESEUS\n\tTHOR\n\tXIPE\n\n\n\n\n\tFailed\t\n\tCluster\n\tCryoSat-1\n\tGEOS 1\n\tSchiaparelli EDM\n\n\n\n\n\tFuture missions in italics\n\t Category\n\t Commons\n\t Wikinews\n\t WikiProject\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nEuropean human spaceflight\n\n\tGeneral\t\n\tEuropean Astronaut Corps\n\tISS contribution\n\tISS research\n\n\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\tFacilities\t\n\tEuropean Astronaut Centre\n\tColumbus Control Centre\n\tOberpfaffenhofen\n\tConcordia Station\n\n\n\n\n\tEarth-based research\t\n\tAMASE\n\tConcordia winterovers\n\tEuro-MARS\n\tEuropean Space Camp\n\tMARS-500\n\tMELiSSA\n\tZero-G Airbus A310\n\n\n\n\n\tSpacecraft used\t\n\tActive\t\n\tSoyuz-MS\n\n\n\n\n\tPlanned and proposed\t\n\tDC4EU\n\tOrion (Orion Service Module)\n\tSkylon\n\n\n\n\n\tRetired and cancelled\t\n\tCSTS\n\tHermes\n\tSoyuz-TM\n\tSoyuz-TMA\n\tSoyuz TMA-M\n\tSpace Shuttle\n\n\n\n\n\n\n\n\tMission highlights\t\n\tSpace stations\t\n\tMir\n\tEuromir\n\tInterkosmos\n\n\n\tInternational Space Station\n\tELIPS programme\n\tModules\n\tColumbus\n\tCupola\n\tHarmony\n\tTranquility\n\n\n\n\n\n\n\n\n\tOther\t\n\tEuropean Retrievable Carrier\n\tHubble Space Telescope\n\tFaint Object Camera\n\n\n\tMulti-Purpose Logistics Module\n\tSpacelab\n\tDeutschland-1\n\tDeutschland-2\n\n\n\tTethered Satellite System\n\n\n\n\n\n\n\n\t\n\tEuropean Space Agency\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNASA Goddard Space Flight Center\n\n\tMain articles\t\n\tRobert H. Goddard\n\tGSFC History\n\n\n\n\n\tFacilities\t\n\tWallops Flight Facility (WFF)\n\tGoddard Institute for Space Studies (GISS)\n\tIndependent Verification and Validation Facility (IV&V)\n\tSpacecraft Magnetic Test Facility\n\tSpacecraft Fabrication Facility\n\tColumbia Scientific Balloon Facility (CSBF)\n\n\n\n\n\tNotable missions\nand programs\t\n\tJames Webb Space Telescope (JWST)\n\tCosmic Background Explorer (COBE)\n\tSpace Network\n\tNear Earth Network\n\tLandsat program\n\tGetaway Special\n\tCompton Gamma Ray Observatory (CGRO)\n\tRossi X-ray Timing Explorer (RXTE)\n\tExplorers program\n\tHitchhiker Program\n\tSolar and Heliospheric Observatory (SOHO)\n\tLunar Reconnaissance Orbiter (LRO)\n\tSolar Dynamics Observatory (SDO)\n\tHubble Space Telescope (HST)\n\tTracking and Data Relay Satellite (TDRS)\n\n\n\n\n\tPeople\t\n\tLeadership\t\n\tChristopher Scolese (Director)\n\tGeorge Morrow (Deputy Director)\n\tChristyl Johnson (Deputy Director, Technology and Research Investments)\n\tColleen Hartman (Deputy Director, Science, Operations and Performance)\n\n\n\n\n\tNotable scientists\nand engineers\t\n\tDavid Louis Band\n\tRobert Bindschadler\n\tFred Espenak\n\tGene Carl Feldman\n\tOrlando Figueroa\n\tJames Hansen\n\tMarc Kuchner\n\tLissette Martinez\n\tJohn C. Mather\n\n\n\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNASA\n\n\tPolicy and history\t\n\tHistory\t\n\tNACA (1915)\n\tNational Aeronautics and Space Act (1958)\n\tSpace Task Group (1958)\n\tPaine (1986)\n\tRogers (1986)\n\tRide (1987)\n\tSpace Exploration Initiative (1989)\n\tAugustine (1990)\n\tU.S. National Space Policy (1996)\n\tCFUSAI (2002)\n\tCAIB (2003)\n\tVision for Space Exploration (2004)\n\tAldridge (2004)\n\tAugustine (2009)\n\n\n\n\n\tGeneral\t\n\tSpace Race\n\tAdministrator and Deputy Administrator\n\tChief Scientist\n\tAstronaut Corps\n\tRanks and positions\n\tChief\n\n\n\tBudget\n\tSpin-off technologies\n\tNASA TV\n\tNASA Social\n\tLaunch Services Program\n\tMercury Control Center\n\tKennedy Space Center\n\tVehicle Assembly Building\n\tLaunch Complex 39\n\tLaunch Control Center\n\tOperations and Checkout Building\n\n\n\tJohnson Space Center\n\tMission Control\n\tLunar Sample Laboratory\n\n\n\n\n\n\n\n\n\t\n\n\tRobotic programs\t\n\tPast\t\n\tHitchhiker\n\tMariner\n\tMariner Mark II\n\tMESUR\n\tMars Surveyor '98\n\tNew Millennium\n\tLunar Orbiter\n\tPioneer\n\tPlanetary Observer\n\tRanger\n\tSurveyor\n\tViking\n\tProject Prometheus\n\tMars Scout\n\tMars Exploration Rover\n\n\n\n\n\tCurrent\t\n\tLiving With a Star\n\tLunar Precursor Robotic Program\n\tEarth Observing System\n\tGreat Observatories program\n\tExplorer\n\tSmall explorer\n\tVoyager\n\tDiscovery\n\tNew Frontiers\n\tSolar Terrestrial Probes\n\tCommercial Lunar Payload Services\n\n\n\n\n\n\n\n\tHuman spaceflight\nprograms\t\n\tPast\t\n\tX-15 (suborbital)\n\tMercury\n\tGemini\n\tApollo\n\tApollo–Soyuz Test Project (with the Soviet space program)\n\tSkylab\n\tSpace Shuttle\n\tShuttle–Mir (with Roscosmos State Corporation)\n\tConstellation\n\n\n\n\n\tCurrent\t\n\tInternational Space Station\n\tCommercial Orbital Transportation Services\n\tCommercial Crew Development\n\tOrion\n\tArtemis\n\tLunar Gateway\n\n\n\n\n\n\n\n\tIndividual featured\n missions\n(human and robotic)\t\n\tPast\t\n\tCOBE\n\tMercury 3\n\tMercury-Atlas 6\n\tMagellan\n\tPioneer 10\n\tPioneer 11\n\tGalileo\n\tGALEX\n\tGRAIL\n\tWMAP\n\tSpace Shuttle\n\tSojourner rover\n\tSpirit rover\n\tLADEE\n\tMESSENGER\n\tAquarius\n\tCassini\n\tDawn\n\tKepler space telescope\n\tOpportunity rover\n\tRHESSI\n\tobserved\n\n\n\n\n\n\n\tCurrently\noperating\t\n\tMars Reconnaissance Orbiter\n\t2001 Mars Odyssey\n\tNew Horizons\n\tInternational Space Station\n\tHubble Space Telescope\n\tSpitzer\n\tSwift\n\tTHEMIS\n\tMars Exploration Rover\n\tCuriosity rover\n\ttimeline\n\n\n\tInSight\n\tGOES 14\n\tLunar Reconnaissance Orbiter\n\tGOES 15\n\tVan Allen Probes\n\tSolar Dynamics Observatory\n\tJuno\n\tMars Science Laboratory\n\ttimeline\n\n\n\tNuSTAR\n\tVoyager 1\n\tVoyager 2\n\tWISE\n\tMAVEN\n\tMMS\n\tOSIRIS-REx\n\tTransiting Exoplanet Survey Satellite\n\n\n\n\n\tFuture\t\n\tJoint Polar Satellite System\n\tJames Webb Space Telescope\n\tWide Field Infrared Survey Telescope\n\tMars 2020\n\tNISAR\n\tEuropa Clipper\n\n\n\n\n\n\n\n\tCommunications\nand navigation\t\n\tNear Earth Network\n\tSpace Network\n\tDeep Space Network (Goldstone\n\tMadrid\n\tCanberra\n\tSpace Flight Operations Facility)\n\tDeep Space Atomic Clock\n\n\n\n\n\tNASA lists\t\n\tAstronauts\n\tby name\n\tby year\n\tGemini astronauts\n\tApollo astronauts\n\n\n\tList of NASA aircraft\n\tList of NASA missions\n\tuncrewed missions\n\n\n\tList of NASA contractors\n\tList of United States rockets\n\tList of NASA cancellations\n\tList of Space Shuttle missions\n\tcrews\n\n\n\tList of NASA cameras on spacecraft\n\n\n\n\n\tNASA images\nand artwork\t\n\tEarthrise\n\tThe Blue Marble\n\tFamily Portrait\n\tPale Blue Dot\n\n\n\tPillars of Creation\n\tMystic Mountain\n\tSolar System Family Portrait\n\tThe Day the Earth Smiled\n\tFallen Astronaut\n\tLunar plaques\n\tPioneer plaques\n\tVoyager Golden Record\n\tApollo 11 goodwill messages\n\tNASA insignia\n\tGemini and Apollo medallions\n\tMission patches\n\n\n\n\n\tRelated\t\n\tApollo 15 postal covers incident\n\tSpace Mirror Memorial\n\tThe Astronaut Monument\n\tU.S. Astronaut Hall of Fame\n\tSpace program on U.S. stamps\n\tApollo 17 Moon mice\n\tOther primates in space\n\tNASA spinoff technologies\n\n\n\n\n\t\n\t Category\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n← 1989  ·  Orbital launches in 1990  ·  1991 →\n\n\tSkynet 4A ·  JCSAT-2 | STS-32 (Leasat 5) | Kosmos 2055 | Kosmos 2056 | SPOT-2 ·  UoSAT-3 ·  UoSAT-4 ·  Pacsat ·  DOVE ·  Webersat ·  LUSat | Molniya-3 No.53L | Hiten ·  Hagoromo | USA-50) | Kosmos 2057 | Kosmos 2058 | Zhongxing 3 | Kosmos 2059 | Momo 1b ·  Orizuru ·  Fuju 1b | Soyuz TM-9 | USA-51 ·  USA-52 | Gran' No.35L | Superbird B ·  BS 2x | Nadezhda No.405 | Okean-O1 No.5 | STS-36 (USA-53) | Progress M-3 | Intelsat 603 | Kosmos 2060 | Kosmos 2061 | Kosmos 2062 | USA-54 | Kosmos 2063 | Ofek-2 | Unnamed | Pegsat ·  USA-55 | Kosmos 2064 ·  Kosmos 2065 ·  Kosmos 2066 ·  Kosmos 2067 ·  Kosmos 2068 ·  Kosmos 2069 ·  Kosmos 2070 ·  Kosmos 2071 | AsiaSat 1 | USA-56 ·  USA-57 ·  USA-58 | Foton No.6L | Kosmos 2072 | Palapa B2R | Kosmos 2073 | Kosmos 2074 | STS-31 (Hubble) | Kosmos 2075 | Molniya-1 No.71 | Kosmos 2076 | Progress 42 | Kosmos 2077 | MacSat 1 ·  MacSat 2 | Kosmos 2078 | Kosmos 2079 ·  Kosmos 2080 ·  Kosmos 2081 | Kosmos 2082 | Resurs-F1 No.50 | Kristall | ROSAT | USA-59 ·  USA-60 ·  USA-61 ·  USA-62 | INSAT-1D | Molniya 3 No.47L | Kosmos 2083 | Gorizont No.30L | Kosmos 2084 | Intelsat 604 | Meteor-2 No.23 | Unnamed | Gamma | Badr-1 ·  Optus-MFS | Resurs-F2 No.5 | Kosmos 2085 | Kosmos 2086 | TDF-2 ·  DFS Kopernikus 2 | Kosmos 2087 | CRRES | Kosmos 2088 | Soyuz TM-10 | USA-63 | Kosmos 2089 | Kosmos 2090 ·  Kosmos 2091 ·  Kosmos 2092 ·  Kosmos 2093 ·  Kosmos 2094 ·  Kosmos 2095 | Ekran-M No.14L | Molniya-1T No.68 | Progress M-4 | Resurs-F1 No.49 | Marco Polo 2 | Kosmos 2096 | Kosmos 2097 | Yuri 3a | Kosmos 2098 | Skynet 4C ·  Eutelsat II F-1 | Kosmos 2099 | Fengyun I-02 ·  Qiqiuweixing 1 ·  Qiqiuweixing 2 | Resurs-F1 No.51 | Kosmos 2100 | Molniya-3 No.54L | Progress M-5 | Meteor-2 No.25 | Kosmos 2101 | USA-64 | Unnamed | FSW-1 No.3 | STS-41 (Ulysses) | SBS 6 ·  Westar 6S | Kosmos 2102 | Inmarsat-2F1 | Gorizont No.32L | USA-65 | Kosmos 2103 | STS-38 (USA-67 ·  Prowler) | Kosmos 2104 | Kosmos 2105 | Satcom C1 ·  GStar 4 | Molniya 1T No.70 | Gorizont No.33L | USA-66 | Kosmos 2106 | USA-68 | STS-35 | Soyuz TM-11 | Kosmos 2107 | Kosmos 2108 | Kosmos 2109 ·  Kosmos 2110 ·  Kosmos 2111 | Kosmos 2112 | Gran' No.37L | Kosmos 2113 | Kosmos 2114 ·  Kosmos 2115 ·  Kosmos 2116 ·  Kosmos 2117 ·  Kosmos 2118 ·  Kosmos 2119 | Kosmos 2120 | Globus No.12\n\n\tPayloads are separated by bullets ( · ), launches by pipes ( | ). Manned flights are indicated in bold text. Uncatalogued launch failures are listed in italics. Payloads deployed from other spacecraft are denoted in (brackets).\n\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4260288-9\n\tISNI: 0000 0001 2214 8100\n\tLCCN: n91011423\n\tNKC: ph117615\n\tNLA: 35793914\n\tNLA-person: 1090571\n\tNLI: 000255446\n\tVIAF: 121711981\n\t WorldCat Identities (via VIAF): 121711981\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Hubble_Space_Telescope&oldid=919156950\"\n\n\t\t\n\t\tCategories: \tSpoken articles\n\tHubble Space Telescope\n\tSpace observatories\n\tGreat Observatories program\n\tUltraviolet telescopes\n\tEuropean Space Agency satellites\n\tNASA satellites\n\tArtificial satellites orbiting Earth\n\tEdwin Hubble\n\tLockheed Corporation\n\tSpace accidents and incidents\n\tSpace science experiments\n\tSpacecraft launched by the Space Shuttle\n\tSpacecraft launched in 1990\n\tSpace accidents and incidents in the United States\n\n\nHidden categories: \tPages using Timeline\n\tWikipedia indefinitely move-protected pages\n\tArticles with short description\n\tUse mdy dates from February 2019\n\tUse American English from March 2018\n\tAll Wikipedia articles written in American English\n\tArticles containing potentially dated statements from 2019\n\tAll articles containing potentially dated statements\n\tArticles containing German-language text\n\tPages using multiple image with auto scaled images\n\tArticles containing potentially dated statements from 2017\n\tArticles with hAudio microformats\n\tCommons category link is on Wikidata\n\tOfficial website different in Wikidata and Wikipedia\n\tFeatured articles\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with ISNI identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NKC identifiers\n\tWikipedia articles with NLA identifiers\n\tWikipedia articles with NLA-person identifiers\n\tWikipedia articles with NLI identifiers\n\tWikipedia articles with VIAF identifiers\n\tWikipedia articles with WorldCat-VIAF identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tالعربية\n\tAragonés\n\tAsturianu\n\tAzərbaycanca\n\tتۆرکجه\n\tবাংলা\n\tBân-lâm-gú\n\tБашҡортса\n\tБеларуская\n\tभोजपुरी\n\tБългарски\n\tBosanski\n\tBrezhoneg\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGaelg\n\tGalego\n\t贛語\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tJawa\n\tಕನ್ನಡ\n\tქართული\n\tҚазақша\n\tKiswahili\n\tKurdî\n\tLatina\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tLimburgs\n\tLingua Franca Nova\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tमराठी\n\tმარგალური\n\tBahasa Melayu\n\tMirandés\n\tМонгол\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNordfriisk\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tپښتو\n\tPatois\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tSeeltersk\n\tShqip\n\tSicilianu\n\tSimple English\n\tسنڌي\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tతెలుగు\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\tWest-Vlams\n\t吴语\n\tYorùbá\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 2 October 2019, at 03:56 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "22", "dc:title": "Hubble Space Telescope - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/HST-SM4.jpeg/1200px-HST-SM4.jpeg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-hubble_space_telescope", "title": "Hubble Space Telescope - Wikipedia"}}