{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHypergolic propellant - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tHypergolic propellant\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nThe hypergolic fuel hydrazine being loaded onto the MESSENGER space probe. The attendant is wearing a full safety suit due to the hazardous materials.\n\n\n\nA hypergolic propellant combination used in a rocket engine is one whose components spontaneously ignite when they come into contact with each other.\n\nThe two propellant components usually consist of a fuel and an oxidizer. The main advantages of hypergolic propellants are that they can be stored as liquids at room temperature and that engines which are powered by them are easy to ignite reliably and repeatedly. Although commonly used, hypergolic propellants are difficult to handle due to their extreme toxicity and/or corrosiveness.\n\nIn contemporary usage, the terms \"hypergol\" or \"hypergolic propellant\" usually mean the most common such propellant combination, dinitrogen tetroxide plus hydrazine and/or its relatives monomethylhydrazine and unsymmetrical dimethylhydrazine.\n\n\nContents\n\n\n\t1 History\n\t2 Characteristics\n\t2.1 Advantages\n\t2.2 Disadvantages\n\n\n\n\t3 Hypergolic combinations\n\t3.1 Common\n\t3.2 Less common and obsolete\n\n\n\n\t4 Related technology\n\t5 Notes\n\t6 References\n\t7 External links\n\n\n\n\n\nHistory[edit]\n\nSoviet rocket engine researcher Valentin Glushko experimented with hypergolic fuel as early as 1931. It was initially used for \"chemical ignition\" of engines, starting kerosene/nitric acid engines with an initial charge of phosphorus dissolved in carbon disulfide.\n\nStarting in 1935, Prof. O. Lutz of the German Aeronautical Institute experimented with over 1000 self-igniting propellants. He assisted the Walter Company with the development of C-Stoff which ignited with concentrated hydrogen peroxide.  BMW developed engines burning a hypergolic mix of nitric acid with various combinations of amines, xylidines and anilines.[1]\n\nHypergolic propellants were discovered independently, for the third time, in the U.S. by GALCIT and Navy Annapolis researchers in 1940. They developed engines powered by aniline and nitric acid.[2] Robert Goddard, Reaction Motors, and Curtiss-Wright worked on aniline/nitric acid engines in the early 1940s, for small missiles and jet assisted take-off (JATO).[3]\n\n\n  \nThe first hypergolic-propellant rocket engine used for human flight, the Walter 109-509A of 1942–45.\n\n\n\nIn Germany from the mid-1930s through World War II, rocket propellants were broadly classed as monergols, hypergols, non-hypergols and lithergols. The ending ergol is a combination of Greek ergon or work, and Latin oleum or oil, later influenced by the chemical suffix -ol from alcohol.[Note 1]  Monergols were monopropellants, while non-hypergols were bipropellants which required external ignition, and lithergols were solid/liquid hybrids.  Hypergolic propellants (or at least hypergolic ignition) were far less prone to hard starts than electric or pyrotechnic ignition.  The \"hypergole\" terminology was coined by Dr. Wolfgang Nöggerath, at the Technical University of Brunswick, Germany.[4]\n\nThe only rocket-powered fighter ever deployed was the Messerschmitt Me 163B Komet.  The Komet had a HWK 109-509, a rocket motor which consumed methanol/hydrazine as fuel and high test peroxide as oxidizer.  The hypergolic rocket motor had the advantage of fast climb and quick-hitting tactics at the cost of being very volatile and capable of exploding with any degree of inattention.  Other proposed combat rocket fighters like the Heinkel Julia and reconnaissance aircraft like the DFS 228 were meant to use the Walter 509 series of rocket motors, but besides the Me 163, only the Bachem Ba 349 Natter vertical launch expendable fighter was ever flight-tested with the Walter rocket propulsion system as its primary sustaining thrust system for military-purpose aircraft.\n\nThe earliest ballistic missiles, such as the Soviet R-7 that launched Sputnik 1 and the U.S. Atlas and Titan-1, used kerosene and liquid oxygen. Although they are preferred in space launchers, the difficulties of storing a cryogen like liquid oxygen in a missile that had to be kept launch ready for months or years at a time led to a switch to hypergolic propellants in the U.S. Titan II and in most Soviet ICBMs such as the R-36.[citation needed] But the difficulties of such corrosive and toxic materials, including leaks and explosions in Titan-II silos, led to their near universal replacement with solid-fuel boosters, first in Western submarine-launched ballistic missiles and then in land-based U.S. and Soviet ICBMs.[5]\n\nThe Apollo Lunar Module, used in the Moon landings, employed hypergolic fuels in both the descent and ascent rocket engines.\n\nThe trend among western space launch agencies is away from large hypergolic rocket engines and toward hydrogen/oxygen engines with higher performance. Ariane 1 through 4, with their hypergolic first and second stages (and optional hypergolic boosters on the Ariane 3 and 4) have been retired and replaced with the Ariane 5, which uses a first stage fueled by liquid hydrogen and liquid oxygen. The Titan II, III and IV, with their hypergolic first and second stages, have also been retired. Hypergolic rockets are still widely used in upper stages when multiple burn-coast periods are required.[citation needed]\n\n\nCharacteristics[edit]\n\n  \nHypergolic propellant tanks of the Orbital Maneuvering System of Space Shuttle Endeavour\n\n\n\nAdvantages[edit]\n\nHypergolically-fueled rocket engines are usually simple and reliable because they need no ignition system. Although larger hypergolic engines in some launch vehicles use turbopumps, most hypergolic engines are pressure-fed. A gas, usually helium, is fed to the propellant tanks under pressure through a series of check and safety valves. The propellants in turn flow through control valves into the combustion chamber; there, their instant contact ignition prevents a mixture of unreacted propellants from accumulating and then igniting in a potentially catastrophic hard start.\n\nThe most common hypergolic fuels, hydrazine, monomethylhydrazine and unsymmetrical dimethylhydrazine, and oxidizer, nitrogen tetroxide, are all liquid at ordinary temperatures and pressures.  They are therefore sometimes called storable liquid propellants.  They are suitable for use in spacecraft missions lasting many years. The cryogenity of liquid hydrogen and liquid oxygen limits their practical use to space launch vehicles where they need to be stored only briefly.\n\nBecause hypergolic rockets do not need an ignition system, they can fire any number of times by simply opening and closing the propellant valves until the propellants are exhausted and are therefore uniquely suited for spacecraft maneuvering and well suited, though not uniquely so, as upper stages of such space launchers as the Delta II and Ariane 5, which must perform more than one burn. Restartable non-hypergolic rocket engines nevertheless exist, notably the cryogenic (oxygen/hydrogen)  RL-10 on the Centaur and the J-2 on the Saturn V. The RP-1/LOX Merlin on the Falcon 9 can also be restarted.\n\n\nDisadvantages[edit]\n\nRelative to their mass, traditional hypergolic propellants are less energetic than such cryogenic propellant combinations as liquid hydrogen / liquid oxygen or liquid methane / liquid oxygen. A launch vehicle that uses hypergolic propellant must therefore carry a greater mass of fuel than one that uses these cryogenic fuels.\n\nThe corrosivity, toxicity, and carcinogenicity of traditional hypergolics necessitate expensive safety precautions.[6]\n\n\nHypergolic combinations[edit]\n\nCommon[edit]\n\n\tAerozine 50 + nitrogen tetroxide (NTO) – widely used in historical American rockets, including the Titan II; all engines in the Apollo Lunar Module; and the service propulsion system in the Apollo service module. Aerozine 50 is a mixture of 50% UDMH and 50% straight hydrazine (N2H4).[7]\n\tUnsymmetrical dimethylhydrazine (UDMH) + nitrogen tetroxide (NTO) – frequently used by Roscosmos, such as in the Proton (rocket family), and supplied by them to France for the Ariane 1 first and second stages (replaced with UH 25); ISRO rockets using Vikas engine.[8]\n\tMonomethylhydrazine (MMH) + nitrogen tetroxide (NTO) – smaller engines and reaction control thrusters:[citation needed]  Apollo command module reaction control system; Space Shuttle OMS and RCS;[9] Ariane 5 EPS;[10] Draco thrusters used by the SpaceX Dragon spacecraft.[11]\n\tTonka (TG-02, approx. 50% triethylamine and 50% xylidine) typically oxidised with nitric acid or its anhydrous nitric oxide derivatives (AK-2x group in the Soviet Union) e.g. AK-20F (80% HNO3 and 20% N2O4 with inhibitor).\n\tTriethylborane/triethylaluminium (TEA-TEB) + liquid oxygen – used during the ignition process of some rocket engines that use liquid oxygen, used by the SpaceX Merlin Engine Family and Rocketdyne F-1.\n\n\nLess common and obsolete[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Hypergolic propellant\" – news · newspapers · books · scholar · JSTOR  (February 2011) (Learn how and when to remove this template message)\n\n\n\n\tHydrazine + nitric acid (toxic but stable),[12]\n\tAniline + nitric acid (unstable, explosive), used in the WAC Corporal\n\tAniline + hydrogen peroxide (dust-sensitive, explosive)\n\tFurfuryl alcohol + IRFNA (or white fuming nitric acid)\n\tTurpentine + IRFNA (flown in French Diamant A first-stage)\n\tUDMH + IRFNA – MGM-52 Lance missile system\n\tT-Stoff (stabilised >80% peroxide) + C-Stoff (methanol, hydrazine, water, catalyst) – Messerschmitt Me 163 World War II German rocket fighter aircraft, for its Walter 109-509A engine\n\tKerosene + (high-test peroxide + catalyst) – Gamma, with the peroxide first decomposed by a catalyst. Cold hydrogen peroxide and kerosene are not hypergolic, but concentrated hydrogen peroxide (referred to as high-test peroxide or HTP) run over a catalyst produces free oxygen and steam at over 700 °C (1,300 °F) which is hypergolic with kerosene.[13]\n\tTetramethylethylenediamine + IRFNA – A less toxic and non-mutagenic alternative to Hydrazine and its derivatives.\n\tPentaborane(9) + nitrogen tetroxide – Pentaborane(9), a so-called Zip fuel, was used in combination with nitrogen tetroxide by the Soviet RD-270M rocket engine.\n\n\nRelated technology[edit]\n\nAlthough not hypergolic in the strict sense[dubious  – discuss] (but rather pyrophoric), triethylborane, which ignites spontaneously in the presence of air, was used for engine starts in the SR-71 Blackbird, the F-1 engines used in the Saturn V rocket, and the Merlin engines used in the SpaceX Falcon 9 rockets.\n\n\nNotes[edit]\n\n\n\t^ \"-ergol\", Oxford English Dictionary\n\n\n\n\nReferences[edit]\n\n\tCitations\n\n\n\n\t^ O. Lutz, in History of German Guided Missiles Development, 1957\n\n\t^ Sutton, George P., History of Liquid Propellant Rocket Engines\n\n\t^ The Papers of Robert H. Goddard\n\n\t^ Botho, Stüwe (1998), Peenemünde West: Die Erprobungsstelle der Luftwaffe für geheime Fernlenkwaffen und deren Entwicklungsgeschichte, Peene Münde West: Weltbildverlag, p. 220, ISBN 9783828902947 (in German)\n\n\t^ Clark (1972), p.214\n\n\t^ A Summary of NASA and USAF Hypergolic Propellant Related Spills and Fires  at the Internet Archive\n\n\t^ Clark (1972), p.45\n\n\t^ \"The Hindu : ISRO tests Vikas engine\". web.archive.org. 2014-03-23. Retrieved 2019-07-29.\n\n\n\t^ T.A. Heppenheimer, Development of the Shuttle, 1972–1981. Smithsonian Institution Press, 2002. \nISBN 1-58834-009-0.\n\n\t^ \"Space Launch Report:  Ariane 5 Data Sheet\".\n\n\n\t^ \"SpaceX Updates — December 10, 2007\". SpaceX. 2007-12-10. Archived from the original on January 4, 2011. Retrieved 2010-02-03.\n\n\n\t^ Brown, Charles D. (2003). Elements of spacecraft design. AIAA. p. 211. ISBN 978-1-56347-524-5.\n\n\n\t^ \"High Test Peroxide\" (pdf). Retrieved July 11, 2014.\n\n\n\n\n\n\tBibliography\n\n\n\n\tClark, John (1972). Ignition! An Informal History of Liquid Rocket Propellants. New Brunswick, New Jersey: Rutgers University Press. p. 14. ISBN 0-8135-0725-1.\n\n\tModern Engineering for Design of Liquid-Propellant Rocket Engines, Huzel & Huang, pub. AIAA, 1992. \nISBN 1-56347-013-6.\n\tHistory of Liquid Propellant Rocket Engines, G. Sutton, pub. AIAA 2005. \nISBN 1-56347-649-5.\n\n\n\n\nExternal links[edit]\n\n\t\"Hypergolic Reaction\". The Periodic Table of Videos. University of Nottingham. 2009.\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft propulsion\n\n\tChemical\nrockets\t\n\tState\t\n\tLiquid-propellant rocket\n\tSolid-propellant rocket\n\tHybrid-propellant rocket\n\n\n\n\n\tPropellants\t\n\tLiquid propellant\n\tCryogenic\n\tHypergolic\n\n\n\tMonopropellant\n\tBipropellant\n\tStaged combustion cycle\n\tExpander cycle\n\tGas-generator cycle\n\tTap-off cycle\n\tPressure-fed engine\n\tPump-fed engine\n\tElectric-pump-fed engine\n\n\n\tTripropellant\n\n\n\n\n\n\n\n\tElectrical\nthrusters\t\n\tElectrostatic\t\n\tColloid thruster\n\tIon thruster\n\tGridded\n\tHall-effect thruster\n\tField-emission electric propulsion\n\n\n\n\n\n\n\tElectromagnetic\t\n\tPulsed inductive thruster\n\tMagnetoplasmadynamic thruster\n\tElectrodeless plasma thruster\n\n\n\n\n\tElectrothermal\t\n\tPulsed plasma thruster\n\tHelicon double-layer thruster\n\tArcjet rocket\n\tResistojet rocket\n\tVASIMR\n\n\n\n\n\tOther\t\n\tAtmosphere-breathing electric propulsion\n\tHigh Power Electric Propulsion\n\tMagBeam\n\tMass driver\n\n\n\n\n\n\n\n\tNuclear\npropulsion\t\n\tClosed system\t\n\tDirect Fusion Drive\n\tNuclear electric rocket\n\tNuclear thermal rocket\n\tRadioisotope\n\tSalt-water\n\tGas core\n\t\"Lightbulb\"\n\n\n\n\n\n\n\tOpen system\t\n\tNuclear pulse propulsion\n\tAntimatter-catalyzed\n\n\n\tPulsed nuclear thermal rocket‎\n\tFusion rocket\n\tBussard ramjet\n\n\n\tFission-fragment rocket\n\tFission sail\n\n\n\tNuclear photonic rocket\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tBeam-powered propulsion\n\tCold gas thruster\n\tGravity assist\n\tSolar sail\n\tElectric sail\n\tMagnetic sail\n\n\n\tSolar thermal rocket\n\tTethers\n\tSteam thruster\n\n\n\n\n\tSpaceflight portal\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Hypergolic_propellant&oldid=916720809\"\n\n\t\t\n\t\tCategories: \tRocket fuels\n\tSoviet inventions\n\n\nHidden categories: \tArticles with German-language external links\n\tArticles with Internet Archive links\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from October 2011\n\tArticles with unsourced statements from December 2014\n\tArticles with unsourced statements from June 2010\n\tArticles needing additional references from February 2011\n\tAll articles needing additional references\n\tAll accuracy disputes\n\tArticles with disputed statements from March 2018\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tΕλληνικά\n\tEspañol\n\tفارسی\n\tFrançais\n\t한국어\n\tBahasa Indonesia\n\tItaliano\n\tNederlands\n\t日本語\n\tPolski\n\tPortuguês\n\tSlovenščina\n\tSuomi\n\tSvenska\n\tTürkçe\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 20 September 2019, at 08:15 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "3", "dc:title": "Hypergolic propellant - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Hypergolic_Fuel_for_MESSENGER.jpg/1200px-Hypergolic_Fuel_for_MESSENGER.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-hypergolic_propellant", "title": "Hypergolic propellant - Wikipedia"}}