{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHZE ions - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tHZE ions\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\"HZE\" redirects here. For the aiport with this designation, see Mercer County Regional Airport.\n\nHZE ions are the high-energy nuclei component of galactic cosmic rays (GCRs) which have an electric charge greater than +2. The abbreviation \"HZE\" comes from high (H) atomic number (Z) and energy (E). HZE ions include the nuclei of all elements heavier than hydrogen (which has a +1 charge) and helium (which has a +2 charge). Each HZE ion consists of a nucleus with no orbiting electrons, meaning that the charge on the ion is the same as the atomic number of the nucleus.[citation needed]\n\nHZE ions are rare compared to protons, for example, composing only 1% of GCRs versus 85% for protons.[1] HZE ions, like other GCRs, travel near the speed of light. Their source is likely to be supernova explosions.[2] \n\nIn addition to the HZE ions from cosmic sources, HZE ions are produced by the Sun. During solar flares and other solar storms, HZE ions are sometimes produced in small amounts along with the more typical protons,[3] but their energy level is substantially smaller than HZE ions from cosmic rays.[2]\n\nSpace radiation is composed mostly of high-energy protons, helium nuclei, and high-Z high-energy ions (HZE ions).  The ionization patterns in molecules, cells, tissues, and the resulting biological harm are distinct from high-energy photon radiation—x-rays and gamma rays, which produce low-linear energy transfer (low-LET) radiation from secondary electrons. While in space, astronauts are exposed to protons, helium nuclei, and HZE ions, as well as secondary radiation from nuclear reactions from spacecraft parts or tissue.[4]\n\nProminent HZE ions:\n\n\n\tCarbon (C)\n\tOxygen (O)\n\tMagnesium (Mg)\n\tSilicon (Si)\n\tIron (Fe)\n\n\nGCRs typically originate from outside the Solar System and within the Milky Way galaxy,[5] but those from outside of the Milky Way consist mostly of highly energetic protons with a small component of HZE ions.[4] GCR energy spectra peaks, with median energy peaks up to 1,000 MeV/amu, and nuclei (with energies up to 10,000 MeV/amu) are important contributors to the dose equivalent.[4]\n\n\nContents\n\n\n\t1 Health concerns of HZE ions\n\t2 See also\n\t3 References\n\t4 External links\n\n\n\n\n\nHealth concerns of HZE ions[edit]\n\nMain article: Health threat from cosmic rays\n\nAlthough HZE ions make up a small proportion of cosmic rays, their high charge and high energies cause them to contribute significantly to the overall biological impact of cosmic rays, making them as significant as protons in regard to biological impact.[1] The most dangerous GCRs are heavy ionized nuclei such as Fe +26, an iron nucleus with a charge of +26. Such heavy particles are \"much more energetic (millions of MeV) than typical protons accelerated by solar flares (tens to hundreds of MeV).\"[2]  HZE ions can therefore penetrate through thick layers of shielding and body tissue, \"breaking the strands of DNA molecules, damaging genes and killing cells.\"[2]\n\nFor HZE ions that originate from solar particle events (SPEs), there is only a small contribution toward a person's absorbed dose of radiation.  During a SPE, there is such a small amount of heavy ions generated that their effects are limited. Their energies per atomic mass unit are all significantly less than protons found in the same SPE, meaning that protons are by far the largest contribution to astronaut body exposure during SPEs.[3]\n\n\nSee also[edit]\n\n\tHigh energy nuclear physics\n\tCosmic radiation\n\tSolar energetic particles\n\tSpaceflight radiation carcinogenesis\n\tCentral nervous system effects from radiation exposure during spaceflight - HZE CNS health effects\n\tSwift heavy ion\n\n\nReferences[edit]\n\n\n\t^ a b Schimmerling, Walter (5 February 2011). \"The Space Radiation Environment: An Introduction\" (PDF). The Health Risks of Extraterrestrial Environments. Universities Space Research Association Division of Space Life Sciences. Retrieved 8 January 2013.\n\n\t^ a b c d Can People go to Mars? Science@NASA, February 17, 2004.\n\n\t^ a b Contribution of High Charge and Energy (HZE) Ions During Solar-Particle Event of September 29, 1989 Kim, Myung-Hee Y.; Wilson, John W.; Cucinotta, Francis A.; Simonsen, Lisa C.; Atwell, William; Badavi, Francis F.; Miller, Jack, NASA Johnson Space Center; Langley Research Center, May 1999.\n\n\t^ a b c Cucinotta, F.A.; Durante, M. \"Risk of Radiation Carcinogenesis\" (PDF). Human Health and Performance Risks of Space Exploration Missions Evidence reviewed by the NASA Human Research Program. NASA. pp. 122–123. Retrieved 6 June 2012.\n\n\n\t^ \"Galactic Cosmic Rays\". NASA. Retrieved 6 June 2012.\n\n\n\n\n\n\nExternal links[edit]\n\n\tLow-LET Radiation - The Free Dictionary\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=HZE_ions&oldid=866737226\"\n\n\t\t\n\t\tCategories: \tSubatomic particles\n\tCosmic rays\n\n\nHidden categories: \tAll articles with unsourced statements\n\tArticles with unsourced statements from January 2017\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tTiếng Việt\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 November 2018, at 06:40 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "2", "dc:title": "HZE ions - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-hze_ions", "title": "HZE ions - Wikipedia"}}