{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIKAROS - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tIKAROS\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\n\n\nIKAROS\tA 1:64 scale model of the IKAROS spacecraft\n\n\t\n\tMission type\tSolar sail technology\n\tOperator\tJAXA[1][2][3][4]\n\tCOSPAR ID\t2010-020E\n\tSATCAT no.\t36577\n\tWebsite\tglobal.jaxa.jp/projects/sas/ikaros/\n\tMission duration\t5 years launch to last contact in 2015\n\t\n\n\t\n\tSpacecraft properties\n\tLaunch mass\t315 kg (694 lb)\n\tDimensions\tSolar sail: 14 m × 14 m (46 ft × 46 ft) (area: 196 m2 (2,110 sq ft))[5]\n\t\n\n\t\n\tStart of mission\n\tLaunch date\t21:58:22, 20 May 2010 (UTC) (2010-05-20T21:58:22Z)\n\tRocket\tH-IIA 202\n\tLaunch site\tTanegashima, LA-Y\n\t\n\n\t\n\tEnd of mission\n\tLast contact\t20 May 2015[6]\n\t\n\n\t\n\tOrbital parameters\n\tReference system\tHeliocentric orbit\n\t\n\n\t\n\tFlyby of Venus\n\tClosest approach\t8 December 2010\n\tDistance\t80,800 kilometers (50,200 mi)\n\t\n\n\t \n\n\nIKAROS (Interplanetary Kite-craft Accelerated by Radiation Of the Sun) is a Japan Aerospace Exploration Agency (JAXA) experimental spacecraft. The spacecraft was launched on 20 May 2010, aboard an H-IIA rocket, together with the Akatsuki (Venus Climate Orbiter) probe and four other small spacecraft. IKAROS is the first spacecraft to successfully demonstrate solar sail technology in interplanetary space.[3][7]\n\nOn 8 December 2010, IKAROS passed by Venus at about 80,800 km (50,200 mi) distance, completing the planned mission successfully, and entered its extended operation phase.[8][9][10][11]\n\n\nContents\n\n\n\t1 Purpose\n\t2 Design\n\t3 Mission progress\n\t4 Science results\n\t5 See also\n\t6 Notes\n\t7 References\n\t8 External links\n\n\n\n\n\nPurpose[edit]\n\nThe IKAROS probe is the world's first spacecraft to use solar sailing as the main propulsion. It was designed to demonstrate four key technologies (comments in parentheses refer to figure):\n\n\n\tDeployment and control of a large, thin solar sail membrane (grey-blue areas numbered 3)\n\tThin-film solar cells integrated into the sail to power the payload (black rectangles numbered 4)\n\tMeasurement of acceleration due to radiation pressure on the solar sail\n\tAttitude control by varying the reflectance of 80 liquid crystal panels embedded in the sail (orange rectangles numbered 2)\n\n\nThe mission also includes investigations of aspects of interplanetary space, such as gamma-ray bursts, solar wind and cosmic dust.[12]\n\nThe probe's ALADDIN instrument (ALDN-S and ALDN-E) measured the variation in dust density[13] while its Gamma-Ray Burst Polarimeter (GAP) measured the polarization of gamma-ray bursts during its six-month cruise.[14]\n\nIKAROS is to be followed by a 40 × 40 m sail, the Jupiter Trojan Asteroid Explorer, intended to journey to Jupiter and the Trojan asteroids, launched in the late 2020s, with a proposed goal of returning an asteroid sample to Earth in the 2050s.[15]\n[16]\n[17]\n[18]\n\n\nDesign[edit]\n\n  \nIKAROS sail schematic diagram:\t(blue square on a line) Tip mass 0.5 kg (1.1 lb), 1 of 4.\n\t(orange rectangle) Liquid crystal device, 1 of 80.\n\t(blue square) Membrane 7.5 μm (0.00030 in) thick, 20 metres (66 ft) on the diagonal.\n\t(black rectangle) Solar cells 25 μm (0.00098 in) thick.\n\t(yellow and blue lines) Tethers.\n\t(blue disc) Main body.\n\t(yellow dots) Instruments.\n\n\n\n\n\n\n  \nIKAROS spaceprobe in flight (artist's depiction)\n\n\n\nThe square sail, deployed via a spinning motion using 0.5-kilogram (1.1 lb) tip masses (key item 1 in figure at right), is 20 m (66 ft) on the diagonal and is made of a 7.5-micrometre (0.00030 in) thick sheet of polyimide (key item 3 in figure at right). The polyimide sheet had a mass of about 10 grams per square metre, resulting in a total sail mass of 2 kilograms, excluding tip masses, attached panels and tethers. A thin-film solar array is embedded in the sail (key item 4 in figure at right). PowerFilm, Inc. provided the thin-film solar array.[19] Eighty blocks of LCD panels are embedded in the sail,[20] whose reflectance can be adjusted for attitude control (key item 2 in figure at right). The sail also contains eight dust counters on the opposite face as part of the science payload.[21][22]\n\n\nMission progress[edit]\n\nIKAROS was successfully launched together with Akatsuki (the Venus Climate Orbiter) aboard an H-IIA rocket from the Tanegashima Space Center on 21 May 2010.\n\nIKAROS spun at 20–25 revolutions per minute and finished unfurling its sail on 10 June 2010.[23][24][25] The craft contains two tiny ejectable cameras, DCAM1 and DCAM2. DCAM2 was used to photograph the sail after deployment on 14 July 2010.[26]\n\nAcceleration and attitude control (orientation) were successfully tested during the remaining six-month voyage to Venus. On 9 July 2010, JAXA confirmed that IKAROS is being accelerated by its solar sail,[27] and on 23 July announced successful attitude control.  Over a 23-hour period of time, the solar angle of the sail was changed by a half a degree, not by using thrusters, but by dynamically controlling the reflectivity of the 80 liquid crystal panels at the outer edge of the sail so that the sunlight pressure would produce torque.[28]\nIKAROS continues to spin at approximately 2 rpm, requiring the LCD panels to be cycled at that rate for attitude control.\n\nAccording to JAXA, IKAROS finished all planned experiments in Dec 2010, but the mission has continued beyond that date \"in order to enhance the skill of controlling solar sail\".[29] On 30 November 2012, JAXA announced that IKAROS had been recognized by Guinness World Records as the world's first solar sail spacecraft between planets, and that its two separated cameras, DCAM1 and DCAM2, had been recognized as the smallest size of a spacecraft flying between planets.[30][31]\nAs of 2012, the IKAROS continued to spin, but its attitude control had degraded. This resulted in unexpected sail motions and as a result, downlink through the medium-gain antenna was only intermittently available. The project team was dissolved on 28 March 2013, although a trial receipt of data was planned for a later date.\n\nThe project was reactivated on 20 June 2013 in the expectation that the satellite would wake up from a hibernation state as more power from the solar panels became available. The team was able to receive telemetry from the IKAROS between 20 June and 12 September 2013, after which contact was again lost. The loss of contact was around the predicted time of the spacecraft again entering a low-power hibernation mode as power from the solar panels decreased. Available communication time through the Usuda Deep Space Center antenna was limited, so data was gathered only intermittently to estimate the speed, trajectory and rotation of the satellite.[32][33] As of August 2013, IKAROS was continuing to gain speed. At that time, it had gained approximately 400 m/s of velocity from its solar sail.[34]\n\nTransmissions were again received on 22 May 2014, the spacecraft flying at a distance of about 230 million kilometers from the Earth. By May 2014, IKAROS was on a ten-month orbit around the Sun, spending seven months of each orbit in hibernation mode due to insufficient power.[35] By 23 April 2015, the spacecraft woke up from hibernation mode for the 4th time and was flying at a distance of about 120 million kilometers from the Earth.[36] On 21 May 2015, JAXA could not receive a signal from IKAROS and concluded that the spacecraft had shifted to the hibernation mode for the fifth time, as expected. Based on May 2015 data the position of IKAROS at the time was about 110 million kilometers away from the Earth, and about 130 million kilometers from the Sun.[37]\n\n\nScience results[edit]\n\nFrom the gamma-ray polarization data of GAP, Toma et al.[38] puts a stricter limit on CPT violation.  It is an improvement of eight orders of magnitude over previous limits.[39][40]\n\nJAXA scientists stated that the measured thrust force by the solar radiation pressure on IKAROS' 196 m2 sail is 1.12 millinewtons.[41]\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\tCubeSail\n\tCubeSail (UltraSail)\n\tLightSail 2, a private solar sail project of the Planetary Society\n\tList of missions to Venus\n\tNear-Earth Asteroid Scout, a CubeSat tasked with traveling to an asteroid ~1AU from Earth\n\tNanoSail-D2, an American solar sail deployed in LEO in January 2011\n\tOKEANOS, proposed successor to IKAROS targeting the Jupiter trojans\n\tSolar sail\n\n\nNotes[edit]\n\n\n\t^ Mori et al. (2009)\n\n\t^ \"Small Solar Power Sail Demonstrator \"IKAROS\"\". JAXA. Retrieved 1 October 2010.\n\n\t^ a b Stephen Clark (20 May 2010). \"H-2A Launch Report – Mission Status Center\". Spaceflight Now. Retrieved 21 May 2010.\n\n\n\t^ Samantha Harvey (20 May 2010). \"Solar System Exploration: Missions: By Target: Venus: Future: Akatsuki\". NASA. Retrieved 21 May 2010.\n\n\n\t^ \"IKAROS: Solar Power Sail Demonstrator\". ISAS. JAXA. Retrieved 24 May 2015.\n\n\n\t^ \"IKAROS enters hibernation mode for 5th time\". Small Solar Power Sail Demonstrator \"IKAROS\" Topics. JAXA. Retrieved 2 March 2019.\n\n\n\t^ \"Launch Day of the H-IIA Launch Vehicle No. 17(H-IIA F17)\". JAXA. 3 March 2010. Retrieved 7 May 2010.\n\n\n\t^ \"今日の IKAROS(12/10)　– Daily Report – Dec 10, 2010\". IKAROS Blog (in Japanese). JAXA. 10 December 2010. Retrieved 22 January 2011.\n\n\n\t^ \"2010年の締めくくり(12/26)　– Daily Report – Dec 26, 2010\". IKAROS Blog (in Japanese). JAXA. 26 December 2010. Retrieved 22 January 2011.\n\n\n\t^ 宇宙帆船イカロス、お疲れさま…実験終え「人工惑星」に (in Japanese). Asahi Shimbun. 10 December 2010. Retrieved 22 January 2011.\n[dead link]\n\n\t^ Mori, Osamu (26 January 2011). \"小型ソーラー電力セイル実証機（IKAROS）の定常運用終了報告\" (PDF) (in Japanese). JAXA. Retrieved 2 February 2011.\n\n\n\t^ \"小型ソーラー電力セイル実証機「IKAROS（イカロス）」のガンマ線バーストの観測成功について\" (in Japanese). JAXA. 14 July 2010. Retrieved 15 July 2010.\n\n\n\t^ Yano, H.;  et al. \"COSMIC DUST DETECTION BY THE IKAROS-ARRAYED LARGE-AREA DUST DETECTORS IN INTERPLANETARY SPACE (ALADDIN) FROM THE EARTH TO VENUS\" (PDF). 42nd Lunar and Planetary Science Conference (2011). Retrieved 14 February 2011.\n\n\n\t^ Yonetoku, D.;  et al. (26 October 2010). \"Gamma-Ray Burst Polarimeter – GAP – aboard the Small Solar Power Sail Demonstrator IKAROS\". Publications of the Astronomical Society of Japan. 63 (3): 625–638. arXiv:1010.5305. Bibcode:2011PASJ...63..625Y. doi:10.1093/pasj/63.3.625.\n\n\n\t^ \"IKAROS Project\". JAXA. 2008. Archived from the original on 22 September 2008. Retrieved 12 July 2010. The second mission will take place in the late 2010s. It will involve a medium-sized solar power sail with a diameter of 50m, and will have integrated ion-propulsion engines. The destinations of the spacecraft will be Jupiter and the Trojan asteroids.\n\n\n\t^ SCIENCE AND EXPLORATION IN THE SOLAR POWER SAIL OKEANOS MISSION TO A JUPITER TROJAN ASTEROID. (PDF). T. Okada, T. Iwata, J. Matsumoto, T. Chujo, Y. Kebukawa, J. Aoki, Y. Kawai, S. Yokota, Y. Saito, K. Terada, M. Toyoda, M. Ito, H. Yabuta, H. Yurimoto, C. Okamoto, S. Matsuura, K. Tsumura, D. Yonetoku, T. Mihara, A. Matsuoka, R. Nomura, H. Yano, T. Hirai, R. Nakamura, S. Ulamec, R. Jaumann, J.-P. Bibring, N. Grand, C. Szopa, E. Palomba, J. Helbert, A. Herique, M. Grott, H. U. Auster, G. Klingelhoefer, T. Saiki, H. Kato, O. Mori, J. Kawaguchi. 49th Lunar and Planetary Science Conference 2018 (LPI Contrib. No. 2083).\n\n\t^ \nJeremy Hsu (21 July 2010). \"Japan's Solar Sail Is the Toast of Space Science\". space.com. Retrieved 8 December 2016.\n\n\n\t^ \nShusuke Murai (21 July 2016). \"JAXA reveals asteroid probe solar panel\". The Japan Times Online. The Japan Times. Retrieved 8 December 2016.\n\n\n\t^ Claire M. Umali (4 May 2010). \"Japan tests power of solar sails in deep space\". EcoSeed. Archived from the original on 2 December 2010. Retrieved 25 January 2011.\n\n\n\t^ \"Small Solar Power Sail Demonstrator 'IKAROS': Successful Attitude Control by Liquid Crystal Device\". Japan Aerospace Exploration Agency (JAXA). 23 July 2010.\n\n\n\t^ \"Small Solar Power Sail Demonstrator\". JAXA. 11 March 2010. Retrieved 7 May 2010.\n\n\n\t^ \"IKAROS Project\". JAXA. 2008. Archived from the original on 22 September 2008. Retrieved 30 March 2010.\n\n\n\t^ Edwards, Lin (11 June 2010). \"IKAROS unfurls first ever solar sail in space\". PhysOrg. Retrieved 11 June 2010.\n\n\n\t^ Staff writers (11 June 2010). \"Japanese Spacecraft Deploys Solar Sail\". Space.com. Retrieved 11 June 2010.\n\n\n\t^ Amos, Jonathan (11 June 2010). \"Japan unfurls Ikaros solar sail in space\". BBC News. Retrieved 25 January 2011.\n\n\n\t^ Staff writers (16 June 2010). \"Mini-camera pictures Japan's Ikaros solar sail\". BBC News. Retrieved 17 June 2010.\n\n\n\t^ \"About the confirmation of photon acceleration of \"IKAROS\" the small solar-sail demonstrating craft\". JAXA website press release (Press release) (in Japanese). Japan Aerospace Exploration Agency. 9 July 2010. Retrieved 25 January 2011. Graph suggests approx 1.1mN force\n\n\n\t^ \"Small Solar Power Sail Demonstrator 'IKAROS'Successful Attitude Control by Liquid Crystal Device\" (Press release). Japan Aerospace Exploration Agency (JAXA). 23 July 2010. Retrieved 25 January 2011.\n\n\n\t^ \"Solar Power Sail Demonstrator \"IKAROS\"\". Japan Aerospace Exploration Agency (JAXA). Archived from the original on 22 September 2008. Retrieved 30 December 2012.\n\n\n\t^ \"IKAROS world record certified!\". Japan Aerospace Exploration Agency (JAXA). 30 November 2012. Retrieved 30 December 2012.\n\n\n\t^ \"JAXA's solar spacecraft gets Guinness World Records entry\". The Asahi Shimbun. 30 December 2012. Archived from the original on 13 February 2013. Retrieved 30 December 2012.\n\n\n\t^ \"今日の IKAROS(2013/06/20)　– Daily Report – June 20, 2013\" (in Japanese). Japan Aerospace Exploration Agency (JAXA). 20 June 2013. Retrieved 8 June 2014.\n\n\n\t^ \"今日の IKAROS(12/7)　– Daily Report – Dec 7, 2013\" (in Japanese). Japan Aerospace Exploration Agency (JAXA). 20 June 2013. Retrieved 8 June 2014.\n\n\n\t^ \"今日の IKAROS(8/29)　– Daily Report – Aug 29, 2013\" (in Japanese). Japan Aerospace Exploration Agency (JAXA). 29 August 2013. Retrieved 8 June 2014.\n\n\n\t^ \"IKAROS：3回目の冬眠モード明けについて\" (in Japanese). Japan Aerospace Exploration Agency (JAXA). 26 May 2014. Retrieved 8 June 2014.\n\n\n\t^ \"IKAROS wakes up from hibernation mode for the 4th time\". JAXA. 30 April 2015. Retrieved 24 May 2015.\n\n\n\t^ \"IKAROS enters hibernation mode for 5th time\". JAXA. 29 May 2015.\n\n\n\t^ Kenji Toma;  et al. (December 2012). \"Strict Limit on CPT Violation from Polarization of γ-Ray Bursts\". Physical Review Letters. 109 (24): 241104. arXiv:1208.5288. Bibcode:2012PhRvL.109x1104T. doi:10.1103/PhysRevLett.109.241104. PMID 23368301.\n\n\n\t^ Michael Schirber (2012). \"Synopsis: Distant Bursts Show no Signs of Predicted Light Rotation\". Physical Review Letters. 109 (24): 241104. arXiv:1208.5288. Bibcode:2012PhRvL.109x1104T. doi:10.1103/PhysRevLett.109.241104. PMID 23368301.\n\n\n\t^ \"Strict Limit on CPT Violation from Gamma-Ray Bursts\". Kavli Institute for the Physics and Mathematics of the Universe. 7 December 2012. Retrieved 16 December 2012.\n\n\n\t^ \"IKAROS – All News Channel\". JAXA. 9 July 2010. Archived from the original on 19 August 2010. Retrieved 24 May 2015.\n\n\n\n\n\nReferences[edit]\n\n\tOsamu Mori;  et al. (6 July 2008). \"Development of Deployment System for Small Size Solar Sail Mission\" (PDF). 26th International Symposium on Space Technology and Science. 7: Pd_87–Pd_94. Bibcode:2009TrSpT...7.Pd87M. doi:10.2322/tstj.7.Pd_87. Retrieved 9 May 2011.\n\n\tOsamu Mori;  et al. (9 July 2009). \"First Solar Power Sail Demonstration by IKAROS\" (PDF). 27th International Symposium on Space Technology and Science. 8: To_4. Bibcode:2011TJSAI...8To425M. Retrieved 6 March 2010.\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to IKAROS.\n\n\n\tSuccessful Image Shooting by the Second Separation Camera – 28 June 2010 JAXA press release\n\tSolar Sail Navigation Technology of IKAROS\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft missions to Venus\n\n\tActive missions\t\n\tOrbiters\t\n\tAkatsuki\n\n\n\n\n\tFlybys\t\n\tParker Solar Probe (en route)\n\tBepiColombo (en route)\n\n\n\n\n\n\n\t\n\n\n\n\tPast missions\t\n\tOrbiters\t\n\tMagellan\n\tPioneer Venus Orbiter\n\tVenera 9\n\t10\n\t15\n\t16\n\tVenus Express\n\n\n\n\n\tFlybys\t\n\tVenera 1†\n\tMariner 2\n\tZond 1†\n\tVenera 2†\n\tMariner 5\n\t10\n\tVenera 11\n\t12\n\t13\n\t14\n\tVega 1\n\t2\n\tGalileo\n\tCassini–Huygens\n\tMESSENGER\n\tIKAROS\n\tShin-en†\n\n\n\n\n\tDescent probes\t\n\tVenera 3†\n\t4\n\t5\n\t6\n\tPioneer Venus Multiprobe\n\n\n\n\n\tLanders\t\n\tVenera 7\n\t8\n\t9\n\t10\n\t11\n\t12\n\t13\n\t14\n\tVega 1\n\t2\n\tPioneer Venus Small Probes\n\n\n\n\n\tBalloon probes\t\n\tVega 1\n\t2\n\n\n\n\n\tFailed launches\t\n\tTyazhely Sputnik\n\tMariner 1\n\t2MV-1 No.1\n\t2MV-1 No.2\n\t2MV-2 No.1\n\tKosmos 21\n\t3MV-1 No.2\n\tKosmos 27\n\t96\n\t167\n\t482\n\n\n\n\n\n\n\n\tPlanned missions\t\n\tFlybys\t\n\tSolar Orbiter (2020, flyby)\n\tJupiter Icy Moons Explorer (2022, flyby)\n\tDragonfly (2026, flyby)\n\n\n\n\n\n\n\n\tProposed missions\t\n\tVenus missions\t\n\tCUVE\n\tDAVINCI\n\tEnVision\n\tHAVOC\n\tHOVER\n\tShukrayaan-1\n\tVAMP\n\tVenera-D\n\tVERITAS\n\tVICI\n\tVISAGE\n\tVISE\n\tVOX\n\tZephyr\n\n\n\n\n\tFlybys\t\n\tEuropa Clipper\n\tMercury-P\n\tLaplace-P\n\tNASA Uranus orbiter and probe\n\n\n\n\n\n\n\n\tCancelled / concepts\t\n\tEuropean Venus Explorer\n\tInspiration Mars\n\tTMK-Mavr\n\tVenus Orbiting Imaging Radar\n\tVesta\n\n\n\n\n\tProgram overviews\t\n\tVenera\n\t3MV\n\n\n\tMariner\n\tPioneer Venus\n\tVega\n\n\n\n\n\tRelated\t\n\tColonization\n\tObservations and explorations\n\tList of artificial objects on Venus\n\tList of missions\n\tManned Venus flyby\n\tTerraforming\n\tVeSpR\n\n\n\n\n\t\n\tMissions are ordered by launch date. † indicates failure en route or before any data returned.\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nJapanese space program\n\n\t\n\tJAXA\n\tformer ISAS\n\tNAL\n\tNASDA\n\n\n\tNICT\n\tUSEF\n\n\n\n\n\tAstronomical\nobservation\t\n\tCompleted\t\n\tAkari\n\tASCA\n\tGinga\n\tHakucho\n\tHALCA\n\tHinotori\n\tSuzaku\n\tTenma\n\tYohkoh\n\n\n\n\n\tIn operation\t\n\tHinode\n\tHisaki\n\n\n\n\n\tFailed\t\n\tHitomi\n\n\n\n\n\tPlanned\t\n\tATHENA2\n\tEUVST\n\tHiZ-GUNDAM\n\tLiteBIRD\n\tNano-JASMINE\n\tSmall-JASMINE\n\tSPICA2\n\tWFIRST1\n\tWSO-UV5\n\tXRISM1\n\n\n\n\n\tCancelled\t\n\tAstro-G\n\n\n\n\n\n\n\n\tCommunications,\nbroadcasting and\npositioning\t\n\tCompleted\t\n\tBS\n\t2X\n\t3H\n\t3N\n\n\n\tKakehashi\n\tKirari\n\tKizuna\n\tKodama\n\tMBSat\n\tN-STAR\n\ta\n\tb\n\n\n\tSakura (1\n\t2a\n\t2b\n\t3a\n\t3b)\n\tYuri\n\t1\n\t2a\n\t2b\n\t3a\n\t3b\n\n\n\n\n\n\n\tIn operation\t\n\tKirameki\n\t1\n\t2\n\n\n\tMichibiki\n\t1\n\t2\n\t3\n\t4\n\n\n\tMTSAT\n\tN-STAR\n\tc\n\td\n\n\n\n\n\n\n\tPlanned\t\n\tDSN\n\t3\n\n\n\tJDRS\n\tQZS\n\t1R\n\t5\n\t6\n\t7\n\n\n\n\n\n\n\n\n\n\tEarth observation\t\n\tCompleted\t\n\tAkebono\n\tDaichi\n\tDenpa\n\tFuyo-1\n\tJikiken\n\tKyokko\n\tMidori\n\tI\n\tII\n\n\n\tMomo\n\t1\n\t1b\n\n\n\tOhozora\n\tTaiyo\n\tTRMM1\n\tUme\n\t1\n\tb\n\n\n\n\n\n\n\tIn operation\t\n\tAqua17\n\tArase\n\tASNARO\n\t1\n\t2\n\n\n\tDaichi-2\n\tGEOTAIL1\n\tGPM1\n\tHimawari\n\tIbuki\n\t2\n\n\n\tShikisai\n\tShizuku\n\n\n\n\n\tPlanned\t\n\tALOS\n\t3\n\t4\n\n\n\tEarthCARE2\n\tGOSAT-3\n\n\n\n\n\n\n\n\tEngineering tests\t\n\tCompleted\t\n\tAyame\n\t1\n\t2\n\n\n\tDASH\n\tEXPRESS\n\tIKAROS\n\tJindai\n\tKiku\n\t1\n\t2\n\t3\n\t4\n\t5\n\t6\n\t7\n\t8\n\n\n\tLDREX\n\t1\n\t2\n\n\n\tLRE\n\tMicro LabSat-1\n\tMyojo\n\tOhsumi\n\tOrizuru\n\tRyusei\n\tSERVIS-1\n\tSERVIS-2\n\tSDS-1\n\tShinsei\n\tSFU\n\tTansei\n\t1\n\t2\n\t3\n\t4\n\n\n\tTasuki\n\tTsubasa\n\tUSERS\n\n\n\n\n\tIn operation\t\n\tAjisai\n\tReimei\n\tSDS-4\n\tTsubame\n\tRAPIS-1\n\n\n\n\n\tPlanned\t\n\tBEAK\n\tETS-IX\n\tG-SATELLITE\n\tSERVIS-3\n\tSmall Demonstration Satellite\n\t2\n\t3\n\n\n\n\n\n\n\tCancelled\t\n\tPETSAT\n\tSmartSat-1\n\n\n\n\n\n\n\n\tHuman spaceflight\t\n\tCompleted\t\n\tH-II Transfer Vehicle\n\t1\n\t2\n\t3\n\t4\n\t5\n\t6\n\t7\n\n\n\n\n\n\n\tIn operation\t\n\tH-II Transfer Vehicle\n\t8\n\n\n\tInternational Space Station (ISS) & Kibo123456\n\n\n\n\n\tPlanned\t\n\tH-II Transfer Vehicle\n\t9\n\tX1\n\n\n\tLunar Orbital Platform – Gateway1245\n\n\n\n\n\tCancelled\t\n\tFuji crewed spacecraft\n\tHOPE-X\n\n\n\n\n\n\n\n\tLunar and\nplanetary exploration\t\n\tCompleted\t\n\tHayabusa\n\tHiten\n\tKaguya (SELENE)\n\tSakigake\n\tSuisei\n\n\n\n\n\tIn operation\t\n\tAkatsuki\n\tBepiColombo (MMO/Mio)2\n\tHayabusa2\n\n\n\n\n\tFailed\t\n\tNozomi\n\tPROCYON\n\tShin'en\n\n\n\n\n\tPlanned\t\n\tComet Interceptor2\n\tDESTINY+\n\tEQUULEUS\n\tJUICE2\n\tMars Terahertz Microsatellite\n\tMELOS\n\tMMX\n\t\n\tOMOTENASHI\n\tSLIM\n\n\n\n\n\tCancelled\t\n\tLunar-A\n\tSELENE-2\n\n\n\n\n\n\n\n\tPrivate\nminiaturized satellites\t\n\tCompleted\t\n\tCosMoz\n\tCUTE\n\t1.7+APD\n\n\n\tFuji\n\t1\n\t2\n\n\n\tHayato\n\tHIT-SAT\n\tKagayaki\n\tKanta-kun (WEOS)\n\tKūkai\n\tMaido-1\n\tNegai☆″\n\tNiwaka\n\tRAIKO\n\tWaseda-SAT2\n\tWE WISH\n\n\n\n\n\tIn operation\t\n\tCUTE\n\t1\n\t1.7+APDII\n\n\n\tFuji-3\n\tHitomi\n\tHoryu\n\t2\n\n\n\tKiseki\n\tPROITERES\n\tRaijin\n\tRISING-2\n\tSEEDS\n\tSOCRATES\n\tXI\n\tIV\n\tV\n\n\n\n\n\n\n\tPlanned\t\n\tDRUMS\n\tQSAT-EOS\n\tSOMESAT\n\tSPROUT\n\tTSUBAME\n\tWNI satellite\n\n\n\n\n\n\n\n\tReconnaissance\t\n\tCompleted\t\n\tIGS-Optical\n\t1\n\t2\n\tExperimentally 3\n\n\n\tIGS-Radar\n\t1\n\t2\n\n\n\n\n\n\n\tIn operation\t\n\tIGS-Optical\n\t3\n\t4\n\t5\n\t6\n\tExperimentally 5\n\n\n\tIGS-Rader\n\t3\n\t4\n\tSpare\n\t5\n\t6\n\n\n\n\n\n\n\tPlanned\t\n\tIGS-Optical\n\t7\n\t8\n\n\n\tIGS-Rader\n\t7\n\t8\n\n\n\n\n\n\n\n\n\n\t\n\tItalics indicates projects in development.\n\tSuperscripts indicate joint development with1NASA, 2ESA,  3ASI,  4CSA, 5RKA, 6AEB and 7INPE.\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n21st-century space probes\n\n\tActive space probes\n(deep space missions)\t\n\tMoon\t\n\tARTEMIS\n\tChandrayaan-2\n\tChang'e 3\n\tChang'e 4 (Yutu-2)\n\tLunar Reconnaissance Orbiter\n\n\n\n\n\tMars\t\n\tExoMars TGO\n\tInSight\n\tMars Orbiter Mission\n\tMars Express\n\t2001 Mars Odyssey\n\tMAVEN\n\tMRO\n\tMSL Curiosity\n\n\n\n\n\tVenus\t\n\tAkatsuki\n\n\n\n\n\tMinor planet\t\n\tChang'e 2\n\tHayabusa2 / MINERVA-II\n\tNew Horizons\n\tOSIRIS-REx\n\n\n\n\n\tSolar science\t\n\tACE\n\tDSCOVR\n\tParker Solar Probe\n\tSOHO\n\tSTEREO\n\tWind\n\n\n\n\n\tOthers\t\n\tBepiColombo\n\tGaia\n\tJuno\n\tTHEMIS\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\n\n\n\tCompleted after 2000\n(by termination date)\t\n\t2000s\t\n\t2001\n\tNEAR Shoemaker\n\tDeep Space 1\n\n\n\t2003\n\tPioneer 10\n\tGalileo\n\tNozomi\n\n\n\t2004\n\tGenesis\n\n\n\t2005\n\tHuygens\n\n\n\t2006\n\tMars Global Surveyor\n\n\n\t2008\n\tPhoenix\n\n\n\t2009\n\tChang'e 1\n\tUlysses\n\tChandrayaan-1\n\tSELENE\n\tLCROSS\n\n\n\n\n\n\n\t2010s\t\n\t2010\n\tHayabusa\n\tMER Spirit\n\n\n\t2011\n\tStardust\n\n\n\t2012\n\tGRAIL\n\n\n\t2013\n\tDeep Impact\n\n\n\t2014\n\tLADEE\n\tVenus Express\n\tChang'e 5-T1\n\n\n\t2015\n\tMESSENGER\n\tPROCYON\n\tIKAROS\n\n\n\t2016\n\tRosetta / Philae\n\tYutu\n\tExoMars Schiaparelli\n\n\n\t2017\n\tLISA Pathfinder\n\tCassini\n\n\n\t2018\n\tMASCOT\n\tDawn\n\tLongjiang-1\n\n\n\t2019\n\tMarCO\n\tMER Opportunity\n\tBeresheet\n\tLongjiang-2\n\tVikram / Pragyan\n\n\n\n\n\n\n\n\n\n\t\n\tList of Solar System probes\n\tList of lunar probes\n\tList of space telescopes\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n← 2009  ·  Orbital launches in 2010  ·  2011 →\n\n\tCompass-G1 | Globus-1M No.12L | Progress M-04M | STS-130 (Tranquility ·  Cupola) | SDO | Intelsat 16 | Kosmos 2459 ·  Kosmos 2460 ·  Kosmos 2461 | GOES 15 | Yaogan 9A ·  Yaogan 9B ·  Yaogan 9C | EchoStar XIV | Soyuz TMA-18 | STS-131 (Leonardo MPLM) | CryoSat-2 | GSAT-4 | Kosmos 2462 | USA-212 | SES-1 | Kosmos 2463 | Progress M-05M | STS-132 (Rassvet ·  ICC-VLD) | Akatsuki ·  IKAROS (DCAM-1 ·  DCAM-2) ·  Shin'en ·  Waseda-SAT2 ·  Hayato ·  Negai ☆'' | Astra 3B ·  COMSATBw-2 | USA-213 | SERVIS-2 | Compass-G3 | Badr-5 | Dragon Spacecraft Qualification Unit | STSAT-2B | Shijian XII | Prisma ·  Picard ·  BPA-1 | Soyuz TMA-19 | TanDEM-X | Ofek-9 | Arabsat-5A ·  Chollian | Progress M-06M | EchoStar XV | Cartosat-2B ·  AlSat-2A ·  StudSat ·  AISSat-1 ·  TIsat-1 | Compass-IGSO1 | Nilesat 201 ·  RASCOM-QAF 1R | Yaogan 10 | USA-214 | Tian Hui 1 | Kosmos 2464 ·  Kosmos 2465 ·  Kosmos 2466 | Chinasat-6A | Gonets-M No.2 ·  Kosmos 2467 ·  Kosmos 2468 | Progress M-07M | Michibiki | USA-215 | Yaogan 11 ·  Zheda Pixing 1B ·  Zheda Pixing 1C | USA-216 | Kosmos 2469 | Chang'e 2 | Shijian 6G ·  Shijian 6H | Soyuz TMA-01M | XM-5 | Globalstar 73 ·  Globalstar 74 ·  Globalstar 75 ·  Globalstar 76 ·  Globalstar 77 ·  Globalstar 79 | Progress M-08M | Eutelsat W3B ·  BSat 3B | Compass-G4 | Meridian 3 | Feng Yun 3B | COSMO-4 | SkyTerra-1 | STPSat-2 ·  RAX ·  O/OREOS  ·  FASTSAT (NanoSail-D2) ·  FalconSat-5 ·  Sara-Lily ·  Emma | USA-223 | Chinasat-20A | Intelsat 17 ·  Hylas 1 | Glonass-M No.39 ·  Glonass-M No.40 ·  Glonass-M No.41 | Dragon C1 ·  Mayflower ·  SMDC-ONE 1 ·  QbX-1 ·  QbX-2 ·  Perseus 000 ·  Perseus 001 ·  Perseus 002 ·  Perseus 003 | Soyuz TMA-20 | Compass-IGSO2 | GSAT-5P | KA-SAT| Alsat-2A\n\n\tPayloads are separated by bullets ( · ), launches by pipes ( | ). Manned flights are indicated in bold text. Uncatalogued launch failures are listed in italics. Payloads deployed from other spacecraft are denoted in (brackets).\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=IKAROS&oldid=917038178\"\n\n\t\t\n\t\tCategories: \tJapanese space probes\n\tSolar sail spacecraft\n\tSpace probes launched in 2010\n\tJAXA\n\t2010 in Japan\n\tSpacecraft launched by H-II rockets\n\n\nHidden categories: \tCS1 Japanese-language sources (ja)\n\tCS1 uses Japanese-language script (ja)\n\tAll articles with dead external links\n\tArticles with dead external links from December 2016\n\tUse dmy dates from September 2019\n\tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCatalà\n\tČeština\n\tDeutsch\n\tEspañol\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tLatviešu\n\tMagyar\n\t日本語\n\tPolski\n\tPortuguês\n\tРусский\n\tSuomi\n\tSvenska\n\tTürkçe\n\tУкраїнська\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 22 September 2019, at 00:04 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "7", "dc:title": "IKAROS - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/IKAROS_IAC_2010.jpg/1200px-IKAROS_IAC_2010.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-ikaros", "title": "IKAROS - Wikipedia"}}