{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn-space propulsion technologies - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tIn-space propulsion technologies\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tProposed in-space propulsion technologies describe the propulsion technologies that could meet future space science and exploration needs. These propulsion technologies are intended to provide effective exploration of our Solar System and will permit mission designers to plan missions to \"fly anytime, anywhere, and complete a host of science objectives at the destinations\" and with greater reliability and safety. With a wide range of possible missions and candidate propulsion technologies, the question of which technologies are \"best\" for future missions is a difficult one. A portfolio of propulsion technologies should be developed to provide optimum solutions for a diverse set of missions and destinations.[1][2][3]\n\nIn-space propulsion begins where the upper stage of the launch vehicle leaves off; performing the functions of primary propulsion, reaction control, station keeping, precision pointing, and orbital maneuvering. The main engines used in space provide the primary propulsive force for orbit transfer, planetary trajectories and extra planetary landing and ascent. The reaction control and orbital maneuvering systems provide the propulsive force for orbit maintenance, position control, station keeping, and spacecraft attitude control.[1][2][3]\n\n\nContents\n\n\n\t1 Current technology\n\t2 Metrics\n\t2.1 Technology area breakdown\n\t2.2 Defining technologies\n\n\n\n\t3 The challenge\n\t4 Primary propulsion technologies\n\t5 See also\n\t6 References\n\t7 Further reading\n\n\n\n\n\nCurrent technology[edit]\n\nA large fraction of the rocket engines in use today are chemical rockets; that is, they obtain the energy needed to generate thrust by chemical reactions to create a hot gas that is expanded to produce thrust. A significant limitation of chemical propulsion is that it has a relatively low specific impulse (Isp), which is the ratio of the thrust produced to the mass of propellant needed at a certain rate of flow.[1]\n\n\n  \nNASA's 2.3 kW NSTAR ion thruster for the Deep Space 1 spacecraft during a hot fire test at the Jet Propulsion Laboratory.\n\n\n\nA significant improvement (above 30%) in specific impulse can be obtained by using cryogenic propellants, such as liquid oxygen and liquid hydrogen, for example. Historically, these propellants have not been applied beyond upper stages. Furthermore, numerous concepts for advanced propulsion technologies, such as electric propulsion, are commonly used for station keeping on commercial communications satellites and for prime propulsion on some scientific space missions because they have significantly higher values of specific impulse. However, they generally have very small values of thrust and therefore must be operated for long durations to provide the total impulse required by a mission.[1][4][5][6]\n\nSeveral of these technologies offer performance that is significantly better than that achievable with chemical propulsion.\n\n\nMetrics[edit]\n\nIn-space propulsion represents technologies that can significantly improve a number of critical aspects of the mission. Space exploration is about getting somewhere safely (mission enabling), getting there quickly (reduced transit times), getting a lot of mass there (increased payload mass), and getting there cheaply (lower cost). The simple act of \"getting\" there requires the employment of an in-space propulsion system, and the other metrics are modifiers to this fundamental action.[1][3]\n\nDevelopment of technologies will result in technical solutions that improve thrust levels, Isp, power, specific mass, (or specific power), volume, system mass, system complexity, operational complexity, commonality with other spacecraft systems, manufacturability, durability, and cost. These types of improvements will yield decreased transit times, increased payload mass, safer spacecraft, and decreased costs. In some instances, development of technologies within this technology area (TA) will result in mission-enabling breakthroughs that will revolutionize space exploration. There is no single propulsion technology that will benefit all missions or mission types. The requirements for in-space propulsion vary widely due according to their intended application. The described technologies should support everything from small satellites and robotic deep space exploration to space stations and human missions to Mars applications.[1][3]\n\n\nTechnology area breakdown[edit]\n\nThe technology areas are divided into four basic groups: (1) Chemical propulsion, (2) Nonchemical propulsion, (3) Advanced propulsion technologies, and (4) Supporting technologies; based on the physics of the propulsion system and how it derives thrust as well as its technical maturity. Additionally, there may be credible meritorious in-space propulsion concepts not foreseen or reviewed at the time of publication, and which may be shown to be beneficial to future mission applications.[1]\n\n\nDefining technologies[edit]\n\nFurthermore, the term \"mission pull\" defines a technology or a performance characteristic necessary to meet a planned NASA mission requirement. Any other relationship between a technology and a mission (an alternate propulsion system, for example) is categorized as \"technology push.\" Also, a space demonstration refers to the spaceflight of a scaled version of a particular technology or of a critical technology subsystem. On the other hand, a space validation would serve as a qualification flight for future mission implementation. A successful validation flight would not require any additional space testing of a particular technology before it can be adopted for a science or exploration mission.[1]\n\n\nThe challenge[edit]\n\nFor both human and robotic exploration, traversing the solar system is a struggle against time and distance. The most distant planets are 4.5–6 billion kilometers from the Sun and to reach them in any reasonable time requires much more capable propulsion systems than conventional chemical rockets. Rapid inner solar system missions with flexible launch dates are difficult, requiring propulsion systems that are beyond today's current state of the art. The logistics, and therefore the total system mass required to support sustained human exploration beyond Earth to destinations such as the Moon, Mars or Near Earth Objects,\nare daunting unless more efficient in-space propulsion technologies are developed and fielded.[1][7]\n\n\nPrimary propulsion technologies[edit]\n\nThe Glenn Research Center aims to develop primary propulsion technologies which could benefit near and mid-term science missions by reducing cost, mass, and/or travel times. Propulsion architectures of particular interest to the GRC are electric propulsion systems, such as Ion and Hall thrusters.  One system combines solar sails, a form of propellantless propulsion which relies on naturally-occurring starlight for propulsion energy, and Hall thrusters. Other propulsion technologies being developed include advanced chemical propulsion and aerocapture.[3][8][9]\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\n\tAlcubierre drive\n\tBreakthrough Propulsion Physics Program\n\tInterplanetary Transport Network\n\tInterplanetary travel\n\tList of aerospace engineering topics\n\tList of rockets\n\tMagnetic sail\n\tOrbital maneuver\n\tOrbital mechanics\n\tPlasma propulsion engine\n\tPulse detonation engine\n\tRocket\n\tRocket engine nozzles\n\tSatellite\n\tSolar sail\n\tSpace travel using constant acceleration\n\tSpecific impulse\n\tStochastic electrodynamics\n\tTsiolkovsky rocket equation\n\n\n\n\nReferences[edit]\n\n\n\t^ a b c d e f g h i \n This article incorporates public domain material from the National Aeronautics and Space Administration document \"\"In-space propulsion systems roadmap.\" (April 2012).\" by Meyer, Mike, et al.\n\n\t^ a b \nMason, Lee S. \"A practical approach to starting fission surface power development.\" \nproceedings of International Congress on Advances in Nuclear Power Plants (ICAPP’06), American Nuclear Society, La Grange Park, IL, 2006b, paper. Vol. 6297. 2006.\n\n\t^ a b c d e \nLeone, Dan (Space Technology and Innovation) (May 20, 2013). \"NASA Banking on Solar Electric Propulsion's Slow but Steady Push\". Space News. SpaceNews, Inc.\n\n\t^ Tomsik, Thomas M. \"Recent advances and applications in cryogenic propellant densification technology.\" NASA TM 209941 (2000).\n\n\t^ Oleson, S., and J. Sankovic. \"Advanced Hall electric propulsion for future in-space transportation.\" Spacecraft Propulsion. Vol. 465. 2000.\n\n\t^ Dunning, John W., Scott Benson, and Steven Oleson. \"NASA’s electric propulsion program.\" 27th International Electric Propulsion Conference, Pasadena, CA, IEPC-01-002. 2001.\n\n\t^ \nHuntsberger, Terry; Rodriguez, Guillermo; Schenker, Paul S. (2000). \"Robotics Challenges for Robotic and Human Mars Exploration\". Robotics 2000: 340. CiteSeerX 10.1.1.83.3242. doi:10.1061/40476(299)45. ISBN 978-0-7844-0476-8.\n\n\n\t^ Solar Electric Propulsion (SEP). Glenn Research Center. NASA. 2019\n\n\t^ Ion propulsion system research. Glenn Research Center. NASA. 2013\n\n\n\n\n\nFurther reading[edit]\n\n\tFullerton, Richard K. \"Advanced EVA Roadmaps and Requirements.\" Proceedings of the 31st International Conference on Environmental Systems. 2001.\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=In-space_propulsion_technologies&oldid=901299315\"\n\n\t\t\n\t\tCategories: \tSpacecraft propulsion\n\tSpace technology\n\tNASA programs\n\tGlenn Research Center\n\tDiscovery and exploration of the Solar System\n\n\nHidden categories: \tWikipedia articles incorporating text from NASA\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\n\n\t\t\t\tAdd links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 10 June 2019, at 23:54 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "In-space propulsion technologies - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-in-space_propulsion_technologies", "title": "In-space propulsion technologies - Wikipedia"}}