{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInertial frame of reference - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tInertial frame of reference\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tFor other uses, see Framing.\n\n\n\n\n\tPart of a series of articles about\n\tClassical mechanics\n\t\n  \n    \n      \n        \n          \n            \n              F\n              →\n            \n          \n        \n        =\n        m\n        \n          \n            \n              a\n              →\n            \n          \n        \n      \n    \n    {\\displaystyle {\\vec {F}}=m{\\vec {a}}}\n  \nSecond law of motion\n\n\t\n\n\tHistory\n\tTimeline\n\n\n\n\n\t\nBranches\n\n\tApplied\n\tCelestial\n\tContinuum\n\tDynamics\n\tKinematics\n\tKinetics\n\tStatics\n\tStatistical\n\n\n\n\n\n\n\t\nFundamentals\n\n\tAcceleration\n\tAngular momentum\n\tCouple\n\tD'Alembert's principle\n\tEnergy\n\tkinetic\n\tpotential\n\n\n\tForce\n\tFrame of reference\n\tInertial frame of reference\n\tImpulse\n\tInertia / Moment of inertia\n\tMass\n\t\nMechanical power\n\tMechanical work\n\t\nMoment\n\tMomentum\n\tSpace\n\tSpeed\n\tTime\n\tTorque\n\tVelocity\n\tVirtual work\n\n\n\n\n\n\n\t\nFormulations\n\n\tNewton's laws of motion\n\n\tAnalytical mechanics \tLagrangian mechanics\n\tHamiltonian mechanics\n\tRouthian mechanics\n\tHamilton–Jacobi equation\n\tAppell's equation of motion\n\tUdwadia–Kalaba equation\n\tKoopman–von Neumann mechanics\n\n\n\n\n\n\n\n\n\t\nCore topics\n\n\tDamping (ratio)\n\tDisplacement\n\tEquations of motion\n\tEuler's laws of motion\n\tFictitious force\n\tFriction\n\tHarmonic oscillator\n\n\n\n\n\tInertial / Non-inertial reference frame\n\tMechanics of planar particle motion\n\n\n\n\tMotion (linear)\n\tNewton's law of universal gravitation\n\tNewton's laws of motion\n\tRelative velocity\n\tRigid body\n\tdynamics\n\tEuler's equations\n\n\n\tSimple harmonic motion\n\tVibration\n\n\n\n\n\n\n\t\nRotation\n\n\tCircular motion\n\tRotating reference frame\n\tCentripetal force\n\tCentrifugal force\n\treactive\n\n\n\tCoriolis force\n\tPendulum\n\tTangential speed\n\tRotational speed\n\n\n\n\n\tAngular acceleration / displacement / frequency / velocity\n\n\n\n\n\t\nScientists\n\n\tGalileo\n\tHuygens\n\tNewton\n\tKepler\n\tHorrocks\n\tHalley\n\tEuler\n\td'Alembert\n\tClairaut\n\tLagrange\n\tLaplace\n\tHamilton\n\tPoisson\n\tDaniel Bernoulli\n\tJohann Bernoulli\n\tCauchy\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\n\t\n\tThis article's tone or style may not reflect the encyclopedic tone used on Wikipedia. See Wikipedia's guide to writing better articles for suggestions.  (January 2018) (Learn how and when to remove this template message)\n\n\n\nAn inertial frame of reference in classical physics and special relativity possesses the property that in this frame of reference a body with zero net force acting upon it does not accelerate; that is, such a body is at rest or moving at a constant velocity.[1] An inertial frame of reference can be defined in analytical terms as a frame of reference that describes time and space homogeneously, isotropically, and in a time-independent manner.[2] Conceptually, the physics of a system in an inertial frame have no causes external to the system.[3] An inertial frame of reference may also be called an inertial reference frame, inertial frame, Galilean reference frame, or inertial space.[4]\n\nAll inertial frames are in a state of constant, rectilinear motion with respect to one another; an accelerometer moving with any of them would detect zero acceleration. Measurements in one inertial frame can be converted to measurements in another by a simple transformation (the Galilean transformation in Newtonian physics and the Lorentz transformation in special relativity). In general relativity, in any region small enough for the curvature of spacetime and tidal forces[5] to be negligible, one can find a set of inertial frames that approximately describe that region.[6][7]\n\nIn a non-inertial reference frame in classical physics and special relativity, the physics of a system vary depending on the acceleration of that frame with respect to an inertial frame, and the usual physical forces must be supplemented by fictitious forces.[8][9] In contrast, systems in general relativity don't have external causes, because of the principle of geodesic motion.[10] In classical physics, for example, a ball dropped towards the ground does not go exactly straight down because the Earth is rotating, which means the frame of reference of an observer on Earth is not inertial. The physics must account for the Coriolis effect—in this case thought of as a force—to predict the horizontal motion. Another example of such a fictitious force associated with rotating reference frames is the centrifugal effect, or centrifugal force.\n\n\nContents\n\n\n\t1 Introduction\n\t2 Background\n\t2.1 A set of frames where the laws of physics are simple\n\t2.2 Absolute space\n\n\n\n\t3 Newton's inertial frame of reference\n\t4 Separating non-inertial from inertial reference frames\n\t4.1 Theory\n\t4.2 Applications\n\n\n\n\t5 Newtonian mechanics\n\t6 Special relativity\n\t7 General relativity\n\t8 See also\n\t9 References\n\t10 Further reading\n\t11 External links\n\n\n\n\n\nIntroduction[edit]\n\nThe motion of a body can only be described relative to something else—other bodies, observers, or a set of space-time coordinates. These are called frames of reference. If the coordinates are chosen badly, the laws of motion may be more complex than necessary. For example, suppose a free body that has no external forces acting on it is at rest at some instant. In many coordinate systems, it would begin to move at the next instant, even though there are no forces on it. However, a frame of reference can always be chosen in which it remains stationary. Similarly, if space is not described uniformly or time independently, a coordinate system could describe the simple flight of a free body in space as a complicated zig-zag in its coordinate system. Indeed, an intuitive summary of inertial frames can be given: in an inertial reference frame, the laws of mechanics take their simplest form.[2]\n\nIn an inertial frame, Newton's first law, the law of inertia, is satisfied: Any free motion has a constant magnitude and direction.[2] Newton's second law for a particle takes the form:\n\n\n\t\n  \n    \n      \n        \n          F\n        \n        =\n        m\n        \n          a\n        \n         \n        ,\n      \n    \n    {\\displaystyle \\mathbf {F} =m\\mathbf {a} \\ ,}\n  \n\n\n\nwith F the net force (a vector), m the mass of a particle and a the acceleration of the particle (also a vector) which would be measured by an observer at rest in the frame. The force F is the vector sum of all \"real\" forces on the particle, such as electromagnetic, gravitational, nuclear and so forth. In contrast, Newton's second law in a rotating frame of reference, rotating at angular rate Ω about an axis, takes the form:\n\n\n\t\n  \n    \n      \n        \n          \n            F\n          \n          ′\n        \n        =\n        m\n        \n          a\n        \n         \n        ,\n      \n    \n    {\\displaystyle \\mathbf {F} '=m\\mathbf {a} \\ ,}\n  \n\n\n\nwhich looks the same as in an inertial frame, but now the force F′ is the resultant of not only F, but also additional terms (the paragraph following this equation presents the main points without detailed mathematics):\n\n\n\t\n  \n    \n      \n        \n          \n            F\n          \n          ′\n        \n        =\n        \n          F\n        \n        −\n        2\n        m\n        \n          Ω\n        \n        ×\n        \n          \n            v\n          \n          \n            B\n          \n        \n        −\n        m\n        \n          Ω\n        \n        ×\n        (\n        \n          Ω\n        \n        ×\n        \n          \n            x\n          \n          \n            B\n          \n        \n        )\n        −\n        m\n        \n          \n            \n              d\n              \n                Ω\n              \n            \n            \n              d\n              t\n            \n          \n        \n        ×\n        \n          \n            x\n          \n          \n            B\n          \n        \n         \n        ,\n      \n    \n    {\\displaystyle \\mathbf {F} '=\\mathbf {F} -2m\\mathbf {\\Omega } \\times \\mathbf {v} _{B}-m\\mathbf {\\Omega } \\times (\\mathbf {\\Omega } \\times \\mathbf {x} _{B})-m{\\frac {d\\mathbf {\\Omega } }{dt}}\\times \\mathbf {x} _{B}\\ ,}\n  \n\n\n\nwhere the angular rotation of the frame is expressed by the vector Ω pointing in the direction of the axis of rotation, and with magnitude equal to the angular rate of rotation Ω, symbol × denotes the vector cross product, vector xB locates the body and vector vB is the velocity of the body according to a rotating observer (different from the velocity seen by the inertial observer).\n\nThe extra terms in the force F′ are the \"fictitious\" forces for this frame, whose causes are external to the system in the frame. The first extra term is the Coriolis force, the second the centrifugal force, and the third the Euler force. These terms all have these properties: they vanish when Ω = 0; that is, they are zero for an inertial frame (which, of course, does not rotate); they take on a different magnitude and direction in every rotating frame, depending upon its particular value of Ω; they are ubiquitous in the rotating frame (affect every particle, regardless of circumstance); and they have no apparent source in identifiable physical sources, in particular, matter. Also, fictitious forces do not drop off with distance (unlike, for example, nuclear forces or electrical forces). For example, the centrifugal force that appears to emanate from the axis of rotation in a rotating frame increases with distance from the axis.\n\nAll observers agree on the real forces, F; only non-inertial observers need fictitious forces. The laws of physics in the inertial frame are simpler because unnecessary forces are not present.\n\nIn Newton's time the fixed stars were invoked as a reference frame, supposedly at rest relative to absolute space. In reference frames that were either at rest with respect to the fixed stars or in uniform translation relative to these stars, Newton's laws of motion were supposed to hold. In contrast, in frames accelerating with respect to the fixed stars, an important case being frames rotating relative to the fixed stars, the laws of motion did not hold in their simplest form, but had to be supplemented by the addition of fictitious forces, for example, the Coriolis force and the centrifugal force. Two experiments were devised by Newton to demonstrate how these forces could be discovered, thereby revealing to an observer that they were not in an inertial frame: the example of the tension in the cord linking two spheres rotating about their center of gravity, and the example of the curvature of the surface of water in a rotating bucket. In both cases, application of Newton's second law would not work for the rotating observer without invoking centrifugal and Coriolis forces to account for their observations (tension in the case of the spheres; parabolic water surface in the case of the rotating bucket).\n\nAs we now know, the fixed stars are not fixed. Those that reside in the Milky Way turn with the galaxy, exhibiting proper motions. Those that are outside our galaxy (such as nebulae once mistaken to be stars) participate in their own motion as well, partly due to expansion of the universe, and partly due to peculiar velocities.[11] The Andromeda Galaxy is on collision course with the Milky Way at a speed of 117 km/s.[12] The concept of inertial frames of reference is no longer tied to either the fixed stars or to absolute space. Rather, the identification of an inertial frame is based upon the simplicity of the laws of physics in the frame. In particular, the absence of fictitious forces is their identifying property.[13]\n\nIn practice, although not a requirement, using a frame of reference based upon the fixed stars as though it were an inertial frame of reference introduces very little discrepancy. For example, the centrifugal acceleration of the Earth because of its rotation about the Sun is about thirty million times greater than that of the Sun about the galactic center.[14]\n\nTo illustrate further, consider the question: \"Does our Universe rotate?\" To answer, we might attempt to explain the shape of the Milky Way galaxy using the laws of physics,[15] although other observations might be more definitive, that is, provide larger discrepancies or less measurement uncertainty, like the anisotropy of the microwave background radiation or Big Bang nucleosynthesis.[16][17] The flatness of the Milky Way depends on its rate of rotation in an inertial frame of reference. If we attribute its apparent rate of rotation entirely to rotation in an inertial frame, a different \"flatness\" is predicted than if we suppose part of this rotation actually is due to rotation of the universe and should not be included in the rotation of the galaxy itself. Based upon the laws of physics, a model is set up in which one parameter is the rate of rotation of the Universe. If the laws of physics agree more accurately with observations in a model with rotation than without it, we are inclined to select the best-fit value for rotation, subject to all other pertinent experimental observations. If no value of the rotation parameter is successful and theory is not within observational error, a modification of physical law is considered, for example, dark matter is invoked to explain the galactic rotation curve. So far, observations show any rotation of the universe is very slow, no faster than once every 60·1012 years (10−13 rad/yr),[18] and debate persists over whether there is any rotation. However, if rotation were found, interpretation of observations in a frame tied to the universe would have to be corrected for the fictitious forces inherent in such rotation in classical physics and special relativity, or interpreted as the curvature of spacetime and the motion of matter along the geodesics in general relativity.\n\nWhen quantum effects are important, there are additional conceptual complications that arise in quantum reference frames.\n\n\nBackground[edit]\n\nA set of frames where the laws of physics are simple[edit]\n\nAccording to the first postulate of special relativity, all physical laws take their simplest form in an inertial frame, and there exist multiple inertial frames interrelated by uniform translation: [19]\nSpecial principle of relativity: If a system of coordinates K is chosen so that, in relation to it, physical laws hold good in their simplest form, the same laws hold good in relation to any other system of coordinates K' moving in uniform translation relatively to K.\n— Albert Einstein: The foundation of the general theory of relativity, Section A, §1\n\n\n\nThis simplicity manifests in that inertial frames have self-contained physics without the need for external causes, while physics in non-inertial frames have external causes.[3] The principle of simplicity can be used within Newtonian physics as well as in special relativity; see Nagel[20] and also Blagojević.[21]\n\n\n\nThe laws of Newtonian mechanics do not always hold in their simplest form...If, for instance, an observer is placed on a disc rotating relative to the earth, he/she will sense a 'force' pushing him/her toward the periphery of the disc, which is not caused by any interaction with other bodies. Here, the acceleration is not the consequence of the usual force, but of the so-called inertial force. Newton's laws hold in their simplest form only in a family of reference frames, called inertial frames. This fact represents the essence of the Galilean principle of relativity:\n   The laws of mechanics have the same form in all inertial frames.\n— Milutin Blagojević: Gravitation and Gauge Symmetries, p. 4\n\n\n\nIn practical terms, the equivalence of inertial reference frames means that scientists within a box moving uniformly cannot determine their absolute velocity by any experiment. Otherwise, the differences would set up an absolute standard reference frame.[22][23] According to this definition, supplemented with the constancy of the speed of light, inertial frames of reference transform among themselves according to the Poincaré group of symmetry transformations, of which the Lorentz transformations are a subgroup.[24] In Newtonian mechanics, which can be viewed as a limiting case of special relativity in which the speed of light is infinite, inertial frames of reference are related by the Galilean group of symmetries.\n\n\nAbsolute space[edit]\n\nMain article: Absolute space and time\n\nNewton posited an absolute space considered well approximated by a frame of reference stationary relative to the fixed stars. An inertial frame was then one in uniform translation relative to absolute space. However, some scientists (called \"relativists\" by Mach[25]), even at the time of Newton, felt that absolute space was a defect of the formulation, and should be replaced.\n\nIndeed, the expression inertial frame of reference (German: Inertialsystem) was coined by Ludwig Lange in 1885, to replace Newton's definitions of \"absolute space and time\" by a more operational definition.[26][27] As translated by Iro, Lange proposed the following definition:[28]\n\n\n\nA reference frame in which a mass point thrown from the same point in three different (non co-planar) directions follows rectilinear paths each time it is thrown, is called an inertial frame.\n\n\n\nA discussion of Lange's proposal can be found in Mach.[25]\n\n\nThe inadequacy of the notion of \"absolute space\" in Newtonian mechanics is spelled out by Blagojević:[29] \n\n\tThe existence of absolute space contradicts the internal logic of classical mechanics since, according to Galilean principle of relativity, none of the inertial frames can be singled out.\n\tAbsolute space does not explain inertial forces since they are related to acceleration with respect to any one of the inertial frames.\n\tAbsolute space acts on physical objects by inducing their resistance to acceleration but it cannot be acted upon.\n\n— Milutin Blagojević: Gravitation and Gauge Symmetries, p. 5\n\n\n\nThe utility of operational definitions was carried much further in the special theory of relativity.[30] Some historical background including Lange's definition is provided by DiSalle, who says in summary:[31]\n\n\n\nThe original question, \"relative to what frame of reference do the laws of motion hold?\" is revealed to be wrongly posed. For the laws of motion essentially determine a class of reference frames, and (in principle) a procedure for constructing them.\n— Robert DiSalle Space and Time: Inertial Frames\n\n\n\nNewton's inertial frame of reference[edit]\n\n  \nFigure 1: Two frames of reference moving with relative velocity \n  \n    \n      \n        \n          \n            \n              \n\n              \n              \n                \n                  \n                    v\n                    →\n                  \n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\stackrel {\\vec {v}}{}}}\n  \n. Frame S'  has an arbitrary but fixed rotation with respect to frame S. They are both inertial frames provided a body not subject to forces appears to move in a straight line. If that motion is seen in one frame, it will also appear that way in the other.\n\n\n\nWithin the realm of Newtonian mechanics, an inertial frame of reference, or inertial reference frame, is one in which Newton's first law of motion is valid.[32] However, the principle of special relativity generalizes the notion of inertial frame to include all physical laws, not simply Newton's first law.\n\nNewton viewed the first law as valid in any reference frame that is in uniform motion relative to the fixed stars;[33] that is, neither rotating nor accelerating relative to the stars.[34] Today the notion of \"absolute space\" is abandoned, and an inertial frame in the field of classical mechanics is defined as:[35][36]\n\n\n\nAn inertial frame of reference is one in which the motion of a particle not subject to forces is in a straight line at constant speed.\n\n\n\nHence, with respect to an inertial frame, an object or body accelerates only when a physical force is applied, and (following Newton's first law of motion), in the absence of a net force, a body at rest will remain at rest and a body in motion will continue to move uniformly—that is, in a straight line and at constant speed. Newtonian inertial frames transform among each other according to the Galilean group of symmetries.\n\nIf this rule is interpreted as saying that straight-line motion is an indication of zero net force, the rule does not identify inertial reference frames because straight-line motion can be observed in a variety of frames. If the rule is interpreted as defining an inertial frame, then we have to be able to determine when zero net force is applied. The problem was summarized by Einstein:[37]\n\n\n\nThe weakness of the principle of inertia lies in this, that it involves an argument in a circle: a mass moves without acceleration if it is sufficiently far from other bodies; we know that it is sufficiently far from other bodies only by the fact that it moves without acceleration.\n— Albert Einstein: The Meaning of Relativity, p. 58\n\n\n\nThere are several approaches to this issue. One approach is to argue that all real forces drop off with distance from their sources in a known manner, so we have only to be sure that a body is far enough away from all sources to ensure that no force is present.[38] A possible issue with this approach is the historically long-lived view that the distant universe might affect matters (Mach's principle). Another approach is to identify all real sources for real forces and account for them. A possible issue with this approach is that we might miss something, or account inappropriately for their influence, perhaps, again, due to Mach's principle and an incomplete understanding of the universe. A third approach is to look at the way the forces transform when we shift reference frames. Fictitious forces, those that arise due to the acceleration of a frame, disappear in inertial frames, and have complicated rules of transformation in general cases. On the basis of universality of physical law and the request for frames where the laws are most simply expressed, inertial frames are distinguished by the absence of such fictitious forces.\n\n\nNewton enunciated a principle of relativity himself in one of his corollaries to the laws of motion:[39][40] \n\nThe motions of bodies included in a given space are the same among themselves, whether that space is at rest or moves uniformly forward in a straight line.\n— Isaac Newton: Principia, Corollary V, p. 88 in Andrew Motte translation\n\n\n\nThis principle differs from the special principle in two ways: first, it is restricted to mechanics, and second, it makes no mention of simplicity. It shares with the special principle the invariance of the form of the description among mutually translating reference frames.[41] The role of fictitious forces in classifying reference frames is pursued further below.\n\n\nSeparating non-inertial from inertial reference frames[edit]\n\nTheory[edit]\n\nMain article: Fictitious force\n\nSee also: Non-inertial frame, Rotating spheres, and Bucket argument\n\n  \nFigure 2: Two spheres tied with a string and rotating at an angular rate ω. Because of the rotation, the string tying the spheres together is under tension.\n\n\n\n  \nFigure 3: Exploded view of rotating spheres in an inertial frame of reference showing the centripetal forces on the spheres provided by the tension in the tying string.\n\n\n\nInertial and non-inertial reference frames can be distinguished by the absence or presence of fictitious forces, as explained shortly.[8][9] \n\nThe effect of this being in the noninertial frame is to require the observer to introduce a fictitious force into his calculations….\n— Sidney Borowitz and Lawrence A Bornstein in A Contemporary View of Elementary Physics, p. 138\n\n\n\nThe presence of fictitious forces indicates the physical laws are not the simplest laws available so, in terms of the special principle of relativity, a frame where fictitious forces are present is not an inertial frame:[42]\n\n\n\nThe equations of motion in a non-inertial system differ from the equations in an inertial system by additional terms called inertial forces. This allows us to detect experimentally the non-inertial nature of a system.\n— V. I. Arnol'd: Mathematical Methods of Classical Mechanics Second Edition, p. 129\n\n\n\nBodies in non-inertial reference frames are subject to so-called fictitious forces (pseudo-forces); that is, forces that result from the acceleration of the reference frame itself and not from any physical force acting on the body. Examples of fictitious forces are the centrifugal force and the Coriolis force in rotating reference frames.\n\nHow then, are \"fictitious\" forces to be separated from \"real\" forces? It is hard to apply the Newtonian definition of an inertial frame without this separation. For example, consider a stationary object in an inertial frame. Being at rest, no net force is applied. But in a frame rotating about a fixed axis, the object appears to move in a circle, and is subject to centripetal force (which is made up of the Coriolis force and the centrifugal force). How can we decide that the rotating frame is a non-inertial frame? There are two approaches to this resolution: one approach is to look for the origin of the fictitious forces (the Coriolis force and the centrifugal force). We will find there are no sources for these forces, no associated force carriers, no originating bodies.[43] A second approach is to look at a variety of frames of reference. For any inertial frame, the Coriolis force and the centrifugal force disappear, so application of the principle of special relativity would identify these frames where the forces disappear as sharing the same and the simplest physical laws, and hence rule that the rotating frame is not an inertial frame.\n\nNewton examined this problem himself using rotating spheres, as shown in Figure 2 and Figure 3. He pointed out that if the spheres are not rotating, the tension in the tying string is measured as zero in every frame of reference.[44] If the spheres only appear to rotate (that is, we are watching stationary spheres from a rotating frame), the zero tension in the string is accounted for by observing that the centripetal force is supplied by the centrifugal and Coriolis forces in combination, so no tension is needed. If the spheres really are rotating, the tension observed is exactly the centripetal force required by the circular motion. Thus, measurement of the tension in the string identifies the inertial frame: it is the one where the tension in the string provides exactly the centripetal force demanded by the motion as it is observed in that frame, and not a different value. That is, the inertial frame is the one where the fictitious forces vanish.\n\nSo much for fictitious forces due to rotation. However, for linear acceleration, Newton expressed the idea of undetectability of straight-line accelerations held in common:[40]\n\n\n\nIf bodies, any how moved among themselves, are urged in the direction of parallel lines by equal accelerative forces, they will continue to move among themselves, after the same manner as if they had been urged by no such forces.\n— Isaac Newton: Principia Corollary VI, p. 89, in Andrew Motte translation\n\n\n\nThis principle generalizes the notion of an inertial frame. For example, an observer confined in a free-falling lift will assert that he himself is a valid inertial frame, even if he is accelerating under gravity, so long as he has no knowledge about anything outside the lift. So, strictly speaking, inertial frame is a relative concept. With this in mind, we can define inertial frames collectively as a set of frames which are stationary or moving at constant velocity with respect to each other, so that a single inertial frame is defined as an element of this set.\n\nFor these ideas to apply, everything observed in the frame has to be subject to a base-line, common acceleration shared by the frame itself. That situation would apply, for example, to the elevator example, where all objects are subject to the same gravitational acceleration, and the elevator itself accelerates at the same rate.\n\n\nApplications[edit]\n\nInertial navigation systems used a cluster of gyroscopes and accelerometers to determine accelerations relative to inertial space. After a gyroscope is spun up in a particular orientation in inertial space, the law of conservation of angular momentum requires that it retain that orientation as long as no external forces are applied to it.[45]:59  Three orthogonal gyroscopes establish an inertial reference frame, and the accelerators measure acceleration relative to that frame. The accelerations, along with a clock, can then be used to calculate the change in position. Thus, inertial navigation is a form of dead reckoning that requires no external input, and therefore cannot be jammed by any external or internal signal source.[46]\n\nA gyrocompass, employed for navigation of seagoing vessels, finds the geometric north. It does so, not by sensing the Earth's magnetic field, but by using inertial space as its reference. The outer casing of the gyrocompass device is held in such a way that it remains aligned with the local plumb line. When the gyroscope wheel inside the gyrocompass device is spun up, the way the gyroscope wheel is suspended causes the gyroscope wheel to gradually align its spinning axis with the Earth's axis. Alignment with the Earth's axis is the only direction for which the gyroscope's spinning axis can be stationary with respect to the Earth and not be required to change direction with respect to inertial space. After being spun up, a gyrocompass can reach the direction of alignment with the Earth's axis in as little as a quarter of an hour.[47]\n\n\nNewtonian mechanics[edit]\n\n\t\tThis section does not cite any sources.  (May 2018) (Learn how and when to remove this template message)\n\n\n \nMain article: Newton's laws of motion\n\nClassical theories that use the Galilean transformation postulate the equivalence of all inertial reference frames. Some theories may even postulate the existence of a privileged frame which provides absolute space and absolute time. The Galilean transformation transforms coordinates from one inertial reference frame, \n  \n    \n      \n        \n          s\n        \n      \n    \n    {\\displaystyle \\mathbf {s} }\n  \n, to another, \n  \n    \n      \n        \n          \n            s\n          \n          \n            ′\n          \n        \n      \n    \n    {\\displaystyle \\mathbf {s} ^{\\prime }}\n  \n, by simple addition or subtraction of coordinates:\n\n\n\t\n  \n    \n      \n        \n          \n            r\n          \n          \n            ′\n          \n        \n        =\n        \n          r\n        \n        −\n        \n          \n            r\n          \n          \n            0\n          \n        \n        −\n        \n          v\n        \n        t\n      \n    \n    {\\displaystyle \\mathbf {r} ^{\\prime }=\\mathbf {r} -\\mathbf {r} _{0}-\\mathbf {v} t}\n  \n\n\n\n\t\n  \n    \n      \n        \n          t\n          \n            ′\n          \n        \n        =\n        t\n        −\n        \n          t\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle t^{\\prime }=t-t_{0}}\n  \n\n\n\nwhere r0 and t0 represent shifts in the origin of space and time, and v is the relative velocity of the two inertial reference frames. Under Galilean transformations, the time t2 − t1 between two events is the same for all reference frames and the distance between two simultaneous events (or, equivalently, the length of any object, |r2 − r1|) is also the same.\n\n\nSpecial relativity[edit]\n\nMain articles: Special relativity and Introduction to special relativity\n\nEinstein's theory of special relativity, like Newtonian mechanics, postulates the equivalence of all inertial reference frames. However, because special relativity postulates that the speed of light in free space is invariant, the transformation between inertial frames is the Lorentz transformation, not the Galilean transformation which is used in Newtonian mechanics. The invariance of the speed of light leads to counter-intuitive phenomena, such as time dilation and length contraction, and the relativity of simultaneity, which have been extensively verified experimentally.[48] The Lorentz transformation reduces to the Galilean transformation as the speed of light approaches infinity or as the relative velocity between frames approaches zero.[49]\n\n\nGeneral relativity[edit]\n\nMain articles: General relativity and Introduction to general relativity\n\nSee also: Equivalence principle and Eötvös experiment\n\nGeneral relativity is based upon the principle of equivalence:[50][51]\n\nThere is no experiment observers can perform to distinguish whether an acceleration arises because of a gravitational force or because their reference frame is accelerating.\n— Douglas C. Giancoli, Physics for Scientists and Engineers with Modern Physics, p. 155.\n\n\n\nThis idea was introduced in Einstein's 1907 article \"Principle of Relativity and Gravitation\" and later developed in 1911.[52] Support for this principle is found in the Eötvös experiment, which determines whether the ratio of inertial to gravitational mass is the same for all bodies, regardless of size or composition. To date no difference has been found to a few parts in 1011.[53] For some discussion of the subtleties of the Eötvös experiment, such as the local mass distribution around the experimental site (including a quip about the mass of Eötvös himself), see Franklin.[54]\n\nEinstein’s general theory modifies the distinction between nominally \"inertial\" and \"noninertial\" effects by replacing special relativity's \"flat\" Minkowski Space with a metric that produces non-zero curvature. In general relativity, the principle of inertia is replaced with the principle of geodesic motion, whereby objects move in a way dictated by the curvature of spacetime. As a consequence of this curvature, it is not a given in general relativity that inertial objects moving at a particular rate with respect to each other will continue to do so. This phenomenon of geodesic deviation means that inertial frames of reference do not exist globally as they do in Newtonian mechanics and special relativity.\n\nHowever, the general theory reduces to the special theory over sufficiently small regions of spacetime, where curvature effects become less important and the earlier inertial frame arguments can come back into play.[55][56] Consequently, modern special relativity is now sometimes described as only a \"local theory\".[57] \"Local\" can encompass, for example, the entire Milky Way galaxy: The astronomer Karl Schwarzschild observed the motion of pairs of stars orbiting each other. He found that the two orbits of the stars of such a system lie in a plane, and the perihelion of the orbits of the two stars remains pointing in the same direction with respect to the solar system. Schwarzschild pointed out that that was invariably seen: the direction of the angular momentum of all observed double star systems remains fixed with respect to the direction of the angular momentum of the Solar System. These observations allowed him to conclude that inertial frames inside the galaxy do not rotate with respect to one another, and that the space of the Milky Way is approximately Galilean or Minkowskian.[58]\n\n\nSee also[edit]\n\n\n\n \n\t\n\tAbsolute rotation\n\tDiffeomorphism\n\tGalilean invariance\n\tGeneral covariance\n\n\n \n\n\n\t\n\tLocal reference frame\n\tLorentz covariance\n\tNewton's first law\n\tQuantum reference frame\n\n\n \n\n\n\n\n\n\nReferences[edit]\n\n\n\t^ Douglas Fields (2015), \"Galilean Relativity\" (PDF), Physics 262-01 Spring 2018, University of New Mexico, retrieved 27 May 2018\n\n\t^ a b c Landau, L. D.; Lifshitz, E. M. (1960). Mechanics. Pergamon Press. pp. 4–6.\n\n\n\t^ a b Ferraro, Rafael (2007), Einstein's Space-Time: An Introduction to Special and General Relativity, Springer Science & Business Media, pp. 209–210, Bibcode:2007esti.book.....F, ISBN 9780387699462\n\n\n\t^ Puebe, Jean-Laurent (2009). Fluid Mechanics. p. 62. ISBN 978-1-84821-065-3.\n\n\n\t^ Cheng, Ta-Pei (2013). Einstein's Physics: Atoms, Quanta, and Relativity – Derived, Explained, and Appraised (illustrated ed.). OUP Oxford. p. 219. ISBN 978-0-19-966991-2.\n Extract of page 219\n\n\t^ Albert Einstein (2001) [Reprint of edition of 1920 translated by RQ Lawson]. Relativity: The Special and General Theory (3rd ed.). Courier Dover Publications. p. 71. ISBN 0-486-41714-X.\n\n\n\t^ Domenico Giulini (2005). Special Relativity. Oxford University Press. p. 19. ISBN 0-19-856746-4.\n\n\n\t^ a b Milton A. Rothman (1989). Discovering the Natural Laws: The Experimental Basis of Physics. Courier Dover Publications. p. 23. ISBN 0-486-26178-6.\n\n\n\t^ a b Sidney Borowitz; Lawrence A. Bornstein (1968). A Contemporary View of Elementary Physics. McGraw-Hill. p. 138. ASIN B000GQB02A.\n\n\n\t^ Gilson, James G. (1 September 2004), Mach's Principle II, arXiv:physics/0409010, Bibcode:2004physics...9010G\n\n\n\t^ Amedeo Balbi (2008). The Music of the Big Bang. Springer. p. 59. ISBN 978-3-540-78726-6.\n\n\n\t^ Abraham Loeb; Mark J. Reid; Andreas Brunthaler; Heino Falcke (2005). \"Constraints on the proper motion of the Andromeda Galaxy based on the survival of its satellite M33\" (PDF). The Astrophysical Journal. 633 (2): 894–898. arXiv:astro-ph/0506609. Bibcode:2005ApJ...633..894L. doi:10.1086/491644.\n\n\n\t^ John J. Stachel (2002). Einstein from \"B\" to \"Z\". Springer. pp. 235–236. ISBN 0-8176-4143-2.\n\n\n\t^ Peter Graneau; Neal Graneau (2006). In the Grip of the Distant Universe. World Scientific. p. 147. ISBN 981-256-754-2.\n\n\n\t^ Henning Genz (2001). Nothingness. Da Capo Press. p. 275. ISBN 0-7382-0610-5.\n\n\n\t^ J Garcio-Bellido (2005). \"The Paradigm of Inflation\".  In J. M. T. Thompson (ed.). Advances in Astronomy. Imperial College Press. p. 32, §9. ISBN 1-86094-577-5.\n\n\n\t^ Wlodzimierz Godlowski; Marek Szydlowski (2003). \"Dark energy and global rotation of the Universe\". General Relativity and Gravitation. 35 (12): 2171–2187. arXiv:astro-ph/0303248. Bibcode:2003GReGr..35.2171G. doi:10.1023/A:1027301723533.\n\n\n\t^ P Birch Is the Universe rotating? Nature 298, 451 – 454 (29 July 1982)\n\n\t^ Einstein, A., Lorentz, H. A., Minkowski, H., & Weyl, H. (1952). The Principle of Relativity: a collection of original memoirs on the special and general theory of relativity. Courier Dover Publications. p. 111. ISBN 0-486-60081-5.CS1 maint: multiple names: authors list (link)\n\n\n\t^ Ernest Nagel (1979). The Structure of Science. Hackett Publishing. p. 212. ISBN 0-915144-71-9.\n\n\n\t^ Milutin Blagojević (2002). Gravitation and Gauge Symmetries. CRC Press. p. 4. ISBN 0-7503-0767-6.\n\n\n\t^ Albert Einstein (1920). Relativity: The Special and General Theory. H. Holt and Company. p. 17.\n\n\n\t^ Richard Phillips Feynman (1998). Six not-so-easy pieces: Einstein's relativity, symmetry, and space-time. Basic Books. p. 73. ISBN 0-201-32842-9.\n\n\n\t^ Armin Wachter; Henning Hoeber (2006). Compendium of Theoretical Physics. Birkhäuser. p. 98. ISBN 0-387-25799-3.\n\n\n\t^ a b Ernst Mach (1915). The Science of Mechanics. The Open Court Publishing Co. p. 38.\n\n\n\t^ Lange, Ludwig (1885). \"Über die wissenschaftliche Fassung des Galileischen Beharrungsgesetzes\". Philosophische Studien. 2.\n\n\n\t^ Julian B. Barbour (2001). The Discovery of Dynamics (Reprint of 1989 Absolute or Relative Motion? ed.). Oxford University Press. pp. 645–646. ISBN 0-19-513202-5.\n\n\n\t^ L. Lange (1885) as quoted by Max von Laue in his book (1921) Die Relativitätstheorie, p. 34, and translated by Harald Iro (2002). A Modern Approach to Classical Mechanics. World Scientific. p. 169. ISBN 981-238-213-5.\n\n\n\t^ Milutin Blagojević (2002). Gravitation and Gauge Symmetries. CRC Press. p. 5. ISBN 0-7503-0767-6.\n\n\n\t^ NMJ Woodhouse (2003). Special relativity. London: Springer. p. 58. ISBN 1-85233-426-6.\n\n\n\t^ Robert DiSalle (Summer 2002). \"Space and Time: Inertial Frames\".  In Edward N. Zalta (ed.). The Stanford Encyclopedia of Philosophy.\n\n\n\t^ C Møller (1976). The Theory of Relativity (Second ed.). Oxford UK: Oxford University Press. p. 1. ISBN 0-19-560539-X. OCLC 220221617.\n\n\n\t^ The question of \"moving uniformly relative to what?\" was answered by Newton as \"relative to absolute space\". As a practical matter, \"absolute space\" was considered to be the fixed stars. For a discussion of the role of fixed stars, see Henning Genz (2001). Nothingness: The Science of Empty Space. Da Capo Press. p. 150. ISBN 0-7382-0610-5.\n\n\n\t^ Robert Resnick; David Halliday; Kenneth S. Krane (2001). Physics (5th ed.). Wiley. Volume 1, Chapter 3. ISBN 0-471-32057-9.\n\n\n\t^ RG Takwale (1980). Introduction to classical mechanics. New Delhi: Tata McGraw-Hill. p. 70. ISBN 0-07-096617-6.\n\n\n\t^ NMJ Woodhouse (2003). Special relativity. London/Berlin: Springer. p. 6. ISBN 1-85233-426-6.\n\n\n\t^ A Einstein (1950). The Meaning of Relativity. Princeton University Press. p. 58.\n\n\n\t^ William Geraint Vaughan Rosser (1991). Introductory Special Relativity. CRC Press. p. 3. ISBN 0-85066-838-7.\n\n\n\t^ Richard Phillips Feynman (1998). Six not-so-easy pieces: Einstein's relativity, symmetry, and space-time. Basic Books. p. 50. ISBN 0-201-32842-9.\n\n\n\t^ a b See the Principia on line at Andrew Motte Translation\n\n\t^ However, in the Newtonian system the Galilean transformation connects these frames and in the special theory of relativity the Lorentz transformation connects them. The two transformations agree for speeds of translation much less than the speed of light.\n\n\t^ V. I. Arnol'd (1989). Mathematical Methods of Classical Mechanics. Springer. p. 129. ISBN 978-0-387-96890-2.\n\n\n\t^ For example, there is no body providing a gravitational or electrical attraction.\n\n\t^ That is, the universality of the laws of physics requires the same tension to be seen by everybody. For example, it cannot happen that the string breaks under extreme tension in one frame of reference and remains intact in another frame of reference, just because we choose to look at the string from a different frame.\n\n\t^ Chatfield, Averil B. (1997). Fundamentals of High Accuracy Inertial Navigation, Volume 174. AIAA. ISBN 9781600864278.\n\n\n\t^ Kennie, edited by T.J.M.; Petrie, G. (1993). Engineering Surveying Technology (Pbk. ed.). Hoboken: Taylor & Francis. p. 95. ISBN 9780203860748.CS1 maint: extra text: authors list (link)\n\n\n\t^ \"The gyroscope pilots ships & planes\". Life: 80–83. 15 March 1943.\n\n\n\t^ Skinner, Ray (2014). Relativity for Scientists and Engineers (reprinted ed.). Courier Corporation. p. 27. ISBN 978-0-486-79367-2.\n Extract of page 27\n\n\t^ LD Landau; LM Lifshitz (1975). The Classical Theory of Fields (4th Revised English ed.). Pergamon Press. pp. 273–274. ISBN 978-0-7506-2768-9.\n\n\n\t^ David Morin (2008). Introduction to Classical Mechanics. Cambridge University Press. p. 649. ISBN 978-0-521-87622-3.\n\n\n\t^ Douglas C. Giancoli (2007). Physics for Scientists and Engineers with Modern Physics. Pearson Prentice Hall. p. 155. ISBN 978-0-13-149508-1.\n\n\n\t^ A. Einstein, \"On the influence of gravitation on the propagation of light\", Annalen der Physik, vol. 35, (1911) : 898–908\n\n\t^ National Research Council (US) (1986). Physics Through the Nineteen Nineties: Overview. National Academies Press. p. 15. ISBN 0-309-03579-1.\n\n\n\t^ Allan Franklin (2007). No Easy Answers: Science and the Pursuit of Knowledge. University of Pittsburgh Press. p. 66. ISBN 978-0-8229-5968-7.\n\n\n\t^ Green, Herbert S. (2000). Information Theory and Quantum Physics: Physical Foundations for Understanding the Conscious Process. Springer. p. 154. ISBN 354066517X.\n Extract of page 154\n\n\t^ Bandyopadhyay, Nikhilendu (2000). Theory of Special Relativity. Academic Publishers. p. 116. ISBN 8186358528.\n Extract of page 116\n\n\t^ Liddle, Andrew R.; Lyth, David H. (2000). Cosmological Inflation and Large-Scale Structure. Cambridge University Press. p. 329. ISBN 0-521-57598-2.\n Extract of page 329\n\n\t^ In the Shadow of the Relativity Revolution Section 3: The Work of Karl Schwarzschild (2.2 MB PDF-file)\n\n\n\n\n\nFurther reading[edit]\n\n\tEdwin F. Taylor and John Archibald Wheeler, Spacetime Physics, 2nd ed. (Freeman, NY, 1992)\n\tAlbert Einstein, Relativity, the special and the general theories, 15th ed. (1954)\n\tPoincaré, Henri (1900). \"La théorie de Lorentz et le Principe de Réaction\". Archives Neerlandaises. V: 253–78.\n\n\tAlbert Einstein, On the Electrodynamics of Moving Bodies, included in The Principle of Relativity, page 38. Dover 1923\n\n\n\tRotation of the Universe\n\n\n\tJulian B. Barbour; Herbert Pfister (1998). Mach's Principle: From Newton's Bucket to Quantum Gravity. Birkhäuser. p. 445. ISBN 0-8176-3823-7.\n\n\tPJ Nahin (1999). Time Machines. Springer. p. 369; Footnote 12. ISBN 0-387-98571-9.\n\n\tB Ciobanu, I Radinchi Modeling the electric and magnetic fields in a rotating universe Rom. Journ. Phys., Vol. 53, Nos. 1–2, P. 405–415, Bucharest, 2008\n\tYuri N. Obukhov, Thoralf Chrobok, Mike Scherfner Shear-free rotating inflation Phys. Rev. D 66, 043518 (2002) [5 pages]\n\tYuri N. Obukhov On physical foundations and observational effects of cosmic rotation (2000)\n\tLi-Xin Li Effect of the Global Rotation of the Universe on the Formation of Galaxies General Relativity and Gravitation, 30 (1998) doi:10.1023/A:1018867011142\n\tP Birch Is the Universe rotating? Nature 298, 451 – 454 (29 July 1982)\n\tKurt Gödel An example of a new type of cosmological solutions of Einstein’s field equations of gravitation Rev. Mod. Phys., Vol. 21, p. 447, 1949.\n\n\nExternal links[edit]\n\n\tStanford Encyclopedia of Philosophy entry\n\tAnimation clip on YouTube showing scenes as viewed from both an inertial frame and a rotating frame of reference, visualizing the Coriolis and centrifugal forces.\n\t\"Is Gravity An Illusion?\". PBS Space Time. 3 June 2015 – via YouTube.\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Inertial_frame_of_reference&oldid=919213582\"\n\n\t\t\n\t\tCategories: \tClassical mechanics\n\tFrames of reference\n\tTheory of relativity\n\tOrbits\n\n\nHidden categories: \tCS1 maint: multiple names: authors list\n\tCS1 maint: extra text: authors list\n\tUse dmy dates from August 2019\n\tWikipedia articles with style issues from January 2018\n\tAll articles with style issues\n\tArticles containing German-language text\n\tArticles needing additional references from May 2018\n\tAll articles needing additional references\n\tArticles using small message boxes\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tالعربية\n\tAzərbaycanca\n\tবাংলা\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tBosanski\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tMagyar\n\tМонгол\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSuomi\n\tSvenska\n\tไทย\n\tTürkçe\n\tУкраїнська\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 2 October 2019, at 12:59 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "31", "dc:title": "Inertial frame of reference - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-inertial_frame_of_reference", "title": "Inertial frame of reference - Wikipedia"}}