{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIon thruster - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tIon thruster\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about a kind of reaction engine. For the air propulsion concept, see ionocraft.\n\n  \nNASA's 2.3 kW NSTAR ion thruster for the Deep Space 1 spacecraft during a hot fire test at the Jet Propulsion Laboratory\n\n\n\n  \nNEXIS ion engine test (2005)\n\n\n\nAn ion thruster or ion drive is a form of electric propulsion used for spacecraft propulsion. It creates thrust by accelerating ions using electricity.\n\nAn ion thruster ionizes a neutral gas by extracting some electrons out of atoms, creating a cloud of positive ions. These ion thrusters rely mainly on electrostatics as ions are accelerated by the Coulomb force along an electric field. Temporarily stored electrons are finally reinjected by a neutralizer in the cloud of ions after it has passed through the electrostatic grid, so the gas becomes neutral again and can freely disperse in space without any further electrical interaction with the thruster. Electromagnetic thrusters on the contrary use the Lorentz force to accelerate all species (free electrons as well as positive and negative ions) in the same direction whatever their electric charge, and are specifically referred as plasma propulsion engines, where the electric field is not in the direction of the acceleration.[1][2]\n\nIon thrusters in operational use have an input power need of 1–7 kW (1.3–9.4 hp), exhaust velocity 20–50 km/s (45,000–112,000 mph), thrust 25–250 millinewtons (0.090–0.899 ozf) and efficiency 65–80%[3][4] though experimental versions have achieved 100 kilowatts (130 hp), 5 newtons (1.1 lbf).[5]\n\nThe Deep Space 1 spacecraft, powered by an ion thruster, changed velocity by 4.3 km/s (9,600 mph) while consuming less than 74 kg (163 lb) of xenon. The Dawn spacecraft broke the record, with a velocity change of 11.5 km/s (26,000 mph).[6]\n\nApplications include control of the orientation and position of orbiting satellites (some satellites have dozens of low-power ion thrusters) and use as a main propulsion engine for low-mass robotic space vehicles (such as Deep Space 1 and Dawn).[3][4]\n\nIon thrust engines are practical only in the vacuum of space and cannot take vehicles through the atmosphere because ion engines do not work in the presence of ions outside the engine. Additionally, the engine's minuscule thrust cannot overcome any significant air resistance. Spacecraft rely on conventional chemical rockets to initially reach orbit.\n\n\nContents\n\n\n\t1 Origins\n\t2 General working principle\n\t3 Electrostatic ion thrusters\n\t3.1 Gridded electrostatic ion thrusters\n\t3.2 Hall effect thrusters\n\t3.3 Field-emission electric propulsion\n\n\n\n\t4 Electromagnetic thrusters\n\t4.1 Pulsed inductive thrusters\n\t4.2 Magnetoplasmadynamic thruster\n\t4.3 Electrodeless plasma thrusters\n\t4.4 Helicon double layer thrusters\n\t4.5 VASIMR\n\t4.6 Microwave electrothermal thrusters\n\n\n\n\t5 Radioisotope thruster\n\t6 Comparisons\n\t7 Lifetime\n\t8 Propellants\n\t9 Energy efficiency\n\t10 Missions\n\t10.1 Demonstration vehicles\n\t10.1.1 SERT\n\n\n\n\t10.2 Operational missions\n\t10.2.1 In Earth orbit\n\t10.2.1.1 GOCE\n\n\n\n\t10.2.2 In deep space\n\t10.2.2.1 Deep Space 1\n\t10.2.2.2 Hayabusa\n\t10.2.2.3 Smart 1\n\t10.2.2.4 Dawn\n\n\n\n\t10.2.3 LISA Pathfinder\n\t10.2.4 BepiColombo\n\n\n\n\t10.3 Planned missions\n\t10.3.1 Lunar Orbital Platform-Gateway\n\n\n\n\t10.4 Proposed missions\n\t10.4.1 International Space Station\n\t10.4.2 MARS-CAT\n\t10.4.3 Interstellar probe\n\n\n\n\n\n\n\t11 Popular culture\n\t12 See also\n\t13 References\n\t13.1 Footnotes\n\t13.2 Bibliography\n\n\n\n\t14 External links\n\t14.1 Articles\n\n\n\n\n\n\n\n\nOrigins[edit]\n\n  \nSERT-1 spacecraft\n\n\n\nThe first person who wrote a paper introducing the idea publicly was Konstantin Tsiolkovsky in 1911.[7] However, the first private document to consider electric propulsion is Robert H. Goddard's handwritten notebook in an entry dated September 6, 1906.[8] The first experiments with ion thrusters were carried out by Goddard at Clark University from 1916–1917.[9] The technique was recommended for near-vacuum conditions at high altitude, but thrust was demonstrated with ionized air streams at atmospheric pressure. The idea appeared again in Hermann Oberth's \"Wege zur Raumschiffahrt\" (Ways to Spaceflight), published in 1923, where he explained his thoughts on the mass savings of electric propulsion, predicted its use in spacecraft propulsion and attitude control, and advocated electrostatic acceleration of charged gasses.[7]\n\nA working ion thruster was built by Harold R. Kaufman in 1959 at the NASA Glenn Research Center facilities. It was similar to a gridded electrostatic ion thruster and used mercury for propellant. Suborbital tests were conducted during the 1960s and in 1964, the engine was sent into a suborbital flight aboard the Space Electric Rocket Test 1 (SERT 1).[10][11] It successfully operated for the planned 31 minutes before falling to Earth.[12] This test was followed by an orbital test, SERT-2, in 1970.[13][14]\n\nAn alternate form of electric propulsion, the Hall effect thruster, was studied independently in the U.S. and the Soviet Union in the 1950s and 1960s. Hall effect thrusters operated on Soviet satellites from 1972 until the late 1990s, mainly used for satellite stabilization in North-South and in East-West directions. Some 100–200 engines completed missions on Soviet and Russian satellites.[15] Soviet thruster design was introduced to the West in 1992 after a team of electric propulsion specialists, under the support of the Ballistic Missile Defense Organization, visited Soviet laboratories.\n\n\nGeneral working principle[edit]\n\nIon thrusters use beams of ions (electrically charged atoms or molecules) to create thrust in accordance with momentum conservation. The method of accelerating the ions varies, but all designs take advantage of the charge/mass ratio of the ions. This ratio means that relatively small potential differences can create high exhaust velocities. This reduces the amount of reaction mass or propellant required, but increases the amount of specific power required compared to chemical rockets. Ion thrusters are therefore able to achieve high specific impulses. The drawback of the low thrust is low acceleration because the mass of the electric power unit directly correlates with the amount of power. This low thrust makes ion thrusters unsuited for launching spacecraft into orbit, but effective for in-space propulsion.\n\nIon thrusters are categorized as either electrostatic or electromagnetic. The main difference is the method for accelerating the ions.\n\n\n\tElectrostatic ion thrusters use the Coulomb force and accelerate the ions in the direction of the electric field.\n\tElectromagnetic ion thrusters use the Lorentz force to move the ions.\n\n\nPower supplies for ion thrusters are usually electric solar panels, but at sufficiently large distances from the Sun, nuclear power is used. In each case, the power supply mass is proportional to the peak power that can be supplied, and both provide, for this application, almost no limit to the energy.[citation needed]\n\nElectric thrusters tend to produce low thrust, which results in low acceleration. Defining \n  \n    \n      \n        1\n        g\n        =\n        9.81\n        \n        \n          m\n          \n            /\n          \n          \n            s\n            \n              2\n            \n          \n        \n      \n    \n    {\\displaystyle 1g=9.81\\;\\mathrm {m/s^{2}} }\n  \n, the standard gravitational acceleration of Earth, and noting that \n  \n    \n      \n        F\n        =\n        m\n        a\n        \n        ⟹\n        \n        a\n        =\n        F\n        \n          /\n        \n        m\n      \n    \n    {\\displaystyle F=ma\\implies a=F/m}\n  \n, this can be analyzed. A NSTAR thruster producing a thrust force of 92 mN[16] will accelerate a satellite with a mass of 1 Mg by 0.092 N / 1000 kg = 9.2×10−5 m/s2 (or 9.38×10−6 g). However, this acceleration can be sustained for months or years at a time, in contrast to the very short burns of chemical rockets.\n\n\n  \n    \n      \n        F\n        =\n        2\n        \n          \n            \n              η\n              P\n            \n            \n              g\n              \n                I\n                \n                  sp\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle F=2{\\frac {\\eta P}{gI_{\\text{sp}}}}}\n  \n\n\n\nWhere:\n\n\n\tF is the thrust force in N,\n\tη is the efficiency\n\tP is the electrical power used by the thruster in W, and\n\tIsp is the specific impulse in seconds.\n\n\nThe ion thruster is not the most promising type of electrically powered spacecraft propulsion, but it is the most successful in practice to date.[4] An ion drive would require two days to accelerate a car to highway speed in vacuum. The technical characteristics, especially thrust, are considerably inferior to the prototypes described in literature,[3][4] technical capabilities are limited by the space charge created by ions. This limits the thrust density (force per cross-sectional area of the engine).[4] Ion thrusters create small thrust levels (the thrust of Deep Space 1 is approximately equal to the weight of one sheet of paper[4]) compared to conventional chemical rockets, but achieve high specific impulse, or propellant mass efficiency, by accelerating the exhaust to high speed. The power imparted to the exhaust increases with the square of exhaust velocity while thrust increase is linear. Conversely, chemical rockets provide high thrust, but are limited in total impulse by the small amount of energy that can be stored chemically in the propellants.[17] Given the practical weight of suitable power sources, the acceleration from an ion thruster is frequently less than one thousandth of standard gravity. However, since they operate as electric (or electrostatic) motors, they convert a greater fraction of input power into kinetic exhaust power. Chemical rockets operate as heat engines, and Carnot's theorem limits the exhaust velocity.\n\n\nElectrostatic ion thrusters[edit]\n\nGridded electrostatic ion thrusters[edit]\n\nMain article: Gridded ion thruster\n\n  \nFigure 2: A diagram of how a gridded electrostatic ion engine (multipole magnetic cusp type) works\n\n\n\nGridded electrostatic ion thrusters commonly utilize xenon gas. The gaseous propellant begins with no charge; it is ionized by bombarding it with energetic electrons, as the energy transferred ejects valence electrons from the propellant gas's atoms. These electrons can be provided by a hot cathode filament and accelerated through the potential difference towards an anode. Alternatively, the electrons can be accelerated by an oscillating induced electric field created by an alternating electromagnet, which results in a self-sustaining discharge without a cathode (radio frequency ion thruster).\n\nThe positively charged ions are extracted by a system consisting of 2 or 3 multi-aperture grids. After entering the grid system near the plasma sheath, the ions are accelerated by the potential difference between the first grid and second grid (called the screen grid and the accelerator grid, respectively) to the final ion energy of (typically) 1–2 keV, which generates thrust.\n\nIon thrusters emit a beam of positively charged xenon ions. To keep the spacecraft from accumulating a charge, another cathode is placed near the engine to emit electrons into the ion beam, leaving the propellant electrically neutral. This prevents the beam of ions from being attracted (and returning) to the spacecraft, which would cancel the thrust.[12]\n\nGridded electrostatic ion thruster research (past/present):\n\n\n\tNASA Solar Technology Application Readiness (NSTAR), 2.3 kW, used on two successful missions\n\tNASA's Evolutionary Xenon Thruster (NEXT), 6.9 kW, flight qualification hardware built\n\tNuclear Electric Xenon Ion System (NEXIS)\n\tHigh Power Electric Propulsion (HiPEP), 25 kW, test example built and run briefly on the ground\n\tEADS Radio-Frequency Ion Thruster (RIT)\n\tDual-Stage 4-Grid (DS4G)[18][19]\n\n\nHall effect thrusters[edit]\n\nMain article: Hall effect thruster\n\n  \nSchematic of a Hall effect thruster\n\n\n\nHall effect thrusters accelerate ions by means of an electric potential between a cylindrical anode and a negatively charged plasma that forms the cathode. The bulk of the propellant (typically xenon) is introduced near the anode, where it ionizes and flows toward the cathode; ions accelerate towards and through it, picking up electrons as they leave to neutralize the beam and leave the thruster at high velocity.\n\nThe anode is at one end of a cylindrical tube. In the center is a spike that is wound to produce a radial magnetic field between it and the surrounding tube. The ions are largely unaffected by the magnetic field, since they are too massive. However, the electrons produced near the end of the spike to create the cathode are trapped by the magnetic field and held in place by their attraction to the anode. Some of the electrons spiral down towards the anode, circulating around the spike in a Hall current. When they reach the anode they impact the uncharged propellant and cause it to be ionized, before finally reaching the anode and closing the circuit.[20]\n\n\nField-emission electric propulsion[edit]\n\nMain article: Field-emission electric propulsion\n\nField-emission electric propulsion (FEEP) thrusters use either caesium or indium as the propellant. The design comprises a small propellant reservoir that stores the liquid metal, a narrow tube or a system of parallel plates that the liquid flows through and an accelerator (a ring or an elongated aperture in a metallic plate) about a millimeter past the tube end. Caesium and indium are used due to their high atomic weights, low ionization potentials and low melting points. Once the liquid metal reaches the end of the tube, an electric field applied between the emitter and the accelerator causes the liquid surface to deform into a series of protruding cusps, or Taylor cones. At a sufficiently high applied voltage, positive ions are extracted from the tips of the cones.[21][22][23] The electric field created by the emitter and the accelerator then accelerates the ions. An external source of electrons neutralizes the positively charged ion stream to prevent charging of the spacecraft.\n\n\nElectromagnetic thrusters[edit]\n\n\t\n\tThis article or section appears to contradict the article Electrically powered spacecraft propulsion. Please see the talk page for more information.  (April 2018)\n\n\n\nMain article: Plasma propulsion engine\n\nPulsed inductive thrusters[edit]\n\nMain article: Pulsed inductive thruster\n\nPulsed inductive thrusters (PIT) use pulses instead of continuous thrust and have the ability to run on power levels on the order of megawatts (MW). PITs consist of a large coil encircling a cone shaped tube that emits the propellant gas. Ammonia is the gas commonly used. For each pulse, a large charge builds up in a group of capacitors behind the coil and is then released. This creates a current that moves circularly in the direction of jθ. The current then creates a magnetic field in the outward radial direction (Br), which then creates a current in the gas that has just been released in the opposite direction of the original current. This opposite current ionizes the ammonia. The positively charged ions are accelerated away from the engine due to the electric field jθ crossing the magnetic field Br, due to the Lorentz Force.[24]\n\n\nMagnetoplasmadynamic thruster[edit]\n\nMain article: Magnetoplasmadynamic thruster\n\nMagnetoplasmadynamic (MPD) thrusters and lithium Lorentz force accelerator (LiLFA) thrusters use roughly the same idea. The LiLFA thruster builds on the MPD thruster. Hydrogen, argon, ammonia and nitrogen can be used as propellant. In a certain configuration, the ambient gas in low Earth orbit (LEO) can be used as a propellant. The gas enters the main chamber where it is ionized into plasma by the electric field between the anode and the cathode. This plasma then conducts electricity between the anode and the cathode, closing the circuit. This new current creates a magnetic field around the cathode, which crosses with the electric field, thereby accelerating the plasma due to the Lorentz force.\n\nThe LiLFA thruster uses the same general idea as the MPD thruster, with two main differences. First, the LiLFA uses lithium vapor, which can be stored as a solid. The other difference is that the single cathode is replaced by multiple, smaller cathode rods packed into a hollow cathode tube. MPD cathodes are easily corroded due to constant contact with the plasma. In the LiLFA thruster the lithium vapor is injected into the hollow cathode and is not ionized to its plasma form/corrode the cathode rods until it exits the tube. The plasma is then accelerated using the same Lorentz Force.[25][26][27]\n\nIn 2013, Russian company the Chemical Automatics Design Bureau successfully conducted a bench test of their MPD engine for long-distance space travel.[28]\n\n\nElectrodeless plasma thrusters[edit]\n\nMain article: Electrodeless plasma thruster\n\nElectrodeless plasma thrusters have two unique features: the removal of the anode and cathode electrodes and the ability to throttle the engine. The removal of the electrodes eliminates erosion, which limits lifetime on other ion engines. Neutral gas is first ionized by electromagnetic waves and then transferred to another chamber where it is accelerated by an oscillating electric and magnetic field, also known as the ponderomotive force. This separation of the ionization and acceleration stages allows throttling of propellant flow, which then changes the thrust magnitude and specific impulse values.[29]\n\n\nHelicon double layer thrusters[edit]\n\nMain article: Helicon double-layer thruster\n\nA helicon double layer thruster is a type of plasma thruster that ejects high velocity ionized gas to provide thrust. In this design, gas is injected into a tubular chamber (the source tube) with one open end. Radio frequency AC power (at 13.56 MHz in the prototype design) is coupled into a specially shaped antenna wrapped around the chamber. The electromagnetic wave emitted by the antenna causes the gas to break down and form a plasma. The antenna then excites a helicon wave in the plasma, which further heats it. The device has a roughly constant magnetic field in the source tube (supplied by solenoids in the prototype), but the magnetic field diverges and rapidly decreases in magnitude away from the source region and might be thought of as a kind of magnetic nozzle. In operation, a sharp boundary separates the high density plasma inside the source region and the low density plasma in the exhaust, which is associated with a sharp change in electrical potential. Plasma properties change rapidly across this boundary, which is known as a current-free electric double layer. The electrical potential is much higher inside the source region than in the exhaust and this serves both to confine most of the electrons and to accelerate the ions away from the source region. Enough electrons escape the source region to ensure that the plasma in the exhaust is neutral overall.\n\n\nVASIMR[edit]\n\nMain article: Variable Specific Impulse Magnetoplasma Rocket\n\nVASIMR, or Variable Specific Impulse Magnetoplasma Rocket, works by using radio waves to ionize a propellant into a plasma and then a magnetic field to accelerate the plasma out of the back of the rocket engine to generate thrust. The VASIMR is currently being developed by the private company Ad Astra Rocket Company, headquartered in Houston, TX with of help from Canada-based Nautel, producing the 200 kW RF generators for ionizing propellant. Some of the components and \"plasma shoots\" experiments are tested in a laboratory settled in Liberia, Costa Rica. This project is led by former NASA astronaut Dr. Franklin Chang-Díaz (CRC-USA). A 200 kW VASIMR test engine was in discussion to be fitted in the exterior of the International Space Station, as part of the plan to test the VASIMR in space – however plans for this test onboard ISS were canceled in 2015 by NASA, with a free flying VASIMR test being discussed by Ad Astra instead.[30] An envisioned 200 megawatt engine could reduce the duration of flight from Earth to Jupiter or Saturn from six years to fourteen months, and Mars from 6 months to 39 days.[31]\n\n\nMicrowave electrothermal thrusters[edit]\n\nMicrowave electrothermal thruster\n\n\nThruster components\n\n\nDischarge chamber\n\n\n\n\n\nUnder a research grant from the NASA Lewis Research Center during the 1980s and 1990s, Martin C. Hawley and Jes Asmussen led a team of engineers in developing a Microwave Electrothermal Thruster (MET).[32]\n\nIn the discharge chamber, microwave (MW) energy flows into the center containing a high level of ions (I), causing neutral species in the gaseous propellant to ionize. Excited species flow out (FES) through the low ion region (II) to a neutral region (III) where the ions complete their recombination, replaced with the flow of neutral species (FNS) towards the center.  Meanwhile, energy is lost to the chamber walls through heat conduction and convection (HCC), along with radiation (Rad). The remaining energy absorbed into the gaseous propellant is converted into thrust.\n\n\nRadioisotope thruster[edit]\n\nA theoretical propulsion system has been proposed, based on alpha particles (He2+\n or 4\n2He2+\n indicating a helium ion with a +2 charge) emitted from a radioisotope uni-directionally through a hole in its chamber. A neutralising electron gun would produce a tiny amount thrust with high specific impulse in the order of millions of seconds due to the high relativistic speed of alpha particles.[33]\n\n\nComparisons[edit]\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Ion thruster\" – news · newspapers · books · scholar · JSTOR  (April 2009) (Learn how and when to remove this template message)\n\n\n\nTest data of some ion thrusters\n\tEngine\n\tPropellant\n\tInput \npower (kW)\n\tSpecific \nimpulse (s)\n\tThrust \n(mN)\n\tThruster \nmass (kg)\n\n\tNSTAR\n\tXenon\n\t2.3\n\t3300–1700[34]\n\t92 max.[16]\n\t\n\n\tPPS-1350 Hall effect\tXenon\t1.5\t1660\t90\t5.3\n\n\tNEXT[16]\n\tXenon\n\t6.9[35]\n\t4190[35][36][37]\n\t236 max.[16][37]\n\t\n\n\tNEXIS[38]\n\tXenon\n\t20.5\n\t\n\t\n\t\n\n\tRIT 22[39]\n\tXenon\n\t5\n\t\n\t\n\t\n\n\tBHT8000[40]\n\tXenon\n\t8\n\t2210\n\t449\n\t25\n\n\tHall effect\n\tXenon\n\t75[citation needed]\n\t\n\t\n\t\n\n\tFEEP\n\tLiquid caesium\n\t6×10−5 – 0.06\n\t6000–10000[22]\n\t0.001–1[22]\n\t\n\n\n\nExperimental thrusters (no mission to date)\n\tEngine\n\tPropellant\n\tInput \npower (kW)\n\tSpecific \nimpulse (s)\n\tThrust \n(mN)\n\tThruster \nmass (kg)\n\n\tHall effect\n\tBismuth\n\t1.9[41]\n\t1520 (anode)[41]\n\t143 (discharge)[41]\n\t\n\n\tHall effect\n\tBismuth\n\t25[citation needed]\n\t\n\t\n\t\n\n\tHall effect\n\tBismuth\n\t140[citation needed]\n\t\n\t\n\t\n\n\tHall effect\n\tIodine\n\t0.2[42]\n\t1510 (anode)[42]\n\t12.1 (discharge)[42]\n\t\n\n\tHall effect\n\tIodine\n\t7[43]\n\t1950[43]\n\t413[43]\n\t\n\n\tHiPEP\n\tXenon\n\t20–50[44]\n\t6000–9000[44]\n\t460–670[44]\n\t\n\n\tMPDT\n\tHydrogen\n\t1500[45]\n\t4900[45]\n\t26300[citation needed]\n\t\n\n\tMPDT\n\tHydrogen\n\t3750[45]\n\t3500[45]\n\t88500[citation needed]\n\t\n\n\tMPDT\n\tHydrogen\n\t7500[citation needed]\n\t6000[citation needed]\n\t60000[citation needed]\n\t\n\n\tLiLFA\n\tLithium vapor\n\t500\n\t4077[citation needed]\n\t12000[citation needed]\n\t\n\n\tFEEP\n\tLiquid caesium\n\t6×10−5 – 0.06\n\t6000–10000[22]\n\t0.001–1[22]\n\t\n\n\tVASIMR\n\tArgon\n\t200\n\t3000–12000\n\tApprox. 5000[46]\n\t620[47]\n\n\tCAT[48]\n\tXenon, iodine, water[49]\n\t0.01\n\t690[50][51]\n\t1.1–2\n\t<1 (73 mN/kW)[49]\n\n\tDS4G\n\tXenon\n\t250\n\t19300\n\t2500 max.\n\t5\n\n\tKLIMT\n\tKrypton\n\t0.5[52]\n\t\n\t\n\t4[52]\n\n\n\nLifetime[edit]\n\nIon thrusters' low thrust requires continuous operation for a long time to achieve the necessary change in velocity (delta-v) for a particular mission. Ion thrusters are designed to provide continuous operation for intervals of weeks to years.\n\nThe lifetime of electrostatic ion thrusters is limited by several processes. In electrostatic gridded designs, charge-exchange ions produced by the beam ions with the neutral gas flow can be accelerated towards the negatively biased accelerator grid and cause grid erosion. End-of-life is reached when either the grid structure fails or the holes in the grid become large enough that ion extraction is substantially affected; e.g., by the occurrence of electron backstreaming. Grid erosion cannot be avoided and is the major lifetime-limiting factor. Thorough grid design and material selection enable lifetimes of 20,000 hours or more.\n\nA test of the NASA Solar Technology Application Readiness (NSTAR) electrostatic ion thruster resulted in 30,472 hours (roughly 3.5 years) of continuous thrust at maximum power. Post-test examination indicated the engine was not approaching failure.[53][3][4]\n\nThe NASA Evolutionary Xenon Thruster (NEXT) project operated continuously for more than 48,000 hours.[54] The test was conducted in a high vacuum test chamber. Over the course of the 5 1/2 + year test, the engine consumed approximately 870 kilograms of xenon propellant. The total impulse generated would require over 10,000 kilograms of conventional rocket propellant for a similar application.\n\nThe Advanced Electric Propulsion System (AEPS) is expected to accumulate about 5,000 hr and the design aims to achieve a flight model that offers a half-life of at least 23,000 hours[55] and a full life of about 50,000 hours.[56]\n\nHall thrusters suffer from strong erosion of the ceramic discharge chamber by impact of energetic ions: a test reported in 2010[57] showed erosion of around 1 mm per hundred hours of operation, though this is inconsistent with observed on-orbit lifetimes of a few thousand hours.\n\n\nPropellants[edit]\n\nIonization energy represents a large percentage of the energy needed to run ion drives. The ideal propellant is thus easy to ionize and has a high mass/ionization energy ratio. In addition, the propellant should not erode the thruster to any great degree to permit long life; and should not contaminate the vehicle.[58]\n\nMany current designs use xenon gas, as it is easy to ionize, has a reasonably high atomic number, is inert and causes low erosion. However, xenon is globally in short supply and expensive.\n\nOlder designs used mercury, but this is toxic and expensive, tended to contaminate the vehicle with the metal and was difficult to feed accurately. A modern commercial prototype may be using mercury successfully.[59]\n\nOther propellants, such as bismuth and iodine, show promise, particularly for gridless designs, such as Hall effect thrusters.[41][42][43]\n\nVASIMR design (and other plasma-based engines) are theoretically able to use practically any material for propellant. However, in current tests the most practical propellant is argon, which is relatively abundant and inexpensive.\n\nThe CubeSat Ambipolar Thruster (CAT) used on the Mars Array of Ionospheric Research Satellites Using the CubeSat Ambipolar Thruster (MARS-CAT) mission proposes to use solid iodine as the propellant to minimize storage volume.[50][51]\n\nKrypton is used for satellites of the Starlink constellation. Fully deployed it is planned to have 12,000 satellites and krypton is cheaper than xenon.[60]\n\n\nEnergy efficiency[edit]\n\n  \nPlot of      instantaneous propulsive efficiency and      overall efficiency for a vehicle accelerating from rest as percentages of the engine efficiency. Note that peak vehicle efficiency occurs at about 1.6 times exhaust velocity.\n\n\n\nIon thruster efficiency is the kinetic energy of the exhaust jet emitted per second divided by the electrical power into the device.\n\nOverall system energy efficiency is determined by the propulsive efficiency, which depends on vehicle speed and exhaust speed. Some thrusters can vary exhaust speed in operation, but all can be designed with different exhaust speeds. At the lower end of specific impulse, Isp, the overall efficiency drops, because ionization takes up a larger percentage energy and at the high end propulsive efficiency is reduced.\n\nOptimal efficiencies and exhaust velocities for any given mission can be calculated to give minimum overall cost.\n\n\nMissions[edit]\n\nIon thrusters have many in-space propulsion applications. The best applications make use of the long mission interval when significant thrust is not needed. Examples of this include orbit transfers, attitude adjustments, drag compensation for low Earth orbits, fine adjustments for scientific missions and cargo transport between propellant depots, e.g., for chemical fuels. Ion thrusters can also be used for interplanetary and deep-space missions where acceleration rates are not crucial. Continuous thrust over a long interval can reach high velocities while consuming far less fuel than traditional chemical rockets.\n\nAmong electric thrusters, ion thrusters have received the most serious commercial and academic consideration. Ion thrusters are seen as the best solution for these missions, as they require high change in velocity but do not require rapid acceleration.\n\n\nDemonstration vehicles[edit]\n\nSERT[edit]\n\nIon propulsion systems were first demonstrated in space by the NASA Lewis (now Glenn Research Center) missions \"Space Electric Rocket Test\" (SERT) I and II.[61] SERT-1 was launched July 20, 1964, and successfully proved that the technology operated as predicted in space. These were electrostatic ion thrusters using mercury and cesium as the reaction mass. SERT-II, launched on February 3, 1970,[62][63] verified the operation of two mercury ion engines for thousands of running hours.[64]\n\n\nOperational missions[edit]\n\nIon thrusters are routinely used for station-keeping on commercial and military communication satellites in geosynchronous orbit. The Soviet Union pioneered this field, using Stationary Plasma Thruster (SPT) thrusters on satellites starting in the early 1970s.\n\nTwo geostationary satellites (ESA's Artemis in 2001–03[65] and the US military's AEHF-1 in 2010–12[66]) used the ion thruster to change orbit after the chemical-propellant engine failed. Boeing[67] began using ion thrusters for station-keeping in 1997 and planned in 2013–14 to offer a variant on their 702 platform, with no chemical engine and ion thrusters for orbit raising; this permits a significantly lower launch mass for a given satellite capability. AEHF-2 used a chemical engine to raise perigee to 10,150 miles and proceeded to geosynchronous orbit using electric propulsion.[68]\n\n\nIn Earth orbit[edit]\n\nGOCE[edit]\n\nESA's Gravity Field and Steady-State Ocean Circulation Explorer (GOCE) was launched on March 16, 2009. It used ion propulsion throughout its twenty-month mission to combat the air-drag it experienced in its low orbit (altitude of 255 kilometres) before intentionally deorbiting on November 11, 2013.\n\n\nIn deep space[edit]\n\nDeep Space 1[edit]\n\nNASA developed the NSTAR ion engine for use in interplanetary science missions beginning in the late-1990s. It was space-tested in the highly successful space probe Deep Space 1, launched in 1998. This was the first use of electric propulsion as the interplanetary propulsion system on a science mission.[61] Based on the NASA design criteria, Hughes Research Labs, developed the Xenon Ion Propulsion System (XIPS) for performing station keeping on geosynchronous satellites.[citation needed] Hughes (EDD) manufactured the NSTAR thruster used on the spacecraft.\n\n\nHayabusa[edit]\n\nThe Japanese space agency's Hayabusa launched in 2003 and successfully rendezvoused with the asteroid 25143 Itokawa and remained in close proximity for months to collect samples and information. It was powered by four xenon ion engines. Its xenon ions were generated by microwave electron cyclotron resonance and an erosion-resistant carbon/carbon-composite material for its acceleration grid.[69] Although the ion engines on Hayabusa had technical difficulties, in-flight reconfiguration allowed one of the four engines to be repaired and allowed the mission to successfully return to Earth.[70]\n\n\nSmart 1[edit]\n\nThe European Space Agency's satellite SMART-1 launched in 2003 using a Snecma PPS-1350-G Hall thruster to get from GTO to lunar orbit. This satellite completed its mission on September 3, 2006, in a controlled collision on the Moon's surface, after a trajectory deviation so scientists could see the 3 meter crater the impact created on the visible side of the Moon.\n\n\nDawn[edit]\n\nDawn launched on September 27, 2007, to explore the asteroid Vesta and the dwarf planet Ceres. It used three Deep Space 1 heritage xenon ion thrusters (firing one at a time). Dawn's ion drive is capable of accelerating from 0 to 60 mph (97 km/h) in 4 days of continuous firing.[71] The mission ended on November 1, 2018, when the spacecraft ran out of hydrazine chemical propellant for its attitude thrusters.[72]\n\n\nLISA Pathfinder[edit]\n\nLISA Pathfinder is an ESA spacecraft launched in 2015. It does not use ion thrusters as its primary propulsion system, but uses both colloid thrusters and FEEP for precise attitude control – the low thrusts of these propulsion devices make it possible to move the spacecraft incremental distances accurately. It is a test for the possible LISA mission. The mission ended on December 30, 2017.\n\n\nBepiColombo[edit]\n\nESA's BepiColombo mission was launched to Mercury on October 20, 2018.[73] It uses ion thrusters in combination with swing-bys to get to Mercury, where a chemical rocket will complete orbit insertion.\n\n\nPlanned missions[edit]\n\nLunar Orbital Platform-Gateway[edit]\n\nThe Lunar Orbital Platform-Gateway is proposed to have a module called 'Power and Propulsion Element' (PPE) that will be used to generate electricity for the space station and its ion thruster. It is targeting launch on a commercial vehicle in 2022.[74][75] It will probably[55] use the 50 kW Advanced Electric Propulsion System (AEPS) under development at NASA Glenn Research Center and Aerojet Rocketdyne.\n\n\nProposed missions[edit]\n\nInternational Space Station[edit]\n\nAs of March 2011[update], a future launch of an Ad Astra VF-200 200 kW VASIMR electromagnetic thruster was under consideration for testing on the International Space Station.[76][77] However, in 2015 NASA ended plans for flying the VF-200 to the ISS. A NASA spokesperson stated that the ISS \"was not an ideal demonstration platform for the desired performance level of the engines\". Ad Astra stated that tests of a VASIMR thruster on the ISS would remain an option after a future in-space demonstration.[30]\n\nThe VF-200 would have been a flight version of the VX-200.[78][79] Since the available power from the ISS is less than 200 kW, the ISS VASIMR would have included a trickle-charged battery system allowing for 15 min pulses of thrust. The ISS orbits at a relatively low altitude and experiences fairly high levels of atmospheric drag, requiring periodic altitude boosts – a high efficiency engine (high specific impulse) for station-keeping would be valuable, theoretically VASIMR reboosting could cut fuel cost from the current $210 million annually to one-twentieth.[76] VASIMR could in theory use as little as 300 kg of argon gas for ISS station-keeping instead of 7.5 tonnes of chemical fuel – the high exhaust velocity (high specific impulse) would achieve the same acceleration with a smaller amount of propellant, compared to chemical propulsion with its lower exhaust velocity needing more fuel.[80] Hydrogen is generated by the ISS as a by-product and is vented into space.\n\nNASA previously worked on a 50 kW ion hall thruster for ISS, but work was stopped in 2005.[80]\n\n\nMARS-CAT[edit]\n\nThe MARS-CAT (Mars Array of ionospheric Research Satellites using the CubeSat Ambipolar Thruster) mission is a two 6U CubeSat concept mission to study Mars' ionosphere. The mission would investigate its plasma and magnetic structure, including transient plasma structures, magnetic field structure, magnetic activity and correlation with solar wind drivers.[50] The CAT thruster is now called the RF thruster and manufactured by Phase Four.[51]\n\n\nInterstellar probe[edit]\n\nGeoffrey A. Landis proposed to use a space laser source and ion thruster to propel an interstellar probe.[81][82]\n\n\nPopular culture[edit]\n\nThe idea of an ion engine first appeared in Donald W Horner's By Aeroplane to the Sun: Being the Adventures of a Daring Aviator and his Friends (1910).[83]\n\nIon propulsion is the main thrust source of the spaceship Kosmokrator in the Eastern German/Polish science fiction movie Der Schweigende Stern (1960).[84] Minute 28:10.\n\nIn the 1968 episode of Star Trek, \"Spock's Brain\", Scotty is repeatedly impressed by a civilization's use of ion power.[85][86]\n\nStar Wars films and literature refer to twin ion engines (TIE) starfighters.\n\nIon thrusters appear as the primary form of propulsion in vacuum for the spacecraft in the game Space Engineers.\n\nIon thrusters are referenced as a method of space propulsion in The Martian.\n\nIon drive is the propulsion system of the Starliner - \"Avalon\" in the movie \"Passengers\" -2016\n\n\nSee also[edit]\n\n\n\tenergy portal\n\n\n\n\n\tAdvanced Electric Propulsion System\n\tColloid thruster\n\tComparison of orbital rocket engines\n\tElectrically powered spacecraft propulsion\n\tElectrostatic fluid accelerator\n\tList of spacecraft with electric propulsion\n\tNano-particle field extraction thruster\n\tNuclear electric rocket\n\tNuclear pulse propulsion\n\tPlasma actuator\n\tPlasma propulsion engine\n\tSpacecraft propulsion\n\n\n\n\nReferences[edit]\n\nFootnotes[edit]\n\n\n\t^ Jahn, Robert G. (1968). Physics of Electric Propulsion (1st ed.). McGraw Hill Book Company. ISBN 978-0070322448. Reprint: Jahn, Robert G. (2006). Physics of Electric Propulsion. Dover Publications. ISBN 978-0486450407.\n\n\n\t^ Jahn, Robert G.; Choueiri, Edgar Y. (2003). \"Electric Propulsion\" (PDF). Encyclopedia of Physical Science and Technology. 5 (3rd ed.). Academic Press. pp. 125–141. ISBN 978-0122274107.\n\n\n\t^ a b c d Choueiri, Edgar Y. (2009). New dawn of electric rocket. The Ion Drive\n\n\t^ a b c d e f g Choueiri, Edgar Y (2009). \"New dawn of electric rocket\". Scientific American. 300 (2): 58–65. Bibcode:2009SciAm.300b..58C. doi:10.1038/scientificamerican0209-58.\n\n\n\t^ Jones, Brad and Bergan, Brad (2017) NASA’s New Ion Thruster Breaks Records, Could Take Humans to Mars\n\n\t^ \"The Human Exploration of Mars\". Retrieved 3 May 2019.\n\n\n\t^ a b Choueiri, E. Y. \"A Critical History of Electric Propulsion: The First 50 Years (1906–1956)\". Retrieved 2016-10-18.\n\n\n\t^ Mark Wright, April 6, 1999, science.nasa.gov, Ion Propulsion 50 years in the making Archived 2010-03-27 at the Wayback Machine\n\n\t^ \"Robert H. Goddard: American Rocket Pioneer\". Smithsonian Scrapbook. Smithsonian Institution Archives. Retrieved March 28, 2012.\n\n\n\t^ \"Contributions to Deep Space 1\". NASA.\n\n\n\t^ Ronald J. Cybulski, Daniel M. Shellhammer, Robert R. LoveII, Edward J. Domino, and Joseph T. Kotnik, RESULTS FROM SERT I ION ROCKET FLIGHT TEST, NASA Technical Note D2718 (1965).\n\n\t^ a b \"Innovative Engines - Glenn Ion Propulsion Research Tames the Challenges of 21st Century Space Travel\". Archived from the original on 2007-09-15. Retrieved 2007-11-19.\n\n\n\t^ NASA Glenn, \"SPACE ELECTRIC ROCKET TEST II (SERT II) (Accessed July 1, 2010)\n\n\t^ SERT Archived 2010-10-25 at the Wayback Machine page at Astronautix (Accessed July 1, 2010)\n\n\t^ \"Native Electric Propulsion Engines Today\" (in Russian). Novosti Kosmonavtiki. 1999. Archived from the original on 6 June 2011.\n\n\n\t^ a b c d Shiga, David (2007-09-28). \"Next-generation ion engine sets new thrust record\". NewScientist. Retrieved 2011-02-02.\n\n\n\t^ Electric Spacecraft Propulsion, Electric versus Chemical Propulsion, ESA Science & Technology\n\n\t^ \"ESA and ANU make space propulsion breakthrough\" (Press release). ESA. 2006-01-11. Retrieved 2007-06-29.\n\n\n\t^ ANU Space Plasma, Power & Propulsion Group (SP3) (2006-12-06). \"ANU and ESA make space propulsion breakthrough\". DS4G Web Story. The Australian National University. Archived from the original on 2007-06-27. Retrieved 2007-06-30.\n\n\n\t^ Oleson, S. R.; Sankovic, J. M. \"Advanced Hall Electric Propulsion for Future In-Space Transportation\" (PDF). Archived from the original (PDF) on 2004-01-22. Retrieved 2007-11-21.\n\n\n\t^ \"FEEP - Field-Emission Electric Propulsion\". Archived from the original on 2012-01-18. Retrieved 2012-04-27.\n\n\n\t^ a b c d e Marcuccio, S.;  et al. \"Experimental Performance of Field Emission Microthrusters\" (PDF). Archived from the original (PDF) on 2013-05-20. Retrieved 2012-04-27.\n\n\n\t^ Marrese-Reading, Colleen; Polk, Jay; Mueller, Juergen; Owens, Al. \"In-FEEP Thruster Ion Beam Neutralization with Thermionic and Field Emission Cathodes\" (PDF). Archived from the original (PDF) on 2006-10-13. Retrieved 2007-11-21. liquid state and wicked up the needle shank to the tip where high electric fields deform the liquid and extract ions and accelerate them up to 130 km/s through 10 kV.\n\n\n\t^ Mikellides, Pavlos G. \"Pulsed Inductive Thruster (PIT): Modeling and Validation Using the MACH2 Code\" (PDF). Archived from the original (PDF) on 2006-10-10. Retrieved 2007-11-21.\n\n\n\t^ Sankaran, K.; Cassady, L.; Kodys, A.D.; Choueiri, E.Y. \"A Survey of Propulsion Options for Cargo and Piloted Missions to Mars\". Retrieved 2016-10-18.\n\n\n\t^ LaPointe, Michael R.; Mikellides, Pavlos G. \"High Power MPD Thruster Development at the NASA Glenn Research Center\" (PDF). Archived from the original (PDF) on October 11, 2006. Retrieved 2007-11-21.\n\n\n\t^ Conley, Buford Ray (May 22, 1999). \"Utilization of Ambient Gas as a Propellant for Low Earth Orbit Electric Propulsion\" (PDF). Archived from the original (PDF) on June 29, 2011.\n\n\n\t^ \"\"В Воронеже создали двигатель для Марса\" в блоге \"Перспективные разработки, НИОКРы, изобретения\" - Сделано у нас\". Сделано у нас.\n\n\n\t^ Emsellem, Gregory D. \"Development of a High Power Electrodeless Thruster\" (PDF). Retrieved 2007-11-21.\n\n\n\t^ a b NASA nixes Ad Astra rocket test on the space station. SEN News, Irene Klotz. 17 March 2015.\n\n\t^ Zyga, Lisa (2009). Plasma Rocket Could Travel to Mars in 39 Days, http://phys.org/news174031552.html Physorg\n\n\t^ \"Less Fuel, More Thrust: New Engines are Being Designed for Deep Space\". The Arugus-Press. 128 (48). Owosso, Michigan. 26 February 1982. p. 10.\n\n\n\t^ \"Revisiting alpha decay-based near-light-speed particle propulsion\". doi:10.1016/j.apradiso.2016.04.005. Cite journal requires |journal= (help)\n\n\n\t^ \"Ion Propulsion\".\n\n\n\t^ a b Szondy, David. \"NASA's NEXT ion thruster runs five and a half years nonstop to set new record\". Retrieved June 26, 2013.\n\n\n\t^ \n Schmidt, George R.; Patterson, Michael J.; Benson, Scott W. \"The NASA Evolutionary Xenon Thruster (NEXT): the next step for US deep space propulsion\" (PDF).\n\n\n\t^ a b \n Herman, Daniel A. (May 3–7, 2010), \"NASA's Evolutionary Xenon Thruster (NEXT) Project Qualifi cation Propellant Throughput Milestone: Performance, Erosion, and Thruster Service Life Prediction After 450 kg\" (PDF), 57th Joint Army-Navy-NASA-Air Force (JANNAF) Propulsion Meeting, Colorado Springs, Colorado, USA: NASA - Glenn Research Center, retrieved 2014-03-08\n\n\n\t^ An overview of the Nuclear Electric Xenon Ion System (NEXIS) program (2006), 2006-02-10 (Polk, Jay E., Goebel, Don, Brophy, John R., Beatty, John, Monheiser, J., Giles, D.), Scientific Commons\n\n\t^ Astrium Radiofrequency Ion Thruster, Model RIT-22., EADS Astrium  Archived June 13, 2009, at the Wayback Machine\n\n\t^ BHT-8000 Busek Hall Effect Thruster\n\n\t^ a b c d Szabo, J., Robin, M., Paintal, Pote, B., S., Hruby, V., \"High Density Hall Thruster Propellant Investigations,\" 48th AIAA/ASME/SAE/ASEE Joint Propulsion Conference and Exhibit, AIAA Paper 2012-3853, July 2012.\n\n\t^ a b c d \n Szabo, J., Pote, B., Paintal, S., Robin, M., Hillier, A., Branam, R., Huffman, R. (2012). \"Performance Evaluation of an Iodine Vapor Hall Thruster\". Journal of Propulsion and Power. Journal of Propulsion and Power, 28, 4, 2012. 28 (4): 848–857. doi:10.2514/1.B34291.CS1 maint: multiple names: authors list (link)\n\n\n\t^ a b c d \n Szabo, J., Robin, M., Paintal, S., Pote, B., Hruby, V., Freeman, C. (2015). \"Iodine Plasma Propulsion Test Results at 1-10 kW\". IEEE Transactions on Plasma Science. IEEE Transactions on Plasma Science, Special Issue – Plasma Propulsion, Vol. 43, No. 1, 2015. 43: 141–148. doi:10.1109/TPS.2014.2367417.CS1 maint: multiple names: authors list (link)\n\n\n\t^ a b c \n \"HIGH POWER ELECTRIC PROPULSION PROGRAM (HiPEP)\". NASA. 2008-12-22.\n\n\n\t^ a b c d James S. Sovey and Maris A. Mantenieks. \"Performance and Lifetime Assessment of MPD Arc Thruster Technology\" (PDF). p. 11. Retrieved 2019-05-09.\n\n\n\t^ \nVASIMR VX-200 Performance and Near-term SEP Capability for Unmanned Mars Flight, Tim Glover, Future in Space Operations (FISO) Colloquium, 2011-01-19, accessed 2011-01-31.\n\n\t^ VASIMR® Spaceflight Engine System Mass Study and Scaling with Power IEPC-2013-149 \n\n\t^ \n Mike Wall (July 8, 2013). \"New Space Engine Could Turn Tiny CubeSats into Interplanetary Explorers\". Space.com. Purch. Retrieved June 25, 2015.\n\n\n\t^ a b \n \"PEPL Thrusters: CubeSat Ambipolar Thruster\". pepl.engin.umich.edu. University of Michigan. Retrieved June 25, 2015.\n\n\n\t^ a b c \n \"MARS-CAT Mission Implementation\". www.marscat.space. University of Houston College of Natural Sciences and Mathematics. Retrieved June 25, 2015.\n\n\n\t^ a b c \n \"Phase Four: Game-Changing Spacecraft propulsion\". P.4ASEFOUR. Retrieved June 5, 2017.\n\n\n\t^ a b \nKrypton Hall effect thruster for space propulsion Archived 2014-01-29 at Archive.today, IFPiLM, accessed 2014-01-29.\n\n\t^ \"Destructive Physical Analysis of Hollow Cathodes from the Deep Space 1 Flight Spare Ion Engine 30,000 Hr Life Test\" (PDF). Archived from the original (PDF) on 2009-02-27. Retrieved 2007-11-21.\n\n\n\t^ \"NASA Thruster Achieves World-Record 5+ Years of Operation\". Retrieved 2012-06-27.\n\n\n\t^ a b Overview of the Development and Mission Application of the Advanced Electric Propulsion System (AEPS). (PDF). Daniel A. Herman, Todd A. Tofil, Walter Santiago, Hani Kamhawi, James E. Polk, John S. Snyder, Richard R. Hofer, Frank Q. Picha, Jerry Jackson and May Allen. NASA; NASA/TM—2018-219761. 35th International Electric Propulsion Conference. Atlanta, Georgia, October 8–12, 2017. Accessed: 27 July 2018.\n\n\t^ Aerojet Rocketdyne Signs Contract to Develop Advanced Electric Propulsion System for NASA. Aerojet Rocketdyne. Press release, 28 April 2016. Accessed: 27 July 2018.\n\n\t^ \"A closer look at a stationary plasma thruster\" (PDF).\n\n\n\t^ Rocket Propulsion Elements — Sutton & Biblarz 7th edition\n\n\t^ Elgin, Ben (19 November 2018). \"This Silicon Valley Space Startup Could Lace the Atmosphere With Mercury\". Bloomberg News. Retrieved 19 November 2018.\n\n\n\t^ \"SpaceX reveals more Starlink info after launch of first 60 satellites\". 24 May 2019. Retrieved 25 May 2019.\n\n\n\t^ a b Sovey, J. S.; Rawlin, V. K.; Patterson, M. J. (May–June 2001). \"Ion Propulsion Development Projects in U. S.: Space Electric Rocket Test 1 to Deep Space 1\". Journal of Propulsion and Power. 17 (3): 517–526. doi:10.2514/2.5806. hdl:2060/20010093217.\n\n\n\t^ SPACE ELECTRIC ROCKET TEST II (SERT II), NASA Glenn Research Center. Accessed July 1, 2010.\n\n\t^ SERT page Archived 2010-10-25 at the Wayback Machine at Astronautix (Accessed July 1, 2010)\n\n\t^ Space Electric Rocket Test at NASA.gov\n\n\t^ ESA. \"Artemis team receives award for space rescue\". Retrieved 2006-11-16.\n\n\n\t^ \"Rescue in Space\".\n\n\n\t^ Spaceflight Now. \"Electric propulsion could launch new commercial trend\".\n\n\n\t^ \"AEHF 2 communications satellite keeps on climbing\".\n\n\n\t^ ISAS. \"小惑星探査機はやぶさ搭載イオンエンジン (Ion Engines used on Asteroid Probe Hayabusa)\" (in Japanese). Archived from the original on 2006-08-19. Retrieved 2006-10-13.\n\n\n\t^ Tabuchi, Hiroko (1 July 2010). \"Faulty Space Probe Seen as Test of Japan's Expertise\". The New York Times.\n\n\n\t^ The Prius of Space, September 13, 2007, NASA Jet Propulsion Laboratory\n\n\t^ \"NASA's Dawn Mission to Asteroid Belt Comes to End\". NASA. 1 November 2018.\n\n\n\t^ \"BepiColombo's beginning ends\". ESA. 22 October 2018. Retrieved 1 November 2018.\n\n\n\t^ \"NASA FY 2019 Budget Overview\" (PDF).\n Quote: \"Supports launch of the Power and PropulsionElement on a commercial launch vehicle as the first component of the LOP - Gateway, (page 14)\n\n\t^ NASA considers acquiring more than one gateway propulsion module. Joe Faust, Space News. 30 March 2018.\n\n\t^ a b \"Executive summary\" (PDF). Ad Astra Rocket Company. January 24, 2010. Archived from the original (PDF) on March 31, 2010. Retrieved 2010-02-27.\n\n\n\t^ Klotz, Irene (7 August 2008). \"Plasma Rocket May Be Tested at Space Station\". Discovery News. Retrieved 2010-02-27.\n\n\n\t^ Whittington, Mark (March 10, 2011). \"NASA to Test VF-200 VASIMR Plasma Rocket at the ISS\". Yahoo. Retrieved 2012-01-27.\n\n\n\t^ Mick, Jason (August 11, 2008). \"Commercially Developed Plasma Engine Soon to be Tested in Space\". DailyTech. Retrieved 2010-02-27.\n\n\n\t^ a b [1]\n\n\t^ \"- Google Scholar\".\n\n\n\t^ Geoffrey A. Landis. Laser-powered Interstellar Probe Archived 2012-07-22 at the Wayback Machine on the Geoffrey A. Landis: Science. papers available on the web\n\n\t^ \"Themes : Ion Drive : SFE : Science Fiction Encyclopedia\".\n\n\n\t^ Kruschel, Karsten (2007). Leim für die Venus. Der Science-Fiction-Film in der DDR. Heyne Verlag. pp. 803–888. ISBN 978-3-453-52261-9.\n\n\n\t^ http://www.chakoteya.net/StarTrek/61.htm\n\n\t^ https://www.tor.com/2016/06/07/star-trek-the-original-series-rewatch-spocks-brain/\n\n\n\n\nBibliography[edit]\n\n\n\tLerner, Eric J. (October 2000). \"Plasma Propulsion in Space\" (PDF). The Industrial Physicist. 6 (5): 16–19. Archived from the original (PDF) on 2007-03-16. Retrieved 2007-06-29.\n\n\tElectroHydroDynamic Thrusters (EHDT), RMCybernetics.\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Ion propulsion.\n\n\n\tNASA Jet Propulsion Laboratory\n\tColorado State University Electric Propulsion & Plasma Engineering (CEPPE) Laboratory\n\tGeoffrey A. Landis: Laser-powered Interstellar Probe\n\tChoueiri, Edgar Y. (2009). New dawn of electric rocket. The Ion Drive\n\tThe revolutionary ion engine that took spacecraft to Ceres\n\tElectric Propulsion Sub-Systems (PDF)\n\tStationary plasma thrusters (PDF)\n\n\nArticles[edit]\n\n\t\"NASA Trumps Star Trek: Ion Drive Live!\", The Daily Galaxy April 13, 2009.\n\t\"The Ultimate Space Gadget: NASA's Ion Drive Live!\", The Daily Galaxy, July 7, 2009.\n\tAn early experimental Ion engine is on display at the Aerospace Discovery at the Florida Air Museum.\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft propulsion\n\n\tChemical\nrockets\t\n\tState\t\n\tLiquid-propellant rocket\n\tSolid-propellant rocket\n\tHybrid-propellant rocket\n\n\n\n\n\tPropellants\t\n\tLiquid propellant\n\tCryogenic\n\tHypergolic\n\n\n\tMonopropellant\n\tBipropellant\n\tStaged combustion cycle\n\tExpander cycle\n\tGas-generator cycle\n\tTap-off cycle\n\tPressure-fed engine\n\tPump-fed engine\n\tElectric-pump-fed engine\n\n\n\tTripropellant\n\n\n\n\n\n\n\n\tElectrical\nthrusters\t\n\tElectrostatic\t\n\tColloid thruster\n\tIon thruster\n\tGridded\n\tHall-effect thruster\n\tField-emission electric propulsion\n\n\n\n\n\n\n\tElectromagnetic\t\n\tPulsed inductive thruster\n\tMagnetoplasmadynamic thruster\n\tElectrodeless plasma thruster\n\n\n\n\n\tElectrothermal\t\n\tPulsed plasma thruster\n\tHelicon double-layer thruster\n\tArcjet rocket\n\tResistojet rocket\n\tVASIMR\n\n\n\n\n\tOther\t\n\tAtmosphere-breathing electric propulsion\n\tHigh Power Electric Propulsion\n\tMagBeam\n\tMass driver\n\n\n\n\n\n\n\n\tNuclear\npropulsion\t\n\tClosed system\t\n\tDirect Fusion Drive\n\tNuclear electric rocket\n\tNuclear thermal rocket\n\tRadioisotope\n\tSalt-water\n\tGas core\n\t\"Lightbulb\"\n\n\n\n\n\n\n\tOpen system\t\n\tNuclear pulse propulsion\n\tAntimatter-catalyzed\n\n\n\tPulsed nuclear thermal rocket‎\n\tFusion rocket\n\tBussard ramjet\n\n\n\tFission-fragment rocket\n\tFission sail\n\n\n\tNuclear photonic rocket\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tBeam-powered propulsion\n\tCold gas thruster\n\tGravity assist\n\tSolar sail\n\tElectric sail\n\tMagnetic sail\n\n\n\tSolar thermal rocket\n\tTethers\n\tSteam thruster\n\n\n\n\n\tSpaceflight portal\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nEmerging technologies\n\n\tFields\t\n\tAgriculture\t\n\tAgricultural robot\n\tCellular agriculture\n\tClosed ecological systems\n\tCultured meat\n\tGenetically modified food\n\tPrecision agriculture\n\tVertical farming\n\n\n\n\n\tArchitecture\t\n\tArcology\n\tBuilding printing\n\tContour crafting\n\n\n\tDomed city\n\n\n\n\n\tBiomedical\t\n\tArtificial uterus\n\tAmpakine\n\tBrain transplant\n\tCryonics\n\tCryoprotectant\n\tCryopreservation\n\tVitrification\n\tSuspended animation\n\n\n\tDe-extinction\n\tGenetic engineering\n\tGene therapy\n\n\n\tHead transplant\n\tIsolated brain\n\tLife extension\n\tStrategies for Engineered Negligible Senescence\n\n\n\tNanomedicine\n\tNanosensors\n\tOrgan printing\n\tPersonalized medicine\n\tRegenerative medicine\n\tStem-cell therapy\n\tTissue engineering\n\n\n\tRobot-assisted surgery\n\tSynthetic biology\n\tSynthetic genomics\n\n\n\tVirotherapy\n\tOncolytic virus\n\n\n\tTricorder\n\tWhole genome sequencing\n\n\n\n\n\tDisplays\t\n\tNext generation\t\n\tFED\n\tFLCD\n\tiMoD\n\tLaser\n\tLPD\n\tOLED\n\tOLET\n\tQD-LED\n\tSED\n\tTPD\n\tTDEL\n\tTMOS\n\tMicroLED\n\n\n\n\n\tScreenless\t\n\tBionic contact lens\n\tHead-mounted display\n\tHead-up display\n\tOptical head-mounted display\n\tVirtual retinal display\n\n\n\n\n\tOther\t\n\tAutostereoscopy\n\tFlexible display\n\tHolographic display\n\tComputer-generated holography\n\n\n\tMulti-primary color display\n\tUltra HD\n\tVolumetric display\n\n\n\n\n\n\n\n\tElectronics\t\n\tElectronic nose\n\tE-textiles\n\tFlexible electronics\n\tMolecular electronics\n\tNanoelectromechanical systems\n\tMemristor\n\tSpintronics\n\tThermal copper pillar bump\n\tTwistronics\n\n\n\n\n\tEnergy\t\n\tProduction\t\n\tAirborne wind turbine\n\tArtificial photosynthesis\n\tBiofuels\n\tCarbon-neutral fuel\n\tConcentrated solar power\n\tFusion power\n\tHome fuel cell\n\tHydrogen economy\n\tMethanol economy\n\tMolten salt reactor\n\tNantenna\n\tPhotovoltaic pavement\n\tSpace-based solar power\n\tVortex engine\n\n\n\n\n\tStorage\t\n\tBeltway battery\n\tCompressed air energy storage\n\tFlywheel energy storage\n\tGrid energy storage\n\tLithium–air battery\n\tMolten-salt battery\n\tNanowire battery\n\tResearch in lithium-ion batteries\n\tSilicon–air battery\n\tThermal energy storage\n\tUltracapacitor\n\n\n\n\n\tOther\t\n\tSmart grid\n\tWireless power\n\n\n\n\n\n\n\n\tInformation and\ncommunications\n\t\n\tAmbient intelligence\n\tInternet of things\n\n\n\tArtificial intelligence\n\tApplications of artificial intelligence\n\tProgress in artificial intelligence\n\tMachine translation\n\tMobile translation\n\tMachine vision\n\tSemantic Web\n\tSpeech recognition\n\n\n\tAtomtronics\n\tCarbon nanotube field-effect transistor\n\tCybermethodology\n\tFourth-generation optical discs\n\t3D optical data storage\n\tHolographic data storage\n\n\n\tGPGPU\n\tMemory\n\tCBRAM\n\tFRAM\n\tMillipede\n\tMRAM\n\tNRAM\n\tPRAM\n\tRacetrack memory\n\tRRAM\n\tSONOS\n\n\n\tOptical computing\n\tRFID\n\tChipless RFID\n\n\n\tSoftware-defined radio\n\tThree-dimensional integrated circuit\n\n\n\n\n\tManufacturing\t\n\t3D printing\n\tClaytronics\n\tMolecular assembler\n\tUtility fog\n\n\n\n\n\tMaterials science\t\n\tAerogel\n\tAmorphous metal\n\tArtificial muscle\n\tConductive polymer\n\tFemtotechnology\n\tFullerene\n\tGraphene\n\tHigh-temperature superconductivity\n\tHigh-temperature superfluidity\n\tLinear acetylenic carbon\n\tMetamaterials\n\tMetamaterial cloaking\n\n\n\tMetal foam\n\tMulti-function structures\n\tNanotechnology\n\tCarbon nanotubes\n\tMolecular nanotechnology\n\tNanomaterials\n\n\n\tPicotechnology\n\tProgrammable matter\n\tQuantum dots\n\tSilicene\n\tSuperalloy\n\tSynthetic diamond\n\n\n\n\n\tMilitary\t\n\tAntimatter weapon\n\tCaseless ammunition\n\tDirected-energy weapon\n\tLaser\n\tMaser\n\tParticle-beam weapon\n\tSonic weapon\n\tCoilgun\n\tRailgun\n\n\n\tPlasma weapon\n\tPure fusion weapon\n\tStealth technology\n\tVortex ring gun\n\n\n\n\n\tNeuroscience\t\n\tArtificial brain\n\tBrain–computer interface\n\tElectroencephalography\n\tMind uploading\n\tBrain-reading\n\tNeuroinformatics\n\n\n\tNeuroprosthetics\n\tBionic eye\n\tBrain implant\n\tExocortex\n\tRetinal implant\n\n\n\n\n\n\n\tQuantum\t\n\tQuantum algorithms\n\tQuantum amplifier\n\tQuantum bus\n\tQuantum channel\n\tQuantum circuit\n\tQuantum complexity theory\n\tQuantum computing\n\tQuantum cryptography\n\tQuantum dynamics\n\tQuantum electronics\n\tQuantum error correction\n\tQuantum imaging\n\tQuantum information\n\tQuantum key distribution\n\tQuantum logic\n\tQuantum logic gates\n\tQuantum machine\n\tQuantum machine learning\n\tQuantum metamaterial\n\tQuantum metrology\n\tQuantum network\n\tQuantum neural network\n\tQuantum optics\n\tQuantum programming\n\tQuantum sensing\n\tQuantum simulator\n\tQuantum teleportation\n\n\n\n\n\tRobotics\t\n\tDomotics\n\tNanorobotics\n\tPowered exoskeleton\n\tSelf-reconfiguring modular robot\n\tSwarm robotics\n\tUncrewed vehicle\n\n\n\n\n\tSpace science\t\n\tLaunch\t\n\tFusion rocket\n\tNon-rocket spacelaunch\n\tMass driver\n\tOrbital ring\n\tSkyhook\n\tSpace elevator\n\tSpace fountain\n\tSpace tether\n\n\n\tReusable launch system\n\n\n\n\n\tPropulsion\t\n\tBeam-powered propulsion\n\tIon thruster\n\tLaser propulsion\n\tPlasma propulsion engine\n\tHelicon thruster\n\tVASIMR\n\n\n\tNuclear pulse propulsion\n\tSolar sail\n\n\n\n\n\tOther\t\n\tInterstellar travel\n\tPropellant depot\n\tLaser communication in space\n\n\n\n\n\n\n\n\tTransport\t\n\tAerial\t\n\tAdaptive compliant wing\n\tBackpack helicopter\n\tDelivery drone\n\tFlying car\n\tHigh-altitude platform\n\tJet pack\n\tPulse detonation engine\n\tScramjet\n\tSpaceplane\n\tSupersonic transport\n\n\n\n\n\tLand\t\n\tAirless tire\n\tAlternative fuel vehicle\n\tHydrogen vehicle\n\n\n\tDriverless car\n\tGround effect train\n\tHyperloop\n\tMaglev train\n\tPersonal rapid transit\n\tTransit Elevated Bus\n\tVactrain\n\tVehicular communication systems\n\n\n\n\n\tPipeline\t\n\tPneumatic transport\n\tAutomated vacuum collection\n\n\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tCloak of invisibility\n\tDigital scent technology\n\tForce field\n\tPlasma window\n\n\n\tImmersive virtual reality\n\tMagnetic refrigeration\n\tPhased-array optics\n\n\n\n\n\n\n\n\tTopics\t\n\tCollingridge dilemma\n\tDifferential technological development\n\tDisruptive Innovation\n\tEphemeralization\n\tExploratory engineering\n\tFictional technology\n\tProactionary principle\n\tTechnological change\n\tTechnological unemployment\n\n\n\tTechnological convergence\n\tTechnological evolution\n\tTechnological paradigm\n\tTechnology forecasting\n\tAccelerating change\n\tMoore's law\n\tTechnological singularity\n\tTechnology scouting\n\n\n\tTechnology readiness level\n\tTechnology roadmap\n\tTranshumanism\n\n\n\n\n\t\n\t Category\n\t List\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Ion_thruster&oldid=917748219\"\n\n\t\t\n\t\tCategories: \tMagnetic propulsion devices\n\tIon engines\n\tEmerging technologies\n\tSpacecraft propulsion\n\n\nHidden categories: \tWebarchive template wayback links\n\tCS1 Russian-language sources (ru)\n\tCS1 errors: missing periodical\n\tCS1 maint: multiple names: authors list\n\tWebarchive template archiveis links\n\tCS1 Japanese-language sources (ja)\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from October 2017\n\tSelf-contradictory articles from April 2018\n\tAll self-contradictory articles\n\tPages using multiple image with manual scaled images\n\tArticles needing additional references from April 2009\n\tAll articles needing additional references\n\tArticles with unsourced statements from August 2012\n\tArticles with unsourced statements from February 2011\n\tArticles containing potentially dated statements from March 2011\n\tAll articles containing potentially dated statements\n\tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tБеларуская\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\t한국어\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tქართული\n\tLatviešu\n\tMagyar\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tپښتو\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSimple English\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 25 September 2019, at 08:30 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "60", "dc:title": "Ion thruster - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Ion_Engine_Test_Firing_-_GPN-2000-000482.jpg/1200px-Ion_Engine_Test_Firing_-_GPN-2000-000482.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-ion_thruster", "title": "Ion thruster - Wikipedia"}}