{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIonization - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tIonization\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about physical processes. For devices, see Ion source. For the musical composition, see Ionisation (Varèse).\n\nIonization or ionisation, is the process by which an atom or a molecule acquires a negative or positive charge by gaining or losing electrons, often in conjunction with other chemical changes.[1]  The resulting electrically charged atom or molecule is called an ion.  Ionization can result from the loss of an electron after collisions with subatomic particles, collisions with other atoms, molecules and ions, or through the interaction with electromagnetic radiation. Heterolytic bond cleavage and heterolytic substitution reactions can result in the formation of ion pairs. Ionization can occur through radioactive decay by the internal conversion process, in which an excited nucleus transfers its energy to one of the inner-shell electrons causing it to be ejected.\n\n\nContents\n\n\n\t1 Uses\n\t2 Production of ions\n\t3 Ionization energy of atoms\n\t4 Semi-classical description of ionization\n\t5 Quantum mechanical description of ionization\n\t5.1 Tunnel ionization\n\t5.1.1 Quasi-static tunnel ionization\n\n\n\n\n\n\n\t6 Strong field approximation for the ionization rate\n\t6.1 Atomic stabilization/population trapping\n\t6.2 Non-sequential multiple ionization\n\t6.3 Multiphoton ionization of inner-valence electrons and fragmentation of polyatomic molecules\n\n\n\n\t7 Kramers-Henneberger frame and ionization phase effects\n\t8 Dissociation – distinction\n\t9 See also\n\t10 References\n\t11 External links\n\n\n\n\n\nUses[edit]\n\nEveryday examples of gas ionization are such as within a fluorescent lamp or other electrical discharge lamps. It is also used in radiation detectors such as the Geiger-Müller counter or the ionization chamber. The ionization process is widely used in a variety of equipment in fundamental science (e.g., mass spectrometry) and in industry (e.g., radiation therapy).\n\n\nProduction of ions[edit]\n\n  \nAvalanche effect between two electrodes. The original ionization event liberates one electron, and each subsequent collision liberates a further electron, so two electrons emerge from each collision: the ionizing electron and the liberated electron.\n\n\n\nNegatively charged ions are produced when a free electron collides with an atom and is subsequently trapped inside the electric potential barrier, releasing any excess energy. The process is known as electron capture ionization.\n\nPositively charged ions are produced by transferring an amount of energy to a bound electron in a collision with charged particles (e.g. ions, electrons or positrons) or with photons. The threshold amount of the required energy is known as ionization potential.  The study of such collisions is of fundamental importance with regard to the few-body problem (see article on few-body systems), which is one of the major unsolved problems in physics.  Kinematically complete experiments,[2] i.e. experiments in which the complete momentum vector of all collision fragments (the scattered projectile, the recoiling target-ion, and the ejected electron) are determined, have contributed to major advances in the theoretical understanding of the few-body problem in recent years.\n\nAdiabatic ionization is a form of ionization in which an electron is removed from or added to an atom or molecule in its lowest energy state to form an ion in its lowest energy state.[3]\n\nThe Townsend discharge is a good example of the creation of positive ions and free electrons due to ion impact. It is a cascade reaction involving electrons in a region with a sufficiently high electric field in a gaseous medium that can be ionized, such as air. Following an original ionization event, due to such as ionizing radiation, the positive ion drifts towards the cathode, while the free electron drifts towards the anode of the device. If the electric field is strong enough, the free electron gains sufficient energy to liberate a further electron when it next collides with another molecule. The two free electrons then travel towards the anode and gain sufficient energy from the electric field to cause impact ionization when the next collisions occur; and so on. This is effectively a chain reaction of electron generation, and is dependent on the free electrons gaining sufficient energy between collisions to sustain the avalanche.[4]\n\nIonization efficiency is the ratio of the number of ions formed to the number of electrons or photons used.[5][6]\n\n\nIonization energy of atoms[edit]\n\n  \nIonization energies of neutral elements.\n\n\n\nThe trend in the ionization energy of atoms is often used to demonstrate the periodic behavior of atoms with respect to the atomic number, as summarized by ordering atoms in  Mendeleev's table. This is a valuable tool for establishing and understanding the ordering of electrons in atomic orbitals without going into the details of wave functions or the ionization process. An example is presented in figure 1. The periodic abrupt decrease in ionization potential after rare gas atoms, for instance, indicates the emergence of a new shell in alkali metals. In addition, the local maximums in the ionization energy plot, moving from left to right in a row, are indicative of s, p, d, and f sub-shells.\n\n\nSemi-classical description of ionization[edit]\n\nClassical physics and the Bohr model of the atom can qualitatively explain photoionization and collision-mediated ionization. In these cases, during the ionization process, the energy of the electron exceeds the energy difference of the potential barrier it is trying to pass. The semi-classical description, however, cannot describe tunnel ionization since the process involves the passage of electron through a classically forbidden potential barrier.\n\n\nQuantum mechanical description of ionization[edit]\n\nThe interaction of atoms and molecules with sufficiently strong laser pulses leads to the ionization to singly or multiply charged ions. The ionization rate, i.e. the ionization probability in unit time, can only be calculated using quantum mechanics. In general, the analytic solutions are not available, and the approximations required for manageable numerical calculations do not provide accurate enough results. However, when the laser intensity is sufficiently high, the detailed structure of the atom or molecule can be ignored and analytic solution for the ionization rate is possible.\n\n\nTunnel ionization[edit]\n\n  \nCombined potential of an atom and a uniform laser field. At distances r < r0, the potential of the laser can be neglected, while at distances with r > r0 the Coulomb potential is negligible compared to the potential of the laser field. The electron emerges from under the barrier at r = Rc. Ei is the ionization potential of the atom.\n\n\n\nTunnel ionization is ionization due to quantum tunneling. In classical ionization, an electron must have enough energy to make it over the potential barrier, but quantum tunneling allows the electron simply to go through the potential barrier instead of going all the way over it because of the wave nature of the electron. The probability of an electron's tunneling through the barrier drops off exponentially with the width of the potential barrier. Therefore, an electron with a higher energy can make it further up the potential barrier, leaving a much thinner barrier to tunnel through and, thus, a greater chance to do so. In practice, tunnel ionization is observable when the atom or molecule is interacting with near-infrared strong laser pulses. This process can be understood as a process by which a bounded electron, through  the absorption of more than one photon from the laser field, is ionized. This picture is generally known as multiphoton ionization (MPI).\n\nKeldysh[7] modeled the MPI process as a transition of the electron from the ground state of the atom to the Volkov states.[8] In this model the perturbation of the ground state by the laser field is neglected and the details of atomic structure in determining the ionization probability are not taken into account. The major difficulty with Keldysh's model was its neglect of the effects of Coulomb interaction on the final state of the electron. As it is observed from figure,  the Coulomb field is not  very small in magnitude compared to the potential of the laser at larger distances from the  nucleus. This is in contrast to the approximation made by neglecting the potential of the laser at regions near the  nucleus. Perelomov et al.[9][10] included the Coulomb interaction at larger internuclear distances. Their model (which we call PPT model) was derived for short range potential and includes the effect of the long range Coulomb interaction through the first order correction in the quasi-classical action. Larochelle et al.[11]  have compared the theoretically predicted ion versus intensity curves of  rare gas atoms interacting with a Ti:Sapphire laser with  experimental measurement. They have shown that the total ionization rate predicted by the PPT model fit very well the experimental ion yields for all rare gases in the intermediate regime of Keldysh parameter.\n\nThe rate of MPI on atom with an ionization potential \n  \n    \n      \n        \n          E\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle E_{i}}\n  \n in a linearly polarized laser with frequency \n  \n    \n      \n        ω\n      \n    \n    {\\displaystyle \\omega }\n  \n is given by\n\n\n\t\n  \n    \n      \n        \n          W\n          \n            P\n            P\n            T\n          \n        \n        =\n        \n          \n            |\n            \n              C\n              \n                \n                  n\n                  \n                    ∗\n                  \n                \n                \n                  l\n                  \n                    ∗\n                  \n                \n              \n            \n            |\n          \n          \n            2\n          \n        \n        \n          \n            \n              6\n              π\n            \n          \n        \n        \n          f\n          \n            l\n            m\n          \n        \n        \n          E\n          \n            i\n          \n        \n        \n          \n            (\n            \n              \n                \n                  2\n                  F\n                \n              \n              \n                \n                  (\n                  \n                    2\n                    \n                      E\n                      \n                        i\n                      \n                    \n                  \n                  )\n                \n                \n                  \n                    3\n                    2\n                  \n                \n              \n            \n            )\n          \n          \n            2\n            \n              n\n              \n                ∗\n              \n            \n            −\n            \n              |\n            \n            m\n            \n              |\n            \n            −\n            \n              \n                3\n                2\n              \n            \n          \n        \n        \n          \n            (\n            \n              1\n              +\n              \n                γ\n                \n                  2\n                \n              \n            \n            )\n          \n          \n            \n              |\n              \n                \n                  m\n                  2\n                \n              \n              |\n            \n            +\n            \n              \n                3\n                4\n              \n            \n          \n        \n        \n          A\n          \n            m\n          \n        \n        (\n        ω\n        ,\n        γ\n        )\n        \n          e\n          \n            −\n            \n              \n                2\n                F\n              \n            \n            \n              \n                (\n                \n                  2\n                  \n                    E\n                    \n                      i\n                    \n                  \n                \n                )\n              \n              \n                \n                  3\n                  2\n                \n              \n            \n            g\n            \n              (\n              γ\n              )\n            \n          \n        \n      \n    \n    {\\displaystyle W_{PPT}=\\left|C_{n^{*}l^{*}}\\right|^{2}{\\sqrt {\\frac {6}{\\pi }}}f_{lm}E_{i}\\left({\\frac {2}{F}}\\left(2E_{i}\\right)^{\\frac {3}{2}}\\right)^{2n^{*}-|m|-{\\frac {3}{2}}}\\left(1+\\gamma ^{2}\\right)^{\\left|{\\frac {m}{2}}\\right|+{\\frac {3}{4}}}A_{m}(\\omega ,\\gamma )e^{-{\\frac {2}{F}}\\left(2E_{i}\\right)^{\\frac {3}{2}}g\\left(\\gamma \\right)}}\n  \n\n\n\nwhere \n\n\n\t\n  \n    \n      \n        γ\n        =\n        \n          \n            \n              ω\n              \n                \n                  2\n                  \n                    E\n                    \n                      i\n                    \n                  \n                \n              \n            \n            F\n          \n        \n      \n    \n    {\\displaystyle \\gamma ={\\frac {\\omega {\\sqrt {2E_{i}}}}{F}}}\n  \n  is the Keldysh's adiabaticity parameter,\n\t\n  \n    \n      \n        \n          n\n          \n            ∗\n          \n        \n        =\n        \n          \n            \n              2\n              \n                E\n                \n                  i\n                \n              \n            \n            \n              Z\n              \n                2\n              \n            \n          \n        \n      \n    \n    {\\displaystyle n^{*}={\\frac {\\sqrt {2E_{i}}}{Z^{2}}}}\n  \n,\n\t\n  \n    \n      \n        F\n      \n    \n    {\\displaystyle F}\n  \n is the peak electric field of laser and\n\t\n  \n    \n      \n        \n          l\n          \n            ∗\n          \n        \n        =\n        \n          n\n          \n            ∗\n          \n        \n        −\n        1\n      \n    \n    {\\displaystyle l^{*}=n^{*}-1}\n  \n.\n\n\nThe coefficients \n  \n    \n      \n        \n          f\n          \n            l\n            m\n          \n        \n      \n    \n    {\\displaystyle f_{lm}}\n  \n, \n  \n    \n      \n        g\n        (\n        γ\n        )\n      \n    \n    {\\displaystyle g(\\gamma )}\n  \n and \n  \n    \n      \n        \n          C\n          \n            \n              n\n              \n                ∗\n              \n            \n            \n              l\n              \n                ∗\n              \n            \n          \n        \n      \n    \n    {\\displaystyle C_{n^{*}l^{*}}}\n  \n are given by\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  f\n                  \n                    l\n                    m\n                  \n                \n              \n              \n                \n                =\n                \n                  \n                    \n                      (\n                      2\n                      l\n                      +\n                      1\n                      )\n                      (\n                      l\n                      +\n                      \n                        |\n                      \n                      m\n                      \n                        |\n                      \n                      )\n                      !\n                    \n                    \n                      \n                        2\n                        \n                          m\n                        \n                      \n                      \n                        |\n                      \n                      m\n                      \n                        |\n                      \n                      !\n                      (\n                      l\n                      −\n                      \n                        |\n                      \n                      m\n                      \n                        |\n                      \n                      )\n                      !\n                    \n                  \n                \n              \n            \n            \n              \n                g\n                (\n                γ\n                )\n              \n              \n                \n                =\n                \n                  \n                    3\n                    \n                      2\n                      γ\n                    \n                  \n                \n                \n                  (\n                  \n                    1\n                    +\n                    \n                      \n                        1\n                        \n                          2\n                          \n                            γ\n                            \n                              2\n                            \n                          \n                        \n                      \n                    \n                    \n                      sinh\n                      \n                        −\n                        1\n                      \n                    \n                    ⁡\n                    (\n                    γ\n                    )\n                    −\n                    \n                      \n                        \n                          1\n                          +\n                          \n                            γ\n                            \n                              2\n                            \n                          \n                        \n                        \n                          2\n                          γ\n                        \n                      \n                    \n                  \n                  )\n                \n              \n            \n            \n              \n                \n                  |\n                \n                \n                  C\n                  \n                    \n                      n\n                      \n                        ∗\n                      \n                    \n                    \n                      l\n                      \n                        ∗\n                      \n                    \n                  \n                \n                \n                  \n                    |\n                  \n                  \n                    2\n                  \n                \n              \n              \n                \n                =\n                \n                  \n                    \n                      2\n                      \n                        2\n                        \n                          n\n                          \n                            ∗\n                          \n                        \n                      \n                    \n                    \n                      \n                        n\n                        \n                          ∗\n                        \n                      \n                      Γ\n                      (\n                      \n                        n\n                        \n                          ∗\n                        \n                      \n                      +\n                      \n                        l\n                        \n                          ∗\n                        \n                      \n                      +\n                      1\n                      )\n                      Γ\n                      (\n                      \n                        n\n                        \n                          ∗\n                        \n                      \n                      −\n                      \n                        l\n                        \n                          ∗\n                        \n                      \n                      )\n                    \n                  \n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}f_{lm}&={\\frac {(2l+1)(l+|m|)!}{2^{m}|m|!(l-|m|)!}}\\\\g(\\gamma )&={\\frac {3}{2\\gamma }}\\left(1+{\\frac {1}{2\\gamma ^{2}}}\\sinh ^{-1}(\\gamma )-{\\frac {\\sqrt {1+\\gamma ^{2}}}{2\\gamma }}\\right)\\\\|C_{n^{*}l^{*}}|^{2}&={\\frac {2^{2n^{*}}}{n^{*}\\Gamma (n^{*}+l^{*}+1)\\Gamma (n^{*}-l^{*})}}\\end{aligned}}}\n  \n\n\n\nThe coefficient \n  \n    \n      \n        \n          A\n          \n            m\n          \n        \n        (\n        ω\n        ,\n        γ\n        )\n      \n    \n    {\\displaystyle A_{m}(\\omega ,\\gamma )}\n  \n  is given by\n\n\n\t\n  \n    \n      \n        \n          A\n          \n            m\n          \n        \n        (\n        ω\n        ,\n        γ\n        )\n        =\n        \n          \n            4\n            \n              3\n              π\n            \n          \n        \n        \n          \n            1\n            \n              \n                |\n              \n              m\n              \n                |\n              \n              !\n            \n          \n        \n        \n          \n            \n              γ\n              \n                2\n              \n            \n            \n              1\n              +\n              \n                γ\n                \n                  2\n                \n              \n            \n          \n        \n        \n          ∑\n          \n            n\n            >\n            v\n          \n          \n            ∞\n          \n        \n        \n          e\n          \n            −\n            (\n            n\n            −\n            v\n            )\n            α\n            (\n            γ\n            )\n          \n        \n        \n          w\n          \n            m\n          \n        \n        \n          (\n          \n            \n              \n                \n                  \n                    2\n                    γ\n                  \n                  \n                    1\n                    +\n                    \n                      γ\n                      \n                        2\n                      \n                    \n                  \n                \n              \n              (\n              n\n              −\n              v\n              )\n            \n          \n          )\n        \n      \n    \n    {\\displaystyle A_{m}(\\omega ,\\gamma )={\\frac {4}{3\\pi }}{\\frac {1}{|m|!}}{\\frac {\\gamma ^{2}}{1+\\gamma ^{2}}}\\sum _{n>v}^{\\infty }e^{-(n-v)\\alpha (\\gamma )}w_{m}\\left({\\sqrt {{\\frac {2\\gamma }{\\sqrt {1+\\gamma ^{2}}}}(n-v)}}\\right)}\n  \n\n\n\nwhere\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  w\n                  \n                    m\n                  \n                \n                (\n                x\n                )\n              \n              \n                \n                =\n                \n                  e\n                  \n                    −\n                    \n                      x\n                      \n                        2\n                      \n                    \n                  \n                \n                \n                  ∫\n                  \n                    0\n                  \n                  \n                    x\n                  \n                \n                (\n                \n                  x\n                  \n                    2\n                  \n                \n                −\n                \n                  y\n                  \n                    2\n                  \n                \n                \n                  )\n                  \n                    m\n                  \n                \n                \n                  e\n                  \n                    \n                      y\n                      \n                        2\n                      \n                    \n                  \n                \n                \n                d\n                y\n              \n            \n            \n              \n                α\n                (\n                γ\n                )\n              \n              \n                \n                =\n                2\n                \n                  (\n                  \n                    \n                      sinh\n                      \n                        −\n                        1\n                      \n                    \n                    ⁡\n                    (\n                    γ\n                    )\n                    −\n                    \n                      \n                        γ\n                        \n                          1\n                          +\n                          \n                            γ\n                            \n                              2\n                            \n                          \n                        \n                      \n                    \n                  \n                  )\n                \n              \n            \n            \n              \n                v\n              \n              \n                \n                =\n                \n                  \n                    \n                      E\n                      \n                        i\n                      \n                    \n                    ω\n                  \n                \n                \n                  (\n                  \n                    1\n                    +\n                    \n                      \n                        2\n                        \n                          γ\n                          \n                            2\n                          \n                        \n                      \n                    \n                  \n                  )\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}w_{m}(x)&=e^{-x^{2}}\\int _{0}^{x}(x^{2}-y^{2})^{m}e^{y^{2}}\\,dy\\\\\\alpha (\\gamma )&=2\\left(\\sinh ^{-1}(\\gamma )-{\\frac {\\gamma }{\\sqrt {1+\\gamma ^{2}}}}\\right)\\\\v&={\\frac {E_{i}}{\\omega }}\\left(1+{\\frac {2}{\\gamma ^{2}}}\\right)\\end{aligned}}}\n  \n\n\n\nQuasi-static tunnel ionization[edit]\n\nThe quasi-static tunnelling (QST) is the ionization whose rate can be satisfactorily predicted by the ADK model,[12] i.e. the limit of the PPT model when \n  \n    \n      \n        γ\n      \n    \n    {\\displaystyle \\gamma }\n  \n approaches zero.[13] The rate of QST is given by\n\n\n\t\n  \n    \n      \n        \n          W\n          \n            A\n            D\n            K\n          \n        \n        =\n        \n          \n            |\n            \n              C\n              \n                \n                  n\n                  \n                    ∗\n                  \n                \n                \n                  l\n                  \n                    ∗\n                  \n                \n              \n            \n            |\n          \n          \n            2\n          \n        \n        \n          \n            \n              6\n              π\n            \n          \n        \n        \n          f\n          \n            l\n            m\n          \n        \n        \n          E\n          \n            i\n          \n        \n        \n          \n            (\n            \n              \n                \n                  2\n                  F\n                \n              \n              \n                \n                  (\n                  \n                    2\n                    \n                      E\n                      \n                        i\n                      \n                    \n                  \n                  )\n                \n                \n                  \n                    3\n                    2\n                  \n                \n              \n            \n            )\n          \n          \n            2\n            \n              n\n              \n                ∗\n              \n            \n            −\n            \n              |\n            \n            m\n            \n              |\n            \n            −\n            \n              \n                3\n                2\n              \n            \n          \n        \n        \n          e\n          \n            −\n            \n              \n                2\n                \n                  3\n                  F\n                \n              \n            \n            \n              \n                (\n                \n                  2\n                  \n                    E\n                    \n                      i\n                    \n                  \n                \n                )\n              \n              \n                \n                  3\n                  2\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle W_{ADK}=\\left|C_{n^{*}l^{*}}\\right|^{2}{\\sqrt {\\frac {6}{\\pi }}}f_{lm}E_{i}\\left({\\frac {2}{F}}\\left(2E_{i}\\right)^{\\frac {3}{2}}\\right)^{2n^{*}-|m|-{\\frac {3}{2}}}e^{-{\\frac {2}{3F}}\\left(2E_{i}\\right)^{\\frac {3}{2}}}}\n  \n\n\n\nAs compared to \n  \n    \n      \n        \n          W\n          \n            P\n            P\n            T\n          \n        \n      \n    \n    {\\displaystyle W_{PPT}}\n  \n the absence of summation over n, which represent different above threshold ionization (ATI) peaks, is remarkable.\n\n\nStrong field approximation for the ionization rate[edit]\n\nThe calculations of PPT are done in the E-gauge, meaning that the laser field is taken as electromagnetic waves.  The ionization rate can also be calculated in A-gauge, which emphasis the particle nature of light (absorbing multiple photons during ionization).  This approach was adopted by Krainov model[14] based on the earlier works of Faisal[15] and Reiss.[16] The resulting rate is given by\n\n\n\t\n  \n    \n      \n        \n          W\n          \n            K\n            R\n            A\n          \n        \n        =\n        \n          ∑\n          \n            n\n            =\n            N\n          \n          \n            n\n            =\n            ∞\n          \n        \n        2\n        π\n        \n          ω\n          \n            2\n          \n        \n        p\n        \n          \n            (\n            \n              n\n              −\n              \n                n\n                \n                  \n                    o\n                    s\n                    c\n                  \n                \n              \n            \n            )\n          \n          \n            2\n          \n        \n        ∫\n        \n          d\n        \n        Ω\n        \n          \n            |\n            \n              F\n              T\n              \n                (\n                \n                  \n                    I\n                    \n                      K\n                      A\n                      R\n                    \n                  \n                  Ψ\n                  \n                    (\n                    \n                      r\n                    \n                    )\n                  \n                \n                )\n              \n            \n            |\n          \n          \n            2\n          \n        \n        \n          J\n          \n            n\n          \n          \n            2\n          \n        \n        \n          (\n          \n            \n              n\n              \n                f\n              \n            \n            ,\n            \n              \n                \n                  n\n                  \n                    \n                      o\n                      s\n                      c\n                    \n                  \n                \n                2\n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle W_{KRA}=\\sum _{n=N}^{n=\\infty }2\\pi \\omega ^{2}p\\left(n-n_{\\mathrm {osc} }\\right)^{2}\\int \\mathrm {d} \\Omega \\left|FT\\left(I_{KAR}\\Psi \\left(\\mathbf {r} \\right)\\right)\\right|^{2}J_{n}^{2}\\left(n_{f},{\\frac {n_{\\mathrm {osc} }}{2}}\\right)}\n  \n\n\n\nwhere, \n  \n    \n      \n        N\n        =\n        [\n        \n          n\n          \n            i\n          \n        \n        +\n        \n          n\n          \n            \n              o\n              s\n              c\n            \n          \n        \n        ]\n      \n    \n    {\\displaystyle N=[n_{i}+n_{\\mathrm {osc} }]}\n  \n is the minimum number of  photons necessary to ionize the atom, \n  \n    \n      \n        \n          n\n          \n            i\n          \n        \n        =\n        \n          E\n          \n            i\n          \n        \n        \n          /\n        \n        ω\n      \n    \n    {\\displaystyle n_{i}=E_{i}/\\omega }\n  \n, \n  \n    \n      \n        \n          n\n          \n            \n              o\n              s\n              c\n            \n          \n        \n        =\n        \n          U\n          \n            p\n          \n        \n        \n          /\n        \n        ω\n      \n    \n    {\\displaystyle n_{\\mathrm {osc} }=U_{p}/\\omega }\n  \n ( \n  \n    \n      \n        \n          U\n          \n            p\n          \n        \n      \n    \n    {\\displaystyle U_{p}}\n  \n is the ponderomotive energy), \n  \n    \n      \n        \n          J\n          \n            n\n          \n        \n        (\n        u\n        ,\n        v\n        )\n      \n    \n    {\\displaystyle J_{n}(u,v)}\n  \n is the double Bessel function,  \n  \n    \n      \n        p\n        =\n        \n          \n            2\n            ω\n            (\n            n\n            −\n            \n              n\n              \n                \n                  o\n                  s\n                  c\n                \n              \n            \n            −\n            \n              n\n              \n                i\n              \n            \n            )\n          \n        \n      \n    \n    {\\displaystyle p={\\sqrt {2\\omega (n-n_{\\mathrm {osc} }-n_{i})}}}\n  \n,   \n\n  \n    \n      \n        \n          n\n          \n            f\n          \n        \n        =\n        2\n        \n          \n            \n              n\n              \n                \n                  o\n                  s\n                  c\n                \n              \n            \n            \n              /\n            \n            ω\n          \n        \n        p\n        cos\n        ⁡\n        (\n        θ\n        )\n      \n    \n    {\\displaystyle n_{f}=2{\\sqrt {n_{\\mathrm {osc} }/\\omega }}p\\cos(\\theta )}\n  \n  where \n  \n    \n      \n        θ\n      \n    \n    {\\displaystyle \\theta }\n  \n  is the angle between the momentum of the electron, p, and the electric field of the laser, F, and, the symbol FT denotes the  three-dimensional Fourier transformation. Finally, \n  \n    \n      \n        \n          I\n          \n            K\n            A\n            R\n          \n        \n        =\n        \n          \n            (\n            \n              \n                \n                  2\n                  \n                    Z\n                    \n                      2\n                    \n                  \n                \n                \n                  \n                    n\n                    \n                      2\n                    \n                  \n                  F\n                  r\n                \n              \n            \n            )\n          \n          \n            n\n          \n        \n      \n    \n    {\\displaystyle I_{KAR}=\\left({\\frac {2Z^{2}}{n^{2}Fr}}\\right)^{n}}\n  \n incorporates the Coulomb correction in the SFA model.\n\n\nAtomic stabilization/population trapping[edit]\n\nIn calculating the rate of MPI of atoms only transitions to the continuum states are considered. Such an approximation is acceptable as long as there is no multiphoton resonance between the ground state and some excited states. However, in real situation of interaction with pulsed lasers, during the evolution of  laser intensity, due to different Stark shift of the ground and excited states there is a possibility that some excited  state go into multiphoton resonance with the ground state. Within the dressed atom picture, the ground state dressed by \n  \n    \n      \n        m\n      \n    \n    {\\displaystyle m}\n  \n photons and the resonant state undergo an avoided crossing at the resonance intensity \n  \n    \n      \n        \n          I\n          \n            r\n          \n        \n      \n    \n    {\\displaystyle I_{r}}\n  \n. The minimum distance, \n  \n    \n      \n        \n          V\n          \n            m\n          \n        \n      \n    \n    {\\displaystyle V_{m}}\n  \n, at the avoided crossing is proportional to the generalized Rabi frequency, \n  \n    \n      \n        Γ\n        (\n        t\n        )\n        =\n        \n          Γ\n          \n            m\n          \n        \n        I\n        (\n        t\n        \n          )\n          \n            m\n            \n              /\n            \n            2\n          \n        \n      \n    \n    {\\displaystyle \\Gamma (t)=\\Gamma _{m}I(t)^{m/2}}\n  \n coupling the two states.  According  to Story et al.,[17] the probability of remaining in the ground state, \n  \n    \n      \n        \n          P\n          \n            g\n          \n        \n      \n    \n    {\\displaystyle P_{g}}\n  \n,  is given by\n\n\n\t\n  \n    \n      \n        \n          P\n          \n            g\n          \n        \n        =\n        exp\n        ⁡\n        \n          (\n          \n            −\n            \n              \n                \n                  2\n                  π\n                  \n                    W\n                    \n                      m\n                    \n                    \n                      2\n                    \n                  \n                \n                \n                  \n                    d\n                  \n                  W\n                  \n                    /\n                  \n                  \n                    d\n                  \n                  t\n                \n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle P_{g}=\\exp \\left(-{\\frac {2\\pi W_{m}^{2}}{\\mathrm {d} W/\\mathrm {d} t}}\\right)}\n  \n\n\n\nwhere \n  \n    \n      \n        W\n      \n    \n    {\\displaystyle W}\n  \n  is the time-dependent energy difference between the two dressed states. In interaction  with a short pulse, if the dynamic resonance is reached in the rising or the falling part of the pulse, the population practically remains in the ground state and the effect of multiphoton resonances may be neglected. However, if the states go onto resonance at the peak of the pulse, where \n  \n    \n      \n        \n          d\n        \n        W\n        \n          /\n        \n        \n          d\n        \n        t\n        =\n        0\n      \n    \n    {\\displaystyle \\mathrm {d} W/\\mathrm {d} t=0}\n  \n, then the excited state is populated. After being populated, since the ionization potential of the excited state is small, it is expected that the electron will be instantly ionized.\n\nIn 1992, de Boer and Muller [18] showed that Xe atoms subjected to short laser pulses could survive in the highly excited states 4f, 5f, and 6f . These states were believed to have been excited by the dynamic Stark shift of the levels into multiphoton resonance with the field during the rising part of the laser pulse. Subsequent evolution of the laser pulse did not ionize completely these states leaving behind some highly excited atoms. We shall refer to this phenomenon as \"population trapping\".\n\n\n  \nSchematic presentation of lambda type population trapping. G is the ground state of the atom. 1 and 2 are two degenerate excited states. After the population is transferred to the states due to multiphoton resonance, these states are coupled through continuum c  and the population is trapped in the superposition of these states.\n\n\n\nWe mention the theoretical calculation that incomplete ionization occurs whenever there is parallel resonant excitation into a common level with ionization loss.[19] We consider a state such as 6f of Xe which consists of 7 quasi-degnerate levels in the range of the laser bandwidth. These levels along with the continuum constitute a lambda system.  The mechanism of the lambda type trapping is schematically presented in figure. At the rising part of the pulse (a) the excited state (with two degenerate levels 1 and 2) are not in multiphoton resonance with the ground state. The electron is ionized through multiphoton coupling with the continuum. As the intensity of the pulse is increased the excited state and the continuum are shifted in energy due to the Stark shift. At the peak of the pulse (b) the excited states go into multiphoton resonance with the ground state. As the intensity starts to decrease (c), the two state are coupled through continuum and the population is trapped in a coherent superposition of the two states. Under subsequent action of the same pulse, due to interference in the transition amplitudes of the lambda system, the field cannot ionize the population completely and a fraction of the population will be trapped in a coherent superposition of the quasi degenerate levels. According to this explanation the states with higher angular momentum- with more sublevels- would have a higher probability of trapping the population. In general the strength of the trapping will be determined by the strength of the two photon coupling between the quasi-degenerate levels via the continuum.In 1996, using the very stable laser and by minimizing the masking effects of the focal region expansion with increasing intensity, Talebpour et al.[20] observed structures on the curves of singly charged ions of Xe, Kr and Ar. These structures were attributed to electron trapping in the strong laser field. A more unambiguous demonstration of population trapping has been reported by T. Morishita and C. D. Lin.[21]\n\n\nNon-sequential multiple ionization[edit]\n\nThe phenomenon of non-sequential ionization (NSI) of atoms  exposed  to intense laser fields has been a subject of many theoretical and experimental studies since 1983.  The pioneering work began with the observation of a “knee” structure on the Xe2+ ion signal versus intensity curve by L’Huillier et al.[22] From the experimental point of view, the NS double ionization refers to processes which somehow enhance the rate of production of doubly charged ions by a huge factor at intensities below the saturation intensity of the singly charged ion. Many, on the other hand, prefer to define the NSI as a process by which two electrons are ionized nearly simultaneously. This definition implies that apart from the sequential channel \n  \n    \n      \n        A\n        +\n        L\n        −\n        >\n        \n          A\n          \n            +\n          \n        \n        +\n        L\n        −\n        >\n        \n          A\n          \n            +\n            +\n          \n        \n      \n    \n    {\\displaystyle A+L->A^{+}+L->A^{++}}\n  \n there is another channel \n  \n    \n      \n        A\n        +\n        L\n        −\n        >\n        \n          A\n          \n            +\n            +\n          \n        \n      \n    \n    {\\displaystyle A+L->A^{++}}\n  \n which is the main contribution to the production of doubly charged ions at lower intensities. The first observation of triple NSI in argon interacting with a 1 µm laser was reported by Augst et al.[23] Later, systematically studying the NSI of all rare gas atoms, the quadruple NSI of Xe was observed.[24] The most important conclusion of this study was the observation of the following relation between the rate of NSI to any charge state and the rate of tunnel ionization (predicted by the ADK formula) to the previous charge states; \n\n\n\t\n  \n    \n      \n        \n          W\n          \n            N\n            S\n          \n        \n        (\n        \n          A\n          \n            n\n            +\n          \n        \n        )\n        =\n        \n          ∑\n          \n            i\n            =\n            1\n          \n          \n            n\n            −\n            1\n          \n        \n        \n          α\n          \n            n\n          \n        \n        \n          (\n          λ\n          )\n        \n        \n          W\n          \n            A\n            D\n            K\n          \n        \n        \n          (\n          \n            A\n            \n              i\n              +\n            \n          \n          )\n        \n      \n    \n    {\\displaystyle W_{NS}(A^{n+})=\\sum _{i=1}^{n-1}\\alpha _{n}\\left(\\lambda \\right)W_{ADK}\\left(A^{i+}\\right)}\n  \n\n\n\nwhere \n  \n    \n      \n        \n          W\n          \n            A\n            D\n            K\n          \n        \n        \n          (\n          \n            A\n            \n              i\n              +\n            \n          \n          )\n        \n      \n    \n    {\\displaystyle W_{ADK}\\left(A^{i+}\\right)}\n  \n is the rate of quasi-static tunneling to i'th charge state and  \n  \n    \n      \n        \n          α\n          \n            n\n          \n        \n        (\n        λ\n        )\n      \n    \n    {\\displaystyle \\alpha _{n}(\\lambda )}\n  \n are some constants depending on the wavelength of the laser (but not on the pulse duration).\n\nTwo models have been proposed to explain the non-sequential ionization;  the shake-off model and electron re-scattering model. The shake-off (SO) model,  first proposed by Fittinghoff et al.,[25] is adopted from the field of ionization of atoms by X rays and electron projectiles where the SO process is one of the major mechanisms responsible  for the multiple ionization of atoms. The SO model describes the NS process as a mechanism where one electron is ionized by the laser field and the departure of this electron is so rapid that the remaining electrons do not have enough time to adjust themselves to the new energy states. Therefore, there is a certain probability that, after the ionization of the first electron, a second electron is excited to states with higher energy (shake-up) or even ionized (shake-off). We should mention that, until now, there has been no quantitative calculation based on the SO model, and the model is still qualitative.\n\nThe electron rescattering model was independently developed by Kuchiev,[26] Schafer et al,[27] Corkum,[28] Becker and Faisal[29] and Faisal and Becker.[30] The principal features of the model can be understood easily from  Corkum's version. Corkum's model describes the NS ionization as a process whereby an electron is tunnel ionized. The electron then interacts with the laser field where it is accelerated away from the nuclear core. If the electron has been ionized at an appropriate phase of the field, it will pass by the position of the remaining ion half a cycle later, where it can free an additional electron by electron impact. Only half of the time the electron is  released with the appropriate phase and the other half  it never return to the nuclear core. The maximum kinetic energy that the returning electron can have is 3.17 times the ponderomotive potential (\n  \n    \n      \n        \n          U\n          \n            p\n          \n        \n      \n    \n    {\\displaystyle U_{p}}\n  \n) of the laser. Corkum's model  places a cut-off limit on the minimum intensity (\n  \n    \n      \n        \n          U\n          \n            p\n          \n        \n      \n    \n    {\\displaystyle U_{p}}\n  \n is proportional to intensity) where ionization due to re-scattering can occur.\n\n\n  \nFeynman diagram for the process of double ionization in an atom through re-scattering mechanism\n\n\n\nThe re-scattering model in Kuchiev's version (Kuchiev's model) is quantum mechanical. The basic idea of the model is illustrated  by Feynman diagrams in figure a. First both electrons are in the ground state of an atom. The lines marked a and b describe the corresponding atomic states. Then the electron a is ionized. The beginning of the ionization process is shown by the intersection with a sloped dashed line. where the MPI occurs. The propagation of the ionized electron in the laser field, during which it absorbs other photons (ATI), is shown by the full thick  line. The collision of this electron with the parent atomic ion is shown by a vertical dotted line representing the Coulomb interaction between the electrons. The state marked with c describes the ion excitation to a discrete or continuum state. Figure b describes the exchange process. Kuchiev's model, contrary to Corkum's model, does not predict any threshold intensity for the occurrence of NS ionization.\n\nKuciev did not include the Coulomb effects on the dynamics of the ionized electron. This resulted in the underestimation of the double ionization rate by a huge factor. Obviously, in the approach of Becker and Faisal (which is equivalent to Kuchiev's model in spirit), this drawback does not exist. In fact, their model is more exact and does not suffer from the large number of approximations made by Kuchiev. Their calculation results perfectly fit with the experimental results of Walker et al.[31] Becker and Faisal[32] have been able to fit the experimental results on the multiple NSI of rare gas atoms using their model. As a result, the electron re-scattering can be taken as the main mechanism for the occurrence of  the NSI process.\n\n\nMultiphoton ionization of inner-valence electrons and fragmentation of polyatomic molecules[edit]\n\nThe ionization of inner valance electrons are responsible for the fragmentation of polyatomic molecules in strong laser fields. According to a qualitative model[33][34] the dissociation of the molecules occurs through a three-step mechanism:\n\n\n\tMPI of electrons from the inner orbitals of the molecule which results in a molecular ion in ro-vibrational levels of an excited electronic state;\n\tRapid radiationless transition to the high-lying ro-vibrational levels of a lower electronic state; and\n\tSubsequent dissociation of the ion to different fragments through various fragmentation channels.\n\n\nThe short pulse induced molecular fragmentation may be used as an ion source for high performance mass spectroscopy. The selectivity provided by a short pulse based source is superior to that expected when using the conventional electron ionization based sources, in particular when the identification of optical isomers is required.[35][36]\n\n\nKramers-Henneberger frame and ionization phase effects[edit]\n\nStudying the strong field ionization of the atom in so called Kramers-Henneberger (K-H) frame[37] leads to the conclusion that the ionization efficiency strongly depends on the temporal details of the ionizing pulse but not necessarily on the field strength and the total energy of the ionizing pulse pumped into the atom.[38] The Kramers-Henneberger frame is the non-intertial frame moving with the free electron under the influence of the harmonic laser pulse. The free electron solution of the Newton equations for the electron in one dimension in the harmonic laser field\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  d\n                \n                \n                  2\n                \n              \n              x\n            \n            \n              \n                d\n              \n              \n                t\n                \n                  2\n                \n              \n            \n          \n        \n        =\n        F\n        sin\n        ⁡\n        (\n        ω\n        t\n        )\n      \n    \n    {\\displaystyle {\\frac {\\mathrm {d} ^{2}x}{\\mathrm {d} t^{2}}}=F\\sin(\\omega t)}\n  \n\n\n\nwill be also harmonic\n\n\n\t\n  \n    \n      \n        x\n        (\n        t\n        )\n        =\n        −\n        \n          \n            F\n            \n              ω\n              \n                2\n              \n            \n          \n        \n        sin\n        ⁡\n        (\n        ω\n        t\n        )\n        =\n        −\n        a\n        sin\n        ⁡\n        (\n        ω\n        t\n        )\n      \n    \n    {\\displaystyle x(t)=-{\\frac {F}{\\omega ^{2}}}\\sin(\\omega t)=-a\\sin(\\omega t)}\n  \n\n\n\nThe frame comoving with this electron will be obtained by the coordinate transformation\n\n\n\t\n  \n    \n      \n        x\n        →\n        x\n        +\n        a\n        sin\n        ⁡\n        (\n        ω\n        t\n        )\n      \n    \n    {\\displaystyle x\\to x+a\\sin(\\omega t)}\n  \n\n\n\nwhile the added Coulomb potential will be\n\n\n\t\n  \n    \n      \n        V\n        (\n        x\n        )\n        =\n        −\n        \n          \n            1\n            \n              |\n              \n                x\n                +\n                a\n                sin\n                ⁡\n                (\n                ω\n                t\n                )\n              \n              |\n            \n          \n        \n      \n    \n    {\\displaystyle V(x)=-{\\frac {1}{\\left|x+a\\sin(\\omega t)\\right|}}}\n  \n\n\n\nThe full cycle time-average of that potential which is \n\n\n\t\n  \n    \n      \n        \n          V\n          \n            A\n            V\n          \n        \n        =\n        −\n        \n          \n            1\n            \n              2\n              \n                |\n                \n                  x\n                  +\n                  \n                    \n                      a\n                      \n                        2\n                      \n                    \n                  \n                \n                |\n              \n            \n          \n        \n        −\n        \n          \n            1\n            \n              2\n              \n                |\n                \n                  x\n                  −\n                  \n                    \n                      a\n                      \n                        2\n                      \n                    \n                  \n                \n                |\n              \n            \n          \n        \n      \n    \n    {\\displaystyle V_{AV}=-{\\frac {1}{2\\left|x+{\\frac {a}{\\sqrt {2}}}\\right|}}-{\\frac {1}{2\\left|x-{\\frac {a}{\\sqrt {2}}}\\right|}}}\n  \n\n\n\nwill be the even function of \n  \n    \n      \n        x\n      \n    \n    {\\displaystyle x}\n  \n and therefore having the maximum at \n  \n    \n      \n        x\n        =\n        0\n      \n    \n    {\\displaystyle x=0}\n  \n while for that initial condition the solution will be \n  \n    \n      \n        x\n        (\n        t\n        )\n        =\n        0\n      \n    \n    {\\displaystyle x(t)=0}\n  \n in the K-H and  it  will be therefore identical to the free electron solution in the laboratory frame. The electron velocity on the other hand is phase shifted both to the field strength and to the electron position: \n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                d\n              \n              x\n            \n            \n              \n                d\n              \n              t\n            \n          \n        \n        =\n        −\n        \n          \n            F\n            ω\n          \n        \n        cos\n        ⁡\n        (\n        ω\n        t\n        )\n      \n    \n    {\\displaystyle {\\frac {\\mathrm {d} x}{\\mathrm {d} t}}=-{\\frac {F}{\\omega }}\\cos(\\omega t)}\n  \n\n\n\nTherefore, considering the wavelet pulses and defining the ionization as the full escape from the line segment of the length 2r (or from the spherical region in three dimensions) the full ionization happens in the classical model after the time \n  \n    \n      \n        r\n        \n          /\n        \n        (\n        a\n        ω\n        )\n      \n    \n    {\\displaystyle r/(a\\omega )}\n  \n or no ionization at all depending if the harmonic field wavelet is cut at the zero minimum or the maximum velocity.\n\n\nDissociation – distinction[edit]\n\nA substance may dissociate without necessarily producing ions. As an example, the molecules of table sugar dissociate in water (sugar is dissolved) but exist as intact neutral entities. Another subtle event is the dissociation of sodium chloride (table salt) into sodium and chlorine ions. Although it may seem as a case of ionization, in reality the ions already exist within the crystal lattice. When salt is dissociated, its constituent ions are simply surrounded by water molecules and their effects are visible (e.g. the solution becomes electrolytic). However, no transfer or displacement of electrons occurs. Actually, the chemical synthesis of salt involves ionization. This is a chemical reaction.\n\n\nSee also[edit]\n\n\tAbove threshold ionization\n\tIonization chamber – Instrument for detecting gaseous ionization, used in ionizing radiation measurements\n\tIon source\n\tPhotoionization\n\tThermal ionization\n\tElectron ionization\n\tChemical ionization\n\tTownsend avalanche – The chain reaction of ionization occurring in a gas with an applied electric field\n\n\n\nPhase transitions of matter (\n\tv\n\tt\n\te\n\n\n)\n\n\n\n\t\n\tTo\n\n\tSolid\n\tLiquid\n\tGas\n\tPlasma\n\n\tFrom\n\tSolid\n\t\n\tMelting\n\tSublimation\n\t\n\n\tLiquid\n\tFreezing\n\t\n\tVaporization\n\t\n\n\tGas\n\tDeposition\n\tCondensation\n\t\n\tIonization\n\n\tPlasma\n\t\n\t\n\tRecombination\n\t\n\n\n\nReferences[edit]\n\n\n\t^ IUPAC, Compendium of Chemical Terminology, 2nd ed. (the \"Gold Book\") (1997). Online corrected version:  (2006–) \"Ionization\". doi:10.1351/goldbook.I03183\n\n\t^ Schulz, Michael (2003). \"Three-Dimensional Imaging of Atomic Four-Body Processes\". Nature. 422 (6927): 48–51. Bibcode:2003Natur.422...48S. doi:10.1038/nature01415. PMID 12621427.\n\n\t^ IUPAC, Compendium of Chemical Terminology, 2nd ed. (the \"Gold Book\") (1997). Online corrected version:  (2006–) \"adiabatic ionization\". doi:10.1351/goldbook.A00143\n\n\t^ Glenn F Knoll. Radiation Detection and Measurement, third edition 2000. John Wiley and sons, \nISBN 0-471-07338-5\n\n\t^ Todd, J. F. J. (1991). \"Recommendations for Nomenclature and Symbolism for Mass Spectroscopy (including an appendix of terms used in vacuum technology)(IUPAC Recommendations 1991)\". Pure Appl. Chem. 63 (10): 1541–1566. doi:10.1351/pac199163101541.\n\n\n\t^ IUPAC, Compendium of Chemical Terminology, 2nd ed. (the \"Gold Book\") (1997). Online corrected version:  (2006–) \"ionization efficiency\". doi:10.1351/goldbook.I03196\n\n\t^ Keldysh, L. V. (1965). \"Ionization in the Field of a Strong Electromagnetic Wave\". Soviet Phys. JETP. 20 (5): 1307.\n\n\n\t^ Volkov D M 1934 Z. Phys. 94 250\n\n\t^ Perelomov, A. M.; Popov, V. S.; Terent'ev, M. V. (1966). \"Ionization of Atoms in an Alternating Electric Field\". Soviet Phys. JETP. 23 (5): 924. Bibcode:1966JETP...23..924P.\n\n\n\t^ Perelomov, A. M.; Popov, V. S.; Terent'ev, M. V. (1967). \"Ionization of Atoms in an Alternating Electric Field: II\". Soviet Phys. JETP. 24 (1): 207. Bibcode:1967JETP...24..207P.\n\n\n\t^ Larochelle, S.; Talebpour, A.; Chin, S. L. (1998). \"Coulomb effect in multiphoton ionization of rare-gas atoms\" (PDF). Journal of Physics B: Atomic, Molecular and Optical Physics. 31 (6): 1215. Bibcode:1998JPhB...31.1215L. doi:10.1088/0953-4075/31/6/009. Archived from the original (PDF) on November 21, 2014.\n\n\n\t^ Ammosov, M. V.; Delone, N. B.; Krainov, V. P. (1986). \"Tunnel ionization of complex atoms and of atomic ions in an alternating electromagnetic field\". Soviet Phys. JETP. 64 (6): 1191.\n\n\n\t^ Sharifi, S. M.; Talebpour, A; Yang, J.; Chin, S. L. (2010). \"Quasi-static tunnelling and multiphoton processes in the ionization of Ar and Xe using intense femtosecond laser pulses\". Journal of Physics B: Atomic, Molecular and Optical Physics. 43 (15): 155601. Bibcode:2010JPhB...43o5601S. doi:10.1088/0953-4075/43/15/155601. ISSN 0953-4075.\n\n\n\t^ Krainov, Vladimir P. (1997). \"Ionization rates and energy and angular distributions at the barrier-suppression ionization of complex atoms and atomic ions\". Journal of the Optical Society of America B. 14 (2): 425. Bibcode:1997JOSAB..14..425K. doi:10.1364/JOSAB.14.000425. ISSN 0740-3224.\n\n\n\t^ Faisal, F. H. M. (1973). \"Multiple absorption of laser photons by atoms\". Journal of Physics B: Atomic and Molecular Physics. 6 (4): L89–L92. Bibcode:1973JPhB....6L..89F. doi:10.1088/0022-3700/6/4/011. ISSN 0022-3700.\n\n\n\t^ Reiss, Howard (1980). \"Effect of an intense electromagnetic field on a weakly bound system\". Physical Review A. 22 (5): 1786–1813. Bibcode:1980PhRvA..22.1786R. doi:10.1103/PhysRevA.22.1786. ISSN 0556-2791.\n\n\n\t^ Story, J.; Duncan, D.; Gallagher, T. (1994). \"Landau-Zener treatment of intensity-tuned multiphoton resonances of potassium\". Physical Review A. 50 (2): 1607–1617. Bibcode:1994PhRvA..50.1607S. doi:10.1103/PhysRevA.50.1607. ISSN 1050-2947. PMID 9911054.\n\n\n\t^ De Boer, M.; Muller, H. (1992). \"Observation of large populations in excited states after short-pulse multiphoton ionization\". Physical Review Letters. 68 (18): 2747–2750. Bibcode:1992PhRvL..68.2747D. doi:10.1103/PhysRevLett.68.2747. PMID 10045482.\n\n\n\t^ Hioe, F. T.; Carrol, C. E. (1988). \"Coherent population trapping in N-level quantum systems\". Physical Review A. 37 (8): 3000–3005. Bibcode:1988PhRvA..37.3000H. doi:10.1103/PhysRevA.37.3000. PMID 9900034.\n\n\n\t^ Talebpour, A.; Chien, C. Y.; Chin, S. L. (1996). \"Population trapping in rare gases\". Journal of Physics B: Atomic, Molecular and Optical Physics. 29 (23): 5725. Bibcode:1996JPhB...29.5725T. doi:10.1088/0953-4075/29/23/015.\n\n\n\t^ Morishita, Toru; Lin, C. D. (2013). \"Photoelectron spectra and high Rydberg states of lithium generated by intense lasers in the over-the-barrier ionization regime\" (PDF). Physical Review A. 87 (6): 63405. Bibcode:2013PhRvA..87f3405M. doi:10.1103/PhysRevA.87.063405. hdl:2097/16373. ISSN 1050-2947.\n\n\n\t^ L’Huillier, A.; Lompre, L. A.; Mainfray, G.; Manus, C. (1983). \"Multiply charged ions induced by multiphoton absorption in rare gases at 0.53 μm\". Physical Review A. 27 (5): 2503. Bibcode:1983PhRvA..27.2503L. doi:10.1103/PhysRevA.27.2503.\n\n\n\t^ Augst, S.; Talebpour, A.; Chin, S. L.; Beaudoin, Y.; Chaker, M. (1995). \"Nonsequential triple ionization of argon atoms in a high-intensity laser field\". Physical Review A. 52 (2): R917–R919. Bibcode:1995PhRvA..52..917A. doi:10.1103/PhysRevA.52.R917. PMID 9912436.\n\n\n\t^ Larochelle, S.; Talebpour, A.; Chin, S. L. (1998). \"Non-sequential multiple ionization of rare gas atoms in a Ti:Sapphire laser field\". Journal of Physics B: Atomic, Molecular and Optical Physics. 31 (6): 1201. Bibcode:1998JPhB...31.1201L. doi:10.1088/0953-4075/31/6/008.\n\n\n\t^ Fittinghoff, D. N.; Bolton, P. R.; Chang, B.; Kulander, K. C. (1992). \"Observation of nonsequential double ionization of helium with optical tunneling\". Physical Review Letters. 69 (18): 2642–2645. Bibcode:1992PhRvL..69.2642F. doi:10.1103/PhysRevLett.69.2642. PMID 10046547.\n\n\n\t^ [1]Kuchiev, M. Yu (1987). \"Atomic antenna\". Soviet Phys. JETP Lett. 45: 404–406.\n\n\n\t^ Schafer, K. J.; Yang, B.; DiMauro, L.F.; Kulander, K.C. (1992). \"Above threshold ionization beyond the high harmonic cutoff\". Physical Review Letters. 70 (11): 1599–1602. Bibcode:1993PhRvL..70.1599S. doi:10.1103/PhysRevLett.70.1599. PMID 10053336.\n\n\n\t^ Corkum, P. B. (1993). \"Plasma perspective on strong field multiphoton ionization\". Physical Review Letters. 71 (13): 1994–1997. Bibcode:1993PhRvL..71.1994C. doi:10.1103/PhysRevLett.71.1994. PMID 10054556.\n\n\n\t^ Becker, Andreas; Faisal, Farhad H M (1996). \"Mechanism of laser-induced double ionization of helium\". Journal of Physics B: Atomic, Molecular and Optical Physics. 29 (6): L197–L202. Bibcode:1996JPhB...29L.197B. doi:10.1088/0953-4075/29/6/005. ISSN 0953-4075.\n\n\n\t^ [2]Faisal, F. H. M.; Becker, A. (1997). \"Nonsequential double ionization: Mechanism and model formula\". Laser Phys. 7: 684.\n\n\n\t^ Walker, B.; Sheehy, B.; Dimauro, L. F.; Agostini, P.; Schafer, K. J.; Kulander, K. C. (1994). \"Precision Measurement of Strong Field Double Ionization of Helium\". Physical Review Letters. 73 (9): 1227–1230. Bibcode:1994PhRvL..73.1227W. doi:10.1103/PhysRevLett.73.1227. PMID 10057657.\n\n\n\t^ Becker, A.; Faisal, F. H. M. (1999). \"S-matrix analysis of ionization yields of noble gas atoms at the focus of Ti:sapphire laser pulses\". Journal of Physics B: Atomic, Molecular and Optical Physics. 32 (14): L335. Bibcode:1999JPhB...32L.335B. doi:10.1088/0953-4075/32/14/101.\n\n\n\t^ Talebpour, A.; Bandrauk, A. D.; Yang, J; Chin, S. L. (1999). \"Multiphoton ionization of inner-valence electrons and fragmentation of ethylene in an intense Ti:sapphire laser pulse\" (PDF). Chemical Physics Letters. 313 (5–6): 789. Bibcode:1999CPL...313..789T. doi:10.1016/S0009-2614(99)01075-1. Archived from the original (PDF) on November 21, 2014.\n\n\n\t^ Talebpour, A; Bandrauk, A D; Vijayalakshmi, K; Chin, S L (2000). \"Dissociative ionization of benzene in intense ultra-fast laser pulses\". Journal of Physics B: Atomic, Molecular and Optical Physics. 33 (21): 4615. Bibcode:2000JPhB...33.4615T. doi:10.1088/0953-4075/33/21/307.\n\n\n\t^ Mehdi Sharifi, S.; Talebpour, A.; Chin, S. L. (2008). \"Ultra-fast laser pulses provide an ion source for highly selective mass spectroscopy\". Applied Physics B. 91 (3–4): 579. Bibcode:2008ApPhB..91..579M. doi:10.1007/s00340-008-3038-y.\n\n\n\t^ Peng, Jiahui; Puskas, Noah; Corkum, Paul B.; Rayner, David M.; Loboda, Alexandre V. (2012). \"High-Pressure Gas Phase Femtosecond Laser Ionization Mass Spectrometry\". Analytical Chemistry. 84 (13): 5633–5640. doi:10.1021/ac300743k. ISSN 0003-2700. PMID 22670784.\n\n\n\t^ Henneberger, Walther C. (1968). \"Perturbation method for atoms in intense laser beams\". Physical Review Letters. 21 (12): 838–841. Bibcode:1968PhRvL..21..838H. doi:10.1103/physrevlett.21.838.\n\n\n\t^ Mathur, D.; Dota, K.; Dharmadhikari, A.K.; Dharmadhikari, J.A. (2013). \"Carrier-envelope-phase effects in ultrafast strong-field ionization dynamics of multielectron systems: Xe and CS2\". Physical Review Letters. 110 (8): 083602–083605. arXiv:1301.3639. Bibcode:2013PhRvL.110h3602M. doi:10.1103/PhysRevLett.110.083602. PMID 23473143.\n\n\n\n\n\nExternal links[edit]\n\n\t The dictionary definition of ionization at Wiktionary\n\n\n\t\tv\n\tt\n\te\n\n\nStates of matter (list)\n\n\tState\t\n\tSolid\n\tLiquid\n\tGas / Vapor\n\tPlasma\n\n\n\n\t\n\n\tLow energy\t\n\tBose–Einstein condensate\n\tFermionic condensate\n\tDegenerate matter\n\tQuantum Hall\n\tRydberg matter\n\tRydberg polaron\n\tStrange matter\n\tSuperfluid\n\tSupersolid\n\tPhotonic matter\n\n\n\n\n\tHigh energy\t\n\tQCD matter\n\tLattice QCD\n\tQuark–gluon plasma\n\tColor-glass condensate\n\tSupercritical fluid\n\n\n\n\n\tOther states\t\n\tColloid\n\tGlass\n\tCrystal\n\tLiquid crystal\n\tTime crystal\n\tQuantum spin liquid\n\tExotic matter\n\tProgrammable matter\n\tDark matter\n\tAntimatter\n\tMagnetically ordered\n\tAntiferromagnet\n\tFerrimagnet\n\tFerromagnet\n\n\n\tString-net liquid\n\tSuperglass\n\n\n\n\n\tTransitions\t\n\tBoiling\n\tBoiling point\n\tCondensation\n\tCritical line\n\tCritical point\n\tCrystallization\n\tDeposition\n\tEvaporation\n\tFlash evaporation\n\tFreezing\n\tChemical ionization\n\tIonization\n\tLambda point\n\tMelting\n\tMelting point\n\tRecombination\n\tRegelation\n\tSaturated fluid\n\tSublimation\n\tSupercooling\n\tTriple point\n\tVaporization\n\tVitrification\n\n\n\n\n\tQuantities\t\n\tEnthalpy of fusion\n\tEnthalpy of sublimation\n\tEnthalpy of vaporization\n\tLatent heat\n\tLatent internal energy\n\tTrouton's ratio\n\tVolatility\n\n\n\n\n\tConcepts\t\n\tBaryonic matter\n\tBinodal\n\tCompressed fluid\n\tCooling curve\n\tEquation of state\n\tLeidenfrost effect\n\tMacroscopic quantum phenomena\n\tMpemba effect\n\tOrder and disorder (physics)\n\tSpinodal\n\tSuperconductivity\n\tSuperheated vapor\n\tSuperheating\n\tThermo-dielectric effect\n\n\n\n\n\n\n\n\tAuthority control \t\n\tNDL: 00561405\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Ionization&oldid=917994574\"\n\n\t\t\n\t\tCategories: \tIons\n\tMolecular physics\n\tAtomic physics\n\tPhysical chemistry\n\tQuantum chemistry\n\tMass spectrometry\n\tIonization\n\n\nHidden categories: \tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tAsturianu\n\tAzərbaycanca\n\tBân-lâm-gú\n\tБеларуская\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDavvisámegiella\n\tDeutsch\n\tEesti\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tInterlingua\n\tItaliano\n\tעברית\n\tქართული\n\tКыргызча\n\tLatviešu\n\tLietuvių\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tBahasa Melayu\n\tNederlands\n\tनेपाली\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tPiemontèis\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tSimple English\n\tSlovenčina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSvenska\n\tதமிழ்\n\tతెలుగు\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 26 September 2019, at 13:55 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "8", "dc:title": "Ionization - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-ionization", "title": "Ionization - Wikipedia"}}