{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLight-year - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\n\n\tLight-year\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tFor other uses, see Light year (disambiguation).\n\nUnit of length that light travels in one Earth year; equal to just under 10 trillion kilometres (or about 6 trillion miles)\n\n\tLight-year\n\tMap showing the stars that lie within 12.5 light-years of the Sun[1]\n\n\tGeneral information\n\tUnit system\tastronomy units\n\tUnit of\tlength\n\tSymbol\tly[2] \n\tConversions\n     \n\t1 ly[2] in ...\t... is equal to ...\n\t\n\n\t   metric (SI) units\t   9.4607×1015 m\n   9.4607 Pm\n\t   imperial & US units\t   5.8786×1012 mi\n\t   astronomical units\t   63241 au\n   0.3066 pc\n\n\nThe light-year is a unit of length used to express astronomical distances and measures about 9.46 trillion kilometres (9.46 x 1012 km) or 5.88 trillion miles (5.88 x 1012 mi).[note 1] As defined by the International Astronomical Union (IAU), a light-year is the distance that light travels in vacuum in one Julian year (365.25 days).[2] Because it includes the word \"year\", the term light-year is sometimes misinterpreted as a unit of time.\n\nThe light-year is most often used when expressing distances to stars and other distances on a galactic scale, especially in nonspecialist and popular science publications. The unit most commonly used in professional astrometry is the parsec (symbol: pc, about 3.26 light-years; the distance at which one astronomical unit subtends an angle of one second of arc).[2]\n\n\nContents\n\n\n\t1 Definitions\n\t2 History\n\t3 Usage of term\n\t4 Related units\n\t5 See also\n\t6 Notes\n\t7 References\n\t8 External links\n\n\n\n\n\nDefinitions[edit]\n\nAs defined by the IAU, the light-year is the product of the Julian year[note 2] (365.25 days as opposed to the 365.2425-day Gregorian year) and the speed of light (299792458 m/s).[note 3] Both of these values are included in the IAU (1976) System of Astronomical Constants, used since 1984.[4] From this, the following conversions can be derived. The IAU recognized abbreviation for light-year is ly,[2] although other standards like ISO 80000 use \"l.y.\"[5][6] and localized abbreviations are frequent, such as \"al\" in French (from année-lumière) and Spanish (from año luz), \"Lj\" in German (from Lichtjahr), etc.\n\n\n\t\t1 light-year  \n\t= 9460730472580800 metres (exactly)\n\n\t≈ 9.461 petametres\n\n\t≈ 9.461 trillion kilometres\n\n\t≈ 5.878625 trillion miles\n\n\t≈ 63241.077 astronomical units\n\n\t≈ 0.306601 parsecs\n\n\n\n\n\nBefore 1984, the tropical year (not the Julian year) and a measured (not defined) speed of light were included in the IAU (1964) System of Astronomical Constants, used from 1968 to 1983.[7] The product of Simon Newcomb's J1900.0 mean tropical year of 31556925.9747 ephemeris seconds and a speed of light of 299792.5 km/s produced a light-year of 9.460530×1015 m (rounded to the seven significant digits in the speed of light) found in several modern sources[8][9][10] was probably derived from an old source such as C. W. Allen's 1973 Astrophysical Quantities reference work,[11] which was updated in 2000, including the IAU (1976) value cited above (truncated to 10 significant digits).[12]\n\nOther high-precision values are not derived from a coherent IAU system. A value of 9.460536207×1015 m found in some modern sources[13][14] is the product of a mean Gregorian year (365.2425 days or 31556952 s) and the defined speed of light (299792458 m/s). Another value, 9.460528405×1015 m,[15][16] is the product of the J1900.0 mean tropical year and the defined speed of light.\n\nAbbreviations used for light years and multiples of light years are\n\n\n\t\"ly\" for one light year[2]\n\t\"kly\" for a kilolight-year (1,000 light years)[17]\n\t\"Mly\" for a megalight-year (1,000,000 light years)[18]\n\t\"Gly\" for a gigalight-year (1,000,000,000 light years)[19]\n\n\nHistory[edit]\n\nThe light-year unit appeared a few years after the first successful measurement of the distance to a star other than the Sun, by Friedrich Bessel in 1838. The star was 61 Cygni, and he used a 6.2-inch (160 mm) heliometer designed by Joseph von Fraunhofer. The largest unit for expressing distances across space at that time was the astronomical unit, equal to the radius of the Earth's orbit (1.50×108 km or 9.30×107 mi). In those terms, trigonometric calculations based on 61 Cygni's parallax of 0.314 arcseconds, showed the distance to the star to be 660000 astronomical units (9.9×1013 km or 6.1×1013 mi). Bessel added that light employs 10.3 years to traverse this distance.[20] He recognized that his readers would enjoy the mental picture of the approximate transit time for light, but he refrained from using the light-year as a unit. He may have resented expressing distances in light-years because it would deteriorate the accuracy of his parallax data due to multiplying with the uncertain parameter of the speed of light.\n\nThe speed of light was not yet precisely known in 1838; its value changed in 1849 (Fizeau) and 1862 (Foucault). It was not yet considered to be a fundamental constant of nature, and the propagation of light through the aether or space was still enigmatic.\n\nThe light-year unit appeared  in 1851 in a German popular astronomical article by Otto Ule.[21] The paradox of a distance unit name ending on \"year\" was explained by Ule by comparing it to a hiking road hour (Wegstunde).\n\nA contemporary German popular astronomical book also noticed that light-year is an odd name.[22] In 1868 an English journal labelled the light-year as a unit used by the Germans.[23] Eddington called the light-year an inconvenient and irrelevant unit, which had sometimes crept from popular use into technical investigations.[24]\n\nAlthough modern astronomers often prefer to use the parsec, light years are also popularly used to gauge the expanses of interstellar and intergalactic space.\n\n\nUsage of term[edit]\n\nDistances expressed in light-years include those between stars in the same general area, such as those belonging to the same spiral arm or globular cluster. Galaxies themselves span from a few thousand to a few hundred thousand light-years in diameter, and are separated from neighbouring galaxies and galaxy clusters by millions of light-years. Distances to objects such as quasars and the Sloan Great Wall run up into the billions of light-years.\n\n\nList of orders of magnitude for length\n\tScale (ly)\n\tValue\n\tItem\n\n\t10−9\n\t4.04×10−8 ly\n\tReflected sunlight from the Moon's surface takes 1.2–1.3 seconds to travel the distance to the Earth's surface (travelling roughly 350000 to 400000 kilometres).\n\n\t10−6\n\t1.58×10−5 ly\n\tOne astronomical unit (the distance from the Sun to the Earth). It takes approximately 499 seconds (8.32 minutes) for light to travel this distance.[25]\n\n\t1.27×10−4 ly\n\tThe Huygens probe lands on Titan off Saturn and transmits images from its surface, 1.2 billion kilometres from Earth.\n\n\t5.04×10−4 ly\n\tNew Horizons encounters Pluto at a distance of 4.7 billion kilometres, and the communication takes 4 hours 25 minutes to reach Earth.\n\n\t10−3\n\t2.04×10−3 ly\n\tThe most distant space probe, Voyager 1, was about 18 light-hours away from the Earth as of October 2014[update].[26] It will take about 17500 years to reach one light-year (1.0×100 ly) at its current speed of about 17 km/s (38000 mph) relative to the Sun. On September 12, 2013, NASA scientists announced that Voyager 1 had entered the interstellar medium of space on August 25, 2012, becoming the first manmade object to leave the Solar System.[27]\n\n\t2.28×10−3 ly\n\tVoyager 1 as of October 2018, nearly 20 light-hours from the Earth\n\n\t100\n\t1.6×100 ly\n\tThe Oort cloud is approximately two light-years in diameter. Its inner boundary is speculated to be at 50000 au, with its outer edge at 100000 au.\n\n\t2.0×100 ly\n\tMaximum extent of the Sun's gravitational dominance (Hill sphere/Roche sphere, 125000 au). Beyond this is the deep ex-solar gravitational interstellar medium.\n\n\t4.22×100 ly\n\tThe nearest known star (other than the Sun), Proxima Centauri, is about 4.22 light-years away.[28][29]\n\n\t8.6×100 ly\n\tSirius, the brightest star of the night sky. Twice as massive and 25 times more luminous than the Sun, it outshines more luminous stars due to its relative proximity.\n\n\t1.19×101 ly\n\tHD 10700 e, an extrasolar candidate for a habitable planet. 6.6 times as massive as the earth, it is in the middle of the habitable zone of star Tau Ceti.[30][31]\n\n\t2.05×101 ly\n\tGliese 581, a red-dwarf star with several detectable exoplanets.\n\n\t3.1×102 ly\n\tCanopus, second in brightness in the terrestrial sky only to Sirius, a type A9 bright giant 10700 times more luminous than the Sun.\n\n\t103\n\t3×103 ly\n\tA0620-00, the nearest known black hole, is about 3000 light-years away.\n\n\t2.6×104 ly\n\tThe centre of the Milky Way is about 26000 light-years away.[32][33]\n\n\t1×105 ly\n\tThe Milky Way is about 100000 light-years across.\n\n\t1.65×105 ly\n\tR136a1, in the Large Magellanic Cloud, the most luminous star known at 8.7 million times the luminosity of the Sun, has an apparent magnitude 12.77, just brighter than 3C 273.\n\n\t106\n\t2.5×106 ly\n\tThe Andromeda Galaxy is approximately 2.5 million light-years away.\n\n\t3×106 ly\n\tThe Triangulum Galaxy (M33), at about 3 million light-years away, is the most distant object visible to the naked eye.\n\n\t5.9×107 ly\n\tThe nearest large galaxy cluster, the Virgo Cluster, is about 59 million light-years away.\n\n\t1.5×108 – 2.5×108 ly\n\tThe Great Attractor lies at a distance of somewhere between 150 and 250 million light-years (the latter being the most recent estimate).\n\n\t109\n\t1.2×109 ly\n\tThe Sloan Great Wall (not to be confused with Great Wall and Her–CrB GW) has been measured to be approximately one billion light-years distant.\n\n\t2.4×109 ly\n\t3C 273, optically the brightest quasar, of apparent magnitude 12.9, just dimmer than R136a1. 3C 273 is about 2.4 billion light-years away.\n\n\t4.57×1010 ly\n\tThe comoving distance from the Earth to the edge of the visible universe is about 45.7 billion light-years in any direction; this is the comoving radius of the observable universe. This is larger than the age of the universe dictated by the cosmic background radiation; see here for why this is possible.\n\n\n\nRelated units[edit]\n\nDistances between objects within a star system tend to be small fractions of a light year, and are usually expressed in astronomical units. However, smaller units of length can similarly be formed usefully by multiplying units of time by the speed of light. For example, the light-second, useful in astronomy, telecommunications and relativistic physics, is exactly 299792458 metres or ​1⁄31557600 of a light-year. Units such as the light-minute, light-hour and light-day are sometimes used in popular science publications. The light-month, roughly one-twelfth of a light-year, is also used occasionally for approximate measures.[34][35] The Hayden Planetarium specifies the light month more precisely as 30 days of light travel time.[36]\n\nLight travels approximately one foot in a nanosecond; the term \"light-foot\" is sometimes used as an informal measure of time.[37]\n\n\nSee also[edit]\n\n\t1 petametre (examples of distances on the order of one light-year)\n\tDistance measures (cosmology)\n\tEinstein protocol\n\tHubble length\n\tOrders of magnitude (length)\n\tSpeed of light\n\n\nNotes[edit]\n\n\n\t^ One trillion here is taken to be 1012 (one million million, or billion in long scale).\n\n\t^ One Julian year is of exactly 365.25 days (or 31557600 s based on a day of exactly 86400 SI seconds)[3]\n\n\t^ The speed of light is precisely 299792458 m/s by definition of the metre.\n\n\n\n\n\nReferences[edit]\n\n\n\t^ The Universe within 12.5 Light Years: The Nearest Stars\n\n\t^ a b c d e International Astronomical Union, Measuring the Universe: The IAU and Astronomical Units, retrieved 10 November 2013\n\n\t^ IAU Recommendations concerning Units, archived from the original on 2007-02-16\n\n\n\t^ \"Selected Astronomical Constants\" in Astronomical Almanac, p. 6.\n\n\t^ ISO 80000-3:2006 Quantities and Units – Space and Time\n\n\t^ IEEE/ASTM SI 10-2010, American National Standard for Metric Practice\n\n\t^ P. Kenneth Seidelmann, ed. (1992), Explanatory Supplement to the Astronomical Almanac, Mill Valley, California: University Science Books, p. 656, ISBN 978-0-935702-68-2\n\n\n\t^ Basic Constants, Sierra College\n\n\n\t^ Marc Sauvage, Table of astronomical constants, archived from the original on 2008-12-11\n\n\n\t^ Robert A. Braeunig, Basic Constants\n\n\n\t^ C. W. Allen (1973), Astrophysical Quantities (third ed.), London: Athlone, p. 16, ISBN 978-0-485-11150-7\n\n\n\t^ Arthur N. Cox, ed. (2000), Allen's Astrophysical Quantities (fourth ed.), New York: Springer-Valeg, p. 12, ISBN 978-0-387-98746-0\n\n\n\t^ Nick Strobel, Astronomical Constants\n\n\n\t^ KEKB, Astronomical Constants\n\n\n\t^ Thomas Szirtes (1997), Applied dimensional analysis and modeling, New York: McGraw-Hill, p. 60, ISBN 9780070628113\n\n\n\t^ Sun, Moon, and Earth: Light-year\n\n\n\t^ Comins, Neil F. (2013), Discovering the Essential Universe (fifth ed.), W. H. Freeman, p. 365, ISBN 978-1-4292-5519-6\n\n\n\t^ Hassani, Sadri (2010), From Atoms to Galaxies, CRC Press, p. 445, ISBN 978-1-4398-0850-4\n\n\n\t^ Deza, Michel Marie; Deza, Elena (2016), Encyclopedia of Distances (fourth ed.), Springer, p. 620, ISBN 978-3-662-52843-3\n\n\n\t^ Bessel, Friedrich (1839). \"On the parallax of the star 61 Cygni\". London and Edinburgh Philosophical Magazine and Journal of Science. 14: 68–72.\n Bessel's statement that light employs 10.3 years to traverse the distance.\n\n\t^ Ule, Otto (1851). \"Was wir in den Sternen lesen\". Deutsches Museum: Zeitschrift für Literatur, Kunst und Öffentliches Leben. 1: 721–738.\n\n\n\t^ Diesterweg, Adolph Wilhelm (1855). Populäre Himmelskunde u. astronomische Geographie. p. 250.\n\n\n\t^ The Student and Intellectual Observer of Science, Literature and Art. 1868.\n\n\n\t^ \"Stellar movements and the structure of the universe\". Retrieved 1 November 2014.\n\n\n\t^ \"Chapter 1, Table 1-1\", IERS Conventions (2003)\n\n\n\t^ WHERE ARE THE VOYAGERS?, retrieved 14 October 2014\n\n\n\t^ NASA Spacecraft Embarks on Historic Journey Into Interstellar Space, retrieved 14 October 2014\n\n\n\t^ NASA, Cosmic Distance Scales – The Nearest Star\n\n\n\t^ \"Proxima Centauri (Gliese 551)\", Encyclopedia of Astrobiology, Astronomy, and Spaceflight\n\n\n\t^ \"Tau Ceti's planets nearest around single, Sun-like star\". BBC News. 19 December 2012. Retrieved 1 November 2014.\n\n\n\t^ Tuomi, Mikko; Jones, Hugh R. A.; Jenkins, James S.; Tinney, Chris G.; Butler, R. Paul; Vogt, Steve S.; Barnes, John R.; Wittenmyer, Robert A.; O'Toole, Simon; Horner, Jonathan; Bailey, Jeremy; Carter, Brad D.; Wright, Duncan J.; Salter, Graeme S.; Pinfield, David (March 2013). \"Signals embedded in the radial velocity noise: periodic variations in the τ Ceti velocities\" (PDF). Astronomy & Astrophysics. 551: A79. arXiv:1212.4277. Bibcode:2013A&A...551A..79T. doi:10.1051/0004-6361/201220509.\n\n\n\t^ Eisenhauer, F.; Schdel, R.; Genzel, R.; Ott, T.; Tecza, M.; Abuter, R.; Eckart, A.; Alexander, T. (2003), \"A Geometric Determination of the Distance to the Galactic Center\", The Astrophysical Journal, 597 (2): L121, arXiv:astro-ph/0306220, Bibcode:2003ApJ...597L.121E, doi:10.1086/380188\n\n\n\t^ McNamara, D. H.; Madsen, J. B.; Barnes, J.; Ericksen, B. F. (2000), \"The Distance to the Galactic Center\", Publications of the Astronomical Society of the Pacific, 112 (768): 202, Bibcode:2000PASP..112..202M, doi:10.1086/316512\n\n\n\t^ Fujisawa, K.; Inoue, M.; Kobayashi, H.; Murata, Y.; Wajima, K.; Kameno, S.; Edwards, P. G.; Hirabayashi, H.; Morimoto, M. (2000), \"Large Angle Bending of the Light-Month Jet in Centaurus A\", Publications of the Astronomical Society of Japan, 52 (6): 1021–26, Bibcode:2000PASJ...52.1021F, doi:10.1093/pasj/52.6.1021, archived from the original on 2009-09-02\n\n\n\t^ Junor, W.; Biretta, J. A. (1994), \"The Inner Light-Month of the M87 Jet\",  in Zensus, J. Anton; Kellermann; Kenneth I. (eds.), Compact Extragalactic Radio Sources, Proceedings of the NRAO workshop held at Socorro, New Mexico, February 11–12, 1994, Green Bank, WV: National Radio Astronomy Observatory (NRAO), p. 97, Bibcode:1994cers.conf...97J\n\n\n\t^ Light-Travel Time and Distance by the Hayden Planetarium Accessed October 2010.\n\n\t^ \nDavid Mermin (2009). It's About Time: Understanding Einstein's Relativity. Princeton, New Jersey: Princeton University Press. p. 22. ISBN 978-0-691-14127-5.\n\n\n\n\n\n\nExternal links[edit]\n\nListen to this article (info/dl)\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis audio file was created from a revision of the article \"Light-year\" dated 27 June 2005, and does not reflect subsequent edits to the article. (Audio help)\n\nMore spoken articles\n\n\n\n\t The dictionary definition of light-year at Wiktionary\n\n\n\t\tv\n\tt\n\te\n\n\nUnits of length used in Astronomy\n\n\t\n\tAstronomical system of units\n\n\n\n\n\t\n\tEarth radius (R⊕ or RE)\n\tLight-second (ls)\n\tSolar radius (R☉)\n\tgigametre (Gm)\n\tAstronomical unit (au)\n\tterametre (Tm)\n\tlight-year (ly)\n\tparsec (pc)\n\tkiloparsec (kpc)\n\tmegaparsec (Mpc)\n\tgigaparsec (Gpc)\n\n\n\n\n\t\n\tSee also\n\tCosmic distance ladder\n\tOrders of magnitude (length)\n\tConversion of units\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Light-year&oldid=915186035\"\n\n\t\t\n\t\tCategories: \tSpoken articles\n\tLight\n\tUnits of length\n\tUnits of measurement in astronomy\n\t1838 in science\n\n\nHidden categories: \tArticles with short description\n\tPages using deprecated image syntax\n\tArticles containing potentially dated statements from October 2014\n\tAll articles containing potentially dated statements\n\tArticles with hAudio microformats\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tአማርኛ\n\tÆnglisc\n\tالعربية\n\tAragonés\n\tঅসমীয়া\n\tAsturianu\n\tAzərbaycanca\n\tتۆرکجه\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tभोजपुरी\n\tБългарски\n\tBosanski\n\tBrezhoneg\n\tCatalà\n\tČeština\n\tChi-Chewa\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEmiliàn e rumagnòl\n\tEspañol\n\tEsperanto\n\tEstremeñu\n\tEuskara\n\tفارسی\n\tFiji Hindi\n\tFrançais\n\tFrysk\n\tGaeilge\n\tGalego\n\t贛語\n\tગુજરાતી\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tInterlingua\n\tÍslenska\n\tItaliano\n\tעברית\n\tJawa\n\tKabɩyɛ\n\tಕನ್ನಡ\n\tქართული\n\tҚазақша\n\tKiswahili\n\tKreyòl ayisyen\n\tKurdî\n\tКыргызча\n\tລາວ\n\tLatina\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tLigure\n\tLimburgs\n\tLingua Franca Nova\n\tLumbaart\n\tMagyar\n\tМакедонски\n\tMalagasy\n\tമലയാളം\n\tMalti\n\tमराठी\n\tمصرى\n\tBahasa Melayu\n\tМонгол\n\tမြန်မာဘာသာ\n\tNāhuatl\n\tNederlands\n\tनेपाली\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tଓଡ଼ିଆ\n\tOromoo\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tភាសាខ្មែរ\n\tPiemontèis\n\tPlattdüütsch\n\tPolski\n\tPortuguês\n\tRomână\n\tRuna Simi\n\tРусиньскый\n\tРусский\n\tСаха тыла\n\tसंस्कृतम्\n\tSardu\n\tScots\n\tSeeltersk\n\tShqip\n\tSicilianu\n\tSimple English\n\tسنڌي\n\tSlovenčina\n\tSlovenščina\n\tSoomaaliga\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tTaqbaylit\n\tТатарча/tatarça\n\tతెలుగు\n\tไทย\n\tTürkçe\n\tTürkmençe\n\tУдмурт\n\tУкраїнська\n\tاردو\n\tVèneto\n\tTiếng Việt\n\tVolapük\n\t文言\n\tWinaray\n\t吴语\n\tייִדיש\n\t粵語\n\tZazaki\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 11 September 2019, at 18:40 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "15", "dc:title": "Light-year - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/d/d3/12lightyears.gif", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-light-year", "title": "Light-year - Wikipedia"}}