{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMagnetic sail - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tMagnetic sail\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tNot to be confused with electric sail or photon sail.\n\nA magnetic sail or magsail is a proposed method of spacecraft propulsion which would use a static magnetic field to deflect charged particles radiated by the Sun as a plasma wind, and thus impart momentum to accelerate the spacecraft.[1][2]   A magnetic sail could also thrust directly against planetary and solar magnetospheres.\n\n\nContents\n\n\n\t1 History\n\t2 Principles of operation and design\n\t2.1 Solar wind example\n\n\n\n\t3 Mini-magnetospheric plasma propulsion (M2P2)\n\t4 Modes of operation\n\t4.1 In a plasma wind\n\t4.2 Inside a planetary magnetosphere\n\t4.3 Interstellar travel\n\n\n\n\t5 Theory in the limit of small plasma densities\n\t5.1 Effective reflection area\n\t5.2 Explicit solution\n\t5.3 Mission profiles\n\n\n\n\t6 Fictional uses in popular culture\n\t7 See also\n\t8 References\n\t9 External links\n\n\n\n\n\nHistory[edit]\n\nThe magnetic sail was proposed by Dana Andrews and Robert Zubrin working in collaboration in 1988. At that time, Andrews was working on a concept to use a magnetic scoop to gather ions to provide propellant for a nuclear electric ion drive spacecraft, allowing the craft to operate in the same manner of a Bussard ramjet, but without the need for a proton-proton fusion propulsion drive. He asked Zubrin to help him compute the drag that the magnetic scoop would create against the interplanetary medium. Zubrin agreed, but found that the drag created by the scoop would be much greater than the thrust created by the ion drive. He therefore proposed that the ion drive component of the system be dropped, and the device simply used as a sail. Andrews agreed, and the magsail was born. The two then proceeded to elaborate their analysis of the magsail for interplanetary, interstellar, and planetary orbital propulsion in a series of papers published from 1988 through the 1990s.\n\n\nPrinciples of operation and design[edit]\n\nThe magsail operates by creating drag against the local medium (planet's magnetic field, solar wind, or interstellar winds), thereby allowing a spacecraft accelerated to very high velocities by other means, such as a fusion rocket or laser pushed lightsail, to slow down – even from relativistic velocities – without requiring the use of onboard propellant. It can thus reduce the delta-V propulsion required for an interstellar mission by a factor of two. This capability is the most unusual feature of the magsail, and perhaps the most significant in the long term.\n\nIn typical magnetic sail designs, the magnetic field is generated by a loop of superconducting wire. Because loops of current-carrying conductors tend to be forced outwards towards a circular shape by their own magnetic field, the sail could be deployed simply by unspooling the conductor and applying a current through it.\n\n\nSolar wind example[edit]\n\nThe solar wind is a continuous stream of plasma that flows outwards from the Sun: near the Earth's orbit, it contains several million protons and electrons per cubic meter and flows at 400 to 600 km/s (250 to 370 mi/s). The magnetic sail introduces a magnetic field into this plasma flow which can deflect the particles from their original trajectory: the momentum of the particles is then transferred to the sail, leading to a thrust on the sail. One advantage of magnetic or solar sails over (chemical or ion) reaction thrusters is that no reaction mass is depleted or carried in the craft.\n\nFor a sail in the solar wind one AU away from the Sun, the field strength required to resist the dynamic pressure of the solar wind is 50 nT. Zubrin's proposed magnetic sail design would create a bubble of space of 100 km in diameter (62 mi) where solar-wind ions are substantially deflected using a hoop 50 km (31 mi) in radius. The minimum mass of such a coil is constrained by material strength limitations at roughly 40 tonnes (44 tons) and it would generate 70 N (16 lbf) of thrust,[3] giving a mass/thrust ratio of 600 kg/N. If operated within the solar system, high temperature superconducting wire would be required to make the magsail practical. If operated in interstellar space conventional superconductors would be adequate.\n\nThe operation of magnetic sails using plasma wind is analogous to the operation of solar sails using the radiation pressure of photons emitted by the Sun. Although solar wind particles have rest mass and photons do not, sunlight has thousands of times more momentum than the solar wind. Therefore, a magnetic sail must deflect a proportionally larger area of the solar wind than a comparable solar sail to generate the same amount of thrust. However, it need not be as massive as a solar sail because the solar wind is deflected by a magnetic field instead of a large physical sail. Conventional materials for solar sails weigh around 7 g/m2 (0.0014 lb/sq ft), giving a thrust of 0.01 mPa (1.5×10−9 psi) at 1 AU (150,000,000 km; 93,000,000 mi). This gives a mass/thrust ratio of at least 700 kg/N, similar to a magnetic sail, neglecting other structural components.\n\nThe solar and magnetic sails have a thrust that falls off as the square of the distance from the Sun.\n\nWhen close to a planet with a strong magnetosphere such as Earth or a gas giant, the magnetic sail could generate more thrust by interacting with the magnetosphere instead of the solar wind, and may therefore be more efficient.\n\n\nMini-magnetospheric plasma propulsion (M2P2)[edit]\n\nIn order to reduce the size and weight of the magnet of the magnetic sail, it may be possible to inflate the magnetic field using a plasma in the same way that the plasma around the Earth stretches out the Earth's magnetic field in the magnetosphere. In this approach, called mini-magnetospheric plasma propulsion (M2P2), currents that run through the plasma will augment and partially replace the currents in the coil. This is expected to be especially useful far from the Sun, where the increased effective size of a M2P2 sail compensates for the reduced dynamic pressure of the solar wind. The original NASA design[4] proposes a spacecraft containing a can-shaped electromagnet into which a plasma is injected. The plasma pressure stretches the magnetic field and inflates a bubble of plasma around the spacecraft. The plasma then generates a kind of miniaturized magnetosphere around the spacecraft, analogous to the magnetosphere that surrounds the Earth. The protons and electrons which make up the solar wind are deflected by this magnetosphere and the reaction accelerates the spacecraft. The thrust of the M2P2 device would be steerable to some extent, potentially allowing the spacecraft to 'tack' into the solar wind and allowing efficient changes of orbit.\n\nIn the case of the (M2P2) system the spacecraft releases gas to create the plasma needed to maintain the somewhat leaky plasma bubble. The M2P2 system therefore has an effective specific impulse which is the amount of gas consumed per newton second of thrust. This is a figure of merit usually used for rockets, where the fuel is actually reaction mass. Robert Winglee, who originally proposed the M2P2 technique, calculates a specific impulse of 200 kN·s/kg (roughly 50 times better than the space shuttle main engine). These calculations suggest that the system requires on the order of a kilowatt of power per newton of thrust, considerably lower than electric thrusters, and that the system generates the same thrust anywhere within the heliopause because the sail spreads automatically as the solar wind becomes less dense. However, this technique is less understood than the simpler magnetic sail and issues of how large and heavy the magnetic coil would have to be[3][5] or whether the momentum from the solar wind can be efficiently transferred to the spacecraft[6] are under dispute.\n\nThe expansion of the magnetic field using plasma injected has been successfully tested in a large vacuum chamber on Earth, but the development of thrust was not part of the experiment. A beam-powered variant, MagBeam,[7] is also under development.\n\n\nModes of operation[edit]\n\n  \nA magnetic sail in a wind of charged particles. The sail generates a magnetic field, represented by red arrows, which deflects the particles to the left. The force on the sail is opposite.\n\n\n\nIn a plasma wind[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (January 2016) (Learn how and when to remove this template message)\n\n\n\nWhen operating away from planetary magnetospheres, a magnetic sail would force the positively charged protons of the solar wind to curve as they passed through the magnetic field.  The change of momentum of the protons would thrust against the magnetic field, and thus against the field coil.\n\nJust as with solar sails, magnetic sails can \"tack\". If a magnetic sail orients at an angle relative to the solar wind, charged particles are deflected preferentially to one side and the magnetic sail is pushed laterally. This means that magnetic sails could maneuver to most orbits.\n\nIn this mode, the amount of thrust generated by a magnetic sail falls off with the square of its distance from the Sun as the flux density of charged particles reduces.  Solar weather also has major effects on the sail.  It is possible that the plasma eruption from a severe solar flare could damage  an efficient, fragile sail.\n\nA common misconception is that a magnetic sail cannot exceed the speed of the plasma pushing it.  As the speed of a magnetic sail increases, its acceleration becomes more dependent on its ability to tack efficiently.  At high speeds, the plasma wind's direction will seem to come increasingly from the front of the spacecraft.  Advanced sailing spacecraft might deploy field coils as \"keels\", so the spacecraft could use the difference in vector between the solar magnetic field and the solar wind, much as sailing yachts do.\n\n\nInside a planetary magnetosphere[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (December 2018) (Learn how and when to remove this template message)\n\n\n\n  \nA magnetic sail in a spatially varying magnetic field. Because the vertical external field Bext is stronger on one side than the other, the leftward force on the left side of the ring is smaller than the rightward force on the right side of the ring, and the net force on the sail is to the right.\n\n\n\nInside a planetary magnetosphere, a magnetic sail can thrust against a planet's magnetic field, especially in an orbit that passes over the planet's magnetic poles, in a similar manner to an electrodynamic tether.\n\nThe range of maneuvers available to a magnetic sail inside a planetary magnetosphere are more limited than in a plasma wind. Just as with the more familiar small-scale magnets used on Earth, a magnetic sail can only be attracted towards the magnetosphere's poles or repelled from them, depending on its orientation.\n\nWhen the magnetic sail's field is oriented in the opposite direction to the magnetosphere it experiences a force inward and toward the nearest pole, and when it is oriented in the same direction as the magnetosphere it experiences the opposite effect. A magnetic sail oriented in the same direction as the magnetosphere is not stable, and will have to prevent itself from being flipped over to the opposite orientation by some other means.\n\nThe thrust that a magnetic sail delivers within a magnetosphere decreases with the fourth power of its distance from the planet's internal magnetic dynamo.\n\nThis limited maneuvering capability is still quite useful. By varying the magnetic sail's field strength over the course of its orbit, a magnetic sail can give itself a \"perigee kick\" raising the altitude of its orbit's apogee.\n\nRepeating this process with each orbit can drive the magnetic sail's apogee higher and higher, until the magnetic sail is able to leave the planetary magnetosphere and catch the solar wind. The same process in reverse can be used to lower or circularize the apogee of a magsail's orbit when it arrives at a destination planet.\n\nIn theory, it is possible for a magnetic sail to launch directly from the surface of a planet near one of its magnetic poles, repelling itself from the planet's magnetic field. However, this requires the magnetic sail to be maintained in its \"unstable\" orientation.  A launch from Earth requires superconductors with 80 times the current density of the best known high-temperature superconductors.\n\n\nInterstellar travel[edit]\n\nInterstellar space contains very small amounts of hydrogen. A fast-moving sail would ionize this hydrogen by accelerating the electrons in one direction and the oppositely charged protons in the other direction. The energy for the ionization and cyclotron radiation would come from the spacecraft's kinetic energy, slowing the spacecraft. The cyclotron radiation from the acceleration of particles would be an easily detected howl in radio frequencies. In a paper published in 1995, \"Detecting Extraterrestrial Civilizations via the Spectral Signatures of Advanced Interstellar Spacecraft\", Zubrin suggested that such radiation could be used as a means of detecting advanced extraterrestrial civilizations.\n\nThus, in interstellar spaceflight outside the heliopause of a star a magnetic sail could act as a parachute to decelerate a spacecraft.  This removes any fuel requirements for the deceleration half of an interstellar journey, which would benefit interstellar travel enormously.  The magsail was first proposed for this purpose in 1988 by Robert Zubrin and Dana Andrews, predating other uses, and evolved from a concept of the Bussard ramjet which used a magnetic scoop to collect interstellar material. More recently a combination of magnetic sail and electric sail was proposed by Perakis and Hein.[8] The magnetic sail is used for deceleration from higher velocities and the electric sail at lower velocities. The simulation shows a considerable mass saving for the combined system.\n\nMagnetic sails could also be used with beam-powered propulsion by using a high-power particle accelerator to fire a beam of charged particles at the spacecraft.[9] The magsail would deflect this beam, transferring momentum to the vehicle. This would provide much higher acceleration than a solar sail driven by a laser, but a charged particle beam would disperse in a shorter distance than a laser due to the electrostatic repulsion of its component particles.  This dispersion problem could potentially be resolved by accelerating a stream of sails which then in turn transfer their momentum to a magsail vehicle, as proposed by Jordin Kare.\n\n\nTheory in the limit of small plasma densities[edit]\n\nA magnetic sail of an interstellar craft needs to brake from\nthe protons of the interstellar medium. The density \n  \n    \n      \n        \n          n\n          \n            p\n          \n        \n      \n    \n    {\\displaystyle n_{p}}\n  \n\nof protons is very low, of the order of 0.3 atoms per cubic\ncentimeter for the Local Interstellar Cloud, which reaches up\nto a distance of 30 light years from the sun, and\nof the order for \n  \n    \n      \n        \n          n\n          \n            p\n          \n        \n        ≈\n        0.05\n        \n        \n          /\n        \n        \n          \n            \n              cm\n            \n          \n          \n            3\n          \n        \n      \n    \n    {\\displaystyle n_{p}\\approx 0.05\\,/{\\mbox{cm}}^{3}}\n  \n for the surrounding\nLocal Bubble. A bow shock can\nbe neglected in the limit of small plasma densities. A spacecraft\nwith an overall mass \n  \n    \n      \n        \n          m\n          \n            t\n            o\n            t\n          \n        \n      \n    \n    {\\displaystyle m_{tot}}\n  \n then changes its velocity\n\n  \n    \n      \n        v\n      \n    \n    {\\displaystyle v}\n  \n via\n\n\n\t\n  \n    \n      \n        \n          m\n          \n            t\n            o\n            t\n          \n        \n        \n          \n            \n              v\n              ˙\n            \n          \n        \n        =\n        −\n        \n          (\n          \n            A\n            (\n            v\n            )\n            \n              n\n              \n                p\n              \n            \n            v\n          \n          )\n        \n        (\n        2\n        \n          m\n          \n            p\n          \n        \n        v\n        )\n        ,\n      \n    \n    {\\displaystyle m_{tot}{\\dot {v}}=-\\left(A(v)n_{p}v\\right)(2m_{p}v),}\n  \n\n\n\nwhere \n  \n    \n      \n        \n          m\n          \n            p\n          \n        \n      \n    \n    {\\displaystyle m_{p}}\n  \n is the proton mass and \n  \n    \n      \n        A\n        (\n        v\n        )\n      \n    \n    {\\displaystyle A(v)}\n  \n\nthe effective reflection area.[10]\nThe number of protons reflected per second is\n\n  \n    \n      \n        A\n        (\n        v\n        )\n        \n          n\n          \n            p\n          \n        \n        v\n      \n    \n    {\\displaystyle A(v)n_{p}v}\n  \n, with every impacting\nproton transferring a momentum of \n  \n    \n      \n        2\n        \n          m\n          \n            p\n          \n        \n        v\n      \n    \n    {\\displaystyle 2m_{p}v}\n  \n to the craft.\nOverall momentum is conserved.\n\n\nEffective reflection area[edit]\n\nThe effective reflection area \n  \n    \n      \n        A\n        (\n        v\n        )\n      \n    \n    {\\displaystyle A(v)}\n  \n must be determined\nnumerically by evaluating the trajectories of the impacting protons\nwithin the magnetic field generated by the superconducting\nloop. The German Physicist Claudius Gros found that the\neffective reflection area can be approximated, for a magnetic sail\nin the axial configuration, to a high precision\nby.[10]\n\n\n\t\n  \n    \n      \n        A\n        (\n        v\n        )\n        =\n        0.081\n        π\n        \n          R\n          \n            2\n          \n        \n        \n          \n            [\n            \n              log\n              ⁡\n              \n                (\n                \n                  \n                    \n                      c\n                      I\n                    \n                    \n                      v\n                      \n                        I\n                        \n                          c\n                        \n                      \n                    \n                  \n                \n                )\n              \n            \n            ]\n          \n          \n            3\n          \n        \n        ,\n      \n    \n    {\\displaystyle A(v)=0.081\\pi R^{2}\\left[\\log \\left({\\frac {cI}{vI_{c}}}\\right)\\right]^{3},}\n  \n\n\n\nwhere \n  \n    \n      \n        π\n        \n          R\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle \\pi R^{2}}\n  \n is the area enclosed by the\ncurrent carrying loop, \n  \n    \n      \n        c\n      \n    \n    {\\displaystyle c}\n  \n the speed of light,\n\n  \n    \n      \n        I\n      \n    \n    {\\displaystyle I}\n  \n the current through the loop and\n\n  \n    \n      \n        \n          I\n          \n            c\n          \n        \n        =\n        1.55\n        ⋅\n        \n          10\n          \n            6\n          \n        \n        \n        \n          \n            Ampere\n          \n        \n      \n    \n    {\\displaystyle I_{c}=1.55\\cdot 10^{6}\\,{\\mbox{Ampere}}}\n  \n a critical\ncurrent. Protons are not reflected at all if \n  \n    \n      \n        v\n        >\n        c\n        (\n        I\n        \n          /\n        \n        \n          I\n          \n            c\n          \n        \n        )\n      \n    \n    {\\displaystyle v>c(I/I_{c})}\n  \n.\n\n\nExplicit solution[edit]\n\nThe analytic expression for the effective reflection area\n\n  \n    \n      \n        A\n        (\n        v\n        )\n      \n    \n    {\\displaystyle A(v)}\n  \n allows for an explicit solution of the\nequation of motion \n  \n    \n      \n        \n          m\n          \n            t\n            o\n            t\n          \n        \n        \n          \n            \n              v\n              ˙\n            \n          \n        \n        =\n        −\n        2\n        A\n        (\n        v\n        )\n        \n          n\n          \n            p\n          \n        \n        \n          m\n          \n            p\n          \n        \n        \n          v\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle m_{tot}{\\dot {v}}=-2A(v)n_{p}m_{p}v^{2}}\n  \n.\nThe result is that the velocity drops to\nzero at a distance \n  \n    \n      \n        \n          x\n          \n            m\n            a\n            x\n          \n        \n      \n    \n    {\\displaystyle x_{max}}\n  \n. Minimizing\nthe stopping distance \n  \n    \n      \n        \n          x\n          \n            m\n            a\n            x\n          \n        \n      \n    \n    {\\displaystyle x_{max}}\n  \n for a given\nmass \n  \n    \n      \n        \n          m\n          \n            t\n            o\n            t\n          \n        \n      \n    \n    {\\displaystyle m_{tot}}\n  \n of the craft one finds\n\n\n\t\n  \n    \n      \n        \n          x\n          \n            m\n            a\n            x\n          \n        \n        =\n        \n          \n            3.1\n            \n              \n                m\n                \n                  p\n                \n              \n              \n                n\n                \n                  p\n                \n              \n            \n          \n        \n        \n        \n          \n            \n              m\n              \n                t\n                o\n                t\n              \n            \n            \n              π\n              \n                R\n                \n                  2\n                \n              \n            \n          \n        \n        .\n      \n    \n    {\\displaystyle x_{max}={\\frac {3.1}{m_{p}n_{p}}}\\,{\\frac {m_{tot}}{\\pi R^{2}}}.}\n  \n\n\n\nThe velocity \n  \n    \n      \n        v\n      \n    \n    {\\displaystyle v}\n  \n of a craft starting to\nbrake with an initial velocity \n  \n    \n      \n        \n          v\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle v_{0}}\n  \n is\ngiven via\n\n\n\t\n  \n    \n      \n        v\n        (\n        x\n        )\n        =\n        \n          v\n          \n            0\n          \n        \n        \n        e\n        \n        exp\n        ⁡\n        \n          (\n          \n            \n              \n                −\n                1\n              \n              \n                1\n                −\n                x\n                \n                  /\n                \n                \n                  x\n                  \n                    m\n                    a\n                    x\n                  \n                \n              \n            \n          \n          )\n        \n        ,\n      \n    \n    {\\displaystyle v(x)=v_{0}\\,e\\,\\exp \\left({\\frac {-1}{\\sqrt {1-x/x_{max}}}}\\right),}\n  \n\n\n\nas a function of the distance \n  \n    \n      \n        x\n        ∈\n        [\n        0\n        ,\n        \n          x\n          \n            m\n            a\n            x\n          \n        \n        ]\n      \n    \n    {\\displaystyle x\\in [0,x_{max}]}\n  \n\ntraveled, with\n\n\n\t\n  \n    \n      \n        t\n        =\n        \n          ∫\n          \n            0\n          \n          \n            x\n          \n        \n        \n          \n            \n              d\n              \n                x\n                ′\n              \n            \n            \n              v\n              (\n              \n                x\n                ′\n              \n              )\n            \n          \n        \n        =\n        \n          \n            1\n            \n              \n                v\n                \n                  0\n                \n              \n              \n              e\n            \n          \n        \n        \n          ∫\n          \n            0\n          \n          \n            x\n          \n        \n        d\n        \n          x\n          ′\n        \n        exp\n        ⁡\n        \n          (\n          \n            \n              1\n              \n                1\n                −\n                \n                  x\n                  ′\n                \n                \n                  /\n                \n                \n                  x\n                  \n                    m\n                    a\n                    x\n                  \n                \n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle t=\\int _{0}^{x}{\\frac {dx'}{v(x')}}={\\frac {1}{v_{0}\\,e}}\\int _{0}^{x}dx'\\exp \\left({\\frac {1}{\\sqrt {1-x'/x_{max}}}}\\right)}\n  \n\n\n\nbeing the time \n  \n    \n      \n        t\n        =\n        t\n        (\n        x\n        )\n      \n    \n    {\\displaystyle t=t(x)}\n  \n needed to cruise\nthe distance \n  \n    \n      \n        x\n      \n    \n    {\\displaystyle x}\n  \n. The time \n  \n    \n      \n        t\n        (\n        x\n        →\n        \n          x\n          \n            m\n            a\n            x\n          \n        \n        )\n      \n    \n    {\\displaystyle t(x\\to x_{max})}\n  \n\nneeded to come to a full stop therefore diverges.\n\n\nMission profiles[edit]\n\nUsing the analytic result for \n  \n    \n      \n        v\n        (\n        x\n        )\n      \n    \n    {\\displaystyle v(x)}\n  \n and\nthe current carrying capacity of state of the art\ncoated superconducting wires\n,[11] one can estimate the mass required for the magnetic sail.\n\n\n\tFor a high speed mission to Alpha Centauri, with \n  \n    \n      \n        \n          v\n          \n            0\n          \n        \n        =\n        c\n        \n          /\n        \n        10\n      \n    \n    {\\displaystyle v_{0}=c/10}\n  \n, one finds \n  \n    \n      \n        R\n        ≈\n        1600\n        \n        \n          \n            km\n          \n        \n      \n    \n    {\\displaystyle R\\approx 1600\\,{\\mbox{km}}}\n  \n and \n  \n    \n      \n        \n          m\n          \n            t\n            o\n            t\n          \n        \n        ≈\n        1500\n        \n        \n          \n            tons\n          \n        \n      \n    \n    {\\displaystyle m_{tot}\\approx 1500\\,{\\mbox{tons}}}\n  \n. These requirements exceed by far the specifications of projected launch systems, such as of the Breakthrough Starshot initiative.\n\tFor a low speed mission to TRAPPIST-1, with \n  \n    \n      \n        \n          v\n          \n            0\n          \n        \n        =\n        c\n        \n          /\n        \n        300\n        ≈\n        1000\n        \n        \n          \n            km/s\n          \n        \n      \n    \n    {\\displaystyle v_{0}=c/300\\approx 1000\\,{\\mbox{km/s}}}\n  \n, one obtains \n  \n    \n      \n        R\n        ≈\n        50\n        \n        \n          \n            km\n          \n        \n      \n    \n    {\\displaystyle R\\approx 50\\,{\\mbox{km}}}\n  \n and \n  \n    \n      \n        \n          m\n          \n            t\n            o\n            t\n          \n        \n        ≈\n        1.5\n        \n        \n          \n            tons\n          \n        \n      \n    \n    {\\displaystyle m_{tot}\\approx 1.5\\,{\\mbox{tons}}}\n  \n. These requirements are well within the specifications of projected launch systems.[12]\n\n\nLong duration missions, such as missions aimed to offer terrestrial life alternative evolutionary pathways, e.g. as envisioned by the Genesis project, could therefore brake passively using magnetic sails.[13]\n\n\nFictional uses in popular culture[edit]\n\nMagnetic sails have become a popular trope in many works of science fiction although the solar sail is more popular: \n\n\n\tThe ancestor of the magsail, the Bussard magnetic scoop, first appeared in science-fiction in Poul Anderson's 1967 short story To Outlive Eternity, which was followed by the novel Tau Zero in 1970.\n\tThe magsail appears as a crucial plot device in The Children's Hour, a Man-Kzin Wars novel by Jerry Pournelle and S.M. Stirling (1991).\n\tIt also features prominently in the science-fiction novels of Michael Flynn, particularly in The Wreck of the River of Stars (2003); this book is the tale of the last flight of a magnetic sail ship when fusion rockets based on the Farnsworth-Hirsch Fusor have become the preferred technology.\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\tSpace portal\n\n\n\n\tElectric sail\n\tElectrodynamic tether interacts with magnetosphere in similar manner to magsail\n\tMagBeam (Magnetized beamed plasma propulsion) – a beam-powered variant of mini-magnetospheric plasma propulsion (M2P2).\n\tSpacecraft propulsion – Other methods of spacecraft propulsion used to change the velocity of spacecraft and artificial satellites.\n\tList of plasma (physics) articles\n\n\nReferences[edit]\n\n\t^ D. G. Andrews and R. Zubrin, \"Magnetic Sails and Interstellar Travel\", Paper IAF-88-553, 1988\n\n\t^ R. Zubrin. (1999) Entering Space: Creating a Spacefaring Civilization. New York: Jeremy P. Tarcher/Putnam. ISBN 0-87477-975-8.\n\n\t^ a b \"Archived copy\" (PDF). Archived from the original (PDF) on 2009-02-27. Retrieved 2009-02-27.CS1 maint: archived copy as title (link)\n\n\n\t^ Mini-magnetospheric Plasma Propulsion: Tapping the energy of the solar wind for spacecraft propulsion, Journal of Geophysical Research, volume 105, A9, pages 21,067-21,077 2000\n\n\t^ SAIL PROPULSION USING THE SOLAR WIND, Journal of Space Technology and Science, volume 20, pages 1-16, 2004\n\n\t^ [1]\n\n\t^ \"MagBeam\". earthweb.ess.washington.edu.\n\n\n\t^ Perakis, N., & Hein, A. M. (2016). Combining Magnetic and Electric Sails for Interstellar Deceleration. arXiv preprint arXiv:1603.03015.\n\n\t^ G. Landis, \"Interstellar Flight by Particle Beam,\" Acta Astronautica. Vol 55, No. 11, 931-934 (Dec. 2004).\n\n\t^ a b C. Gros, Universal scaling relation for magnetic sails: momentum braking in the limit of dilute interstellar media, Journal of Physics Communication (2017).\n\n\t^ X. Obradors and T. Puig, Coated conductors for power\napplications: materials challenges, Superconductor Science\nand Technology, 27 044003, (2014).\n\n\t^ N. Kulkarni, P. Lubin and Q. Zhang, Relativistic Spacecraft Propelled by Directed Energy, arXiv:1710.10732.\n\n\t^ James Romero, \"Should we seed life through the cosmos using laser-driven ships?\", New Scientist, November 13 (2017).\n\n\n\n\nExternal links[edit]\n\n\tプラズマ・核融合学会誌 - 磁気プラズマセイルの研究と深宇宙探査への挑戦(PDF)\n\n\n\t九州大学大学院 - MPSにおける磁気インフレーションに関する研究(PDF)\n\n\n\tJAXA - プラズマセイル(PDF)\n\n\n\t神戸大学大学院 - 惑星間航行システム開発に向けたマルチスケール粒子シミュレーション(PDF)\n\n\n\tJAXA - 磁気プラズマセイルの推力発生メカニズムの解明(PDF)\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft propulsion\n\n\tChemical\nrockets\t\n\tState\t\n\tLiquid-propellant rocket\n\tSolid-propellant rocket\n\tHybrid-propellant rocket\n\n\n\n\n\tPropellants\t\n\tLiquid propellant\n\tCryogenic\n\tHypergolic\n\n\n\tMonopropellant\n\tBipropellant\n\tStaged combustion cycle\n\tExpander cycle\n\tGas-generator cycle\n\tTap-off cycle\n\tPressure-fed engine\n\tPump-fed engine\n\tElectric-pump-fed engine\n\n\n\tTripropellant\n\n\n\n\n\n\n\n\tElectrical\nthrusters\t\n\tElectrostatic\t\n\tColloid thruster\n\tIon thruster\n\tGridded\n\tHall-effect thruster\n\tField-emission electric propulsion\n\n\n\n\n\n\n\tElectromagnetic\t\n\tPulsed inductive thruster\n\tMagnetoplasmadynamic thruster\n\tElectrodeless plasma thruster\n\n\n\n\n\tElectrothermal\t\n\tPulsed plasma thruster\n\tHelicon double-layer thruster\n\tArcjet rocket\n\tResistojet rocket\n\tVASIMR\n\n\n\n\n\tOther\t\n\tAtmosphere-breathing electric propulsion\n\tHigh Power Electric Propulsion\n\tMagBeam\n\tMass driver\n\n\n\n\n\n\n\n\tNuclear\npropulsion\t\n\tClosed system\t\n\tDirect Fusion Drive\n\tNuclear electric rocket\n\tNuclear thermal rocket\n\tRadioisotope\n\tSalt-water\n\tGas core\n\t\"Lightbulb\"\n\n\n\n\n\n\n\tOpen system\t\n\tNuclear pulse propulsion\n\tAntimatter-catalyzed\n\n\n\tPulsed nuclear thermal rocket‎\n\tFusion rocket\n\tBussard ramjet\n\n\n\tFission-fragment rocket\n\tFission sail\n\n\n\tNuclear photonic rocket\n\n\n\n\n\n\n\n\tOther\t\n\tAnti-gravity\n\tBeam-powered propulsion\n\tCold gas thruster\n\tGravity assist\n\tSolar sail\n\tElectric sail\n\tMagnetic sail\n\n\n\tSolar thermal rocket\n\tTethers\n\tSteam thruster\n\n\n\n\n\tSpaceflight portal\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Magnetic_sail&oldid=917805398\"\n\n\t\t\n\t\tCategories: \tSpacecraft propulsion\n\tSpacecraft components\n\tElectrodynamics\n\tMagnetic propulsion devices\n\n\nHidden categories: \tCS1 maint: archived copy as title\n\tArticles needing additional references from January 2016\n\tAll articles needing additional references\n\tArticles needing additional references from December 2018\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tFrançais\n\tItaliano\n\t日本語\n\tPolski\n\tSlovenščina\n\tСрпски / srpski\n\tSuomi\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 25 September 2019, at 15:39 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Magnetic sail - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-magnetic_sail", "title": "Magnetic sail - Wikipedia"}}