{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMagnetometer - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tMagnetometer\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tDevice that measures magnetism\n\n\n\n\n  \nHelium Vector Magnetometer (HVM) of the Pioneer 10 and 11 spacecraft\n\n\n\nA magnetometer is a device that measures magnetism—the direction, strength, or relative change of a magnetic field at a particular location. The measurement of the magnetization of a magnetic material (like a ferromagnet) is an example. A compass is one such device, one that measures the direction of an ambient magnetic field, in this case, the Earth's magnetic field.\n\nThe first magnetometer capable of measuring the absolute magnetic intensity was invented by Carl Friedrich Gauss in 1833 and notable developments in the 19th century included the Hall effect, which is still widely used.\n\nMagnetometers are widely used for measuring the Earth's magnetic field, and in geophysical surveys, to detect magnetic anomalies of various types. In an aircraft's attitude and heading reference system, they are commonly used as a heading reference. Magnetometers are also used in the military to detect submarines. Consequently, some countries, such as the United States, Canada and Australia, classify the more sensitive magnetometers as military technology, and control their distribution.\n\nMagnetometers can be used as metal detectors: they can detect only magnetic (ferrous) metals, but can detect such metals at a much larger depth than conventional metal detectors; they are capable of detecting large objects, such as cars, at tens of metres, while a metal detector's range is rarely more than 2 metres.\n\nIn recent years, magnetometers have been miniaturized to the extent that they can be incorporated in integrated circuits at very low cost and are finding increasing use as miniaturized compasses (MEMS magnetic field sensor).\n\n\nContents\n\n\n\t1 Introduction\n\t1.1 Magnetic fields\n\t1.2 Types of magnetometer\n\t1.3 Performance and capabilities\n\t1.4 Early magnetometers\n\n\n\n\t2 Laboratory magnetometers\n\t2.1 SQUID (superconducting quantum interference device)\n\t2.2 Inductive pickup coils\n\t2.3 VSM (vibrating-sample magnetometer)\n\t2.4 Pulsed-field extraction magnetometry\n\t2.5 Torque magnetometry\n\t2.6 Faraday force magnetometry\n\t2.7 Optical magnetometry\n\n\n\n\t3 Survey magnetometers\n\t3.1 Scalar magnetometers\n\t3.1.1 Proton precession magnetometer\n\t3.1.2 Overhauser effect magnetometer\n\t3.1.3 Caesium vapour magnetometer\n\t3.1.4 Potassium vapour magnetometer\n\t3.1.5 Applications\n\n\n\n\t3.2 Vector magnetometers\n\t3.2.1 Rotating coil magnetometer\n\t3.2.2 Hall effect magnetometer\n\t3.2.3 Magnetoresistive devices\n\t3.2.4 Fluxgate magnetometer\n\t3.2.5 SQUID magnetometer\n\t3.2.6 Spin-exchange relaxation-free (SERF) atomic magnetometers\n\n\n\n\n\n\n\t4 Calibration of magnetometers\n\t5 Uses\n\t5.1 Mechanical stress measurement\n\t5.2 Accelerator physics\n\t5.3 Archaeology\n\t5.4 Auroras\n\t5.5 Coal exploration\n\t5.6 Directional drilling\n\t5.7 Military\n\t5.8 Mineral exploration\n\t5.9 Mobile phones\n\t5.10 Oil exploration\n\t5.11 Spacecraft\n\t5.12 Magnetic surveys\n\t5.12.1 Magnetovision\n\t5.12.2 Gradiometer\n\t5.12.3 Position control of magnetic surveys\n\t5.12.4 Heading errors in magnetic surveys\n\t5.12.5 Image processing of magnetic data\n\n\n\n\n\n\n\t6 See also\n\t7 References\n\t8 Further reading\n\t9 External links\n\n\n\n\n\nIntroduction[edit]\n\nMagnetic fields[edit]\n\nMagnetic fields are vector quantities characterized by both strength and direction. The strength of a magnetic field is measured in units of tesla in the SI units, and in gauss in the cgs system of units. 10,000 gauss are equal to one tesla.[1] Measurements of the Earth's magnetic field are often quoted in units of nanotesla (nT), also called a gamma.[2] The Earth's magnetic field can vary from 20,000 to 80,000 nT depending on location, fluctuations in the Earth's magnetic field are on the order of 100 nT, and magnetic field variations due to magnetic anomalies can be in the picotesla (pT) range.[3] Gaussmeters and teslameters are magnetometers that measure in units of gauss or tesla, respectively. In some contexts, magnetometer is the term used for an instrument that measures fields of less than 1 millitesla (mT) and gaussmeter is used for those measuring greater than 1 mT.[1]\n\n\nTypes of magnetometer[edit]\n\n  \nThe Magnetometer experiment for the Juno orbiter for Juno can be seen here on the end of a boom. The spacecraft uses two fluxgate magnetometers. (see also Magnetometer (Juno))\n\n\n\nThere are two basic types of magnetometer measurement. Vector magnetometers measure the vector components of a magnetic field. Total field magnetometers or scalar magnetometers measure the magnitude of the vector magnetic field.[4] Magnetometers used to study the Earth's magnetic field may express the vector components of the field in terms of declination (the angle between the horizontal component of the field vector and magnetic north) and the inclination (the angle between the field vector and the horizontal surface).[5]\n\nAbsolute magnetometers measure the absolute magnitude or vector magnetic field, using an internal calibration or known physical constants of the magnetic sensor.[6] Relative magnetometers measure magnitude or vector magnetic field relative to a fixed but uncalibrated baseline. Also called variometers, relative magnetometers are used to measure variations in magnetic field.\n\nMagnetometers may also be classified by their situation or intended use. Stationary magnetometers are installed to a fixed position and measurements are taken while the magnetometer is stationary.[4] Portable or mobile magnetometers are meant to be used while in motion and may be manually carried or transported in a moving vehicle. Laboratory magnetometers are used to measure the magnetic field of materials placed within them and are typically stationary. Survey magnetometers are used to measure magnetic fields in geomagnetic surveys; they may be fixed base stations, as in the INTERMAGNET network, or mobile magnetometers used to scan a geographic region.\n\n\nPerformance and capabilities[edit]\n\nThe performance and capabilities of magnetometers are described through their technical specifications. Major specifications include[1][3]\n\n\n\tSample rate is the amount of readings given per second. The inverse is the cycle time in seconds per reading. Sample rate is important in mobile magnetometers; the sample rate and the vehicle speed determine the distance between measurements.\n\tBandwidth or bandpass characterizes how well a magnetometer tracks rapid changes in magnetic field. For magnetometers with no onboard signal processing, bandwidth is determined by the Nyquist limit set by sample rate. Modern magnetometers may perform smoothing or averaging over sequential samples. achieving a lower noise in exchange for lower bandwidth.\n\tResolution is the smallest change in a magnetic field the magnetometer can resolve. A magnetometer should have a resolution a good deal smaller than the smallest change one wishes to observe.\n\tQuantization error is caused by recording roundoff and truncation of digital expressions of the data.\n\tAbsolute error is the difference between the readings of a magnetometer true magnetic field.\n\tDrift is the change in absolute error over time.\n\tThermal stability is the dependence of the measurement on temperature. It is given as a temperature coefficient in units of nT per degree Celsius.\n\tNoise is the random fluctuations generated by the magnetometer sensor or electronics. Noise is given in units of \n  \n    \n      \n        \n          \n            \n              n\n              T\n            \n            \n              /\n            \n            \n              \n                \n                  H\n                  z\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\rm {{nT}/{\\sqrt {\\rm {Hz}}}}}}\n  \n, where frequency component refers to the bandwidth.\n\tSensitivity is the larger of the noise or the resolution.\n\tHeading error is the change in the measurement due to a change in orientation of the instrument in a constant magnetic field.\n\tThe dead zone is the angular region of magnetometer orientation in which the instrument produces poor or no measurements. All optically pumped, proton-free precession, and Overhauser magnetometers experience some dead zone effects.\n\tGradient tolerance is the ability of a magnetometer to obtain a reliable measurement in the presence of a magnetic field gradient. In surveys of unexploded ordnance or landfills, gradients can be large.\n\n\nEarly magnetometers[edit]\n\n  \nThe compass is a simple type of magnetometer.\n\n\n\n  \nCoast and Geodetic Survey Magnetometer No. 18.\n\n\n\nThe compass, consisting of a magnetized needle whose orientation changes in response to the ambient magnetic field, is a simple type of magnetometer, one that measures the direction of the field. The oscillation frequency of a magnetized needle is proportional to the square-root of the strength of the ambient magnetic field; so, for example, the oscillation frequency of the needle of a horizontally situated compass is proportional to the square-root of the horizontal intensity of the ambient field.\n\nIn 1833, Carl Friedrich Gauss, head of the Geomagnetic Observatory in Göttingen, published a paper on measurement of the Earth's magnetic field.[7] It described a new instrument that consisted of a permanent bar magnet suspended horizontally from a gold fibre. The difference in the oscillations when the bar was magnetised and when it was demagnetised allowed Gauss to calculate an absolute value for the strength of the Earth's magnetic field.[8]\n\nThe gauss, the CGS unit of magnetic flux density was named in his honour, defined as one maxwell per square centimeter; it equals 1×10−4 tesla (the SI unit).[9]\n\nFrancis Ronalds and Charles Brooke independently invented magnetographs in 1846 that continuously recorded the magnet's movements using photography, thus easing the load on observers.[10] They were quickly utilised by Edward Sabine and others in a global magnetic survey and updated machines were in use well into the 20th century.[11][12]\n\n\nLaboratory magnetometers[edit]\n\nLaboratory magnetometers measure the magnetization, also known as the magnetic moment of a sample material. Unlike survey magnetometers, laboratory magnetometers require the sample to be placed inside the magnetometer, and often the temperature, magnetic field, and other parameters of the sample can be controlled. A sample's magnetization, is primarily dependent on the ordering of unpaired electrons within its atoms, with smaller contributions from nuclear magnetic moments, Larmor diamagnetism, among others. Ordering of magnetic moments are primarily classified as diamagnetic, paramagnetic, ferromagnetic, or antiferromagnetic (although the zoology of magnetic ordering also includes ferrimagnetic, helimagnetic, toroidal, spin glass, etc.). Measuring the magnetization as a function of temperature and magnetic field can give clues as to the type of magnetic ordering, as well as any phase transitions between different types of magnetic orders that occur at critical temperatures or magnetic fields. This type of magnetometry measurement is very important to understand the magnetic properties of materials in physics, chemistry, geophysics and geology, as well as sometimes biology.\n\n\nSQUID (superconducting quantum interference device)[edit]\n\nMain article: SQUID\n\nSQUIDs are a type of magnetometer used both as survey and as laboratory magnetometers. SQUID magnetometry is an extremely sensitive absolute magnetometry technique. However SQUIDs are noise sensitive, making them impractical as laboratory magnetometers in high DC magnetic fields, and in pulsed magnets. Commercial SQUID magnetometers are available for temperatures between 300 mK and 400 kelvins, and magnetic fields up to 7 tesla.\n\n\nInductive pickup coils[edit]\n\nMain article: Inductive sensor\n\nInductive pickup coils (also referred as inductive sensor) measure the magnetization by detecting the current induced in a coil due to the changing magnetic moment of the sample. The sample's magnetization can be changed by applying a small ac magnetic field (or a rapidly changing dc field), as occurs in capacitor-driven pulsed magnets. These measurements require differentiating between the magnetic field produced by the sample and that from the external applied field. Often a special arrangement of cancellation coils is used. For example, half of the pickup coil is wound in one direction, and the other half in the other direction, and the sample is placed in only one half. The external uniform magnetic field is detected by both halves of the coil, and since they are counter-wound, the external magnetic field produces no net signal.\n\n\nVSM (vibrating-sample magnetometer)[edit]\n\nVibrating-sample magnetometers (VSMs) detect the magnetization of a sample by mechanically vibrating the sample inside of an inductive pickup coil or inside of a SQUID coil. Induced current or changing flux in the coil is measured. The vibration is typically created by a motor or a piezoelectric actuator. Typically the VSM technique is about an order of magnitude less sensitive than SQUID magnetometry. VSMs can be combined with SQUIDs to create a system that is more sensitive than either one alone. Heat due to the sample vibration can limit the base temperature of a VSM, typically to 2 Kelvin. VSM is also impractical for measuring a fragile sample that is sensitive to rapid acceleration.\n\n\nPulsed-field extraction magnetometry[edit]\n\nPulsed-field extraction magnetometry is another method making use of pickup coils to measure magnetization. Unlike VSMs where the sample is physically vibrated, in pulsed-field extraction magnetometry, the sample is secured and the external magnetic field is changed rapidly, for example in a capacitor-driven magnet. One of multiple techniques must then be used to cancel out the external field from the field produced by the sample. These include counterwound coils that cancel the external uniform field and background measurements with the sample removed from the coil.\n\n\nTorque magnetometry[edit]\n\nMagnetic torque magnetometry can be even more sensitive than SQUID magnetometry. However, magnetic torque magnetometry doesn't measure magnetism directly as all the previously mentioned methods do. Magnetic torque magnetometry instead measures the torque τ acting on a sample's magnetic moment μ as a result of a uniform magnetic field B, τ=μ×B.\nA torque is thus a measure of the sample's magnetic or shape anisotropy. In some cases the sample's magnetization can be extracted from the measured torque. In other cases, the magnetic torque measurement is used to detect magnetic phase transitions or quantum oscillations. The most common way to measure magnetic torque is to mount the sample on a cantilever and measure the displacement via capacitance measurement between the cantilever and nearby fixed object, or by measuring the piezoelectricity of the cantilever, or by optical interferometry off the surface of the cantilever.\n\n\nFaraday force magnetometry[edit]\n\nFaraday force magnetometry uses the fact that a spatial magnetic field gradient produces force that acts on a magnetized object, F=(M⋅∇)B. In Faraday Force Magnetometry the force on the sample can be measured by a scale (hanging the sample from a sensitive balance), or by detecting the displacement against a spring. Commonly a capacitive load cell or cantilever is used because of its sensitivity, size, and lack of mechanical parts. Faraday Force Magnetometry is approximately one order of magnitude less sensitive than a SQUID. The biggest drawback to Faraday Force Magnetometry is that it requires some means of not only producing a magnetic field, but also producing a magnetic field gradient. While this can be accomplished by using a set of special pole faces, a much better result can be achieved by using set of gradient coils. A major advantage to Faraday Force Magnetometry is that it is small and reasonably tolerant to noise, and thus can be implemented in a wide range of environments, including a dilution refrigerator. Faraday Force Magnetometry can also be complicated by the presence of torque (see previous technique). This can be circumvented by varying the gradient field independently of the applied DC field so the torque and the Faraday Force contribution can be separated, and/or by designing a Faraday Force Magnetometer that prevents the sample from being rotated.\n\n\nOptical magnetometry[edit]\n\nOptical magnetometry makes use of various optical techniques to measure magnetization. One such technique, Kerr Magnetometry makes use of the magneto-optic Kerr effect, or MOKE. In this technique, incident light is directed at the sample's surface. Light interacts with a magnetized surface nonlinearly so the reflected light has an elliptical polarization, which is then measured by a detector. Another method of optical magnetometry is Faraday Rotation Magnetometry. Faraday Rotation Magnetometry utilizes nonlinear magneto-optical rotation to measure a sample's magnetization. In this method a Faraday Modulating thin film is applied to the sample to be measured and a series of images are taken with a camera that senses the polarization of the reflected light. To reduce noise, multiple pictures are then averaged together. One advantage to this method is that it allows mapping of the magnetic characteristics over the surface of a sample. This can be especially useful when studying such things as the Meissner effect on superconductors. Microfabricated optically pumped magnetometers (µOPMs) can be used to detect the origin of brain seizures more precisely and generate less heat than currently available superconducting quantum interference devices, better known as SQUIDs.[13] The device works by using polarized light to control the spin of rubidium atoms which can be used to measure and monitor the magnetic field.[14]\n\n\nSurvey magnetometers[edit]\n\nSurvey magnetometers can be divided into two basic types:\n\n\n\tScalar magnetometers measure the total strength of the magnetic field to which they are subjected, but not its direction\n\tVector magnetometers have the capability to measure the component of the magnetic field in a particular direction, relative to the spatial orientation of the device.\n\n\nA vector is a mathematical entity with both magnitude and direction. The Earth's magnetic field at a given point is a vector. A magnetic compass is designed to give a horizontal bearing direction, whereas a vector magnetometer measures both the magnitude and direction of the total magnetic field. Three orthogonal sensors are required to measure the components of the magnetic field in all three dimensions.\n\nThey are also rated as \"absolute\" if the strength of the field can be calibrated from their own known internal constants or \"relative\" if they need to be calibrated by reference to a known field.\n\nA magnetograph is a magnetometer that continuously records data.\n\nMagnetometers can also be classified as \"AC\" if they measure fields that vary relatively rapidly in time (>100 Hz), and \"DC\" if they measure fields that vary only slowly (quasi-static) or are static. AC magnetometers find use in electromagnetic systems (such as magnetotellurics), and DC magnetometers are used for detecting mineralisation and corresponding geological structures.\n\n\nScalar magnetometers[edit]\n\nProton precession magnetometer[edit]\n\nMain article: Proton magnetometer\n\nProton precession magnetometers, also known as proton magnetometers, PPMs or simply mags, measure the resonance frequency of protons (hydrogen nuclei) in the magnetic field to be measured, due to nuclear magnetic resonance (NMR). Because the precession frequency depends only on atomic constants and the strength of the ambient magnetic field, the accuracy of this type of magnetometer can reach 1 ppm.[15]\n\nA direct current flowing in a solenoid creates a strong magnetic field around a hydrogen-rich fluid (kerosene and decane are popular, and even water can be used), causing some of the protons to align themselves with that field. The current is then interrupted, and as protons realign themselves with the ambient magnetic field, they precess at a frequency that is directly proportional to the magnetic field. This produces a weak rotating magnetic field that is picked up by a (sometimes separate) inductor, amplified electronically, and fed to a digital frequency counter whose output is typically scaled and displayed directly as field strength or output as digital data.\n\nFor hand/backpack carried units, PPM sample rates are typically limited to less than one sample per second. Measurements are typically taken with the sensor held at fixed locations at approximately 10 metre increments.\n\nPortable instruments are also limited by sensor volume (weight) and power consumption. PPMs work in field gradients up to 3,000 nT/m, which is adequate for most mineral exploration work. For higher gradient tolerance, such as mapping banded iron formations and detecting large ferrous objects, Overhauser magnetometers can handle 10,000 nT/m, and caesium magnetometers can handle 30,000 nT/m.\n\nThey are relatively inexpensive (< US$8,000) and were once widely used in mineral exploration. Three manufacturers dominate the market: GEM Systems, Geometrics and Scintrex. Popular models include G-856/857, Smartmag, GSM-18, and GSM-19T.\n\nFor mineral exploration, they have been superseded by Overhauser, caesium, and potassium instruments, all of which are fast-cycling, and do not require the operator to pause between readings.\n\n\nOverhauser effect magnetometer[edit]\n\nThe Overhauser effect magnetometer or Overhauser magnetometer uses the same fundamental effect as the proton precession magnetometer to take measurements. By adding free radicals to the measurement fluid, the nuclear Overhauser effect can be exploited to significantly improve upon the proton precession magnetometer. Rather than aligning the protons using a solenoid, a low power radio-frequency field is used to align (polarise) the electron spin of the free radicals, which then couples to the protons via the Overhauser effect. This has two main advantages: driving the RF field takes a fraction of the energy (allowing lighter-weight batteries for portable units), and faster sampling as the electron-proton coupling can happen even as measurements are being taken. An Overhauser magnetometer produces readings with a 0.01 nT to 0.02 nT standard deviation while sampling once per second.\n\n\nCaesium vapour magnetometer[edit]\n\nThe optically pumped caesium vapour magnetometer is a highly sensitive (300 fT/Hz0.5) and accurate device used in a wide range of applications. It is one of a number of alkali vapours (including rubidium and potassium) that are used in this way, as well as helium.[16]\n\nThe device broadly consists of a photon emitter containing a caesium light emitter or lamp, an absorption chamber containing caesium vapour, a \"buffer gas\" through which the emitted photons pass and a photon detector, arranged in that order.\n\nThe basic principle that allows the device to operate is the fact that a caesium atom can exist in any of nine energy levels, which can be informally thought of as the placement of electron atomic orbitals around the atomic nucleus. When a caesium atom within the chamber encounters a photon from the lamp, it is excited to a higher energy state, emits a photon and falls to an indeterminate lower energy state. The caesium atom is \"sensitive\" to the photons from the lamp in three of its nine energy states, and therefore, assuming a closed system, all the atoms eventually fall into a state in which all the photons from the lamp pass through unhindered and are measured by the photon detector. At this point, the sample (or population) is said to be polarized and ready for measurement to take place. This process is done continuously during operation. This theoretically perfect magnetometer is now functional and so can begin to make measurements.\n\nIn the most common type of caesium magnetometer, a very small AC magnetic field is applied to the cell. Since the difference in the energy levels of the electrons is determined by the external magnetic field, there is a frequency at which this small AC field makes the electrons change states. In this new state, the electron once again can absorb a photon of light. This causes a signal on a photo detector that measures the light passing through the cell. The associated electronics use this fact to create a signal exactly at the frequency that corresponds to the external field.\n\nAnother type of caesium magnetometer modulates the light applied to the cell. This is referred to as a Bell-Bloom magnetometer, after the two scientists who first investigated the effect. If the light is turned on and off at the frequency corresponding to the Earth's field,[clarification needed] there is a change in the signal seen at the photo detector. Again, the associated electronics use this to create a signal exactly at the frequency that corresponds to the external field. Both methods lead to high performance magnetometers.\n\n\nPotassium vapour magnetometer[edit]\n\nPotassium is the only optically pumped magnetometer that operates on a single, narrow electron spin resonance (ESR) line in contrast to other alkali vapour magnetometers that use irregular, composite and wide spectral lines and helium with the inherently wide spectral line.[17]\n\n\nApplications[edit]\n\nThe caesium and potassium magnetometers are typically used where a higher performance magnetometer than the proton magnetometer is needed. In archaeology and geophysics, where the sensor sweeps through an area and many accurate magnetic field measurements are often needed, caesium and potassium magnetometers have advantages over the proton magnetometer.\n\nThe caesium and potassium magnetometer's faster measurement rate allows the sensor to be moved through the area more quickly for a given number of data points. Caesium and potassium magnetometers are insensitive to rotation of the sensor while the measurement is being made.\n\nThe lower noise of caesium and potassium magnetometers allow those measurements to more accurately show the variations in the field with position.\n\n\nVector magnetometers[edit]\n\nVector magnetometers measure one or more components of the magnetic field electronically. Using three orthogonal magnetometers, both azimuth and dip (inclination) can be measured. By taking the square root of the sum of the squares of the components the total magnetic field strength (also called total magnetic intensity, TMI) can be calculated by the Pythagorean theorem.\n\nVector magnetometers are subject to temperature drift and the dimensional instability of the ferrite cores. They also require leveling to obtain component information, unlike total field (scalar) instruments. For these reasons they are no longer used for mineral exploration.\n\n\nRotating coil magnetometer[edit]\n\nThe magnetic field induces a sine wave in a rotating coil. The amplitude of the signal is proportional to the strength of the field, provided it is uniform, and to the sine of the angle between the rotation axis of the coil and the field lines. This type of magnetometer is obsolete.\n\n\nHall effect magnetometer[edit]\n\nMain article: Hall effect sensor\n\nThe most common magnetic sensing devices are solid-state Hall effect sensors. These sensors produce a voltage proportional to the applied magnetic field and also sense polarity. They are used in applications where the magnetic field strength is relatively large, such as in anti-lock braking systems in cars, which sense wheel rotation speed via slots in the wheel disks.\n\n\nMagnetoresistive devices[edit]\n\nMain article: Magnetoresistance\n\nThese are made of thin strips of permalloy (NiFe magnetic film) whose electrical resistance varies with a change in magnetic field. They have a well-defined axis of sensitivity, can be produced in 3-D versions and can be mass-produced as an integrated circuit. They have a response time of less than 1 microsecond and can be sampled in moving vehicles up to 1,000 times/second. They can be used in compasses that read within 1°, for which the underlying sensor must reliably resolve 0.1°.[18]\n\n\nFluxgate magnetometer[edit]\n\n  \nA uniaxial fluxgate magnetometer\n\n\n\n  \nA fluxgate compass/inclinometer\n\n\n\nPlay media\n  \nBasic principles of a fluxgate magnetometer\n\n\n\nThe fluxgate magnetometer was invented by H. Aschenbrenner and G. Goubau in 1936.[19][20]:4 A team at Gulf Research Laboratories led by Victor Vacquier developed airborne fluxgate magnetometers to detect submarines during World War II and after the war confirmed the theory of plate tectonics by using them to measure shifts in the magnetic patterns on the sea floor.[21]\n\nA fluxgate magnetometer consists of a small magnetically susceptible core wrapped by two coils of wire. An alternating electric current is passed through one coil, driving the core through an alternating cycle of magnetic saturation; i.e., magnetised, unmagnetised, inversely magnetised, unmagnetised, magnetised, and so forth. This constantly changing field induces an electric current in the second coil, and this output current is measured by a detector. In a magnetically neutral background, the input and output currents match. However, when the core is exposed to a background field, it is more easily saturated in alignment with that field and less easily saturated in opposition to it. Hence the alternating magnetic field, and the induced output current, are out of step with the input current. The extent to which this is the case depends on the strength of the background magnetic field. Often, the current in the output coil is integrated, yielding an output analog voltage proportional to the magnetic field.\n\nA wide variety of sensors are currently available and used to measure magnetic fields. Fluxgate compasses and gradiometers measure the direction and magnitude of magnetic fields. Fluxgates are affordable, rugged and compact with miniaturization recently advancing to the point of complete sensor solutions in the form of IC chips, including examples from both academia [22] and industry.[23] This, plus their typically low power consumption makes them ideal for a variety of sensing applications. Gradiometers are commonly used for archaeological prospecting and unexploded ordnance (UXO) detection such as the German military's popular Foerster.[24]\n\nThe typical fluxgate magnetometer consists of a \"sense\" (secondary) coil surrounding an inner \"drive\" (primary) coil that is closely wound around a highly permeable core material, such as mu-metal. An alternating current is applied to the drive winding, which drives the core in a continuous repeating cycle of saturation and unsaturation. To an external field, the core is alternately weakly permeable and highly permeable. The core is often a toroidally wrapped ring or a pair of linear elements whose drive windings are each wound in opposing directions. Such closed flux paths minimise coupling between the drive and sense windings. In the presence of an external magnetic field, with the core in a highly permeable state, such a field is locally attracted or gated (hence the name fluxgate) through the sense winding. When the core is weakly permeable, the external field is less attracted. This continuous gating of the external field in and out of the sense winding induces a signal in the sense winding, whose principal frequency is twice that of the drive frequency, and whose strength and phase orientation vary directly with the external-field magnitude and polarity.\n\nThere are additional factors that affect the size of the resultant signal. These factors include the number of turns in the sense winding, magnetic permeability of the core, sensor geometry, and the gated flux rate of change with respect to time.\n\nPhase synchronous detection is used to extract these harmonic signals from the sense winding and convert them into a DC voltage proportional to the external magnetic field. Active current feedback may also be employed, such that the sense winding is driven to counteract the external field. In such cases, the feedback current varies linearly with the external magnetic field and is used as the basis for measurement. This helps to counter inherent non-linearity between the applied external field strength and the flux gated through the sense winding.\n\n\nSQUID magnetometer[edit]\n\nMain article: SQUID\n\nSQUIDs, or superconducting quantum interference devices, measure extremely small changes in magnetic fields. They are very sensitive vector magnetometers, with noise levels as low as 3 fT Hz−½ in commercial instruments and 0.4 fT Hz−½ in experimental devices. Many liquid-helium-cooled commercial SQUIDs achieve a flat noise spectrum from near DC (less than 1 Hz) to tens of kilohertz, making such devices ideal for time-domain biomagnetic signal measurements. SERF atomic magnetometers demonstrated in laboratories so far reach competitive noise floor but in relatively small frequency ranges.\n\nSQUID magnetometers require cooling with liquid helium (4.2 K) or liquid nitrogen (77 K) to operate, hence the packaging requirements to use them are rather stringent both from a thermal-mechanical as well as magnetic standpoint. SQUID magnetometers are most commonly used to measure the magnetic fields produced by laboratory samples, also for brain or heart activity (magnetoencephalography and magnetocardiography, respectively). Geophysical surveys use SQUIDs from time to time, but the logistics of cooling the SQUID are much more complicated than other magnetometers that operate at room temperature.\n\n\nSpin-exchange relaxation-free (SERF) atomic magnetometers[edit]\n\nMain article: SERF\n\nAt sufficiently high atomic density, extremely high sensitivity can be achieved. Spin-exchange-relaxation-free (SERF) atomic magnetometers containing potassium, caesium, or rubidium vapor operate similarly to the caesium magnetometers described above, yet can reach sensitivities lower than 1 fT Hz−½. The SERF magnetometers only operate in small magnetic fields. The Earth's field is about 50 µT; SERF magnetometers operate in fields less than 0.5 µT.\n\nLarge volume detectors have achieved a sensitivity of 200 aT Hz−½.[25] This technology has greater sensitivity per unit volume than SQUID detectors.[26] The technology can also produce very small magnetometers that may in the future replace coils for detecting changing magnetic fields.[citation needed] This technology may produce a magnetic sensor that has all of its input and output signals in the form of light on fiber-optic cables.[27] This lets the magnetic measurement be made near high electrical voltages.\n\n\nCalibration of magnetometers[edit]\n\nThe calibration of magnetometers is usually performed by means of coils which are supplied by an electrical current to create a magnetic field. It allows to characterize the sensitivity of the magnetometer (in terms of V/T). In many applications the homogeneity of the calibration coil is an important feature. For this reason, coils like Helmholtz coils is commonly used either in a single axis or a three axis configuration. For demanding applications high homogeneity magnetic field is mandatory, in such cases magnetic field calibration can be performed using Maxwell coil, cosine coils,[28] or calibration in the highly homogenous Earth's magnetic field.\n\n\nUses[edit]\n\nPlay media\n  \nMagnetometers can measure the magnetic fields of planets.\n\n\n\nMagnetometers have a very diverse range of applications, including locating objects such as submarines, sunken ships, hazards for tunnel boring machines, hazards in coal mines, unexploded ordnance, toxic waste drums, as well as a wide range of mineral deposits and geological structures. They also have applications in heart beat monitors, weapon systems positioning, sensors in anti-locking brakes, weather prediction (via solar cycles), steel pylons, drill guidance systems, archaeology, plate tectonics and radio wave propagation and planetary exploration.\n\nDepending on the application, magnetometers can be deployed in spacecraft, aeroplanes (fixed wing magnetometers), helicopters (stinger and bird), on the ground (backpack), towed at a distance behind quad bikes (sled or trailer), lowered into boreholes (tool, probe or sonde) and towed behind boats (tow fish).\n\n\nMechanical stress measurement[edit]\n\nMagnetometers are used to measure or monitor mechanical stress in ferromagnetic materials. Mechanical stress will improve alignment of magnetic domains in microscopic scale that will raise the magnetic field measured close to the material by magnetometers. There are different hypothesis about stress-magnetisation relationship. However the effect of mechanical stress on measured magnetic field near the specimen is claimed to be proven in many scientific publications. There have been efforts to solve the inverse problem of magnetisation-stress resolution in order to quantify the stress based on measured magnetic field.[29][30]\n\n\nAccelerator physics[edit]\n\nMagnetometers are used extensively in experimental particle physics to measure the magnetic field of pivotal components such as the concentration or focusing beam-magnets. \n\n\nArchaeology[edit]\n\nMain article: Magnetic survey (archaeology)\n\nMagnetometers are also used to detect archaeological sites, shipwrecks, and other buried or submerged objects. Fluxgate gradiometers are popular due to their compact configuration and relatively low cost. Gradiometers enhance shallow features and negate the need for a base station. Caesium and Overhauser magnetometers are also very effective when used as gradiometers or as single-sensor systems with base stations.\n\nThe TV program Time Team popularised 'geophys', including magnetic techniques used in archaeological work to detect fire hearths, walls of baked bricks and magnetic stones such as basalt and granite. Walking tracks and roadways can sometimes be mapped with differential compaction in magnetic soils or with disturbances in clays, such as on the Great Hungarian Plain. Ploughed fields behave as sources of magnetic noise in such surveys.\n\n\nAuroras[edit]\n\nMagnetometers can give an indication of auroral activity before the light from the aurora becomes visible. A grid of magnetometers around the world constantly measures the effect of the solar wind on the Earth's magnetic field, which is then published on the K-index.[31]\n\n\nCoal exploration[edit]\n\nWhile magnetometers can be used to help map basin shape at a regional scale, they are more commonly used to map hazards to coal mining, such as basaltic intrusions (dykes, sills, and volcanic plug) that destroy resources and are dangerous to longwall mining equipment. Magnetometers can also locate zones ignited by lightning and map siderite (an impurity in coal).\n\nThe best survey results are achieved on the ground in high-resolution surveys (with approximately 10 m line spacing and 0.5 m station spacing). Bore-hole magnetometers using a Ferret can also assist when coal seams are deep, by using multiple sills or looking beneath surface basalt flows.[citation needed]\n\nModern surveys generally use magnetometers with GPS technology to automatically record the magnetic field and their location. The data set is then corrected with data from a second magnetometer (the base station) that is left stationary and records the change in the Earth's magnetic field during the survey.[32]\n\n\nDirectional drilling[edit]\n\nMagnetometers are used in directional drilling for oil or gas to detect the azimuth of the drilling tools near the drill. They are most often paired with accelerometers in drilling tools so that both the inclination and azimuth of the drill can be found.\n\n\nMilitary[edit]\n\nFor defensive purposes, navies use arrays of magnetometers laid across sea floors in strategic locations (i.e. around ports) to monitor submarine activity. The Russian Alfa-class titanium submarines were designed and built at great expense to thwart such systems (as pure titanium is non-magnetic).[33]\n\nMilitary submarines are degaussed—by passing through large underwater loops at regular intervals—to help them escape detection by sea-floor monitoring systems, magnetic anomaly detectors, and magnetically-triggered mines. However, submarines are never completely de-magnetised. It is possible to tell the depth at which a submarine has been by measuring its magnetic field, which is distorted as the pressure distorts the hull and hence the field. Heating can also change the magnetization of steel.[clarification needed]\n\nSubmarines tow long sonar arrays to detect ships, and can even recognise different propeller noises. The sonar arrays need to be accurately positioned so they can triangulate direction to targets (e.g. ships). The arrays do not tow in a straight line, so fluxgate magnetometers are used to orient each sonar node in the array.\n\nFluxgates can also be used in weapons navigation systems, but have been largely superseded by GPS and ring laser gyroscopes.\n\nMagnetometers such as the German Foerster are used to locate ferrous ordnance. Caesium and Overhauser magnetometers are used to locate and help clean up old bombing and test ranges.\n\nUAV payloads also include magnetometers for a range of defensive and offensive tasks.[example  needed]\n\n\nMineral exploration[edit]\n\nMain article: Exploration geophysics\n\n  \nA Diamond DA42 light aircraft, modified for aerial survey with a nose-mounted boom containing a magnetometer at its tip\n\n\n\nMagnetometric surveys can be useful in defining magnetic anomalies which represent ore (direct detection), or in some cases gangue minerals associated with ore deposits (indirect or inferential detection). This includes iron ore, magnetite, hematite, and often pyrrhotite.\n\nDeveloped countries such as Australia, Canada and USA invest heavily in systematic airborne magnetic surveys of their respective continents and surrounding oceans, to assist with map geology and in the discovery of mineral deposits. Such aeromag surveys are typically undertaken with 400 m line spacing at 100 m elevation, with readings every 10 meters or more. To overcome the asymmetry in the data density, data is interpolated between lines (usually 5 times) and data along the line is then averaged. Such data is gridded to an 80 m × 80 m pixel size and image processed using a program like ERMapper. At an exploration lease scale, the survey may be followed by a more detailed helimag or crop duster style fixed wing at 50 m line spacing and 50 m elevation (terrain permitting). Such an image is gridded on a 10 x 10 m pixel, offering 64 times the resolution.\n\nWhere targets are shallow (<200 m), aeromag anomalies may be followed up with ground magnetic surveys on 10 m to 50 m line spacing with 1 m station spacing to provide the best detail (2 to 10 m pixel grid) (or 25 times the resolution prior to drilling).\n\nMagnetic fields from magnetic bodies of ore fall off with the inverse distance cubed (dipole target), or at best inverse distance squared (magnetic monopole target). One analogy to the resolution-with-distance is a car driving at night with lights on. At a distance of 400 m one sees one glowing haze, but as it approaches, two headlights, and then the left blinker, are visible.\n\nThere are many challenges interpreting magnetic data for mineral exploration. Multiple targets mix together like multiple heat sources and, unlike light, there is no magnetic telescope to focus fields. The combination of multiple sources is measured at the surface. The geometry, depth, or magnetisation direction (remanence) of the targets are also generally not known, and so multiple models can explain the data.\n\nPotent by Geophysical Software Solutions [1] is a leading magnetic (and gravity) interpretation package used extensively in the Australian exploration industry.\n\nMagnetometers assist mineral explorers both directly (i.e., gold mineralisation associated with magnetite, diamonds in kimberlite pipes) and, more commonly, indirectly, such as by mapping geological structures conducive to mineralisation (i.e., shear zones and alteration haloes around granites).\n\nAirborne Magnetometers detect the change in the Earth's magnetic field using sensors attached to the aircraft in the form of a \"stinger\" or by towing a magnetometer on the end of a cable. The magnetometer on a cable is often referred to as a \"bomb\" because of its shape. Others call it a \"bird\".\n\nBecause hills and valleys under the aircraft make the magnetic readings rise and fall, a radar altimeter keeps track of the transducer's deviation from the nominal altitude above ground. There may also be a camera that takes photos of the ground. The location of the measurement is determined by also recording a GPS.\n\n\nMobile phones[edit]\n\n  \nTri-axis Electronic Magnetometer by AKM Semiconductor, inside Motorola Xoom\n\n\n\nMany smartphones contain miniaturized microelectromechanical systems (MEMS) magnetometers which are used to detect magnetic field strength and are used as compasses. The iPhone 3GS has a magnetometer, a magnetoresistive permalloy sensor, the AN-203 produced by Honeywell.[34] In 2009, the price of three-axis magnetometers dipped below US$1 per device and dropped rapidly. The use of a three-axis device means that it is not sensitive to the way it is held in orientation or elevation. Hall effect devices are also popular.[35]\n\nResearchers at Deutsche Telekom have used magnetometers embedded in mobile devices to permit touchless 3D interaction. Their interaction framework, called MagiTact, tracks changes to the magnetic field around a cellphone to identify different gestures made by a hand holding or wearing a magnet.[36]\n\n\nOil exploration[edit]\n\nSeismic methods are preferred to magnetometers as the primary survey method for oil exploration although magnetic methods can give additional information about the underlying geology and in some environments evidence of leakage from traps.[37] Magnetometers are also used in oil exploration to show locations of geologic features that make drilling impractical, and other features that give geophysicists a more complete picture of stratigraphy.\n\n\nSpacecraft[edit]\n\nMain article: Spacecraft magnetometer\n\nA three-axis fluxgate magnetometer was part of the Mariner 2 and Mariner 10 missions.[38] A dual technique magnetometer is part of the Cassini–Huygens mission to explore Saturn.[39] This system is composed of a vector helium and fluxgate magnetometers.[40] Magnetometers were also a component instrument on the Mercury MESSENGER mission. A magnetometer can also be used by satellites like GOES to measure both the magnitude and direction of the magnetic field of a planet or moon.\n\n\nMagnetic surveys[edit]\n\n  \nGround surveying in Surprise Valley, Cedarville, California\n\n\n\nSystematic surveys can be used to in searching for mineral deposits or locating lost objects. Such surveys are divided into:\n\n\n\tAeromagnetic survey\n\tBorehole\n\tGround\n\tMarine\n\n\nAeromag datasets for Australia can be downloaded from the GADDS database.\n\nData can be divided in point located and image data, the latter of which is in ERMapper format.\n\n\nMagnetovision[edit]\n\nOn the base of space measured distribution of magnetic field parameters (e.g. amplitude or direction), the magnetovision images may be generated. Such presentation of magnetic data is very useful for further analyse and data fusion.\n\n\nGradiometer[edit]\n\nMagnetic gradiometers are pairs of magnetometers with their sensors separated, usually horizontally, by a fixed distance. The readings are subtracted to measure the difference between the sensed magnetic fields, which gives the field gradients caused by magnetic anomalies. This is one way of compensating both for the variability in time of the Earth's magnetic field and for other sources of electromagnetic interference, thus allowing for more sensitive detection of anomalies. Because nearly equal values are being subtracted, the noise performance requirements for the magnetometers is more extreme.\n\nGradiometers enhance shallow magnetic anomalies and are thus good for archaeological and site investigation work. They are also good for real-time work such as unexploded ordnance location. It is twice as efficient to run a base station and use two (or more) mobile sensors to read parallel lines simultaneously (assuming data is stored and post-processed). In this manner, both along-line and cross-line gradients can be calculated.\n\n\nPosition control of magnetic surveys[edit]\n\nIn traditional mineral exploration and archaeological work, grid pegs placed by theodolite and tape measure were used to define the survey area. Some UXO surveys used ropes to define the lanes. Airborne surveys used radio triangulation beacons, such as Siledus.\n\nNon-magnetic electronic hipchain triggers were developed to trigger magnetometers. They used rotary shaft encoders to measure distance along disposable cotton reels.\n\nModern explorers use a range of low-magnetic signature GPS units, including Real-Time Kinematic GPS.\n\n\nHeading errors in magnetic surveys[edit]\n\nMagnetic surveys can suffer from noise coming from a range of sources. Different magnetometer technologies suffer different kinds of noise problems.\n\nHeading errors are one group of noise. They can come from three sources:\n\n\n\tSensor\n\tConsole\n\tOperator\n\n\nSome total field sensors give different readings depending on their orientation. Magnetic materials in the sensor itself are the primary cause of this error. In some magnetometers, such as the vapor magnetometers (caesium, potassium, etc.), there are sources of heading error in the physics that contribute small amounts to the total heading error.\n\nConsole noise comes from magnetic components on or within the console. These include ferrite in cores in inductors and transformers, steel frames around LCDs, legs on IC chips and steel cases in disposable batteries. Some popular MIL spec connectors also have steel springs.\n\nOperators must take care to be magnetically clean and should check the 'magnetic hygiene' of all apparel and items carried during a survey. Akubra hats are very popular in Australia, but their steel rims must be removed before use on magnetic surveys. Steel rings on notepads, steel capped boots and steel springs in overall eyelets can all cause unnecessary noise in surveys. Pens, mobile phones and stainless steel implants can also be problematic.\n\nThe magnetic response (noise) from ferrous object on the operator and console can change with heading direction because of induction and remanence. Aeromagnetic survey aircraft and quad bike systems can use special compensators to correct for heading error noise.\n\nHeading errors look like herringbone patterns in survey images. Alternate lines can also be corrugated.\n\n\nImage processing of magnetic data[edit]\n\nRecording data and image processing is superior to real-time work because subtle anomalies often missed by the operator (especially in magnetically noisy areas) can be correlated between lines, shapes and clusters better defined. A range of sophisticated enhancement techniques can also be used. There is also a hard copy and need for systematic coverage.\n\n\nSee also[edit]\n\n\t\t\tBook: Geomagnetism\n\n\n\n\n\n\tAccelerometer\n\tAeromagnetic survey\n\tEarth's field NMR\n\tEMF measurement\n\tGyroscope\n\tInertial measurement unit\n\tINTERMAGNET\n\tMagnetic anomaly detector\n\tMagnetic immunoassay\n\tMagnetization\n\tMagnetogram\n\tMEMS magnetic field sensor\n\tSQUID\n\tVibrating-sample magnetometer\n\tZero field NMR\n\n\n\n\nReferences[edit]\n\n\n\t^ a b c Macintyre, Steven A. \"Magnetic field measurement\" (PDF). ENG Net Base (2000). CRC Press LLC. Retrieved 29 March 2014.\n\n\t^ \"USGS FS–236–95: Introduction to Potential Fields: Magnetics\" (PDF). USGS. Retrieved 29 March 2014.\n\n\n\t^ a b D. C. Hovde; M. D. Prouty; I. Hrvoic; R. E. Slocum (2013). \"Commercial magnetometers and their application\", in the book \"Optical Magnetometry\". Cambridge University Press. pp. 387–405. ISBN 978-0-511-84638-0.\n\n\n\t^ a b Edelstein, Alan (2007). \"Advances in magnetometry\" (PDF). J. Phys.: Condens. Matter. 19 (16): 165217 (28pp). Bibcode:2007JPCM...19p5217E. doi:10.1088/0953-8984/19/16/165217. Retrieved 29 March 2014.\n[permanent dead link]\n\n\t^ Tauxe, L.; Banerjee, S.K.; Butler, R.F.; van der Voo, R. \"Essentials of Paleomagnetism: Third Web Edition 2014\". Magnetics Information Consortium (MagIC). Retrieved 30 March 2014.\n\n\n\t^ JERZY JANKOWSKI & CHRISTIAN SUCKSDORFF (1996). IAGA GUIDE FOR MAGNETIC MEASUREMENTS AND OISERVAIORY PRACTICE (PDF). Warsaw: International Association of Geomagnetism and Aeronomy. p. 51. ISBN 978-0-9650686-2-8. Archived from the original (PDF) on 4 March 2016.\n\n\n\t^ Gauss, C.F. (1832). \"The Intensity of the Earth's Magnetic Force Reduced to Absolute Measurement\" (PDF). Retrieved 21 October 2009.\n\n\n\t^ \"Magnetometer: The History\". CT Systems. Archived from the original on 30 September 2007. Retrieved 21 October 2009.\n\n\n\t^ \"Ferromagnetic Materials\". Archived from the original on 27 June 2015. Retrieved 26 May 2015.\n\n\n\t^ Ronalds, B.F. (2016). \"The Beginnings of Continuous Scientific Recording using Photography: Sir Francis Ronalds' Contribution\". European Society for the History of Photography. Retrieved 2 June 2016.\n\n\n\t^ Ronalds, B.F. (2016). Sir Francis Ronalds: Father of the Electric Telegraph. London: Imperial College Press. ISBN 978-1-78326-917-4.\n\n\n\t^ David Gubbins; Emilio Herrero-Bervera, eds. (2007). Encyclopedia of Geomagnetism and Paleomagnetism. Springer. ISBN 978-1-4020-3992-8.\n\n\n\t^ \"MicroMicrofabricated Optically Pumped Magnetometers to Detect Source of Seizures\". Medgadget. 17 April 2017. Retrieved 18 April 2017.\n\n\n\t^ Kelley, Sean (26 July 2016). \"Measuring Field Strength with an Optically Pumped Magnetometer\". National Institute of Standards and Technology. Retrieved 18 April 2017.\n\n\n\t^ Dr. Ivan Hrvoic, Ph.D., P.Eng. \"Requirements for obtaining high accuracy with proton magnetometers\". GEM Systems Inc., 11 January 2010.\n\n\t^ Robert C. Snare. \"A History of Vector Magnetometry in Space\". Archived from the original on 20 May 2012. Retrieved 25 October 2012.\n\n\n\t^ Hrvoic I (2008) Development of a new high sensitivity Potassium magnetometer for geophysical mapping, First Break 26:81–85\n\n\t^ Michael J. Caruso, Applications of Magnetoresistive Sensors in Navigation Systems (PDF), Honeywell Inc., archived from the original (PDF) on 5 July 2010, retrieved 21 October 2012\n\n\n\t^ Snare, Robert C. (1998). \"A history of vector magnetometry in space\".  In Pfaff, Robert F.; Borovsky, Josep E.; Young, David T. (eds.). Measurement Techniques in Space Plasmas Fields. Washington, D. C.: American Geophysical Union. pp. 101–114. doi:10.1002/9781118664391.ch12 (inactive 20 August 2019).\n\n\n\t^ Musmann, Günter Dr. (2010). Fluxgate Magnetometers for Space Research. Norderstedt: Books on Demand. ISBN 9783839137024.\n\n\n\t^ Thomas H. Maugh II (24 January 2009). \"Victor Vacquier Sr. dies at 101; geophysicist was a master of magnetics\". The Los Angeles Times.\n\n\n\t^ http://www.mdpi.com/1424-8220/14/8/13815/pdf\n\n\t^ http://www.ti.com/lit/gpn/drv425\n\n\t^ \"Landmine and UXO detection brochure – Foerster Instruments\". Retrieved 25 October 2012.\n\n\n\t^ Kominis, I.K.; Kornack, T.W.; Allred, J.C.; Romalis, M.V. (4 February 2003). \"A subfemtotesla multichannel atomic magnetometer\". Nature. 422 (6932): 596–9. Bibcode:2003Natur.422..596K. doi:10.1038/nature01484. PMID 12686995.\n\n\n\t^ Budker, D.; Romalis, M.V. (2006). \"Optical Magnetometry\". Nature Physics. 3 (4): 227–234. arXiv:physics/0611246. Bibcode:2007NatPh...3..227B. doi:10.1038/nphys566.\n\n\n\t^ Kitching, J.; Knappe, S.; Shah, V.; Schwindt, P.; Griffith, C.; Jimenez, R.; Preusser, J.; Liew, L. -A.; Moreland, J. (2008). \"Microfabricated atomic magnetometers and applications\". 2008 IEEE International Frequency Control Symposium. p. 789. doi:10.1109/FREQ.2008.4623107. ISBN 978-1-4244-1794-0.\n\n\n\t^ Coillot, C.; Nativel, E.; Zanca, M.; Goze-Bac, C. (2016). \"The magnetic field homogeneity of coils by means of the space harmonics suppression of the current density distribution\" (PDF). J. Sens. Sens. Syst. 5 (2): 401–408. doi:10.5194/jsss-5-401-2016.\n\n\n\t^ Staples, S. G. H.; Vo, C.; Cowell, D. M. J.; Freear, S.; Ives, C.; Varcoe, B. T. H. (7 April 2013). \"Solving the inverse problem of magnetisation–stress resolution\". Journal of Applied Physics. 113 (13): 133905. doi:10.1063/1.4799049. ISSN 0021-8979.\n\n\n\t^ Wilson, John W.; Tian, Gui Yun; Barrans, Simon (April 2007). \"Residual magnetic field sensing for stress measurement\". Sensors and Actuators A: Physical. 135 (2): 381–387. doi:10.1016/j.sna.2006.08.010.\n\n\n\t^ \"The K-index\". Space Weather Prediction Center. 1 October 2007. Archived from the original on 22 October 2013. Retrieved 21 October 2009.\n\n\n\t^ Abraham, Jared D.;  et al. (April 2008). Aeromagnetic Survey in Afghanistan: A Website for Distribution of Data (Report). United States Geological Survey. OF 07-1247.\n\n\n\t^ \"The application of titanium Navy\". Free press release. 15 September 2010. Retrieved 9 December 2013.\n\n\n\t^ Allan, Alasdair (2011). \"5. Using the magnetometer\". Basic sensors in iOS (1st ed.). Sebastopol, CA: O'Reilly. pp. 57–70. ISBN 978-1-4493-1542-9.\n\n\n\t^ Willie D. Jones (February 2010), \"A Compass in Every Smartphone\", IEEE Spectrum, retrieved 21 October 2012\n\n\n\t^ MagiTact. Portal.acm.org. Retrieved on 23 March 2011.\n\n\t^ \"中国科技论文在线\". Archived from the original on 11 September 2018.\n\n\n\t^ Coleman Jr., P.J.; Davis Jr., L.; Smith, E.J.; Sonett, C.P. (1962). \"The Mission of Mariner II: Preliminary Observations – Interplanetary Magnetic Fields\". Science. 138 (3545): 1099–1100. Bibcode:1962Sci...138.1099C. doi:10.1126/science.138.3545.1099. JSTOR 1709490. PMID 17772967.\n\n\n\t^ \"Cassini Orbiter Instruments – MAG\". JPL/NASA. Archived from the original on 8 April 2014.\n\n\n\t^ Dougherty M.K.; Kellock S.; Southwood D.J.;  et al. (2004). \"The Cassini magnetic field investigation\" (PDF). Space Science Reviews. 114 (1–4): 331–383. Bibcode:2004SSRv..114..331D. doi:10.1007/s11214-004-1432-2.\n\n\n\n\n\nFurther reading[edit]\n\n\n\tHollos, Stefan; Hollos, Richard (2008). Signals from the Subatomic World: How to Build a Proton Precession Magnetometer. Abrazol Publishing. ISBN 978-1-887187-09-1.\n\n\tRipka, Pavel, ed. (2001). Magnetic sensors and magnetometers. Boston, Mass.: Artech House. ISBN 978-1-58053-057-6.\n\n\tTumanski, S. (2011). \"4. Magnetic sensors\". Handbook of magnetic measurements. Boca Raton, FL: CRC Press. pp. 159–256. ISBN 978-1-4398-2952-3.\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Magnetometer.\n\n\n\tEarthquake forecasting techniques and more research on the study of electromagnetic fields\n\tUSGS Geomagnetism Program\n\tEarth's Field NMR (EFNMR)\n\tSpace-based magnetometers\n\tPractical guidelines for building a magnetometer by hobbyists – Part 1 Introduction\n\tPractical guidelines for building a magnetometer by hobbyists – Part 2 Building\n\n\n\t\tv\n\tt\n\te\n\n\nScience instruments on satellites and spacecraft\n\n\tRadar\t\n\tCassini–Huygens\n\tMagellan\n\tPaz\n\tPioneer Venus Orbiter\n\tREASON\n\tSELENE\n\tSHARAD\n\tMARSIS\n\tVenera 4\n\t8\n\t9\n\t10\n\t15\n\t16\n\tWISDOM\n\n\n\n\n\tRadio science\t\n\tAkatsuki\n\tCassini–Huygens\n\tEuropa-UVS\n\tExoMars lander\n\tGalileo\n\tInSight\n\tKaguya\n\tMagellan\n\tMariner 2\n\t3\n\t4\n\t5\n\t6, 7\n\t9\n\t10\n\tMars Express\n\tMESSENGER\n\tNozomi\n\tPioneer 7\n\t10\n\t11\n\tPioneer Venus Orbiter\n\tSakigake\n\tVenus Express\n\tVenera 9\n\tVoyager 1\n\t2\n\n\n\n\n\tRadiometer\t\n\tMicrowave\t\n\tNear Earth\t\n\tAQUA\n\tAMR-C (Sentinel-6)\n\tAMSR-E (AQUA)\n\tAMSR (ADEOS II)\n\tAMSR2 (Shizuku)\n\tDMSP 5D-2/F13-F15\n\tDMSP 5D-2/F16\n\tERSS\n\tEnvisat\n\tGPM Core\n\tKanopus-ST\n\tMIRAS\n\tMISR, MOPITT (Terra)\n\tMSR (MOS-1, MOS-1b)\n\tMTVZA (Meteor-3M-1)\n\tMTVZA-GYa\n\tMeteor-M2\n\tMeteor-M2-1\n\n\n\tNimbus 7\n\tRM-08 and MTVZA-OK (Sich-1M)\n\tSeasat\n\tSentinel-3\n\tSMAP\n\tSMMR\n\tSMOS\n\tSSM/I\n\tSSMIS\n\tTRMM\n\tWSF-M\n\tZond-PP\n\n\n\n\n\tInterplanetary\t\n\tCassini-Huygens\n\tElectra (radio)\n\tMariner 2\n\tMWR (Juno)\n\tRosetta\n\n\n\n\n\n\n\n\tInfrared-Visible\t\n\tNear Earth\t\n\tAVHRR\n\tASTER, MISR (Terra)\n\tAIRS\n\tAVNIR\n\tAVNIR-2\n\tCERES (TRMM, Terra, Aura, Suomi NPP, NOAA-20)\n\tERBS\n\tERSS\n\tGLI (ADEOS II)\n\tKanopus-V-IK\n\tMESSR and VTIR\n\tMOS-1\n\t1b\n\n\n\tMeteor-2\n\tMODIS (Terra, Aqua)\n\tOPS (JERS-1)\n\tORI (EURECA)\n\tRadiation Budget Instrument\n\tSGLI (GCOM-C)\n\tSLSTR (Sentinel-3)\n\tVIIRS (Suomi NPP, JPSS-2)\n\n\n\n\n\tInterplanetary\t\n\tCOMARS+ (on Schiaparelli)\n\tDiviner (on LRO)\n\tHP3 (on InSight)\n\n\n\tIRIS\n\tLuna 13\n\tMariner 6 and 7\n\tMariner 10\n\tMars 96\n\t2M No.521\n\t2M No.522\n\tPioneer 10\n\t11\n\tPMIRR (on Mars Climate Orbiter)\n\tVenera 9\n\t10\n\tVoyager 1\n\t2\n\n\n\n\n\n\n\n\tUltraviolet (UV)\t\n\tNear Earth\t\n\tORI (EURECA)\n\tLYRA\n\tProba-2\n\n\n\n\n\n\n\n\n\n\n\n\n\tSpectrophotometers\t\n\tLong wavelength\t\n\tInterplanetary\t\n\tISO\n\n\n\n\n\n\n\n\tVisible-IR (VIRS)\t\n\tNear Earth\t\n\tMOMS\n\tMultispectral Scanner\n\tSCIAMACHY\n\tTES\n\tTRMM\n\n\n\n\n\tInterplanetary\t\n\tAKARI\n\tEnvisat\n\tRosalind Franklin rover\n\tMA-MISS\n\tISEM\n\n\n\tInfrared Space Observatory\n\tIRIS (Voyager 1 and 2)\n\tJIRAM (on Juno)\n\tM3\n\tMariner 6 and 7\n\tMASCS\n\tMERIS\n\tE-THEMIS, MISE, SUDA (on Europa Clipper)\n\tRalph\n\tSPICAM\n\tSPICAV\n\n\n\n\n\n\n\n\tUV-visible (UVVS)\t\n\tInterplanetary\t\n\tAlice\n\tMariner 6 and 7\n\tMariner 10\n\tMASCS\n\tNOMAD\n\tSPICAM\n\tSPICAV\n\tUVS\n\tVoyager 1\n\t2\n\n\n\n\n\n\n\n\tRaman\t\n\tInterplanetary\t\n\tRaman Laser Spectrometer (Rosalind Franklin rover)\n\tSHERLOC (Mars 2020 rover)\n\n\n\n\n\n\n\n\n\n\n\tMagnetometer\t\n\tNear Earth\t\n\tGOES\n\tQuakeSat 1 and 2\n\tSGVM\n\tProba-2\n\n\n\n\n\n\n\tInterplanetary\t\n\tFIELDS\n\tPioneer 10\n\t11\n\tVoyager 1\n\t2\n\tMAG  (Juno)\n\tICEMAG and PIMS (Europa Clipper)\n\n\n\n\n\tTriaxial fluxgate\t\n\tInterplanetary\t\n\tCassini–Huygens\n\tFIELDS\n\tMagsat\n\tMariner 2\n\t4\n\t5\n\t10\n\tMESSENGER\n\tPioneer 11\n\tVenus Express\n\n\n\n\n\n\n\n\tHelium vapor\t\n\tInterplanetary\t\n\tCassini–Huygens\n\n\n\n\n\n\n\n\n\n\n\tParticle\ndetectors\t\n\tIon detectors\t\n\tNear Earth\t\n\tDEMETER\n\tTPMU and DSLP\n\tProba-2\n\n\n\n\n\n\n\tInterplanetary\t\n\tASPERA-3\n\tASPERA-4\n\tMariner 2\n\tSPS\n\tUlysses\n\n\n\n\n\n\n\n\tNeutral particle detector\t\n\tInterplanetary\t\n\tADRON-RM (Rosalind Franklin rover)\n\tASPERA-3 (on Mars Express)\n\tASPERA-4 (on Venus Express)\n\tDAN (on Curiosity)\n\tFREND (on ExoMars TGO)\n\tNozomi\n\tSPS (on Mariner 2)\n\tUlysses\n\n\n\n\n\n\n\n\tMass spectrometer\t\n\tInterplanetary\t\n\tMASPEX (Europa Clipper)\n\tMOMA (Rosalind Franklin rover)\n\n\n\n\n\n\n\n\n\n\n\tSeismometers\t\n\tSEIS (on InSight)\n\tViking 1\n\t2\n\n\n\n\n\tImagers/telescopes\t\n\tHigh Resolution Stereo Camera\n\tHiRISE\n\tLORRI\n\tMars Orbiter Camera\n\n\n\n\n\tMicroscopes\t\n\tMicrOmega-IR (Rosalind Franklin rover)\n\n\n\n\n\tAstronomical\ninstruments\t\n\tInternational Lunar Observatory\n\tMoonLIGHT\n\n\n\n\n\tMisc\t\n\tDeep Space Atomic Clock\n\tInertial Stellar Compass\n\tVenetia Burney Student Dust Counter\n\tPlasma Wave Subsystem\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSensors\n\n\tAcoustic, sound, vibration\t\n\tGeophone\n\tHydrophone\n\tMicrophone\n\tSeismometer\n\n\n\n\n\tAutomotive, transportation\t\n\tAir–fuel ratio meter\n\tBlind spot monitor\n\tCrankshaft position sensor\n\tCurb feeler\n\tDefect detector\n\tEngine coolant temperature sensor\n\tHall effect sensor\n\tMAP sensor\n\tMass flow sensor\n\tOmniview technology\n\tOxygen sensor\n\tParking sensors\n\tRadar gun\n\tSpeed sensor\n\tSpeedometer\n\tThrottle position sensor\n\tTire-pressure monitoring system\n\tTorque sensor\n\tTransmission fluid temperature sensor\n\tTurbine speed sensor\n\tVariable reluctance sensor\n\tVehicle speed sensor\n\tWater sensor\n\tWheel speed sensor\n\n\n\n\n\tChemical\t\n\tBreathalyzer\n\tCarbon dioxide sensor\n\tCarbon monoxide detector\n\tCatalytic bead sensor\n\tChemical field-effect transistor\n\tElectrochemical gas sensor\n\tElectrolyte–insulator–semiconductor sensor\n\tElectronic nose\n\tFluorescent chloride sensors\n\tHolographic sensor\n\tHydrocarbon dew point analyzer\n\tHydrogen sensor\n\tHydrogen sulfide sensor\n\tInfrared point sensor\n\tIon selective electrode\n\tMicrowave chemistry sensor\n\tNitrogen oxide sensor\n\tNondispersive infrared sensor\n\tOlfactometer\n\tOptode\n\tOxygen sensor\n\tPellistor\n\tpH glass electrode\n\tPotentiometric sensor\n\tRedox electrode\n\tSmoke detector\n\tZinc oxide nanorod sensor\n\n\n\n\n\tElectric, magnetic, radio\t\n\tCurrent sensor\n\tElectroscope\n\tGalvanometer\n\tHall effect sensor\n\tHall probe\n\tMagnetic anomaly detector\n\tMagnetometer\n\tMEMS magnetic field sensor\n\tMetal detector\n\tPlanar Hall sensor\n\tRadio direction finder\n\tTest light\n\n\n\n\n\tEnvironment, weather,\n moisture\t\n\tActinometer\n\tBedwetting alarm\n\tCeilometer\n\tDew warning\n\tElectrochemical gas sensor\n\tFish counter\n\tFrequency domain sensor\n\tGas detector\n\tHook gauge evaporimeter\n\tHumistor\n\tHygrometer\n\tLeaf sensor\n\tPsychrometer\n\tPyranometer\n\tPyrgeometer\n\tRain gauge\n\tRain sensor\n\tSNOTEL\n\tSnow gauge\n\tSoil moisture sensor\n\tStream gauge\n\tTide gauge\n\tWeather radar\n\n\n\n\n\tFlow, fluid velocity\t\n\tAir flow meter\n\tAnemometer\n\tFlow sensor\n\tGas meter\n\tMass flow sensor\n\tWater metering\n\n\n\n\n\tIonising radiation,\n subatomic particles\t\n\tBubble chamber\n\tCloud chamber\n\tGeiger–Müller tube\n\tGeiger counter\n\tIonization chamber\n\tNeutron detection\n\tParticle detector\n\tProportional counter\n\tScintillation counter\n\tSemiconductor detector\n\tScintillator\n\tThermoluminescent dosimeter\n\tWire chamber\n\n\n\n\n\tNavigation instruments\t\n\tAirspeed indicator\n\tMachmeter\n\tAltimeter\n\tAttitude indicator\n\tDepth gauge\n\tFluxgate compass\n\tGyroscope\n\tInertial navigation system\n\tInertial reference unit\n\tMagnetic compass\n\tMHD sensor\n\tRing laser gyroscope\n\tTurn coordinator\n\tVariometer\n\tVibrating structure gyroscope\n\tYaw-rate sensor\n\n\n\n\n\tPosition, angle,\n displacement\t\n\tAccelerometer\n\tAngular rate sensor\n\tAuxanometer\n\tCapacitive displacement sensor\n\tCapacitive sensing\n\tGravimeter\n\tInclinometer\n\tIntegrated circuit piezoelectric sensor\n\tLaser rangefinder\n\tLaser surface velocimeter\n\tLidar\n\tLinear encoder\n\tLinear variable differential transformer\n\tLiquid capacitive inclinometers\n\tOdometer\n\tPhotoelectric sensor\n\tPiezoelectric accelerometer\n\tPosition sensor\n\tRotary encoder\n\tRotary variable differential transformer\n\tSelsyn\n\tSudden Motion Sensor\n\tTachometer\n\tTilt sensor\n\tUltrasonic thickness gauge\n\tVariable reluctance sensor\n\tVelocity receiver\n\n\n\n\n\tOptical, light, imaging\t\n\tActive pixel sensor\n\tAngle–sensitive pixel\n\tBack-illuminated sensor\n\tCharge-coupled device\n\tContact image sensor\n\tElectro-optical sensor\n\tFlame detector\n\tInfrared\n\tKinetic inductance detector\n\tLED as light sensor\n\tLight-addressable potentiometric sensor\n\tNichols radiometer\n\tOptical fiber\n\tPhotodetector\n\tPhotodiode\n\tPhotoelectric sensor\n\tPhotoionization detector\n\tPhotomultiplier\n\tPhotoresistor\n\tPhotoswitch\n\tPhototransistor\n\tPhototube\n\tPosition sensitive device\n\tScintillometer\n\tShack–Hartmann wavefront sensor\n\tSingle-photon avalanche diode\n\tSuperconducting nanowire single-photon detector\n\tTransition edge sensor\n\tTristimulus colorimeter\n\tVisible-light photon counter\n\tWavefront sensor\n\n\n\n\n\tPressure\t\n\tBarograph\n\tBarometer\n\tBoost gauge\n\tBourdon gauge\n\tHot-filament ionization gauge\n\tIonization gauge\n\tMcLeod gauge\n\tOscillating U-tube\n\tPermanent Downhole Gauge\n\tPiezometer\n\tPirani gauge\n\tPressure gauge\n\tPressure sensor\n\tTactile sensor\n\tTime pressure gauge\n\n\n\n\n\tForce, density, level\t\n\tBhangmeter\n\tForce gauge\n\tHydrometer\n\tLevel sensor\n\tLoad cell\n\tMagnetic level gauge\n\tNuclear density gauge\n\tPiezoelectric sensor\n\tStrain gauge\n\tTorque sensor\n\tViscometer\n\n\n\n\n\tThermal, heat,\n temperature\t\n\tBimetallic strip\n\tBolometer\n\tCalorimeter\n\tExhaust gas temperature gauge\n\tFlame detection\n\tGardon gauge\n\tGolay cell\n\tHeat flux sensor\n\tInfrared thermometer\n\tMicrobolometer\n\tMicrowave radiometer\n\tNet radiometer\n\tQuartz thermometer\n\tResistance thermometer\n\tSilicon bandgap temperature sensor\n\tSpecial sensor microwave/imager\n\tThermistor\n\tThermocouple\n\tThermometer\n\n\n\n\n\tProximity, presence\t\n\tAlarm sensor\n\tDoppler radar\n\tMotion detector\n\tOccupancy sensor\n\tPassive infrared sensor\n\tProximity sensor\n\tReed switch\n\tStud finder\n\tTouch switch\n\tTriangulation sensor\n\tWired glove\n\n\n\n\n\tSensor technology\t\n\tActive pixel sensor\n\tBack-illuminated sensor\n\tBiochip\n\tBiosensor\n\tCapacitance probe\n\tCarbon paste electrode\n\tCatadioptric sensor\n\tDigital sensors\n\tDisplacement receiver\n\tElectromechanical film\n\tElectro-optical sensor\n\tFabry–Pérot interferometer\n\tFisheries acoustics\n\tImage sensor\n\tImage sensor format\n\tInductive sensor\n\tIntelligent sensor\n\tLab-on-a-chip\n\tLeaf sensor\n\tMachine vision\n\tMicroelectromechanical systems\n\tPhotoelasticity\n\tQuantum sensor\n\tRadar\n\tGround-penetrating radar\n\tSynthetic aperture radar\n\n\n\tRadar tracker\n\tSensor array\n\tSensor fusion\n\tSensor grid\n\tSensor node\n\tSoft sensor\n\tSonar\n\tStaring array\n\tTransducer\n\tUltrasonic sensor\n\tVideo sensor technology\n\tVisual sensor network\n\tWheatstone bridge\n\tWireless sensor network\n\n\n\n\n\tRelated\t\n\tList of sensors\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Magnetometer&oldid=918468362\"\n\n\t\t\n\t\tCategories: \tMagnetic devices\n\tMagnetometers\n\tMeasuring instruments\n\tNuclear magnetic resonance\n\tSensors\n\n\nHidden categories: \tAll articles with dead external links\n\tArticles with dead external links from July 2017\n\tArticles with permanently dead external links\n\tPages with DOIs inactive as of 2019 August\n\tArticles with short description\n\tUse dmy dates from July 2019\n\tWikipedia articles needing clarification from July 2013\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from January 2012\n\tArticles with unsourced statements from June 2011\n\tWikipedia articles needing clarification from June 2011\n\tAll articles needing examples\n\tArticles needing examples from June 2011\n\tCommons category link is on Wikidata\n\tArticles containing video clips\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tБългарски\n\tCatalà\n\tČeština\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tҚазақша\n\tКыргызча\n\tLietuvių\n\tMagyar\n\tമലയാളം\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSlovenčina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 28 September 2019, at 20:30 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "15", "dc:title": "Magnetometer - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Pioneer_10-11_-_P50_-_fx.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-magnetometer", "title": "Magnetometer - Wikipedia"}}