{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMagnetic field - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tMagnetic field\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tSpatial distribution of vectors allowing the calculation of the magnetic force on a test particle\n\nFor other uses, see Magnetic field (disambiguation).\n\n  \nThe shape of the magnetic field produced by a horseshoe magnet is revealed by the orientation of iron filings sprinkled on a piece of paper above the magnet.\n\n\n\n\tPart of a series of articles about\n\tElectromagnetism\n\t\n\t\n\tElectricity\n\tMagnetism\n\n\n\t\nElectrostatics\n\n\tConductor\n\tCoulomb's law\n\tElectric charge\n\tElectric dipole moment\n\tElectric field\n\tElectric flux / potential energy\n\tElectrostatic discharge\n\tGauss's law\n\tInduction\n\tInsulator\n\tPolarization density\n\tStatic electricity\n\tTriboelectricity\n\n\n\n\n\t\nMagnetostatics\n\n\tAmpère's law\n\tBiot–Savart law\n\tGauss's law for magnetism\n\tMagnetic field\n\tMagnetic flux\n\tMagnetic dipole moment\n\tMagnetization\n\tMagnetomotive force\n\n\n\n\n\t\nElectrodynamics\n\n\tLorentz force law\n\tElectromagnetic induction\n\tFaraday's law\n\tLenz's law\n\tDisplacement current\n\tMagnetic potential\n\tMaxwell's equations\n\tElectromagnetic field\n\tElectromagnetic pulse\n\tElectromagnetic radiation\n\tMaxwell tensor\n\tPoynting vector\n\tLiénard–Wiechert potential\n\tJefimenko's equations\n\tEddy current\n\tLondon equations\n\n\n\tMathematical descriptions of the electromagnetic field\n\n\n\n\n\n\t\nElectrical network\n\n\tAlternating current\n\tCapacitance\n\tDirect current\n\tElectric current\n\tElectric potential\n\tElectromotive force\n\tImpedance\n\tInductance\n\tOhm's law\n\tParallel circuit\n\tResistance\n\tResonant cavities\n\tSeries circuit\n\tVoltage\n\tWaveguides\n\n\n\n\n\t\nCovariant formulation\n\n\tElectromagnetic tensor\n(stress–energy tensor)\n\n\n\n\tFour-current\n\tElectromagnetic four-potential\n\n\n\n\n\t\nScientists\n\n\tAmpère\n\tBiot\n\tCoulomb\n\tFaraday\n\tGauss\n\tHeaviside\n\tHenry\n\tHertz\n\tLenz\n\tLorentz\n\tMaxwell\n\tØrsted\n\tSavart\n\tTesla\n\tVolta\n\tWeber\n\t\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nA magnetic field is a vector field that describes the magnetic influence of electric charges in relative motion[1][2] and magnetized materials.  The effects of magnetic fields are commonly seen in permanent magnets, which pull on magnetic materials (such as iron) and attract or repel other magnets. Magnetic fields surround and are created by magnetized material and by moving electric charges (electric currents) such as those used in electromagnets.  They exert forces on nearby moving electrical charges and torques on nearby magnets. In addition, a magnetic field that varies with location exerts a force on magnetic materials. Both the strength and direction of a magnetic field vary with location.  As such, it is described mathematically as a vector field.\n\nIn electromagnetics, the term \"magnetic field\" is used for two distinct but closely related fields denoted by the symbols B and H. In the International System of Units, H, magnetic field strength, is measured in the SI base units of ampere per meter.[3] B, magnetic flux density, is measured in tesla (in SI base units: kilogram per second2 per ampere),[4] which is equivalent to newton per meter per ampere. H and B differ in how they account for magnetization. In a vacuum, B and H are the same aside from units; but in a magnetized material, B/\n  \n    \n      \n        \n          μ\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle \\mu _{0}}\n  \n and H differ by the magnetization M of the material at that point in the material.\n\nMagnetic fields are produced by moving electric charges and the intrinsic magnetic moments of elementary particles associated with a fundamental quantum property, their spin.[5][6] Magnetic fields and electric fields are interrelated, and are both components of the electromagnetic force, one of the four fundamental forces of nature.\n\nMagnetic fields are widely used throughout modern technology, particularly in electrical engineering and electromechanics. Rotating magnetic fields are used in both electric motors and generators. The interaction of magnetic fields in electric devices such as transformers is studied in the discipline of magnetic circuits. Magnetic forces give information about the charge carriers in a material through the Hall effect. The Earth produces its own magnetic field, which shields the Earth's ozone layer from the solar wind and is important in navigation using a compass.\n\n\nContents\n\n\n\t1 History\n\t2 Definitions, units, and measurement\n\t2.1 The B-field\n\t2.2 The H-field\n\t2.3 Units\n\t2.4 Measurement\n\n\n\n\t3 Magnetic field lines\n\t4 Magnetic field and permanent magnets\n\t4.1 Magnetic field of permanent magnets\n\t4.2 Magnetic pole model and the H-field\n\t4.3 Amperian loop model and the B-field\n\t4.4 Force between magnets\n\t4.5 Magnetic torque on permanent magnets\n\n\n\n\t5 Magnetic field and electric currents\n\t5.1 Magnetic field due to moving charges and electric currents\n\t5.2 Force on moving charges and current\n\t5.2.1 Force on a charged particle\n\t5.2.2 Force on current-carrying wire\n\t5.2.3 Direction of force\n\n\n\n\n\n\n\t6 Relation between H and B\n\t6.1 Magnetization\n\t6.2 H-field and magnetic materials\n\t6.3 Magnetism\n\n\n\n\t7 Energy stored in magnetic fields\n\t8 Electromagnetism: the relationship between magnetic and electric fields\n\t8.1 Faraday's Law: Electric force due to a changing B-field\n\t8.2 Maxwell's correction to Ampère's Law: The magnetic field due to a changing electric field\n\t8.3 Maxwell's equations\n\t8.4 Electric and magnetic fields: different aspects of the same phenomenon\n\t8.5 Magnetic vector potential\n\t8.6 Quantum electrodynamics\n\n\n\n\t9 Important uses and examples of magnetic field\n\t9.1 Earth's magnetic field\n\t9.2 Record-high fields\n\t9.3 Rotating magnetic fields\n\t9.4 Hall effect\n\t9.5 Magnetic circuits\n\t9.6 Magnetic field shape descriptions\n\t9.7 Magnetic dipoles\n\t9.8 Magnetic monopole (hypothetical)\n\n\n\n\t10 See also\n\t10.1 General\n\t10.2 Mathematics\n\t10.3 Applications\n\n\n\n\t11 Notes\n\t12 References\n\t13 Further reading\n\t14 External links\n\t14.1 Information\n\t14.2 Field density\n\t14.3 Rotating magnetic fields\n\t14.4 Diagrams\n\n\n\n\n\n\n\n\n\nHistory[edit]\n\nMain article: History of electromagnetic theory\n\n  \nOne of the first drawings of a magnetic field, by René Descartes, 1644, showing the Earth attracting lodestones.  It illustrated his theory that magnetism was caused by the circulation of tiny helical particles, \"threaded parts\", through threaded pores in magnets.\n\n\n\nAlthough magnets and magnetism were studied much earlier, the research of magnetic fields began in 1269 when French scholar Petrus Peregrinus de Maricourt mapped out the magnetic field on the surface of a spherical magnet using iron needles.[nb 1] Noting that the resulting field lines crossed at two points he named those points \"poles\" in analogy to Earth's poles. He also clearly articulated the principle that magnets always have both a north and south pole, no matter how finely one slices them.\n\nAlmost three centuries later, William Gilbert of Colchester replicated Petrus Peregrinus's work and was the first to state explicitly that Earth is a magnet.[7] Published in 1600, Gilbert's work, De Magnete, helped to establish magnetism as a science.\n\nIn 1750, John Michell stated that magnetic poles attract and repel in accordance with an inverse square law.[8] Charles-Augustin de Coulomb experimentally verified this in 1785 and stated explicitly that the north and south poles cannot be separated.[9] Building on this force between poles, Siméon Denis Poisson (1781–1840) created the first successful model of the magnetic field, which he presented in 1824.[10] In this model, a magnetic H-field is produced by \"magnetic poles\" and magnetism is due to small pairs of north/south magnetic poles.\n\n\n  \nHans Christian Ørsted, Der Geist in der Natur, 1854\n\n\n\nThree discoveries in 1820 challenged this foundation of magnetism, though. Hans Christian Ørsted demonstrated that a current-carrying wire is surrounded by a circular magnetic field.[11] Then André-Marie Ampère showed that parallel wires with currents attract one another if the currents are in the same direction and repel if they are in opposite directions.[12] Finally, Jean-Baptiste Biot and Félix Savart announced empirical results about the forces that a current-carrying long, straight wire exerted on a small magnet, determining that the forces were inversely proportional to the perpendicular distance from the wire to the magnet.[13] Laplace later deduced, but did not publish, a law of force[13] based on the differential action of a differential section of the wire,[14] which became known as the Biot–Savart law.[15]\n\nExtending these experiments, Ampère published his own successful model of magnetism in 1825. In it, he showed the equivalence of electrical currents to magnets[16] and proposed that magnetism is due to perpetually flowing loops of current instead of the dipoles of magnetic charge in Poisson's model.[nb 2] This has the additional benefit of explaining why magnetic charge can not be isolated. Further, Ampère derived both Ampère's force law describing the force between two currents and Ampère's law, which, like the Biot–Savart law, correctly described the magnetic field generated by a steady current. Also in this work, Ampère introduced the term electrodynamics to describe the relationship between electricity and magnetism.\n\nIn 1831, Michael Faraday discovered electromagnetic induction when he found that a changing magnetic field generates an encircling electric field. He described this phenomenon in what is known as Faraday's law of induction. Later, Franz Ernst Neumann proved that, for a moving conductor in a magnetic field, induction is a consequence of Ampère's force law.[17] In the process, he introduced the magnetic vector potential, which was later shown to be equivalent to the underlying mechanism proposed by Faraday.\n\nIn 1850, Lord Kelvin, then known as William Thomson, distinguished between two magnetic fields now denoted H and B. The former applied to Poisson's model and the latter to Ampère's model and induction.[18] Further, he derived how H and B relate to each other.\n\nThe reason magnetic fields H and B are used for the two magnetic fields has been a source of some debate among science historians. Most agree that Kelvin avoided M to prevent confusion with the SI fundamental unit of length, the Metre, abbreviated \"m\". Others believe the choices were purely random.[19][20]\n\nBetween 1861 and 1865, James Clerk Maxwell developed and published Maxwell's equations, which explained and united all of classical electricity and magnetism. The first set of these equations was published in a paper entitled On Physical Lines of Force in 1861. These equations were valid although incomplete. Maxwell completed his set of equations in his later 1865 paper A Dynamical Theory of the Electromagnetic Field and demonstrated the fact that light is an electromagnetic wave. Heinrich Hertz experimentally confirmed this fact in 1887.\n\nThe twentieth century extended electrodynamics to include relativity and quantum mechanics. Albert Einstein, in his paper of 1905 that established relativity, showed that both the electric and magnetic fields are part of the same phenomena viewed from different reference frames. (See moving magnet and conductor problem for details about the thought experiment that eventually helped Albert Einstein to develop special relativity.) Finally, the emergent field of quantum mechanics was merged with electrodynamics to form quantum electrodynamics (QED).\n\n\nDefinitions, units, and measurement[edit]\n\n  \nComparison of B, H and M inside and outside a cylindrical bar magnet.\n\n\n\nThe B-field[edit]\n\n\tAlternative names for B[21]\n\n\t\n\tMagnetic flux density\n\tMagnetic induction\n\tMagnetic field\n\n\n\n\n\nThe magnetic field can be defined in several equivalent ways based on the effects it has on its environment.\n\nOften the magnetic field is defined by the force it exerts on a moving charged particle. Experiments in electrostatics show that a particle of charge q in an electric field E experiences a force F = qE. Other experiments show that a charged particle experiences a force proportional to its relative velocity to a current-carrying wire. The velocity dependent portion can be separated such that the force on the particle satisfies the Lorentz force law,\n\n\n\t\n  \n    \n      \n        \n          F\n        \n        =\n        q\n        (\n        \n          E\n        \n        +\n        \n          v\n        \n        ×\n        \n          B\n        \n        )\n        .\n      \n    \n    {\\displaystyle \\mathbf {F} =q(\\mathbf {E} +\\mathbf {v} \\times \\mathbf {B} ).}\n  \n\n\n\nHere v is the particle's velocity and × denotes the cross product. The vector B is termed the magnetic field, and it is defined as the vector field necessary to make the Lorentz force law correctly describe the motion of a charged particle. This definition allows the determination of B in the following way[22]\n\n\n[T]he command, \"Measure the direction and magnitude of the vector B at such and such a place,\" calls for the following operations: Take a particle of known charge q. Measure the force on q at rest, to determine E. Then measure the force on the particle when its velocity is v; repeat with v in some other direction. Now find a B that makes the Lorentz force law fit all these results—that is the magnetic field at the place in question.\n\n\n\nAlternatively, the magnetic field can be defined in terms of the torque it produces on a magnetic dipole (see magnetic torque on permanent magnets below).\n\n\nThe H-field[edit]\n\n\tAlternative names for H[21][23]\n\n\t\n\tMagnetic field intensity\n\tMagnetic field strength\n\tMagnetic field\n\tMagnetizing field\n\n\n\n\n\nIn addition to B, there is a quantity H, which is often called the magnetic field.[nb 3] In a vacuum, B and H are proportional to each other, with the multiplicative constant depending on the physical units. Inside a material they are different (see H and B inside and outside magnetic materials). The term \"magnetic field\" is historically reserved for H while using other terms for B. Informally, though, and formally for some recent textbooks mostly in physics, the term 'magnetic field' is used to describe B as well as or in place of H.[nb 4]\nThere are many alternative names for both (see sidebar).\n\n\nUnits[edit]\n\nIn SI units, B is measured in teslas (symbol: T) and correspondingly ΦB (magnetic flux) is measured in webers (symbol: Wb) so that a flux density of 1 Wb/m2 is 1 tesla. The SI unit of tesla is equivalent to (newton·second)/(coulomb·metre).[nb 5] In Gaussian-cgs units, B is measured in gauss (symbol: G). (The conversion is 1 T = 10000 G.[24][25]) One nanotesla is equivalent to 1 gamma (symbol: γ).[25] The H-field is measured in amperes per metre (A/m) in SI units,[26] and in oersteds (Oe) in cgs units.[24]\n\n\nMeasurement[edit]\n\nThe finest precision for a magnetic field measurement was attained by Gravity Probe B at 5 aT (5×10−18 T).[27]\n\nMagnetometers are devices used to measure the local magnetic field. Important classes of magnetometers include using induction magnetometer (or search-coil magnetometer) which measure only varying magnetic fields, rotating coil magnetometer, Hall effect magnetometers, NMR magnetometers, SQUID magnetometers, and fluxgate magnetometers. The magnetic fields of distant astronomical objects are measured through their effects on local charged particles. For instance, electrons spiraling around a field line produce synchrotron radiation that is detectable in radio waves.\n\n\nMagnetic field lines[edit]\n\nMain article: Field line\n\n  \nThe direction of magnetic field lines represented by iron filings sprinkled on paper placed above a bar magnet.\n\n\n\n  \nCompass needles point in the direction of the local magnetic field, towards a magnet's south pole and away from its north pole.\n\n\n\nMapping the magnetic field of an object is simple in principle. First, measure the strength and direction of the magnetic field at a large number of locations (or at every point in space). Then, mark each location with an arrow (called a vector) pointing in the direction of the local magnetic field with its magnitude proportional to the strength of the magnetic field.\n\nAn alternative method to map the magnetic field is to \"connect\" the arrows to form magnetic field lines. The direction of the magnetic field at any point is parallel to the direction of nearby field lines, and the local density of field lines can be made proportional to its strength. Magnetic field lines are like streamlines in fluid flow, in that they represent something continuous, and a different resolution would show more or fewer lines.\n\nAn advantage of using magnetic field lines as a representation is that many laws of magnetism (and electromagnetism) can be stated completely and concisely using simple concepts such as the \"number\" of field lines through a surface. These concepts can be quickly \"translated\" to their mathematical form. For example, the number of field lines through a given surface is the surface integral of the magnetic field.\n\nVarious phenomena \"display\" magnetic field lines as though the field lines were physical phenomena. For example, iron filings placed in a magnetic field form lines that correspond to \"field lines\".[nb 6] Magnetic field \"lines\" are also visually displayed in polar auroras, in which plasma particle dipole interactions create visible streaks of light that line up with the local direction of Earth's magnetic field.\n\nField lines can be used as a qualitative tool to visualize magnetic forces. In ferromagnetic substances like iron and in plasmas, magnetic forces can be understood by imagining that the field lines exert a tension, (like a rubber band) along their length, and a pressure perpendicular to their length on neighboring field lines. \"Unlike\" poles of magnets attract because they are linked by many field lines; \"like\" poles repel because their field lines do not meet, but run parallel, pushing on each other. The rigorous form of this concept is the electromagnetic stress–energy tensor.\n\n\nMagnetic field and permanent magnets[edit]\n\nMain article: Magnet\n\nPermanent magnets are objects that produce their own persistent magnetic fields. They are made of ferromagnetic materials, such as iron and nickel, that have been magnetized, and they have both a north and a south pole.\n\n\nMagnetic field of permanent magnets[edit]\n\nMain articles: Magnetic moment and Two definitions of moment\n\nThe magnetic field of permanent magnets can be quite complicated, especially near the magnet. The magnetic field of a small[nb 7] straight magnet is proportional to the magnet's strength (called its magnetic dipole moment m). The equations are non-trivial and also depend on the distance from the magnet and the orientation of the magnet. For simple magnets, m points in the direction of a line drawn from the south to the north pole of the magnet. Flipping a bar magnet is equivalent to rotating its m by 180 degrees.\n\nThe magnetic field of larger magnets can be obtained by modeling them as a collection of a large number of small magnets called dipoles each having their own m. The magnetic field produced by the magnet then is the net magnetic field of these dipoles; any net force on the magnet is a result of adding up the forces on the individual dipoles.\n\nThere are two competing models for the nature of these dipoles. These two models produce two different magnetic fields, H and B. Outside a material, though, the two are identical (to a multiplicative constant) so that in many cases the distinction can be ignored. This is particularly true for magnetic fields, such as those due to electric currents, that are not generated by magnetic materials.\n\n\nMagnetic pole model and the H-field[edit]\n\n  \nThe magnetic pole model: two opposing poles, North (+) and South (−), separated by a distance d produce a H-field (lines).\n\n\n\nIt is sometimes useful to model the force and torques between two magnets as due to magnetic poles repelling or attracting each other in the same manner as the Coulomb force between electric charges. In this model, a magnetic H-field is produced by magnetic charges that are \"smeared\" around each pole. These magnetic charges are in fact related to the magnetization field M.\n\nThe H-field, therefore, is analogous to the electric field E, which starts at a positive electric charge and ends at a negative electric charge. Near the north pole, therefore, all H-field lines point away from the north pole (whether inside the magnet or out) while near the south pole all H-field lines point toward the south pole (whether inside the magnet or out). Too, a north pole feels a force in the direction of the H-field while the force on the south pole is opposite to the H-field.\n\nIn the magnetic pole model, the elementary magnetic dipole m is formed by two opposite magnetic poles of pole strength qm separated by a small distance vector d, such that m = qm d. The magnetic pole model predicts correctly the field H both inside and outside magnetic materials, in particular the fact that  H is opposite to the magnetization field M inside a permanent magnet.\n\nSince it is based on the fictitious idea of a magnetic charge density, the pole model has limitations. Magnetic poles cannot exist apart from each other as electric charges can, but always come in north/south pairs. If a magnetized object is divided in half, a new pole appears on the surface of each piece, so each has a pair of complementary poles. The magnetic pole model does not account for magnetism that is produced by electric currents.\n\n\nAmperian loop model and the B-field[edit]\n\nSee also: Gauss's law for magnetism\n\n  \nThe Amperian loop model: A current loop (ring) that goes into the page at the x and comes out at the dot produces a B-field (lines). The north pole is to the right and the south to the left.\n\n\n\nAfter Ørsted discovered that electric currents produce a magnetic field and Ampere discovered that electric currents attracted and repelled each other similar to magnets, it was natural to hypothesize that all magnetic fields are due to electric current loops. In this model developed by Ampere, the elementary magnetic dipole that makes up all magnets is a sufficiently small Amperian loop of current I. The dipole moment of this loop is m = IA where A is the area of the loop.\n\nThese magnetic dipoles produce a magnetic B-field. One important property of the B-field produced this way is that magnetic B-field lines neither start nor end (mathematically, B is a solenoidal vector field); a field line either extends to infinity or wraps around to form a closed curve.[nb 8] To date, no exception to this rule has been found. (See magnetic monopole below.) Magnetic field lines exit a magnet near its north pole and enter near its south pole, but inside the magnet B-field lines continue through the magnet from the south pole back to the north.[nb 9] If a B-field line enters a magnet somewhere it has to leave somewhere else; it is not allowed to have an end point. Magnetic poles, therefore, always come in N and S pairs.\n\nMore formally, since all the magnetic field lines that enter any given region must also leave that region, subtracting the \"number\"[nb 10] of field lines that enter the region from the number that exit gives identically zero. Mathematically this is equivalent to:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                ∮\n                \n              \n            \n            \n          \n          \n            S\n          \n        \n        ⁡\n        \n          B\n        \n        ⋅\n        \n          d\n        \n        \n          A\n        \n        =\n        0\n        ,\n      \n    \n    {\\displaystyle \\oint _{S}\\mathbf {B} \\cdot \\mathrm {d} \\mathbf {A} =0,}\n  \n\n\n\nwhere the integral is a surface integral over the closed surface S (a closed surface is one that completely surrounds a region with no holes to let any field lines escape). Since dA points outward, the dot product in the integral is positive for B-field pointing out and negative for B-field pointing in.\n\nThere is also a corresponding differential form of this equation covered in Maxwell's equations below.\n\n\nForce between magnets[edit]\n\nMain article: Force between magnets\n\nThe force between two small magnets is quite complicated and depends on the strength and orientation of both magnets and the distance and direction of the magnets relative to each other. The force is particularly sensitive to rotations of the magnets due to magnetic torque. The force on each magnet depends on its magnetic moment and the magnetic field[nb 11] of the other.\n\nTo understand the force between magnets, it is useful to examine the magnetic pole model given above. In this model, the H-field of one magnet pushes and pulls on both poles of a second magnet. If this H-field is the same at both poles of the second magnet then there is no net force on that magnet since the force is opposite for opposite poles. If, however, the magnetic field of the first magnet is nonuniform (such as the H near one of its poles), each pole of the second magnet sees a different field and is subject to a different force. This difference in the two forces moves the magnet in the direction of increasing magnetic field and may also cause a net torque.\n\nThis is a specific example of a general rule that magnets are attracted (or repulsed depending on the orientation of the magnet) into regions of higher magnetic field. Any non-uniform magnetic field, whether caused by permanent magnets or electric currents, exerts a force on a small magnet in this way.\n\nThe details of the Amperian loop model are different and more complicated but yield the same result: that magnetic dipoles are attracted/repelled into regions of higher magnetic field.\nMathematically, the force on a small magnet having a magnetic moment m due to a magnetic field B is:[28]\n\n\n\t\n  \n    \n      \n        \n          F\n        \n        =\n        \n          ∇\n        \n        \n          (\n          \n            \n              m\n            \n            ⋅\n            \n              B\n            \n          \n          )\n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {F} ={\\boldsymbol {\\nabla }}\\left(\\mathbf {m} \\cdot \\mathbf {B} \\right),}\n  \n\n\n\nwhere the gradient ∇ is the change of the quantity m · B per unit distance and the direction is that of maximum increase of m · B. The dot product m · B = mBcos(θ), where m and B represent the magnitude of the m and B vectors and θ is the angle between them. If m is in the same direction as B then the dot product is positive and the gradient points \"uphill\" pulling the magnet into regions of higher B-field (more strictly larger m · B). This equation is strictly only valid for magnets of zero size, but is often a good approximation for not too large magnets. The magnetic force on larger magnets is determined by dividing them into smaller regions each having their own m then summing up the forces on each of these very small regions.\n\n\nMagnetic torque on permanent magnets[edit]\n\nMain article: Magnetic torque\n\nIf two like poles of two separate magnets are brought near each other, and one of the magnets is allowed to turn, it promptly rotates to align itself with the first. In this example, the magnetic field of the stationary magnet creates a magnetic torque on the magnet that is free to rotate. This magnetic torque τ tends to align a magnet's poles with the magnetic field lines. A compass, therefore, turns to align itself with Earth's magnetic field.\n\nMagnetic torque is used to drive electric motors. In one simple motor design, a magnet is fixed to a freely rotating shaft and subjected to a magnetic field from an array of electromagnets. By continuously switching the electric current through each of the electromagnets, thereby flipping the polarity of their magnetic fields, like poles are kept next to the rotor; the resultant torque is transferred to the shaft. See Rotating magnetic fields below.\n\n\n  \ntorque on a dipole: An H field (to right) causes equal but opposite forces on a N pole (+q) and a S pole (−q) creating a torque.\n\n\nAs is the case for the force between magnets, the magnetic pole model leads more readily to the correct equation. Here, two equal and opposite magnetic charges experiencing the same H also experience equal and opposite forces. Since these equal and opposite forces are in different locations, this produces a torque proportional to the distance (perpendicular to the force) between them. With the definition of m as the pole strength times the distance between the poles, this leads to τ = μ0mHsinθ, where μ0 is a constant called the vacuum permeability, measuring 4π×10−7 V·s/(A·m) and θ is the angle between H and m.\n\nThe Amperian loop model also predicts the same magnetic torque. Here, it is the B field interacting with the Amperian current loop through a Lorentz force described below. Again, the results are the same although the models are completely different.\n\n\n  \nCross product: |a × b| = a b sinθ.\n\n\n\nMathematically, the torque τ on a small magnet is proportional both to the applied magnetic field and to the magnetic moment m of the magnet:\n\n\n\t\n  \n    \n      \n        \n          τ\n        \n        =\n        \n          m\n        \n        ×\n        \n          B\n        \n        =\n        \n          μ\n          \n            0\n          \n        \n        \n          m\n        \n        ×\n        \n          H\n        \n        ,\n        \n      \n    \n    {\\displaystyle {\\boldsymbol {\\tau }}=\\mathbf {m} \\times \\mathbf {B} =\\mu _{0}\\mathbf {m} \\times \\mathbf {H} ,\\,}\n  \n\n\n\nwhere × represents the vector cross product. This equation includes all of the qualitative information included above. There is no torque on a magnet if m is in the same direction as the magnetic field. (The cross product is zero for two vectors that are in the same direction.) Further, all other orientations feel a torque that twists them toward the direction of magnetic field.\n\n\nMagnetic field and electric currents[edit]\n\nCurrents of electric charges both generate a magnetic field and feel a force due to magnetic B-fields.\n\n\nMagnetic field due to moving charges and electric currents[edit]\n\nMain articles: Electromagnet, Biot–Savart law, and Ampère's law\n\n  \nRight hand grip rule: a current flowing in the direction of the white arrow produces a magnetic field shown by the red arrows.\n\n\n\nAll moving charged particles produce magnetic fields. Moving point charges, such as electrons, produce complicated but well known magnetic fields that depend on the charge, velocity, and acceleration of the particles.[29]\n\nMagnetic field lines form in concentric circles around a cylindrical current-carrying conductor, such as a length of wire. The direction of such a magnetic field can be determined by using the \"right-hand grip rule\" (see figure at right). The strength of the magnetic field decreases with distance from the wire. (For an infinite length wire the strength is inversely proportional to the distance.)\n\n\n  \nSolenoid\n\n\n\nBending a current-carrying wire into a loop concentrates the magnetic field inside the loop while weakening it outside. Bending a wire into multiple closely spaced loops to form a coil or \"solenoid\" enhances this effect. A device so formed around an iron core may act as an electromagnet, generating a strong, well-controlled magnetic field. An infinitely long cylindrical electromagnet has a uniform magnetic field inside, and no magnetic field outside. A finite length electromagnet produces a magnetic field that looks similar to that produced by a uniform permanent magnet, with its strength and polarity determined by the current flowing through the coil.\n\nThe magnetic field generated by a steady current I (a constant flow of electric charges, in which charge neither accumulates nor is depleted at any point)[nb 12] is described by the Biot–Savart law:[31]\n\n\n\t\n  \n    \n      \n        \n          B\n        \n        =\n        \n          \n            \n              \n                μ\n                \n                  0\n                \n              \n              I\n            \n            \n              4\n              π\n            \n          \n        \n        \n          ∫\n          \n            \n              w\n              i\n              r\n              e\n            \n          \n        \n        \n          \n            \n              \n                d\n              \n              \n                ℓ\n              \n              ×\n              \n                \n                  \n                    r\n                    ^\n                  \n                \n              \n            \n            \n              r\n              \n                2\n              \n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {B} ={\\frac {\\mu _{0}I}{4\\pi }}\\int _{\\mathrm {wire} }{\\frac {\\mathrm {d} {\\boldsymbol {\\ell }}\\times \\mathbf {\\hat {r}} }{r^{2}}},}\n  \n\n\n\nwhere the integral sums over the wire length where vector dℓ is the vector line element with direction in the same sense as the current I, μ0 is the magnetic constant, r is the distance between the location of dℓ and the location where the magnetic field is calculated, and r̂ is a unit vector in the direction of r.  For example, in the case of a sufficiently long, straight wire, this becomes:\n\n\n\t\n  \n    \n      \n        \n          |\n        \n        \n          B\n        \n        \n          |\n        \n        =\n        \n          \n            \n              μ\n              \n                0\n              \n            \n            \n              2\n              π\n              r\n            \n          \n        \n        I\n      \n    \n    {\\displaystyle |\\mathbf {B} |={\\frac {\\mu _{0}}{2\\pi r}}I}\n  \n\n\n\nwhere r = |r|. The direction is tangent to a circle perpendicular to the wire according to the right hand rule.[32]\n\nA slightly more general[33][nb 13] way of relating the current \n  \n    \n      \n        \n          I\n        \n      \n    \n    {\\displaystyle {I}}\n  \n to the B-field is through Ampère's law:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              ∮\n              \n            \n          \n          \n        \n        ⁡\n        \n          B\n        \n        ⋅\n        \n          d\n        \n        \n          ℓ\n        \n        =\n        \n          μ\n          \n            0\n          \n        \n        \n          I\n          \n            \n              e\n              n\n              c\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle \\oint \\mathbf {B} \\cdot \\mathrm {d} {\\boldsymbol {\\ell }}=\\mu _{0}I_{\\mathrm {enc} },}\n  \n\n\n\nwhere the line integral is over any arbitrary loop and \n  \n    \n      \n        \n          I\n        \n      \n    \n    {\\displaystyle {I}}\n  \nenc is the current enclosed by that loop. Ampère's law is always valid for steady currents and can be used to calculate the B-field for certain highly symmetric situations such as an infinite wire or an infinite solenoid.\n\nIn a modified form that accounts for time varying electric fields, Ampère's law is one of four Maxwell's equations that describe electricity and magnetism.\n\n\nForce on moving charges and current[edit]\n\n  \nCharged particle drifts in a magnetic field with (A) no net force, (B) an electric field, E, (C) a charge independent force, F (e.g. gravity), and (D) in a homogeneous magnetic field, grad H.\n\n\n\nForce on a charged particle[edit]\n\nMain article: Lorentz force\n\nA charged particle moving in a B-field experiences a sideways force that is proportional to the strength of the magnetic field, the component of the velocity that is perpendicular to the magnetic field and the charge of the particle. This force is known as the Lorentz force, and is given by\n\n\n\t\n  \n    \n      \n        \n          F\n        \n        =\n        q\n        \n          E\n        \n        +\n        q\n        \n          v\n        \n        ×\n        \n          B\n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {F} =q\\mathbf {E} +q\\mathbf {v} \\times \\mathbf {B} ,}\n  \n\n\n\nwhere\nF is the force, q is the electric charge of the particle, v is the instantaneous velocity  of the particle, and B is the magnetic field (in teslas).\n\nThe Lorentz force is always perpendicular to both the velocity of the particle and the magnetic field that created it. When a charged particle moves in a static magnetic field, it traces a helical path in which the helix axis is parallel to the magnetic field, and in which the speed of the particle remains constant. Because the magnetic force is always perpendicular to the motion, the magnetic field can do no work on an isolated charge. It can only do work indirectly, via the electric field generated by a changing magnetic field. It is often claimed that the magnetic force can do work to a non-elementary magnetic dipole, or to charged particles whose motion is constrained by other forces, but this is incorrect[34] because the work in those cases is performed by the electric forces of the charges deflected by the magnetic field.\n\n\nForce on current-carrying wire[edit]\n\nMain article: Laplace force\n\nThe force on a current carrying wire is similar to that of a moving charge as expected since a current carrying wire is a collection of moving charges. A current-carrying wire feels a force in the presence of a magnetic field. The Lorentz force on a macroscopic current is often referred to as the Laplace force.\nConsider a conductor of length ℓ, cross section A, and charge q due to electric current i. If this conductor is placed in a magnetic field of magnitude B that makes an angle θ with the velocity of charges in the conductor, the force exerted on a single charge q is\n\n\n\t\n  \n    \n      \n        F\n        =\n        q\n        v\n        B\n        sin\n        ⁡\n        θ\n        ,\n      \n    \n    {\\displaystyle F=qvB\\sin \\theta ,}\n  \n\n\n\nso, for N charges where \n\n\n\t\n  \n    \n      \n        N\n        =\n        n\n        ℓ\n        A\n      \n    \n    {\\displaystyle N=n\\ell A}\n  \n,\n\n\nthe force exerted on the conductor is\n\n\n\t\n  \n    \n      \n        f\n        =\n        F\n        N\n        =\n        q\n        v\n        B\n        n\n        ℓ\n        A\n        sin\n        ⁡\n        θ\n        =\n        B\n        i\n        ℓ\n        sin\n        ⁡\n        θ\n      \n    \n    {\\displaystyle f=FN=qvBn\\ell A\\sin \\theta =Bi\\ell \\sin \\theta }\n  \n,\n\n\nwhere i = nqvA.\n\n\n  \nThe right-hand rule: Pointing the thumb of the right hand in the direction of the conventional current, and the fingers in the direction of B, the force on the current points out of the palm. The force is reversed for a negative charge.\n\n\n\nDirection of force[edit]\n\nSee also: Right-hand rule\n\nThe direction of force on a charge or a current can be determined by a mnemonic known as the right-hand rule (see the figure). Using the right hand, pointing the thumb in the direction of the current, and the fingers in the direction of the magnetic field, the resulting force on the charge points outwards from the palm. The force on a negatively charged particle is in the opposite direction. If both the speed and the charge are reversed then the direction of the force remains the same. For that reason a magnetic field measurement (by itself) cannot distinguish whether there is a positive charge moving to the right or a negative charge moving to the left. (Both of these cases produce the same current.)  On the other hand, a magnetic field combined with an electric field can distinguish between these, see Hall effect below.\n\nAn alternative mnemonic to the right hand rule is Fleming's left-hand rule.\n\n\nRelation between H and B[edit]\n\nThe formulas derived for the magnetic field above are correct when dealing with the entire current. A magnetic material placed inside a magnetic field, though, generates its own bound current, which can be a challenge to calculate. (This bound current is due to the sum of atomic sized current loops and the spin of the subatomic particles such as electrons that make up the material.)  The H-field as defined above helps factor out this bound current; but to see how, it helps to introduce the concept of magnetization first.\n\n\nMagnetization[edit]\n\nMain article: Magnetization\n\nThe magnetization vector field M represents how strongly a region of material is magnetized. It is defined as the net magnetic dipole moment per unit volume of that region. The magnetization of a uniform magnet is therefore a material constant, equal to the magnetic moment m of the magnet divided by its volume. Since the SI unit of magnetic moment is A⋅m2, the SI unit of magnetization M is ampere per meter, identical to that of the H-field.\n\nThe magnetization M field of a region points in the direction of the average magnetic dipole moment in that region. Magnetization field lines, therefore, begin near the magnetic south pole and ends near the magnetic north pole. (Magnetization does not exist outside the magnet.)\n\nIn the Amperian loop model, the magnetization is due to combining many tiny Amperian loops to form a resultant current called bound current. This bound current, then, is the source of the magnetic B field due to the magnet. (See Magnetic dipoles below and magnetic poles vs. atomic currents for more information.) Given the definition of the magnetic dipole, the magnetization field follows a similar law to that of Ampere's law:[35]\n\n\n\t\n  \n    \n      \n        \n          \n            \n              ∮\n              \n            \n          \n          \n        \n        ⁡\n        \n          M\n        \n        ⋅\n        \n          d\n        \n        \n          ℓ\n        \n        =\n        \n          I\n          \n            \n              b\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle \\oint \\mathbf {M} \\cdot \\mathrm {d} {\\boldsymbol {\\ell }}=I_{\\mathrm {b} },}\n  \n\n\n\nwhere the integral is a line integral over any closed loop and Ib is the bound current enclosed by that closed loop.\n\nIn the magnetic pole model, magnetization begins at and ends at magnetic poles. If a given region, therefore, has a net positive \"magnetic pole strength\" (corresponding to a north pole) then it has more magnetization field lines entering it than leaving it. Mathematically this is equivalent to:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                ∮\n                \n              \n            \n            \n          \n          \n            S\n          \n        \n        ⁡\n        \n          μ\n          \n            0\n          \n        \n        \n          M\n        \n        ⋅\n        \n          d\n        \n        \n          A\n        \n        =\n        −\n        \n          q\n          \n            \n              M\n            \n          \n        \n      \n    \n    {\\displaystyle \\oint _{S}\\mu _{0}\\mathbf {M} \\cdot \\mathrm {d} \\mathbf {A} =-q_{\\mathrm {M} }}\n  \n,\n\n\nwhere the integral is a closed surface integral over the closed surface S and qM is the \"magnetic charge\" (in units of magnetic flux) enclosed by S. (A closed surface completely surrounds a region with no holes to let any field lines escape.) The negative sign occurs because the magnetization field moves from south to north.\n\n\nH-field and magnetic materials[edit]\n\nSee also: demagnetizing field\n\nIn SI units, the H-field is related to the B-field by\n\n\n\t\n  \n    \n      \n        \n          H\n        \n         \n        ≡\n         \n        \n          \n            \n              B\n            \n            \n              μ\n              \n                0\n              \n            \n          \n        \n        −\n        \n          M\n        \n        .\n      \n    \n    {\\displaystyle \\mathbf {H} \\ \\equiv \\ {\\frac {\\mathbf {B} }{\\mu _{0}}}-\\mathbf {M} .}\n  \n\n\n\nIn terms of the H-field, Ampere's law is\n\n\n\t\n  \n    \n      \n        \n          \n            \n              ∮\n              \n            \n          \n          \n        \n        ⁡\n        \n          H\n        \n        ⋅\n        \n          d\n        \n        \n          ℓ\n        \n        =\n        \n          \n            \n              ∮\n              \n            \n          \n          \n        \n        ⁡\n        \n          (\n          \n            \n              \n                \n                  B\n                \n                \n                  μ\n                  \n                    0\n                  \n                \n              \n            \n            −\n            \n              M\n            \n          \n          )\n        \n        ⋅\n        \n          d\n        \n        \n          ℓ\n        \n        =\n        \n          I\n          \n            \n              t\n              o\n              t\n            \n          \n        \n        −\n        \n          I\n          \n            \n              b\n            \n          \n        \n        =\n        \n          I\n          \n            \n              f\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle \\oint \\mathbf {H} \\cdot \\mathrm {d} {\\boldsymbol {\\ell }}=\\oint \\left({\\frac {\\mathbf {B} }{\\mu _{0}}}-\\mathbf {M} \\right)\\cdot \\mathrm {d} {\\boldsymbol {\\ell }}=I_{\\mathrm {tot} }-I_{\\mathrm {b} }=I_{\\mathrm {f} },}\n  \n\n\n\nwhere If represents the 'free current' enclosed by the loop so that the line integral of H does not depend at all on the bound currents.[36]\n\nFor the differential equivalent of this equation see Maxwell's equations. Ampere's law leads to the boundary condition \n\n\n\t\n  \n    \n      \n        \n          (\n          \n            \n              \n                H\n                \n                  1\n                \n                \n                  ∥\n                \n              \n            \n            −\n            \n              \n                H\n                \n                  2\n                \n                \n                  ∥\n                \n              \n            \n          \n          )\n        \n        =\n        \n          \n            K\n          \n          \n            \n              f\n            \n          \n        \n        ×\n        \n          \n            \n              \n                n\n              \n              ^\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle \\left(\\mathbf {H_{1}^{\\parallel }} -\\mathbf {H_{2}^{\\parallel }} \\right)=\\mathbf {K} _{\\mathrm {f} }\\times {\\hat {\\mathbf {n} }},}\n  \n\n\n\nwhere Kf is the surface free current density and the unit normal \n  \n    \n      \n        \n          \n            \n              \n                n\n              \n              ^\n            \n          \n        \n      \n    \n    {\\displaystyle {\\hat {\\mathbf {n} }}}\n  \n points in the direction from medium 2 to medium 1.[37]\n\nSimilarly, a surface integral of H over any closed surface is independent of the free currents and picks out the \"magnetic charges\" within that closed surface:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                ∮\n                \n              \n            \n            \n          \n          \n            S\n          \n        \n        ⁡\n        \n          μ\n          \n            0\n          \n        \n        \n          H\n        \n        ⋅\n        \n          d\n        \n        \n          A\n        \n        =\n        \n          \n            \n              \n                ∮\n                \n              \n            \n            \n          \n          \n            S\n          \n        \n        ⁡\n        (\n        \n          B\n        \n        −\n        \n          μ\n          \n            0\n          \n        \n        \n          M\n        \n        )\n        ⋅\n        \n          d\n        \n        \n          A\n        \n        =\n        0\n        −\n        (\n        −\n        \n          q\n          \n            \n              M\n            \n          \n        \n        )\n        =\n        \n          q\n          \n            \n              M\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle \\oint _{S}\\mu _{0}\\mathbf {H} \\cdot \\mathrm {d} \\mathbf {A} =\\oint _{S}(\\mathbf {B} -\\mu _{0}\\mathbf {M} )\\cdot \\mathrm {d} \\mathbf {A} =0-(-q_{\\mathrm {M} })=q_{\\mathrm {M} },}\n  \n\n\n\nwhich does not depend on the free currents.\n\nThe H-field, therefore, can be separated into two[nb 14] independent parts:\n\n\n\t\n  \n    \n      \n        \n          H\n        \n        =\n        \n          \n            H\n          \n          \n            0\n          \n        \n        +\n        \n          \n            H\n          \n          \n            \n              d\n            \n          \n        \n        ,\n        \n      \n    \n    {\\displaystyle \\mathbf {H} =\\mathbf {H} _{0}+\\mathbf {H} _{\\mathrm {d} },\\,}\n  \n\n\n\nwhere H0 is the applied magnetic field due only to the free currents and Hd is the demagnetizing field due only to the bound currents.\n\nThe magnetic H-field, therefore, re-factors the bound current in terms of \"magnetic charges\". The H field lines loop only around \"free current\" and, unlike the magnetic B field, begins and ends near magnetic poles as well.\n\n\nMagnetism[edit]\n\nMain article: Magnetism\n\nMost materials respond to an applied B-field by producing their own magnetization M and therefore their own B-fields. Typically, the response is weak and exists only when the magnetic field is applied. The term magnetism describes how materials respond on the microscopic level to an applied magnetic field and is used to categorize the magnetic phase of a material. Materials are divided into groups based upon their magnetic behavior:\n\n\n\tDiamagnetic materials[38] produce a magnetization that opposes the magnetic field.\n\tParamagnetic materials[38] produce a magnetization in the same direction as the applied magnetic field.\n\tFerromagnetic materials and the closely related ferrimagnetic materials and antiferromagnetic materials[39][40]  can have a magnetization independent of an applied B-field with a complex relationship between the two fields.\n\tSuperconductors (and ferromagnetic superconductors)[41][42] are materials that are characterized by perfect conductivity below a critical temperature and magnetic field. They also are highly magnetic and can be perfect diamagnets below a lower critical magnetic field. Superconductors often have a broad range of temperatures and magnetic fields (the so-named mixed state) under which they exhibit a complex hysteretic dependence of M on B.\n\n\nIn the case of paramagnetism and diamagnetism, the magnetization M is often proportional to the applied magnetic field such that:\n\n\n\t\n  \n    \n      \n        \n          B\n        \n        =\n        μ\n        \n          H\n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {B} =\\mu \\mathbf {H} ,}\n  \n\n\n\nwhere μ is a material dependent parameter called the permeability. In some cases the permeability may be a second rank tensor so that H may not point in the same direction as B. These relations between B  and H are examples of constitutive equations. However, superconductors and ferromagnets have a more complex B-to-H relation; see magnetic hysteresis.\n\n\nEnergy stored in magnetic fields[edit]\n\nMain article: Magnetic energy\n\nSee also: Magnetic hysteresis\n\nEnergy is needed to generate a magnetic field both to work against the electric field that a changing magnetic field creates and to change the magnetization of any material within the magnetic field. For non-dispersive materials, this same energy is released when the magnetic field is  destroyed so that the energy can be modeled as being stored in the magnetic field.\n\nFor linear, non-dispersive, materials (such that B = μH where μ is frequency-independent), the energy density is:\n\n\n\t\n  \n    \n      \n        u\n        =\n        \n          \n            \n              \n                B\n              \n              ⋅\n              \n                H\n              \n            \n            2\n          \n        \n        =\n        \n          \n            \n              \n                B\n              \n              ⋅\n              \n                B\n              \n            \n            \n              2\n              μ\n            \n          \n        \n        =\n        \n          \n            \n              μ\n              \n                H\n              \n              ⋅\n              \n                H\n              \n            \n            2\n          \n        \n        .\n      \n    \n    {\\displaystyle u={\\frac {\\mathbf {B} \\cdot \\mathbf {H} }{2}}={\\frac {\\mathbf {B} \\cdot \\mathbf {B} }{2\\mu }}={\\frac {\\mu \\mathbf {H} \\cdot \\mathbf {H} }{2}}.}\n  \n\n\n\nIf there are no magnetic materials around then μ can be replaced by μ0. The above equation cannot be used for nonlinear materials, though; a more general expression given below must be used.\n\nIn general, the incremental amount of work per unit volume δW needed to cause a small change of magnetic field δB is:\n\n\n\t\n  \n    \n      \n        δ\n        W\n        =\n        \n          H\n        \n        ⋅\n        δ\n        \n          B\n        \n        .\n      \n    \n    {\\displaystyle \\delta W=\\mathbf {H} \\cdot \\delta \\mathbf {B} .}\n  \n\n\n\nOnce the relationship between H and B is known this equation is used to determine the work needed to reach a given magnetic state. For hysteretic materials such as ferromagnets and superconductors, the work needed also depends on how the magnetic field is created. For linear non-dispersive materials, though, the general equation leads directly to the simpler energy density equation given above.\n\n\nElectromagnetism: the relationship between magnetic and electric fields[edit]\n\nMain article: Electromagnetism\n\nFaraday's Law: Electric force due to a changing B-field[edit]\n\nMain articles: Faraday's law and Magnetic flux\n\nA changing magnetic field, such as a magnet moving through a conducting coil, generates an electric field (and therefore tends to drive a current in such a coil). This is known as Faraday's law and forms the basis of many electrical generators and electric motors.\n\nMathematically, Faraday's law is:\n\n\n\t\n  \n    \n      \n        \n          \n            E\n          \n        \n        =\n        −\n        \n          \n            \n              \n                d\n              \n              Φ\n            \n            \n              \n                d\n              \n              t\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle {\\mathcal {E}}=-{\\frac {\\mathrm {d} \\Phi }{\\mathrm {d} t}},}\n  \n\n\n\nwhere \n  \n    \n      \n        \n          \n            \n              E\n            \n          \n        \n      \n    \n    {\\displaystyle \\scriptstyle {\\mathcal {E}}}\n  \n is the electromotive force (or EMF, the voltage generated around a closed loop) and Φ is the magnetic flux—the product of the area times the magnetic field normal to that area.  (This definition of magnetic flux is why B is often referred to as magnetic flux density.)[43]:210\n\nThe negative sign represents the fact that any current generated by a changing magnetic field in a coil produces a magnetic field that opposes the change in the magnetic field that induced it. This phenomenon is known as Lenz's law.\n\nThis integral formulation of Faraday's law can be converted[nb 15] into a differential form, which applies under slightly different conditions. This form is covered as one of Maxwell's equations below.\n\n\nMaxwell's correction to Ampère's Law: The magnetic field due to a changing electric field[edit]\n\nMain article: Maxwell's correction to Ampère's law\n\nSimilar to the way that a changing magnetic field generates an electric field, a changing electric field generates a magnetic field. This fact is known as Maxwell's correction to Ampère's law and is applied as an additive term to Ampere's law as given above. This additional term is proportional to the time rate of change of the electric flux and is similar to Faraday's law above but with a different and positive constant out front. (The electric flux through an area is proportional to the area times the perpendicular part of the electric field.)\n\nThe full law including the correction term is known as the Maxwell–Ampère equation. It is not commonly given in integral form because the effect is so small that it can typically be ignored in most cases where the integral form is used.\n\nThe Maxwell term is critically important in the creation and propagation of electromagnetic waves. Maxwell's correction to Ampère's Law together with Faraday's law of induction describes how mutually changing electric and magnetic fields interact to sustain each other and thus to form electromagnetic waves, such as light: a changing electric field generates a changing magnetic field, which generates a changing electric field again. These, though, are usually described using the differential form of this equation given below.\n\n\nMaxwell's equations[edit]\n\nMain article: Maxwell's equations\n\nLike all vector fields, a magnetic field has two important mathematical properties that relates it to its sources.  (For B the sources are currents and changing electric fields.) These two properties, along with the two corresponding properties of the electric field, make up Maxwell's Equations. Maxwell's Equations together with the Lorentz force law form a complete description of classical electrodynamics including both electricity and magnetism.\n\nThe first property is the divergence of a vector field A, ∇ · A, which represents how A \"flows\" outward from a given point. As discussed above, a B-field line never starts or ends at a point but instead forms a complete loop. This is mathematically equivalent to saying that the divergence of B is zero. (Such vector fields are called solenoidal vector fields.) This property is called Gauss's law for magnetism and is equivalent to the statement that there are no isolated magnetic poles or magnetic monopoles. The electric field on the other hand begins and ends at electric charges so that its divergence is non-zero and proportional to the charge density (See Gauss's law).\n\nThe second mathematical property is called the curl, such that ∇ × A represents how A curls or \"circulates\" around a given point. The result of the curl is called a \"circulation source\". The equations for the curl of B and of E are called the Ampère–Maxwell equation and Faraday's law respectively. They represent the differential forms of the integral equations given above.\n\nThe complete set of Maxwell's equations then are:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                ∇\n                ⋅\n                \n                  B\n                \n              \n              \n                \n                =\n                0\n                ,\n              \n            \n            \n              \n                ∇\n                ⋅\n                \n                  E\n                \n              \n              \n                \n                =\n                \n                  \n                    ρ\n                    \n                      ε\n                      \n                        0\n                      \n                    \n                  \n                \n                ,\n              \n            \n            \n              \n                ∇\n                ×\n                \n                  B\n                \n              \n              \n                \n                =\n                \n                  μ\n                  \n                    0\n                  \n                \n                \n                  J\n                \n                +\n                \n                  μ\n                  \n                    0\n                  \n                \n                \n                  ε\n                  \n                    0\n                  \n                \n                \n                  \n                    \n                      ∂\n                      \n                        E\n                      \n                    \n                    \n                      ∂\n                      t\n                    \n                  \n                \n                ,\n              \n            \n            \n              \n                ∇\n                ×\n                \n                  E\n                \n              \n              \n                \n                =\n                −\n                \n                  \n                    \n                      ∂\n                      \n                        B\n                      \n                    \n                    \n                      ∂\n                      t\n                    \n                  \n                \n                ,\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}\\nabla \\cdot \\mathbf {B} &=0,\\\\\\nabla \\cdot \\mathbf {E} &={\\frac {\\rho }{\\varepsilon _{0}}},\\\\\\nabla \\times \\mathbf {B} &=\\mu _{0}\\mathbf {J} +\\mu _{0}\\varepsilon _{0}{\\frac {\\partial \\mathbf {E} }{\\partial t}},\\\\\\nabla \\times \\mathbf {E} &=-{\\frac {\\partial \\mathbf {B} }{\\partial t}},\\end{aligned}}}\n  \n\n\n\nwhere J = complete microscopic current density and ρ is the charge density.\n\nAs discussed above, materials respond to an applied electric E field and an applied magnetic B field by producing their own internal \"bound\" charge and current distributions that contribute to E and B but are difficult to calculate. To circumvent this problem, H and D fields are used to re-factor Maxwell's equations in terms of the free current density Jf and free charge density ρf:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                ∇\n                ⋅\n                \n                  B\n                \n              \n              \n                \n                =\n                0\n                ,\n              \n            \n            \n              \n                ∇\n                ⋅\n                \n                  D\n                \n              \n              \n                \n                =\n                \n                  ρ\n                  \n                    \n                      f\n                    \n                  \n                \n                ,\n              \n            \n            \n              \n                ∇\n                ×\n                \n                  H\n                \n              \n              \n                \n                =\n                \n                  \n                    J\n                  \n                  \n                    \n                      f\n                    \n                  \n                \n                +\n                \n                  \n                    \n                      ∂\n                      \n                        D\n                      \n                    \n                    \n                      ∂\n                      t\n                    \n                  \n                \n                ,\n              \n            \n            \n              \n                ∇\n                ×\n                \n                  E\n                \n              \n              \n                \n                =\n                −\n                \n                  \n                    \n                      ∂\n                      \n                        B\n                      \n                    \n                    \n                      ∂\n                      t\n                    \n                  \n                \n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}\\nabla \\cdot \\mathbf {B} &=0,\\\\\\nabla \\cdot \\mathbf {D} &=\\rho _{\\mathrm {f} },\\\\\\nabla \\times \\mathbf {H} &=\\mathbf {J} _{\\mathrm {f} }+{\\frac {\\partial \\mathbf {D} }{\\partial t}},\\\\\\nabla \\times \\mathbf {E} &=-{\\frac {\\partial \\mathbf {B} }{\\partial t}}.\\end{aligned}}}\n  \n\n\n\nThese equations are not any more general than the original equations (if the \"bound\" charges and currents in the material are known). They also must be supplemented by the relationship between B and H as well as that between E and D. On the other hand, for simple relationships between these quantities this form of Maxwell's equations can circumvent the need to calculate the bound charges and currents.\n\n\nElectric and magnetic fields: different aspects of the same phenomenon[edit]\n\nMain article: Relativistic electromagnetism\n\nAccording to the special theory of relativity, the partition of the electromagnetic force into separate electric and magnetic components is not fundamental, but varies with the observational frame of reference: An electric force perceived by one observer may be perceived by another (in a different frame of reference) as a magnetic force, or a mixture of electric and magnetic forces.\n\nFormally, special relativity combines the electric and magnetic fields into a rank-2 tensor, called the electromagnetic tensor. Changing reference frames mixes these components. This is analogous to the way that special relativity mixes space and time into spacetime, and mass, momentum, and energy into four-momentum.[44]\n\n\nMagnetic vector potential[edit]\n\nMain article: Magnetic potential\n\nIn advanced topics such as quantum mechanics and relativity it is often easier to work with a potential formulation of electrodynamics rather than in terms of the electric and magnetic fields. In this representation, the magnetic vector potential A, and the electric scalar potential φ, are defined such that:\n\n\n\t\n  \n    \n      \n        \n          \n            \n              \n                \n                  B\n                \n              \n              \n                \n                =\n                ∇\n                ×\n                \n                  A\n                \n                ,\n              \n            \n            \n              \n                \n                  E\n                \n              \n              \n                \n                =\n                −\n                ∇\n                φ\n                −\n                \n                  \n                    \n                      ∂\n                      \n                        A\n                      \n                    \n                    \n                      ∂\n                      t\n                    \n                  \n                \n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}\\mathbf {B} &=\\nabla \\times \\mathbf {A} ,\\\\\\mathbf {E} &=-\\nabla \\varphi -{\\frac {\\partial \\mathbf {A} }{\\partial t}}.\\end{aligned}}}\n  \n\n\n\nThe vector potential A may be interpreted as a generalized potential momentum per unit charge[45] just as φ is interpreted as a generalized potential energy per unit charge.\n\nMaxwell's equations when expressed in terms of the potentials can be cast into a form that agrees with special relativity with little effort.[46] In relativity A together with φ forms the four-potential, analogous to the four-momentum that combines the momentum and energy of a particle. Using the four potential instead of the electromagnetic tensor has the advantage of being much simpler—and it can be easily modified to work with quantum mechanics.\n\n\nQuantum electrodynamics[edit]\n\nSee also: Standard Model and quantum electrodynamics\n\nIn modern physics, the electromagnetic field is understood to be not a classical field, but rather a quantum field; it is represented not as a vector of three numbers at each point, but as a vector of three quantum operators at each point. The most accurate modern description of the electromagnetic interaction (and much else) is quantum electrodynamics (QED),[47] which is incorporated into a more complete theory known as the Standard Model of particle physics.\n\nIn QED, the magnitude of the electromagnetic interactions between charged particles (and their antiparticles) is computed using perturbation theory. These rather complex formulas produce a remarkable pictorial representation as Feynman diagrams in which virtual photons are exchanged.\n\nPredictions of QED agree with experiments to an extremely high degree of accuracy: currently about 10−12 (and limited by experimental errors); for details see precision tests of QED. This makes QED one of the most accurate physical theories constructed thus far.\n\nAll equations in this article are in the classical approximation, which is less accurate than the quantum description mentioned here. However, under most everyday circumstances, the difference between the two theories is negligible.\n\n\nImportant uses and examples of magnetic field[edit]\n\nEarth's magnetic field[edit]\n\nMain article: Earth's magnetic field\n\n  \nA sketch of Earth's magnetic field representing the source of the field as a magnet. The geographic north pole is above the south pole of the magnet.\n\n\n\nThe Earth's magnetic field is produced by convection of a liquid iron alloy in the outer core. In a dynamo process, the movements drive a feedback process in which electric currents create electric and magnetic fields that in turn act on the currents.[48]\n\nThe field at the surface of the Earth is approximately the same as if a giant bar magnet were positioned at the center of the Earth and tilted at an angle of about 11° off the rotational axis of the Earth (see the figure).[49] The north pole of a magnetic compass needle points roughly north, toward the North Magnetic Pole. However, because a magnetic pole is attracted to its opposite, the North Magnetic Pole is actually the south pole of the geomagnetic field. This confusion in terminology arises because the pole of a magnet is defined by the geographical direction it points.[50]\n\nEarth's magnetic field is not constant—the strength of the field and the location of its poles vary.[51] Moreover, the poles periodically reverse their orientation in a process called geomagnetic reversal. The most recent reversal occurred 780,000 years ago.[52]\n\n\nRecord-high fields[edit]\n\nThe largest magnetic field produced over a macroscopic volume is 2.8 kT \n(VNIIEF in Sarov, Russia, 1998).\n[53] The largest magnetic fields produced in a laboratory occur in particle accelerators, such as RHIC, inside the collisions of heavy ions, where fields reach 1014 T.\n[54]\n[55]\nMagnetars have the strongest known magnetic fields of any naturally occurring object, ranging from 0.1 to 100 GT (108 to 1011 T).[56]  See orders of magnitude (magnetic field).\n\n\nRotating magnetic fields[edit]\n\nMain articles: Rotating magnetic field and Alternator\n\nThe rotating magnetic field is a key principle in the operation of alternating-current motors. A permanent magnet in such a field rotates so as to maintain its alignment with the external field. This effect was conceptualized by Nikola Tesla, and later utilized in his and others' early AC (alternating current) electric motors.\n\nA rotating magnetic field can be constructed using two orthogonal coils with 90 degrees phase difference in their AC currents. However, in practice such a system would be supplied through a three-wire arrangement with unequal currents.\n\nThis inequality would cause serious problems in standardization of the conductor size and so, to overcome it, three-phase systems are used where the three currents are equal in magnitude and have 120 degrees phase difference. Three similar coils having mutual geometrical angles of 120 degrees create the rotating magnetic field in this case. The ability of the three-phase system to create a rotating field, utilized in electric motors, is one of the main reasons why three-phase systems dominate the world's electrical power supply systems.\n\nSynchronous motors use DC-voltage-fed rotor windings, which lets the excitation of the machine be controlled—and induction motors use short-circuited rotors (instead of a magnet) following the rotating magnetic field of a multicoiled stator. The short-circuited turns of the rotor develop eddy currents in the rotating field of the stator, and these currents in turn move the rotor by the Lorentz force.\n\nIn 1882, Nikola Tesla identified the concept of the rotating magnetic field. In 1885, Galileo Ferraris independently researched the concept. In 1888, Tesla gained U.S. Patent 381,968 for his work. Also in 1888, Ferraris published his research in a paper to the Royal Academy of Sciences in Turin.\n\n\nHall effect[edit]\n\nMain article: Hall effect\n\nThe charge carriers of a current-carrying conductor placed in a transverse magnetic field experience a sideways Lorentz force; this results in a charge separation in a direction perpendicular to the current and to the magnetic field. The resultant voltage in that direction is proportional to the applied magnetic field. This is known as the Hall effect.\n\nThe Hall effect is often used to measure the magnitude of a magnetic field. It is used as well to find the sign of the dominant charge carriers in materials such as semiconductors (negative electrons or positive holes).\n\n\nMagnetic circuits[edit]\n\nMain article: Magnetic circuit\n\nAn important use of H is in magnetic circuits where B = μH inside a linear material. Here, μ is the magnetic permeability of the material. This result is similar in form to Ohm's law J = σE, where J is the current density, σ is the conductance and E is the electric field. Extending this analogy, the counterpart to the macroscopic Ohm's law (I = V⁄R) is:\n\n\n\t\n  \n    \n      \n        Φ\n        =\n        \n          \n            \n              F\n              R\n            \n          \n          \n            \n              m\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle \\Phi ={\\frac {F}{R}}_{\\mathrm {m} },}\n  \n\n\n\nwhere \n  \n    \n      \n        Φ\n        =\n        ∫\n        \n          B\n        \n        ⋅\n        \n          d\n        \n        \n          A\n        \n      \n    \n    {\\displaystyle \\Phi =\\int \\mathbf {B} \\cdot \\mathrm {d} \\mathbf {A} }\n  \n is the magnetic flux in the circuit, \n  \n    \n      \n        F\n        =\n        ∫\n        \n          H\n        \n        ⋅\n        \n          d\n        \n        \n          ℓ\n        \n      \n    \n    {\\displaystyle F=\\int \\mathbf {H} \\cdot \\mathrm {d} {\\boldsymbol {\\ell }}}\n  \n is the magnetomotive force  applied to the circuit, and Rm is the reluctance of the circuit. Here the reluctance Rm is a quantity similar in nature to resistance for the flux.\n\nUsing this analogy it is straightforward to calculate the magnetic flux of complicated magnetic field geometries, by using all the available techniques of circuit theory.\n\n\nMagnetic field shape descriptions[edit]\n\n  \nSchematic quadrupole magnet (\"four-pole\") magnetic field. There are four steel pole tips, two opposing magnetic north poles and two opposing magnetic south poles.\n\n\n\n\tAn azimuthal magnetic field is one that runs east–west.\n\tA meridional magnetic field is one that runs north–south. In the solar dynamo model of the Sun, differential rotation of the solar plasma causes the meridional magnetic field to stretch into an azimuthal magnetic field, a process called the omega-effect. The reverse process is called the alpha-effect.[57]\n\tA dipole magnetic field is one seen around a bar magnet or around a charged elementary particle with nonzero spin.\n\tA quadrupole magnetic field is one seen, for example, between the poles of four bar magnets. The field strength grows linearly with the radial distance from its longitudinal axis.\n\tA solenoidal magnetic field is similar to a dipole magnetic field, except that a solid bar magnet is replaced by a hollow electromagnetic coil magnet.\n\tA toroidal magnetic field occurs in a doughnut-shaped coil, the electric current spiraling around the tube-like surface, and is found, for example, in a tokamak.\n\tA poloidal magnetic field is generated by a current flowing in a ring, and is found, for example, in a tokamak.\n\tA radial magnetic field is one in which field lines are directed from the center outwards, similar to the spokes in a bicycle wheel. An example can be found in a loudspeaker transducers (driver).[58]\n\tA helical magnetic field is corkscrew-shaped, and sometimes seen in space plasmas such as the Orion Molecular Cloud.[59]\n\n\nMagnetic dipoles[edit]\n\n  \nMagnetic field lines around a ”magnetostatic dipole” pointing to the right.\n\n\n\nMain article: Magnetic dipole\n\nSee also: Spin magnetic moment and Micromagnetism\n\nThe magnetic field of a magnetic dipole is depicted in the figure. From outside, the ideal magnetic dipole is identical to that of an ideal electric dipole of the same strength. Unlike the electric dipole, a magnetic dipole is properly modeled as a current loop having a current I and an area a. Such a current loop has a magnetic moment of:\n\n\n\t\n  \n    \n      \n        m\n        =\n        I\n        a\n        ,\n        \n      \n    \n    {\\displaystyle m=Ia,\\,}\n  \n\n\n\nwhere the direction of m is perpendicular to the area of the loop and depends on the direction of the current using the right-hand rule. An ideal magnetic dipole is modeled as a real magnetic dipole whose area a has been reduced to zero and its current I increased to infinity such that the product m = Ia is finite. This model clarifies the connection between angular momentum and magnetic moment, which is the basis of the Einstein–de Haas effect rotation by magnetization and its inverse, the Barnett effect or magnetization by rotation.[60] Rotating the loop faster (in the same direction) increases the current and therefore the magnetic moment, for example.\n\nIt is sometimes useful to model the magnetic dipole similar to the electric dipole with two equal but opposite magnetic charges (one south the other north) separated by distance d. This model produces an H-field not a B-field. Such a model is deficient, though, both in that there are no magnetic charges and in that it obscures the link between electricity and magnetism. Further, as discussed above it fails to explain the inherent connection between angular momentum and magnetism.\n\n\nMagnetic monopole (hypothetical)[edit]\n\nMain article: Magnetic monopole\n\nA magnetic monopole is a hypothetical particle (or class of particles) that has, as its name suggests, only one magnetic pole (either a north pole or a south pole). In other words, it would possess a \"magnetic charge\" analogous to an electric charge. Magnetic field lines would start or end on magnetic monopoles, so if they exist, they would give exceptions to the rule that magnetic field lines neither start nor end.\n\nModern interest in this concept stems from particle theories, notably Grand Unified Theories and superstring theories, that predict either the existence, or the possibility, of magnetic monopoles. These theories and others have inspired extensive efforts to search for monopoles. Despite these efforts, no magnetic monopole has been observed to date.[nb 16]\n\nIn recent research, materials known as spin ices can simulate monopoles, but do not contain actual monopoles.[61][62]\n\n\nSee also[edit]\n\nGeneral[edit]\n\n\tMagnetohydrodynamics – the study of the dynamics of electrically conducting fluids\n\tMagnetic hysteresis – application to ferromagnetism\n\tMagnetic nanoparticles – extremely small magnetic particles that are tens of atoms wide\n\tMagnetic reconnection – an effect that causes solar flares and auroras\n\tMagnetic potential – the vector and scalar potential representation of magnetism\n\tSI electromagnetism units – common units used in electromagnetism\n\tOrders of magnitude (magnetic field) – list of magnetic field sources and measurement devices from smallest magnetic fields to largest detected\n\tUpward continuation\n\tMoses Effect\n\n\nMathematics[edit]\n\n\tMagnetic helicity – extent to which a magnetic field wraps around itself\n\n\nApplications[edit]\n\n\tDynamo theory – a proposed mechanism for the creation of the Earth's magnetic field\n\tHelmholtz coil – a device for producing a region of nearly uniform magnetic field\n\tMagnetic field viewing film – Film used to view the magnetic field of an area\n\tMagnetic pistol – a device on torpedoes or naval mines that detect the magnetic field of their target\n\tMaxwell coil – a device for producing a large volume of an almost constant magnetic field\n\tStellar magnetic field – a discussion of the magnetic field of stars\n\tTeltron tube – device used to display an electron beam and demonstrates effect of electric and magnetic fields on moving charges\n\n\nNotes[edit]\n\n\t^ His Epistola Petri Peregrini de Maricourt ad Sygerum de Foucaucourt Militem de Magnete, which is often shortened to Epistola de magnete, is dated 1269 C.E.\n\n\t^ \n\nFrom the outside, the field of a dipole of magnetic charge has exactly the same form as a current loop when both are sufficiently small. Therefore, the two models differ only for magnetism inside magnetic material.\n\n\t^ The letters B and H were originally chosen by Maxwell in his Treatise on Electricity and Magnetism (Vol. II, pp. 236–237). For many quantities, he simply started choosing letters from the beginning of the alphabet. See Ralph Baierlein (2000). \"Answer to Question #73. S is for entropy, Q is for charge\". American Journal of Physics. 68 (8): 691. Bibcode:2000AmJPh..68..691B. doi:10.1119/1.19524.\n\n\t^ Edward Purcell, in Electricity and Magnetism, McGraw-Hill, 1963, writes, Even some modern writers who treat B as the primary field feel obliged to call it the magnetic induction because the name magnetic field was historically preempted by H. This seems clumsy and pedantic. If you go into the laboratory and ask a physicist what causes the pion trajectories in his bubble chamber to curve, he'll probably answer \"magnetic field\", not \"magnetic induction.\" You will seldom hear a geophysicist refer to the Earth's magnetic induction, or an astrophysicist talk about the magnetic induction of the galaxy. We propose to keep on calling B the magnetic field. As for H, although other names have been invented for it, we shall call it \"the field H\" or even \"the magnetic field H.\" In a similar vein, M Gerloch (1983). Magnetism and Ligand-field Analysis. Cambridge University Press. p. 110. ISBN 978-0-521-24939-3.\n says: \"So we may think of both B and H as magnetic fields, but drop the word 'magnetic' from H so as to maintain the distinction ... As Purcell points out, 'it is only the names that give trouble, not the symbols'.\"\n\n\t^ This can be seen from the magnetic part of the Lorentz force law F = qvBsinθ.\n\n\t^ The use of iron filings to display a field presents something of an exception to this picture; the filings alter the magnetic field so that it is much larger along the \"lines\" of iron, because of the large permeability of iron relative to air.\n\n\t^ Here, \"small\" means that the observer is sufficiently far away that it can be treated as being infinitesimally small. \"Larger\" magnets need to include more complicated terms in the expression and depend on the entire geometry of the magnet not just m.\n\n\t^ Magnetic field lines may also wrap around and around without closing but also without ending.\n\n\t^ To see that this must be true imagine placing a compass inside a magnet. There, the north pole of the compass points toward the north pole of the magnet since magnets stacked on each other point in the same direction.\n\n\t^ As discussed above, magnetic field lines are primarily a conceptual tool used to represent the mathematics behind magnetic fields. The total \"number\" of field lines is dependent on how the field lines are drawn. In practice, integral equations such as the one that follows in the main text are used instead.\n\n\t^ Either B or H may be used for the magnetic field outside the magnet.\n\n\t^ In practice, the Biot–Savart law and other laws of magnetostatics are often used even when a current change in time, as long as it does not change too quickly. It is often used, for instance, for standard household currents, which oscillate sixty times per second.[30]\n\n\t^ \nThe Biot–Savart law contains the additional restriction (boundary condition) that the B-field must go to zero fast enough at infinity. It also depends on the divergence of B being zero, which is always valid.  (There are no magnetic charges.)\n\n\t^ A third term is needed for changing electric fields and polarization currents; this displacement current term is covered in Maxwell's equations below.\n\n\t^ \n\nA complete expression for Faraday's law of induction in terms of the electric E and magnetic fields can be written as:\n\n  \n    \n      \n        \n          \n            \n              E\n            \n          \n          =\n          −\n          d\n          Φ\n          \n            /\n          \n          d\n          t\n        \n      \n    \n    {\\displaystyle \\textstyle {\\mathcal {E}}=-d\\Phi /dt}\n  \n \n\n  \n    \n      \n        \n          =\n          \n            \n              \n                ∮\n              \n              \n            \n            \n              ∂\n              Σ\n              (\n              t\n              )\n            \n          \n          ⁡\n          \n            (\n            \n              \n                E\n              \n              (\n              \n                r\n              \n              ,\n               \n              t\n              )\n              +\n              \n                v\n                ×\n                B\n              \n              (\n              \n                r\n              \n              ,\n               \n              t\n              )\n            \n            )\n          \n          ⋅\n          d\n          \n            ℓ\n          \n           \n        \n      \n    \n    {\\displaystyle \\textstyle =\\oint _{\\partial \\Sigma (t)}\\left(\\mathbf {E} (\\mathbf {r} ,\\ t)+\\mathbf {v\\times B} (\\mathbf {r} ,\\ t)\\right)\\cdot d{\\boldsymbol {\\ell }}\\ }\n  \n \n\n  \n    \n      \n        \n          =\n          −\n          \n            \n              d\n              \n                d\n                t\n              \n            \n          \n          \n            ∬\n            \n              Σ\n              (\n              t\n              )\n            \n          \n          d\n          \n            A\n          \n          ⋅\n          \n            B\n          \n          (\n          \n            r\n          \n          ,\n           \n          t\n          )\n          ,\n        \n      \n    \n    {\\displaystyle \\textstyle =-{\\frac {d}{dt}}\\iint _{\\Sigma (t)}d{\\boldsymbol {A}}\\cdot \\mathbf {B} (\\mathbf {r} ,\\ t),}\n  \n\n where ∂Σ(t) is the moving closed path bounding the moving surface Σ(t), and dA is an element of surface area of Σ(t). The first integral calculates the work done moving a charge a distance dℓ based upon the Lorentz force law. In the case where the bounding surface is stationary, the Kelvin–Stokes theorem can be used to show this equation is equivalent to the Maxwell–Faraday equation.\n\n\t^ Two experiments produced candidate events that were initially interpreted as monopoles, but these are now considered inconclusive. For details and references, see magnetic monopole.\n\n\n\n\nReferences[edit]\n\n\n\t^ Feynman, Richard P.; Leighton, Robert B.; Sands, Matthew (1963). The Feynman Lectures on Physics. 1. California Institute of Technology. p. 2–4. ISBN 9780465040858.\n\n\n\t^ Young, Hugh D.; Freedman, Roger A.; Ford, A. Lewis (2008). Sears and Zemansky's university physics : with modern physics. 2. Pearson Addison-Wesley. p. 918 - 919. ISBN 9780321501219.\n\n\n\t^ International Bureau of Weights and Measures (5 February 2018), SI Brochure: The International System of Units (SI) (PDF) (Draft) (9th ed.)\n, p. 22\n\n\t^ International Bureau of Weights and Measures (5 February 2018), SI Brochure: The International System of Units (SI) (PDF) (Draft) (9th ed.)\n, p. 21\n\n\t^ Jiles, David C. (1998). Introduction to Magnetism and Magnetic Materials (2 ed.). CRC. p. 3. ISBN 978-0412798603.\n\n\n\t^ Feynman, Richard Phillips; Leighton, Robert B.; Sands, Matthew (1964). The Feynman Lectures on Physics. 2. California Institute of Technology. pp. 1.7–1.8. ISBN 978-0465079988.\n\n\n\t^ Whittaker 1951, p. 34\n\n\t^ Whittaker 1951, p. 56\n\n\t^ Whittaker 1951, p. 59\n\n\t^ Whittaker 1951, p. 64\n\n\t^ Williams, L. Pearce (1974). \"Oersted, Hans Christian\".  In Gillespie, C. C. (ed.). Dictionary of Scientific Biography. New York: Charles Scribner's Sons. p. 185.\n\n\n\t^ Blundell, Stephen J. (2012). Magnetism: A Very Short Introduction. OUP Oxford. p. 31. ISBN 9780191633720.\n\n\n\t^ a b Tricker, R. A. R. (1965). Early electrodynamics. Oxford: Pergamon. p. 23.\n\n\n\t^ Erlichson, Herman (1998). \"The experiments of Biot and Savart concerning the force exerted by a current on a magnetic needle\". American Journal of Physics. 66: 389. doi:10.1119/1.18878.\n\n\n\t^ Frankel, Eugene (1972). Jean-Baptiste Biot: The career of a physicist in nineteenth-century France. Princeton University: Doctoral dissertation. p. 334.\n\n\n\t^ Whittaker 1951, p. 88\n\n\t^ Whittaker 1951, p. 222\n\n\t^ Whittaker 1951, p. 244\n\n\t^ Kelvin (1900). \"Kabinett physikalischer Raritäten.\" Page 200\n\n\t^ Lord Kelvin of Largs. physik.uni-augsburg.de. 26 June 1824\n\n\t^ a b E. J. Rothwell and M. J. Cloud (2010) Electromagnetics. Taylor & Francis. p. 23. \nISBN 1420058266.\n\n\t^ Purcell, E. (2011). Electricity and Magnetism (2nd ed.). Cambridge University Press. pp. 173–4. ISBN 978-1107013605.\n\n\n\t^ R.P. Feynman; R.B. Leighton; M. Sands (1963). The Feynman Lectures on Physics, volume 2.\n[page needed]\n\n\t^ a b \"Non-SI units accepted for use with the SI, and units based on fundamental constants (contd.)\". SI Brochure: The International System of Units (SI) [8th edition, 2006; updated in 2014]. Bureau International des Poids et Mesures. Retrieved 19 April 2018.\n\n\n\t^ a b Lang, Kenneth R. (2006). A Companion to Astronomy and Astrophysics. Springer. p. 176. ISBN 9780387333670. Retrieved 19 April 2018.\n\n\n\t^ \"International system of units (SI)\". NIST reference on constants, units, and uncertainty. National Institute of Standards and Technology. Retrieved 9 May 2012.\n\n\n\t^ \"Gravity Probe B Executive Summary\" (PDF). pp. 10, 21.\n\n\n\t^ \n\nSee Eq. 11.42 in E. Richard Cohen; David R. Lide; George L. Trigg (2003). AIP physics desk reference (3 ed.). Birkhäuser. p. 381. ISBN 978-0-387-98973-0.\n\n\n\t^ Griffiths 1999, p. 438\n\n\t^ Griffiths 2017, p. 223\n\n\t^ Griffiths 2017, p. 224\n\n\t^ Griffiths 2017, p. 225\n\n\t^ Griffiths 1999, pp. 222–225\n\n\t^ \nDeissler, R.J. (2008). \"Dipole in a magnetic field, work, and quantum spin\" (PDF). Physical Review E. 77 (3, pt 2): 036609. Bibcode:2008PhRvE..77c6609D. doi:10.1103/PhysRevE.77.036609. PMID 18517545.\n\n\n\t^ Griffiths 1999, pp. 266–268\n\n\t^ John Clarke Slater; Nathaniel Herman Frank (1969). Electromagnetism (first published in 1947 ed.). Courier Dover Publications. p. 69. ISBN 978-0-486-62263-7.\n\n\n\t^ Griffiths 1999, p. 332\n\n\t^ a b \n\nRJD Tilley (2004). Understanding Solids. Wiley. p. 368. ISBN 978-0-470-85275-0.\n\n\n\t^ \n\nSōshin Chikazumi; Chad D. Graham (1997). Physics of ferromagnetism (2 ed.). Oxford University Press. p. 118. ISBN 978-0-19-851776-4.\n\n\n\t^ \n\nAmikam Aharoni (2000). Introduction to the theory of ferromagnetism (2 ed.). Oxford University Press. p. 27. ISBN 978-0-19-850808-3.\n\n\n\t^ \n\nM Brian Maple;  et al. (2008). \"Unconventional superconductivity in novel materials\".  In K. H. Bennemann; John B. Ketterson (eds.). Superconductivity. Springer. p. 640. ISBN 978-3-540-73252-5.\n\n\n\t^ \n\nNaoum Karchev (2003). \"Itinerant ferromagnetism and superconductivity\".  In Paul S. Lewis; D. Di (CON) Castro (eds.). Superconductivity research at the leading edge. Nova Publishers. p. 169. ISBN 978-1-59033-861-2.\n\n\n\t^ Jackson, John David (1975). Classical electrodynamics (2nd ed.). New York: Wiley. ISBN 9780471431329.\n\n\n\t^ C. Doran and A. Lasenby (2003) Geometric Algebra for Physicists, Cambridge University Press, p. 233. \nISBN 0521715954.\n\n\t^ \nE. J. Konopinski (1978). \"What the electromagnetic vector potential describes\". Am. J. Phys. 46 (5): 499–502. Bibcode:1978AmJPh..46..499K. doi:10.1119/1.11298.\n\n\n\t^ Griffiths 1999, p. 422\n\n\t^ \nFor a good qualitative introduction see:\nRichard Feynman (2006). QED: the strange theory of light and matter. Princeton University Press. ISBN 978-0-691-12575-6.\n\n\n\t^ Weiss, Nigel (2002). \"Dynamos in planets, stars and galaxies\". Astronomy and Geophysics. 43 (3): 3.09–3.15. Bibcode:2002A&G....43c...9W. doi:10.1046/j.1468-4004.2002.43309.x.\n\n\n\t^ \"What is the Earth's magnetic field?\". Geomagnetism Frequently Asked Questions. National Centers for Environmental Information, National Oceanic and Atmospheric Administration. Retrieved 19 April 2018.\n\n\n\t^ Raymond A. Serway; Chris Vuille; Jerry S. Faughn (2009). College physics (8th ed.). Belmont, CA: Brooks/Cole, Cengage Learning. p. 628. ISBN 978-0-495-38693-3.\n\n\n\t^ Merrill, Ronald T.; McElhinny, Michael W.; McFadden, Phillip L. (1996). \"2. The present geomagnetic field: analysis and description from historical observations\". The magnetic field of the earth: paleomagnetism, the core, and the deep mantle. Academic Press. ISBN 978-0-12-491246-5.\n\n\n\t^ Phillips, Tony (29 December 2003). \"Earth's Inconstant Magnetic Field\". Science@Nasa. Retrieved 27 December 2009.\n\n\n\t^ \"With record magnetic fields to the 21st Century\". IEEE Xplore.\n\n\n\t^ Tuchin, Kirill (2013). \"Particle production in strong electromagnetic fields in relativistic heavy-ion collisions\". Adv. High Energy Phys. 2013: 490495. arXiv:1301.0099. doi:10.1155/2013/490495.\n\n\n\t^ Bzdak, Adam; Skokov, Vladimir (29 March 2012). \"Event-by-event fluctuations of magnetic and electric fields in heavy ion collisions\". Physics Letters B. 710 (1): 171–174. arXiv:1111.1949. doi:10.1016/j.physletb.2012.02.065.\n\n\n\t^ Kouveliotou, C.; Duncan, R. C.; Thompson, C. (February 2003). \"Magnetars Archived 11 June 2007 at the Wayback Machine\". Scientific American; Page 36.\n\n\t^ The Solar Dynamo. Retrieved 15 September 2007.\n\n\t^ I. S. Falconer and M. I. Large (edited by I. M. Sefton), \"Magnetism: Fields and Forces\" Lecture E6, The University of Sydney. Retrieved 3 October 2008\n\n\t^ Robert Sanders (12 January 2006) \"Astronomers find magnetic Slinky in Orion\", UC Berkeley.\n\n\t^ See magnetic moment  and B. D. Cullity; C. D. Graham (2008). Introduction to Magnetic Materials (2 ed.). Wiley-IEEE. p. 103. ISBN 978-0-471-47741-9.\n\n\n\t^ \"'Magnetricity' Observed And Measured For First Time\". Science Daily. 15 October 2009. Retrieved 10 June 2010.\n\n\n\t^ M.J.P. Gingras (2009). \"Observing Monopoles in a Magnetic Analog of Ice\". Science. 326 (5951): 375–376. arXiv:1005.3557. doi:10.1126/science.1181510. PMID 19833948.\n\n\n\n\n\nFurther reading[edit]\n\n\n\tDurney, Carl H. & Johnson, Curtis C. (1969). Introduction to modern electromagnetics. McGraw-Hill. ISBN 978-0-07-018388-9.\n\n\tFurlani, Edward P. (2001). Permanent Magnet and Electromechanical Devices: Materials, Analysis and Applications. Academic Press Series in Electromagnetism. ISBN 978-0-12-269951-1. OCLC 162129430.\n\n\tGriffiths, David J. (2017). Introduction to Electrodynamics (4th ed.). Cambridge University Press. ISBN 9781108357142.\n\n\tGriffiths, David J. (1999). Introduction to Electrodynamics (3rd ed.). Prentice Hall. p. 438. ISBN 978-0-13-805326-0. OCLC 40251748.\n\n\tJiles, David (1994). Introduction to Electronic Properties of Materials (1st ed.). Springer. ISBN 978-0-412-49580-9.\n\n\tKraftmakher, Yaakov (2001). \"Two experiments with rotating magnetic field\". Eur. J. Phys. 22 (5): 477–482. Bibcode:2001EJPh...22..477K. doi:10.1088/0143-0807/22/5/302.\n\n\tMelle, Sonia; Rubio, Miguel A.; Fuller, Gerald G. (2000). \"Structure and dynamics of magnetorheological fluids in rotating magnetic fields\". Phys. Rev. E. 61 (4): 4111–4117. Bibcode:2000PhRvE..61.4111M. doi:10.1103/PhysRevE.61.4111.\n\n\tRao, Nannapaneni N. (1994). Elements of engineering electromagnetics (4th ed.). Prentice Hall. ISBN 978-0-13-948746-0. OCLC 221993786.\n\n\tMielnik, Bogdan; FernáNdez c., David J. Fernández C. (1989). \"An electron trapped in a rotating magnetic field\". Journal of Mathematical Physics. 30 (2): 537–549. Bibcode:1989JMP....30..537M. doi:10.1063/1.528419.\n\n\tThalmann, Julia K. (2010). Evolution of Coronal Magnetic Fields. uni-edition. ISBN 978-3-942171-41-0.\n\n\tTipler, Paul (2004). Physics for Scientists and Engineers: Electricity, Magnetism, Light, and Elementary Modern Physics (5th ed.). W. H. Freeman. ISBN 978-0-7167-0810-0. OCLC 51095685.\n\n\tPurcell, Edward M.; Morin, David J. (2013). Electricity and Magnetism (3rd ed.). Cambridge University Press. ISBN 9781107014022.\n\n\tWhittaker, E. T. (1951). A History of the Theories of Aether and Electricity. Dover Publications. ISBN 978-0-486-26126-3.\n\n\n\n\n\nExternal links[edit]\n\n\n\n \n\t\nInformation[edit]\n\n\tCrowell, B., \"Electromagnetism\".\n\tNave, R., \"Magnetic Field\". HyperPhysics.\n\t\"Magnetism\", The Magnetic Field. theory.uwinnipeg.ca.\n\tHoadley, Rick, \"What do magnetic fields look like?\" 17 July 2005.\n\n\nField density[edit]\n\n\tOppelt, Arnulf (2 November 2006). \"magnetic field strength\". Retrieved 4 June 2007.\n\n\t\"magnetic field strength converter\". Retrieved 4 June 2007.\n\n\n\n \n\n\n\t\nRotating magnetic fields[edit]\n\n\t\"Rotating magnetic fields\". Integrated Publishing.\n\t\"Introduction to Generators and Motors\", rotating magnetic field. Integrated Publishing.\n\t\"Induction Motor – Rotating Fields\".\n\n\nDiagrams[edit]\n\n\t\"AC Motor Theory\" Figure 2 Rotating Magnetic Field. Integrated Publishing.\n\t\"Magnetic Fields\" Arc & Mitre Magnetic Field Diagrams. Magnet Expert Ltd.\n\n\n \n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nMagnetic states\n\n\t\n\tdiamagnetism\n\tsuperdiamagnetism\n\tparamagnetism\n\tsuperparamagnetism\n\tferromagnetism\n\tsuperferromagnetism\n\tantiferromagnetism\n\tferrimagnetism\n\thelimagnetism\n\tmetamagnetism\n\tmictomagnetism\n\tspin glass\n\tspin ice\n\tferromagnetic superconductor\n\n\n\n\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4074450-4\n\tLCCN: sh00006588\n\tNDL: 00574624\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Magnetic_field&oldid=918226216\"\n\n\t\t\n\t\tCategories: \tMagnetism\n\tPhysical quantities\n\n\nHidden categories: \tWikipedia articles needing page number citations from April 2018\n\tWebarchive template wayback links\n\tArticles with short description\n\tUse dmy dates from August 2010\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tአማርኛ\n\tالعربية\n\tAragonés\n\tঅসমীয়া\n\tAsturianu\n\tAzərbaycanca\n\tتۆرکجه\n\tবাংলা\n\tБашҡортса\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBosanski\n\tБуряад\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEstremeñu\n\tEuskara\n\tفارسی\n\tFiji Hindi\n\tFrançais\n\tGaeilge\n\tGalego\n\tગુજરાતી\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tInterlingua\n\tÍslenska\n\tItaliano\n\tעברית\n\tქართული\n\tҚазақша\n\tKiswahili\n\tKreyòl ayisyen\n\tКыргызча\n\tLatina\n\tLatviešu\n\tЛезги\n\tLietuvių\n\tLimburgs\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tМонгол\n\tမြန်မာဘာသာ\n\tNederlands\n\tनेपाली\n\t日本語\n\tNordfriisk\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tPolski\n\tPortuguês\n\tRomână\n\tРусиньскый\n\tРусский\n\tScots\n\tShqip\n\tSicilianu\n\tසිංහල\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSunda\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tТатарча/tatarça\n\tతెలుగు\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\tWinaray\n\tWolof\n\t吴语\n\tייִדיש\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 27 September 2019, at 16:31 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "12", "dc:title": "Magnetic field - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Magnetic_field_of_horseshoe_magnet.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-magnetic_field", "title": "Magnetic field - Wikipedia"}}