{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMagnetorquer - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tMagnetorquer\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Magnetic torquer)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tA magnetorquer or magnetic torquer (also known as torque rod) is a satellite system for attitude control, detumbling, and stabilization built from electromagnetic coils. The magnetorquer creates a magnetic dipole that interfaces with an ambient magnetic field, usually Earth's, so that the counter-forces produced provide useful torque.\n\n\nContents\n\n\n\t1 Functional principle\n\t2 Construction\n\t3 Advantages\n\t4 Disadvantages\n\t5 See also\n\t6 References\n\n\n\n\n\nFunctional principle[edit]\n\nMagnetorquers are essentially sets of electromagnets which are laid out to yield a rotationally asymmetric (anisotropic) magnetic field over an extended area. That field is controlled by switching current flow through the coils on or off, usually under computerized feedback control. The magnets themselves are mechanically anchored to the craft, so that any magnetic force they exert on the surrounding magnetic field will lead to a magnetic reverse force and result in mechanical torque about the vessel's center of gravity. This makes it possible to freely pivot the craft around in a known local gradient of the magnetic field by only using electrical energy.\nThe magnetic dipole generated by the magnetorquer is expressed by the formula:\n\n\n  \n    \n      \n        \n          m\n        \n        =\n        n\n        I\n        \n          A\n        \n        \n        \n      \n    \n    {\\displaystyle \\mathbf {m} =nI\\mathbf {A} \\,\\!}\n  \n\n\nwhere n is the number of turns of the wire, I is the current provided, and A is the vector area of the coil. \nThe dipole interacts with the magnetic field generating a torque whose expression is:\n\n\n  \n    \n      \n        \n          τ\n        \n        =\n        \n          m\n        \n        ×\n        \n          B\n        \n        \n        \n      \n    \n    {\\displaystyle \\mathbf {\\tau } =\\mathbf {m} \\times \\mathbf {B} \\,\\!}\n  \n\n\nwhere m is the magnetic dipole vector, B the magnetic field vector (for a spacecraft it is the Earth magnetic field vector) and τ is the generated torque vector.\n\n\nConstruction[edit]\n\nThe construction of a magnetorquer is based on the realization of a coil with a defined area and number of turns according to the required performances. However, there are different ways to obtain the coil; thus, depending on the construction strategy, it is possible to find three types of magnetorquer, apparently very different from each other but based on the same concept [1]: \n\n\n\tAir-core magnetorquer: this comprises the basic concept of magnetorquer, a conductive wire wrapped around a non-conductive support anchored to the satellite. This kind of magnetorquer can provide a consistent magnetic dipole with an acceptable mass and encumbrance.\n\tEmbedded coil: this kind of magnetorquer is constructed creating a spiral trace inside the PCBs of solar panels which generates the effect of the coil. This solution is the one with the least impact on the satellite as it is entirely contained within the solar panels. However, due to the physical limit in the board thickness and the presence of other circuits and electronic components, it is not possible to reach a high value of the magnetic dipole.\n\tTorquerod: this kind of magnetorquer is the most efficient solution. A conductive wire is wrapped around a ferromagnetic core which is magnetized when excited by the coil, thus generating a dipole considerably higher than the other solutions. However, the disadvantage is the presence of a residual magnetic dipole that remains even when the coil is turned off because of the hysteresis in the magnetization curve of the core. It is therefore necessary to demagnetize the core with a proper demagnetizing procedure. Normally, the presence of the core (generally consisting of heavy metal) increases the mass of the system.\n\n\nTypically three coils are used, although reduced configurations of two or even one magnet can suffice where full attitude control is not needed or external forces like asymmetric drag allow underactuated control. The three coil assembly usually takes the form of three perpendicular coils, because this setup equalizes the rotational symmetry of the fields which can be generated; no matter how the external field and the craft are placed with respect to each other, approximately the same torque can always be generated simply by using different amounts of current on the three different coils.\n\nAs long as current is passing through the coils and the spacecraft has not yet been stabilized in a fixed orientation with respect to the external field, the craft's spinning will continue.[citation needed]\n\nVery small satellites may use permanent magnets instead of coils.\n\n\nAdvantages[edit]\n\nMagnetorquers are lightweight, reliable, and energy-efficient. Unlike thrusters, they do not require expendable propellant either, so they could in theory work indefinitely as long as sufficient power is available to match the resistive load of the coils. In Earth orbit, sunlight is one such practically inexhaustible energy source, using solar panels.\n\nA further advantage over momentum wheels and control moment gyroscopes is the absence of moving parts and therefore significantly higher reliability.\n\n\nDisadvantages[edit]\n\nThe main disadvantage of magnetorquers is that very high magnetic flux densities are needed if large craft have to be turned very fast. This either necessitates a very high current in the coils, or much higher ambient flux densities than are available in Earth orbit. Consequently, the torques provided are very limited and only serve to accelerate or decelerate the change in a spacecraft's attitude by minute amounts. Over time active control can produce very fast spinning even here, but for accurate attitude control and stabilization the torques provided often aren't enough.  To overcome this, magnetorquer are often combined with reaction wheels.\n\nA broader disadvantage is the dependence on Earth's magnetic field strength, making this approach unsuitable for deep space missions, and also more suitable for low Earth orbits as opposed to higher ones like the geosynchronous. The dependence on the highly variable intensity of Earth's magnetic field is also problematic because then the attitude control problem becomes highly nonlinear. It is also impossible to control attitude in all three axes even if the full three coils are used, because the torque can be generated only perpendicular to the Earth's magnetic field vector.[2][3]\n\nAny spinning satellite made of a conductive material will lose rotational momentum in Earth's magnetic field due to generation of eddy currents in its body and the corresponding braking force proportional to its spin rate.[4] Aerodynamic friction losses can also play a part. This means that the magnetorquer will have to be continuously operated, and at a power level which is enough to counter the resistive forces present. This is not always possible within the energy constraints of the vessel.\n\nThe Michigan Exploration Laboratory (MXL) suspects that the M-Cubed CubeSat, a joint project run by MXL and JPL, became magnetically conjoined to Explorer-1 Prime, a second CubeSat released at the same time, via strong onboard magnets used for passive attitude control, after deploying on October 28, 2011.[5]\nThis is the first non-destructive latching of two satellites.[6]\n\n\nSee also[edit]\n\n\tReaction wheel\n\n\nReferences[edit]\n\n\n\t^ Niccolò Bellini (2014-09-10). \"Magnetic actuators for nanosatellite attitude control\" (pdf). Cite journal requires |journal= (help)\n\n\t^ Vincent Francois-Lavet (2010-05-31). \"Attitude and Determination Control Systems for the OUFTI nanosatellites\" (pdf).\n\n\n\t^ Ping Wang;  et al. (21–26 June 1998). \"Satellite attitude control using only magnetorquers\" (PDF). American Control Conference. 1: 222–226. doi:10.1109/ACC.1998.694663. Archived from the original (pdf) on 2011-08-21.\n\n\n\t^ \"Magnetorquers\". Amsat.org. 2002-11-24. Retrieved 2010-02-08.\n\n\n\t^ \"Michigan Exploration Laboratory\". Michigan Exploration Laboratory. 2011-12-06. Retrieved 2012-12-14.\n\n\n\t^ \"MCubed-2\". National Space Science Data Center. NASA. 2013-08-16. Retrieved 2019-05-27.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Magnetorquer&oldid=919154209\"\n\n\t\t\n\t\tCategories: \tSpacecraft attitude control\n\tSpacecraft propulsion\n\tSpacecraft components\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from November 2012\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tDeutsch\n\tFrançais\n\tItaliano\n\t日本語\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 2 October 2019, at 03:34 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Magnetorquer - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-magnetic_torquer", "title": "Magnetorquer - Wikipedia"}}