{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMagnetosphere - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tMagnetosphere\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThe region around an astronomical object in which charged particles are affected by its magnetic field\n\nPlay media\n  \nA rendering of the magnetic field lines of Earth's magnetosphere\n\n\n\nA magnetosphere is a region of space surrounding an astronomical object in which charged particles are manipulated or affected by that object's magnetic field.[1][2] It is created by a planet having an active interior dynamo.\n\nIn the space environment close to a planetary body, the magnetic field resembles a magnetic dipole. Farther out, field lines can be significantly distorted by the flow of electrically conducting plasma, as emitted from the Sun or a nearby star. e.g. the solar wind.[3][4] Planets having active magnetospheres, like the Earth, are capable of mitigating or blocking the effects of solar radiation or cosmic radiation, that also protects all living organisms from potentially detrimental and dangerous consequences. This is studied under the specialized scientific subjects of plasma physics, space physics and aeronomy.\n\n\nContents\n\n\n\t1 History\n\t2 Structure and behavior\n\t3 Structure\n\t3.1 Bow shock\n\t3.2 Magnetosheath\n\t3.3 Magnetopause\n\t3.4 Magnetotail\n\t3.5 Earth's magnetosphere\n\t3.6 Other objects\n\n\n\n\t4 See also\n\t5 References\n\n\n\n\n\nHistory[edit]\n\nMain article: Magnetosphere chronology\n\nStudy of Earth's magnetosphere began in 1600, when William Gilbert discovered that the magnetic field on the surface of Earth resembled that on a terrella, a small, magnetized sphere. In the 1940s, Walter M. Elsasser proposed the model of dynamo theory, which attributes Earth's magnetic field to the motion of Earth's iron outer core. Through the use of magnetometers, scientists were able to study the variations in Earth's magnetic field as functions of both time and latitude and longitude.\n\nBeginning in the late 1940s, rockets were used to study cosmic rays. In 1958, Explorer 1, the first of the Explorer series of space missions, was launched to study the intensity of cosmic rays above the atmosphere and measure the fluctuations in this activity. This mission observed the existence of the Van Allen radiation belt (located in the inner region of Earth's magnetosphere), with the follow up Explorer 3 later that year definitively proving its existence. Also during 1958, Eugene Parker proposed the idea of the solar wind, with the term 'magnetosphere' being proposed by Thomas Gold in 1959 to explain how the solar wind interacted with the Earth's magnetic field. The later mission of Explorer 12 in 1961 led by the Cahill and Amazeen observation in 1963 of a sudden decrease in magnetic field strength near the noon-time meridian, later was named the magnetopause. By 1983, the International Cometary Explorer observed the magnetotail, or the distant magnetic field.[4]\n\n\nStructure and behavior[edit]\n\nMagnetospheres are dependent on several variables: the type of astronomical object, the nature of sources of plasma and momentum, the period of the object's spin, the nature of the axis about which the object spins, the axis of the magnetic dipole, and the magnitude and direction of the flow of solar wind.\n\nThe planetary distance where the magnetosphere can withstand the solar wind pressure is called the Chapman–Ferraro distance. This is usefully modeled by the formula wherein \n  \n    \n      \n        \n          R\n          \n            P\n          \n        \n      \n    \n    {\\displaystyle R_{P}}\n  \n represents the radius of the planet, \n  \n    \n      \n        \n          B\n          \n            \n              s\n              u\n              r\n              f\n            \n          \n        \n      \n    \n    {\\displaystyle B_{\\it {surf}}}\n  \n represents the magnetic field on the surface of the planet at the equator, and \n  \n    \n      \n        \n          V\n          \n            S\n            W\n          \n        \n      \n    \n    {\\displaystyle V_{SW}}\n  \n represents the velocity of the solar wind:\n\n\n\t\n  \n    \n      \n        \n          R\n          \n            C\n            F\n          \n        \n        =\n        \n          R\n          \n            P\n          \n        \n        \n          \n            (\n            \n              \n                \n                  B\n                  \n                    \n                      s\n                      u\n                      r\n                      f\n                    \n                  \n                  \n                    2\n                  \n                \n                \n                  \n                    μ\n                    \n                      0\n                    \n                  \n                  ρ\n                  \n                    V\n                    \n                      S\n                      W\n                    \n                    \n                      2\n                    \n                  \n                \n              \n            \n            )\n          \n          \n            \n              1\n              6\n            \n          \n        \n      \n    \n    {\\displaystyle R_{CF}=R_{P}\\left({\\frac {B_{\\it {surf}}^{2}}{\\mu _{0}\\rho V_{SW}^{2}}}\\right)^{\\frac {1}{6}}}\n  \n\n\n\nA magnetosphere is classified as \"intrinsic\" when \n  \n    \n      \n        \n          R\n          \n            C\n            F\n          \n        \n        ≫\n        \n          R\n          \n            P\n          \n        \n      \n    \n    {\\displaystyle R_{CF}\\gg R_{P}}\n  \n, or when the primary opposition to the flow of solar wind is the magnetic field of the object. Mercury, Earth, Jupiter, Ganymede, Saturn, Uranus, and Neptune, for example, exhibit intrinsic magnetospheres. A magnetosphere is classified as \"induced\" when \n  \n    \n      \n        \n          R\n          \n            C\n            F\n          \n        \n        ≪\n        \n          R\n          \n            P\n          \n        \n      \n    \n    {\\displaystyle R_{CF}\\ll R_{P}}\n  \n, or when the solar wind is not opposed by the object's magnetic field. In this case, the solar wind interacts with the atmosphere or ionosphere of the planet (or surface of the planet, if the planet has no atmosphere). Venus has an induced magnetic field, which means that because Venus appears to have no internal dynamo effect, the only magnetic field present is that formed by the solar wind's wrapping around the physical obstacle of Venus (see also Venus' induced magnetosphere). When \n  \n    \n      \n        \n          R\n          \n            C\n            F\n          \n        \n        ≈\n        \n          R\n          \n            P\n          \n        \n      \n    \n    {\\displaystyle R_{CF}\\approx R_{P}}\n  \n, the planet itself and its magnetic field both contribute. It is possible that Mars is of this type.[5]\n\n\nStructure[edit]\n\n  \nAn artist's rendering of the structure of a magnetosphere: 1) Bow shock. 2) Magnetosheath. 3) Magnetopause. 4) Magnetosphere. 5) Northern tail lobe. 6) Southern tail lobe. 7) Plasmasphere.\n\n\n\nBow shock[edit]\n\n  \nInfrared image and artist's concept of the bow shock around R Hydrae\n\n\n\nMain article: Bow shock\n\nThe bow shock forms the outermost layer of the magnetosphere; the boundary between the magnetosphere and the ambient medium. For stars, this is usually the boundary between the stellar wind and interstellar medium; for planets, the speed of the solar wind there decreases as it approaches the magnetopause.[6]\n\n\nMagnetosheath[edit]\n\nMain article: Magnetosheath\n\nThe magnetosheath is the region of the magnetosphere between the bow shock and the magnetopause. It is formed mainly from shocked solar wind, though it contains a small amount of plasma from the magnetosphere.[7] It is an area exhibiting high particle energy flux, where the direction and magnitude of the magnetic field varies erratically. This is caused by the collection of solar wind gas that has effectively undergone thermalization. It acts as a cushion that transmits the pressure from the flow of the solar wind and the barrier of the magnetic field from the object.[4]\n\n\nMagnetopause[edit]\n\nMain article: Magnetopause\n\nThe magnetopause is the area of the magnetosphere wherein the pressure from the planetary magnetic field is balanced with the pressure from the solar wind.[3] It is the convergence of the shocked solar wind from the magnetosheath with the magnetic field of the object and plasma from the magnetosphere. Because both sides of this convergence contain magnetized plasma, the interactions between them are complex. The structure of the magnetopause depends upon the Mach number and beta of the plasma, as well as the magnetic field.[8] The magnetopause changes size and shape as the pressure from the solar wind fluctuates.[9]\n\n\nMagnetotail[edit]\n\nOpposite the compressed magnetic field is the magnetotail, where the magnetosphere extends far beyond the astronomical object. It contains two lobes, referred to as the northern and southern tail lobes. Magnetic field lines in the northern tail lobe point towards the object while those in the southern tail lobe point away. The tail lobes are almost empty, with few charged particles opposing the flow of the solar wind. The two lobes are separated by a plasma sheet, an area where the magnetic field is weaker, and the density of charged particles is higher.[10]\n\n\nEarth's magnetosphere[edit]\n\nSee also: Earth's magnetic field § Magnetosphere\n\n  \nArtist's rendition of Earth's magnetosphere\n\n\n\n  \nDiagram of Earth's magnetosphere\n\n\n\nOver Earth's equator, the magnetic field lines become almost horizontal, then return to reconnect at high latitudes. However, at high altitudes, the magnetic field is significantly distorted by the solar wind and its solar magnetic field. On the dayside of Earth, the magnetic field is significantly compressed by the solar wind to a distance of approximately 65,000 kilometers (40,000 mi). Earth's bow shock is about 17 kilometers (11 mi) thick[11] and located about 90,000 kilometers (56,000 mi) from Earth.[12] The magnetopause exists at a distance of several hundred kilometers above Earth's surface. Earth's magnetopause has been compared to a sieve because it allows solar wind particles to enter. Kelvin–Helmholtz instabilities occur when large swirls of plasma travel along the edge of the magnetosphere at a different velocity from the magnetosphere, causing the plasma to slip past. This results in magnetic reconnection, and as the magnetic field lines break and reconnect, solar wind particles are able to enter the magnetosphere.[13] On Earth's nightside, the magnetic field extends in the magnetotail, which lengthwise exceeds 6,300,000 kilometers (3,900,000 mi).[3] Earth's magnetotail is the primary source of the polar aurora.[10] Also, NASA scientists have suggested that Earth's magnetotail might cause \"dust storms\" on the Moon by creating a potential difference between the day side and the night side.[14]\n\n\nOther objects[edit]\n\nThe magnetosphere of Jupiter is the largest planetary magnetosphere in the Solar System, extending up to 7,000,000 kilometers (4,300,000 mi) on the dayside and almost to the orbit of Saturn on the nightside.[15] Jupiter's magnetosphere is stronger than Earth's by an order of magnitude, and its magnetic moment is approximately 18,000 times larger.[16]\nPluto, on the other hand, has no magnetic field.[17]\n\n\nSee also[edit]\n\n Geomagnetism – Wikipedia book\n\n\n\tPlasma (physics)\n\n\nReferences[edit]\n\n\n\t^ \"Magnetospheres\". NASA Science. NASA.\n\n\t^ Ratcliffe, John Ashworth (1972). An Introduction to the Ionosphere and Magnetosphere. CUP Archive. ISBN 9780521083416.\n\n\n\t^ a b c \"Ionosphere and magnetosphere\". Encyclopædia Britannica. Encyclopædia Britannica, Inc. 2012.\n\n\n\t^ a b c Van Allen, James Alfred (2004). Origins of Magnetospheric Physics. Iowa City, Iowa USA: University of Iowa Press. ISBN 9780877459217. OCLC 646887856.\n\n\n\t^ Blanc, M.; Kallenbach, R.; Erkaev, N.V. (2005). \"Solar System Magnetospheres\". Space Science Reviews. 116 (116): 227–298. Bibcode:2005SSRv..116..227B. doi:10.1007/s11214-005-1958-y.\n\n\n\t^ Sparavigna, A.C.; Marazzato, R. (10 May 2010). \"Observing stellar bow shocks\" (PDF). arXiv:1005.1527. Bibcode:2010arXiv1005.1527S. Cite journal requires |journal= (help)\n\n\n\t^ Paschmann, G.; Schwartz, S.J.; Escoubet, C.P.; Haaland, S., eds. (2005). Outer Magnetospheric Boundaries: Cluster Results (PDF). Space Science Reviews. Space Sciences Series of ISSI. 118. doi:10.1007/1-4020-4582-4. ISBN 978-1-4020-3488-6.\n\n\n\t^ Russell, C.T. (1990). \"The Magnetopause\".  In Russell, C.T.; Priest, E.R.; Lee, L.C. (eds.). Physics of magnetic flux ropes. American Geophysical Union. pp. 439–453. ISBN 9780875900261. Archived from the original on 2 February 1999.\n\n\n\t^ Stern, David P.; Peredo, Mauricio (20 November 2003). \"The Magnetopause\". The Exploration of the Earth's Magnetosphere. NASA. Retrieved 19 August 2019.\n\n\n\t^ a b \"The Tail of the Magnetosphere\". NASA.\n\n\n\t^ \"Cluster reveals Earth's bow shock is remarkably thin\". European Space Agency. 16 November 2011.\n\n\n\t^ \"Cluster reveals the reformation of Earth's bow shock\". European Space Agency. 11 May 2011.\n\n\n\t^ \"Cluster observes a 'porous' magnetopause\". European Space Agency. 24 October 2012.\n\n\n\t^ http://www.nasa.gov/topics/moonmars/features/magnetotail_080416.html NASA, The Moon and the Magnetotail\n\n\t^ Khurana, K.K.; Kivelson, M.G.;  et al. (2004). \"The configuration of Jupiter's magnetosphere\" (PDF).  In Bagenal, F.; Dowling, T.E.; McKinnon, W.B. (eds.). Jupiter: The Planet, Satellites and Magnetosphere. Cambridge University Press. ISBN 978-0-521-81808-7.\n\n\n\t^ Russell, C.T. (1993). \"Planetary Magnetospheres\". Reports on Progress in Physics. 56 (6): 687–732. Bibcode:1993RPPh...56..687R. doi:10.1088/0034-4885/56/6/001.\n\n\n\t^ NASA (14 September 2016). \"X-ray Detection Sheds New Light on Pluto\". nasa.gov. Retrieved 3 December 2016.\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nMagnetospherics\n\n\tSubmagnetosphere\t\n\tAtmospheric circulation\n\tAurora\n\tEarth's magnetic field\n\tGeosphere\n\tJet stream\n\tPolar wind\n\n\n\n\n\tEarth's magnetosphere\t\n\tBirkeland current\n\tBow shock\n\tIonosphere\n\tMagnetopause\n\tMagnetosheath\n\tMagnetosphere\n\tMagnetosphere chronology\n\tMagnetosphere particle motion\n\tPlasmasphere\n\tRing current\n\tVan Allen radiation belt\n\n\n\n\n\tSolar wind\t\n\tCoronal cloud\n\tCoronal mass ejection\n\tSolar flare\n\tGeomagnetic storm\n\tHeliosphere\n\tInterplanetary magnetic field\n\tHeliospheric current sheet\n\tHeliopause\n\tSolar particle event\n\tSpace climate\n\tSpace weather\n\n\n\n\n\tSatellites\t\n\tFull list\n\tArase (2016)\n\tCluster II\n\tDouble Star\n\tGeotail\n\tIMAGE\n\tMMS (2015)\n\tPolar\n\tTHEMIS\n\tVan Allen Probes\n\tWind\n\n\n\n\n\tResearch projects\t\n\tHAARP\n\tSHARE\n\tUnwin Radar\n\n\n\tSuperDARN\n\n\n\n\n\tOther magnetospheres\t\n\tHermian\n\tLunar\n\tJovian\n\tGanymedian\n\tSaturnian\n\tUranian\n\tNeptunian\n\n\n\n\n\tRelated topics\t\n\tFlux tube\n\tGas torus\n\tLunar swirls\n\tPlanetary rings\n\tJupiter\n\tSaturn\n\tUranus\n\tNeptune\n\n\n\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4132479-1\n\tNDL: 00574730\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Magnetosphere&oldid=916515717\"\n\n\t\t\n\t\tCategories: \tGeomagnetism\n\tIonosphere\n\tPlanetary science\n\tSpace plasmas\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tArticles with short description\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with NDL identifiers\n\tUse dmy dates from September 2019\n\tArticles containing video clips\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tБеларуская\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tქართული\n\tҚазақша\n\tКыргызча\n\tLietuvių\n\tMagyar\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tOʻzbekcha/ўзбекча\n\tភាសាខ្មែរ\n\tPolski\n\tPortuguês\n\tQaraqalpaqsha\n\tRomână\n\tРусский\n\tScots\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 19 September 2019, at 08:40 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "8", "dc:title": "Magnetosphere - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Rattling_Earth%27s_Force_Field.ogv/960px--Rattling_Earth%27s_Force_Field.ogv.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-magnetosphere", "title": "Magnetosphere - Wikipedia"}}