{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMolniya orbit - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\n\n\tMolniya orbit\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\n\n\nType of high-latitude satellite orbit\n\nFor other uses, see Molniya (disambiguation).\n\n  \nFigure 1: The Molniya orbit. Usually the period from perigee +2 hours to perigee +10 hours is used to transmit to the northern hemisphere.\n\n\n\n  \nFigure 2: The SDS constellation, which uses satellites in a mixture of geostationary and Molniya orbits. The constellation of Molniya-orbiting satellites uses three satellites on different orbital planes, with apogees comparable to those of the geostationary satellites.\n\n\n\nA Molniya orbit (Russian: Молния, IPA: [ˈmolnʲɪjə] (listen), \"Lightning\") is a type of satellite orbit designed to provide communications and remote sensing coverage over high latitudes. It is a highly elliptical orbit with an inclination of 63.4 degrees, an argument of perigee of 270 degrees, and an orbital period of approximately half a sidereal day.[1] The name comes from the Molniya satellites, a series of Soviet/Russian  civilian and military communications satellites which have used this type of orbit since the mid-1960s.\n\nThe Molniya orbit has a long dwell time over the hemisphere of interest, while moving very quickly over the other. In practice, this places it over either Russia or the northern United States for the majority of its orbit, providing a high angle of view to communications and monitoring satellites covering these high-latitude areas. Geostationary orbits, which are necessarily inclined over the equator, can only view these regions from a low angle, hampering performance. In practice, a satellite in a Molniya orbit serves the same purpose for high latitudes as a geostationary satellite does for equatorial regions, except that multiple satellites are required for continuous coverage.[2]\n\nSatellites placed in Molniya orbits have been used for television broadcasting, telecommunications, military communications, relaying, weather monitoring, early-warning systems and some classified purposes.\n\n\nContents\n\n\n\t1 History\n\t2 Uses\n\t2.1 Southern hemisphere proposals\n\t2.2 Molniya constellations\n\t2.3 Diagrams\n\n\n\n\t3 Properties\n\t3.1 Argument of perigee\n\t3.2 Orbital inclination\n\t3.3 Orbital period\n\t3.4 Eccentricity\n\t3.5 Semi-major axis\n\n\n\n\t4 Modelling\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nHistory[edit]\n\nThe Molniya orbit was discovered by Soviet scientists in the 1960s as a high-latitude communications alternative to geostationary orbits, which require large launch energies to achieve a high perigee and to change inclination to orbit over the equator (especially when launched from Russian latitudes). As a result, OKB-1 sought a less energy-demanding orbit.[3] Studies found that this could be achieved using a highly elliptical orbit with an apogee over Russian territory.[4] The orbit's name refers to the \"lightning\" speed with which the satellite passes through the perigee.[5]\n\nThe first use of the Molniya orbit was by the communications satellite series of the same name. After two launch failures, and one satellite failure in 1964, the first successful satellite to use this orbit, Molniya 1-1, launched on 23 April 1965.[4][6] The early Molniya-1 satellites were used for civilian television, telecommunication and long-range military communications, but they were also fitted with cameras used for weather monitoring, and possibly for assessing clear areas for Zenit spy satellites.[3][7] The original Molniya satellites had a lifespan of approximately 1.5 years, as their orbits were disrupted by perturbations, and they had to be constantly replaced.[1]\n\nThe succeeding series, the Molniya-2, provided both military and civilian broadcasting and was used to create the Orbita television network, spanning the Soviet Union. These were in turn replaced by the Molniya-3 design.[4] A satellite called Mayak was designed to supplement and replace the Molniya satellites in 1997, but the project was cancelled,[8] and the Molniya-3 was replaced by the Meridian satellites, the first of which launched in 2006.[9] The Soviet US-K early-warning satellites, which watch for American rocket launches, were launched in Molniya orbits from 1967, as part of the Oko system.[10][11][12]\n\nFrom 1971, the American Jumpseat and Trumpet military satellites were launched into Molniya orbits (and possibly used to intercept Soviet communications from the Molniya satellites). Detailed information about both projects remains classified as of 2019[update].[13] This was followed by the American SDS constellation, which operates with a mix of Molniya and geostationary orbits. These satellites are used to relay signals from lower flying satellites back to ground stations in the United States and have been active in some capacity since 1976.[14] A Russian satellite constellation called Tyulpan was designed in 1994 to support communications at high latitudes, but it did not progress past the planning phase.[8]\n\nIn 2015 and 2017 Russia launched two Tundra satellites into a Molniya orbit, despite their name, as part of its EKS early warning system.[15][16][17]\n\n\nUses[edit]\n\n  \nFigure 3: Groundtrack of a Molniya orbit. In the operational part of the orbit (four hours on each side of apogee), the satellite is north of 55.5° N (latitude of, for example, central Scotland, Moscow and southern part of Hudson Bay). A satellite in this orbits spends most of its time over the northern hemisphere and passes quickly over the southern hemisphere.\n\n\n\nMuch of the area of the former Soviet Union, and Russia in particular, is located at high northern latitudes. To broadcast to these latitudes from a geostationary orbit (above the Earth's equator) requires considerable power due to the low elevation angles, and the extra distance and atmospheric attenuation that comes with it. Sites located about 81° latitude are unable to view geostationary satellites at all, and as a rule of thumb, elevation angles of less than 10° can cause problems, depending on the communications frequency.[2]:499[18]\n\nA satellite in a Molniya orbit is better suited to communications in these regions, because it looks more directly down on them during large portions of its orbit. With an apogee altitude as high as 40,000 kilometres (25,000 mi) and an apogee sub-satellite point of 63.4 degrees north, it spends a considerable portion of its orbit with excellent visibility in the northern hemisphere, from Russia as well as from northern Europe, Greenland and Canada.[2]\n\nWhile satellites in Molniya orbits require considerably less launch energy than those in geostationary orbits (especially launching from high latitudes),[4] their ground stations need steerable antennas to track the spacecraft, links must be switched between satellites in a constellation and range changes cause variations in signal amplitude. Additionally, there is a greater need for station-keeping,[19][20][21] and the spacecraft will pass through the Van Allen radiation belt four times per day.[22]\n\n\nSouthern hemisphere proposals[edit]\n\nSimilar orbits with an argument of perigee of 90° could allow high-latitude coverage in the southern hemisphere. A proposed constellation, the Antarctic Broadband Program, would have used satellites in an inverted Molniya orbit to provide broadband internet service to facilities in Antarctica.[23][24] Initially funded by the now defunct Australian Space Research Program, it did not progress beyond initial development.[25][26]\n\n\nMolniya constellations[edit]\n\nPermanent high-elevation coverage of a large area of Earth (like the whole of Russia, where some parts are as far south as 45° N) requires a constellation of at least three spacecraft in Molniya orbits. If three spacecraft are used, then each spacecraft will be active for a period of eight hours per orbit, centered around apogee,[2] as illustrated in figure 4. Figure 5 shows the satellite's field of view around the apogee. \n\nThe Earth completes half a rotation in twelve hours, so the apogees of successive Molniya orbits will alternate between one half of the northern hemisphere and the other. For the original Molniya orbit, the apogees were placed over Russia and North America, but by changing the right ascension of the ascending node this can be varied.[19] The coverage from a satellite in a Molniya orbit over Russia is shown in figures 6 to 8, and over North America in figures 9 to 11.\n\nThe orbits of the three spacecraft should then have the same orbital parameters, but different right ascensions of the ascending nodes, with their passes over the apogees separated by 7.97 hours.[2][27] Since each satellite has an operational period of approximately eight hours, when one spacecraft travels four hours after its apogee passage (see figure 8 or figure 11), then the next satellite will enter its operational period, with the view of the earth shown in figure 6 (or figure 9), and the switch-over can take place. Note that the two spacecraft at the time of switch-over are separated by about 1,500 kilometres (930 mi), so that the ground stations only have to move their antennas a few degrees to acquire the new spacecraft.[28]\n\n\nDiagrams[edit]\n\n\t\n\t\t\t\n\n\n\t\t\t\nFigure 4: A constellation of three Molniya spacecraft providing service for the Northern hemisphere. P is the orbital period. A green line corresponds to service for Asia and Europe with the visibility of figures 6–8. A red line corresponds to service for North America with the visibility of figures 9–11.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nFigure 5: Illumination zones (at least 10° elevation) from a Molniya orbit. At apogee, the green illumination zone applies. At three hours before or after apogee, the red zone applies. At four hours before or after apogee, the blue zone applies. The plane of the figure is the longitudinal plane of apogee rotating with the Earth. In the eight-hour period centered at the apogee passage, the longitudinal plane is almost fixed, the longitude of the satellite varies by only ±2.7°. The views of the Earth from these three points are displayed in figures 6–11.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nFigure 6: View of the Earth four hours before apogee from a Molniya orbit under the assumption that the longitude of the apogee is 90° E. The spacecraft is at an altitude of 24,043 km over the point 92.65° E 47.04° N.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nFigure 7: View of the Earth from the apogee of a Molniya orbit under the assumption that the longitude of the apogee is 90° E. The spacecraft is at an altitude of 39,867 km over the point 90° E 63.43° N.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nFigure 8: View of the Earth four hours after apogee from a Molniya orbit under the assumption that the longitude of the apogee is 90° E. The spacecraft is at an altitude of 24,043 km over the point 87.35° E 47.04° N\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nFigure 9: View of the Earth four hours before apogee from a Molniya orbit under the assumption that the longitude of the apogee is 90° W. The spacecraft is at an altitude of 24,043 km over the point 87.35° W 47.04° N.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nFigure 10: View of the Earth from the apogee of a Molniya orbit under the assumption that the longitude of the apogee is 90° W. The spacecraft is at an altitude of 39,867 km over the point 90° W 63.43° N.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nFigure 11: View of the Earth 4 hours after apogee from a Molniya orbit under the assumption that the longitude of the apogee is 90° W. The spacecraft is at an altitude of 24,043 km over the point 92.65° W 47.04° N.\n\n\n\t\t\t\n\n\t\t\n\n\n\n\n\n\nProperties[edit]\n\nA typical Molniya orbit has the following properties:\n\n\n\tArgument of perigee: 270°\n\tInclination: 63.4°[20]\n\tPeriod: 718 minutes[1]\n\tEccentricity: 0.74\n\tSemi-major axis: 26,600 km (16,500 mi)\n\n\nArgument of perigee[edit]\n\nThe argument of perigee is set at 270°, causing the satellite to experience apogee at the most northerly point of its orbit. For any future applications over the southern hemisphere, it would instead be set at 90°.[24]\n\n\nOrbital inclination[edit]\n\nIn general, the oblateness of the Earth perturbs the argument of perigee (\n  \n    \n      \n        ω\n      \n    \n    {\\displaystyle \\omega }\n  \n), so that it gradually changes with time. If we only consider the first-order coefficient \n  \n    \n      \n        \n          J\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle J_{2}}\n  \n, the perigee will change according to equation 1, unless it is constantly corrected with station-keeping thruster burns.\n\n\n\t\n\t\n  \n    \n      \n        \n          \n            \n              ω\n              ˙\n            \n          \n        \n        =\n        \n          \n            3\n            4\n          \n        \n        ⋅\n        n\n        \n          J\n          \n            2\n          \n        \n        ⋅\n        \n          \n            (\n            \n              \n                \n                  R\n                  \n                    E\n                  \n                \n                a\n              \n            \n            )\n          \n          \n            2\n          \n        \n        \n          \n            \n              4\n              −\n              5\n              \n                sin\n                \n                  2\n                \n              \n              ⁡\n              \n                i\n              \n            \n            \n              (\n              1\n              −\n              \n                e\n                \n                  2\n                \n              \n              \n                )\n                \n                  2\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\dot {\\omega }}={\\frac {3}{4}}\\cdot nJ_{2}\\cdot \\left({\\frac {R_{E}}{a}}\\right)^{2}{\\frac {4-5\\sin ^{2}{i}}{(1-e^{2})^{2}}}}\n  \n\n\n\t\n\n\t \n\n\t \n\n\t \n\n\n\t\n \n\n\n\n\n\n\n\t(1)\n\n\n\n\n\n\nwhere \n  \n    \n      \n        i\n      \n    \n    {\\displaystyle i}\n  \n is the orbital inclination, \n  \n    \n      \n        e\n      \n    \n    {\\displaystyle e}\n  \n is the eccentricity, \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n is mean motion in degrees per day, \n  \n    \n      \n        \n          J\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle J_{2}}\n  \n is the perturbing factor, \n  \n    \n      \n        \n          R\n          \n            E\n          \n        \n      \n    \n    {\\displaystyle R_{E}}\n  \n is the radius of the earth, \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n is the semimajor axis, and \n  \n    \n      \n        \n          \n            \n              ω\n              ˙\n            \n          \n        \n      \n    \n    {\\displaystyle {\\dot {\\omega }}}\n  \n is in degrees per day.\n\nTo avoid this expenditure of fuel, the Molniya orbit uses an inclination of 63.4°, for which the factor \n  \n    \n      \n        4\n        −\n        5\n        \n          sin\n          \n            2\n          \n        \n        ⁡\n        \n          i\n        \n      \n    \n    {\\displaystyle 4-5\\sin ^{2}{i}}\n  \n is zero, so that there is no change in the position of perigee over time.[20][19]:143 An orbit designed in this manner is called a frozen orbit.\n\n\nOrbital period[edit]\n\nTo ensure the geometry relative to the ground stations repeats every 24 hours, the period should be about half a sidereal day, keeping the longitudes of the apogees constant.\n\nHowever, the oblateness of the Earth also perturbs the right ascension of the ascending node (\n  \n    \n      \n        Ω\n      \n    \n    {\\displaystyle \\Omega }\n  \n), changing the nodal period and causing the ground track to drift over time at the rate shown in equation 2.\n\n\n\t\n\t \n  \n    \n      \n        \n          \n            \n              Ω\n              ˙\n            \n          \n        \n        =\n        −\n        \n          \n            3\n            2\n          \n        \n        ⋅\n        n\n        \n          J\n          \n            2\n          \n        \n        ⋅\n        \n          \n            (\n            \n              \n                \n                  R\n                  \n                    E\n                  \n                \n                a\n              \n            \n            )\n          \n          \n            2\n          \n        \n        \n          \n            \n              cos\n              ⁡\n              \n                i\n              \n            \n            \n              (\n              1\n              −\n              \n                e\n                \n                  2\n                \n              \n              \n                )\n                \n                  2\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\dot {\\Omega }}=-{\\frac {3}{2}}\\cdot nJ_{2}\\cdot \\left({\\frac {R_{E}}{a}}\\right)^{2}{\\frac {\\cos {i}}{(1-e^{2})^{2}}}}\n  \n \n\n\t\n\n\t \n\n\t \n\n\t \n\n\n\t\n \n\n\n\n\n\n\n\t(2)\n\n\n\n\n\n\nwhere \n  \n    \n      \n        \n          \n            \n              Ω\n              ˙\n            \n          \n        \n      \n    \n    {\\displaystyle {\\dot {\\Omega }}}\n  \n is in degrees per day.[19]:143\n\nSince the inclination of a Molniya orbit is fixed (as above), this perturbation is \n  \n    \n      \n        \n          \n            \n              Ω\n              ˙\n            \n          \n        \n        =\n        −\n        0.3\n      \n    \n    {\\displaystyle {\\dot {\\Omega }}=-0.3}\n  \n degrees per day. To compensate, the orbital period is adjusted so that the longitude of the apogee changes enough to cancel out this effect.[20]\n\n\nEccentricity[edit]\n\nThe eccentricity of the orbit is based on the differences in altitudes of its apogee and perigee. To maximise the amount of time that the satellite spends over the apogee, the eccentricity should be set as high as possible. However, the perigee needs to be high enough to keep the satellite substantially above the atmosphere to minimize drag (~600km), and the orbital period needs to be kept to approximately half a sidereal day (as above). These two factors constrain the eccentricity, which becomes approximately 0.737.[20]\n\n\nSemi-major axis[edit]\n\nThe exact height of a satellite in a Molniya orbit varies between missions, but a typical orbit will have a perigee of approximately 600 kilometres (370 mi) and an apogee of 39,700 kilometres (24,700 mi), for a semi-major axis of 26,600 kilometres (16,500 mi).[20]\n\n\nModelling[edit]\n\nTo track satellites using Molniya orbits, scientists use the SDP4 simplified perturbations model, which calculates the location of a satellite based on orbital shape, drag, radiation, gravitation effects from the sun and moon, and earth resonance terms.[29]\n\n\nSee also[edit]\n\n\tList of orbits\n\tTundra orbit\n\n\nReferences[edit]\n\n\n\t^ a b c Kolyuka, Yu. F.; Ivanov, N.M.; Afanasieva, T.I.; Gridchina, T.A. (28 September 2009). Examination of the Lifetime, Evolution and Re-Entry Features for the \"Molniya\" Type Orbits (PDF). 21st International Symposium of Space Flight Dynamics. Toulouse, France: Mission Control Center 4, Korolev, Moscow. p. 2. Retrieved 22 May 2018.\n\n\t^ a b c d e Ilčev, Stojče Dimov (2017). Global Satellite Meteorological Observation (GSMO) Theory. 1. Springer International Publishing. p. 57. ISBN 978-3-319-67119-2. Retrieved 16 April 2019.\n\n\n\t^ a b History Committee of the American Astronautical Society (23 August 2010).  Johnson, Stephen B. (ed.). Space Exploration and Humanity: A Historical Encyclopedia. 1. Greenwood Publishing Group. p. 416. ISBN 978-1-85109-514-8. Retrieved 17 April 2019.\n\n\n\t^ a b c d Martin, Donald H. (2000). Communication Satellites (4 ed.). American Institute of Aeronautics and Astronautics. pp. 215–232. ISBN 978-1-884989-09-4. Retrieved 17 April 2019.\n\n\n\t^ Capderou, Michel (23 April 2014). Handbook of Satellite Orbits: From Kepler to GPS. Springer Science & Business. p. 393. Bibcode:2014hso..book.....C. ISBN 978-3-319-03416-4. Retrieved 16 April 2019.\n\n\n\t^ Preliminary Analysis of the First Successful Soviet Communications Satellite (PDF) (Report). CIA: Office of Scientific Intelligence. 12 December 2003. p. 3. Retrieved 16 April 2016.\n\n\n\t^ Hendrickx, Bart (2004). \"A History of Soviet/Russian Meteorological Satellites\" (PDF). Journal of the British Interplanetary Society. 57 (Suppl. 1): 66.\n\n\n\t^ a b Heyman, Jos (December 2015).  Heyman, Jos (ed.). Cancelled projects: Russian comsats (PDF) (Report). 41. IAC 2017: Tiros Space Information News Bulletin. p. 4. Retrieved 16 April 2019.\n\n\n\t^ Graham, William (4 May 2011). \"Soyuz 2-1a launches with Russian Meridian 4 military satellite\". NASASpaceflight.com. Retrieved 16 April 2019.\n\n\n\t^ Forden, Geoffrey (May 3, 2001). \"Reducing a Common Danger: Improving Russia's Early-Warning System\" (PDF). Cato Policy Analysis No. 399: 5. Retrieved 16 April 2019.\n\n\n\t^ Podvig, Pavel (2002). \"History and the Current Status of the Russian Early-Warning System\" (PDF). Science and Global Security. 10: 21–60. CiteSeerX 10.1.1.692.6127. doi:10.1080/08929880212328. ISSN 0892-9882. Archived from the original (PDF) on 2012-03-15.\n\n\n\t^ \"Russia blinded by loss of missile detection satellite\". Moscow Times. 26 June 2014. Retrieved 16 April 2019.\n\n\n\t^ Graham, William (23 September 2017). \"Atlas V launches NROL-42 spy satellite\". NASASpaceflight.com. Retrieved 16 April 2019.\n\n\n\t^ Richelson, Jeffrey T (2002). The Wizards of Langley. Inside the CIA's Directorate of Science and Technology. Boulder: Westview Press. ISBN 978-0-8133-4059-3. Retrieved 17 April 2019.\n\n\n\t^ Tomasz Nowakowski (November 17, 2015). \"Russian Soyuz-2.1b rocket successfully launches Tundra satellite\". Spaceflight Insider.\n\n\n\t^ Curt Godwin (May 25, 2017). \"Soyuz rocket successfully delivers EKS-2 early-warning satellite to rare orbit\". Spaceflight Insider.\n\n\n\t^ Clark, Stephen (25 May 2017). \"Russia sends military satellite into orbit for missile warnings – Spaceflight Now\".\n\n\n\t^ Soler, Tomás; Eisemann, David W. (August 1994). \"Determination of Look Angles To Geostationary Communication Satellites\" (PDF). Journal of Surveying Engineering. 120: 123. doi:10.1061/(ASCE)0733-9453(1994)120:3(115). ISSN 0733-9453. Retrieved 16 April 2019.\n\n\n\t^ a b c d Wertz, James Richard; Larson, Wiley J. (1999).  Larson, Wiley J.; Wertz, James R. (eds.). Space Mission Analysis and Design. Microcosm Press and Kluwer Academic Publishers. Bibcode:1999smad.book.....W. ISBN 1-881883-10-8.\n\n\n\t^ a b c d e f Kidder, Stanley Q.; Vonder Haar, Thomas H. (18 August 1989). \"On the Use of Satellites in Molniya Orbits of Meteorological Observation of Middle and High Latitudes\". Journal of Atmospheric and Oceanic Technology. 7: 517. doi:10.1175/1520-0426(1990)007<0517:OTUOSI>2.0.CO;2.\n\n\n\t^ King-Hele, D. G. (January 1975). \"The Orbital Lifetime of Molniya Satellites\". Journal of the British Interplanetary Society. 28: 783–796. Bibcode:1975JBIS...28..783K.\n\n\n\t^ van der Ha, Jozef C., ed. (November 1997). Mission Design & Implementation of Satellite Constellations: Proceedings of an International Workshop held in Toulouse, France. Springer-Science. p. 67. ISBN 9401061378. Retrieved 16 April 2019.\n\n\n\t^ \"Antarctic Broadband program\". rsaa.anu.edu.au. Australian National University. Retrieved 12 April 2019.\n\n\n\t^ a b Bonin, Grant; Zee, Robert; Brett, Michael; King, Jan; Faber, Daniel (October 2012). Antarctic Broadband: Fast Internet for the Bottom of the Earth. IAC 2012. Retrieved 12 April 2019.\n\n\n\t^ Bird, Cameron, ed. (17 November 2015). Final evaluation of the Australian Space Research Program (PDF) (Report). Department of Industry, Innovation and Science. Retrieved 12 April 2019.\n\n\n\t^ Dempster, Andrew. \"As the details emerge on Australia's new space agency, we (might) finally have lift-off\". The Conversation. Retrieved 12 April 2019.\n\n\n\t^ Kidder, Stanley Q.; Vonder Haar, Thomas H. (18 August 1989). \"On the Use of Satellites in Molniya Orbits of Meteorological Observation of Middle and High Latitudes\". Journal of Atmospheric and Oceanic Technology. 7: 519. doi:10.1175/1520-0426.\n\n\n\t^ Sturdivant, R. L.; Chon, E. K. P. (2016). \"Systems Engineering of a Terabit Elliptic Orbit Satellite and Phased Array Ground Station for IoT Connectivity and Consumer Internet Access\". IEEE Access. 4: 9947. doi:10.1109/ACCESS.2016.2608929.\n\n\n\t^ Hoots, Felix R.; Roehrich, Ronald L. (31 December 1988). Models for Propagation of NORAD Element Sets (PDF) (Report). United States Department of Defense Spacetrack Report. Retrieved 16 June 2010.\n\n\n\n\n\n\nExternal links[edit]\n\n\tIllustration of the communication geometry provided by satellites in 12-hour Molniya orbits (video)\n\n\n\t\tv\n\tt\n\te\n\n\nGravitational orbits\n\n\tTypes\t\n\tGeneral\t\n\tBox\n\tCapture\n\tCircular\n\tElliptical / Highly elliptical\n\tEscape\n\tHorseshoe\n\tHyperbolic trajectory\n\tInclined / Non-inclined\n\tLagrangian point\n\tOsculating\n\tParabolic trajectory\n\tParking\n\tSynchronous\n\tsemi\n\tsub\n\n\n\tTransfer orbit\n\n\n\n\n\tGeocentric\t\n\tGeosynchronous\n\tGeostationary\n\tGeostationary transfer\n\n\n\tGraveyard\n\tHigh Earth\n\tLow Earth\n\tMedium Earth\n\tMolniya\n\tNear-equatorial\n\tOrbit of the Moon\n\tPolar\n\tSun-synchronous\n\tTundra\n\n\n\n\n\tAbout other points\t\n\tMars\n\tAreosynchronous\n\tAreostationary\n\n\n\tLagrange points\n\tHalo\n\tLissajous\n\n\n\tLunar\n\tSun\n\tHeliocentric\n\tEarth's orbit\n\n\n\tHeliosynchronous\n\n\n\n\n\n\n\n\n\n\tParameters\t\n\t\tShape\n\tSize\n\n\n\t\n\te  Eccentricity\n\ta  Semi-major axis\n\tb  Semi-minor axis\n\tQ, q  Apsides\n\n\n\n\n\tOrientation\t\n\ti  Inclination\n\tΩ  Longitude of the ascending node\n\tω  Argument of periapsis\n\tϖ  Longitude of the periapsis\n\n\n\n\n\tPosition\t\n\tM  Mean anomaly\n\tν, θ, f  True anomaly\n\tE  Eccentric anomaly\n\tL  Mean longitude\n\tl  True longitude\n\n\n\n\n\tVariation\t\n\tT  Orbital period\n\tn  Mean motion\n\tv  Orbital speed\n\tt0  Epoch\n\n\n\n\n\n\n\n\tManeuvers\t\n\tBi-elliptic transfer\n\tCollision avoidance (spacecraft)\n\tDelta-v\n\tDelta-v budget\n\tGravity assist\n\tGravity turn\n\tHohmann transfer\n\tInclination change\n\tLow energy transfer\n\tOberth effect\n\tPhasing\n\tRocket equation\n\tRendezvous\n\tTransposition, docking, and extraction\n\n\n\n\n\tOrbital mechanics\t\n\tCelestial coordinate system\n\tCharacteristic energy\n\tEscape velocity\n\tEphemeris\n\tEquatorial coordinate system\n\tGround track\n\tHill sphere\n\tInterplanetary Transport Network\n\tKepler's laws of planetary motion\n\tLagrangian point\n\tn-body problem\n\tOrbit equation\n\tOrbital state vectors\n\tPerturbation\n\tRetrograde motion\n\tSpecific orbital energy\n\tSpecific relative angular momentum\n\tTwo-line elements\n\n\n\n\n\t\n\tList of orbits\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Molniya_orbit&oldid=918551453\"\n\n\t\t\n\t\tCategories: \tEarth orbits\n\tSatellite broadcasting\n\tRussian inventions\n\n\nHidden categories: \tCS1: long volume value\n\tGood articles\n\tArticles with short description\n\tArticles containing Russian-language text\n\tArticles with hAudio microformats\n\tArticles containing potentially dated statements from 2019\n\tAll articles containing potentially dated statements\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCatalà\n\tDeutsch\n\tEspañol\n\tFrançais\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tMagyar\n\t日本語\n\tPortuguês\n\tРусский\n\tSlovenščina\n\tSuomi\n\tSvenska\n\tతెలుగు\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 29 September 2019, at 06:49 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "10", "dc:title": "Molniya orbit - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/1/12/NASA_molniya_oblique.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-molniya_orbit", "title": "Molniya orbit - Wikipedia"}}