{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMulti-layer insulation - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tMulti-layer insulation\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nCloseup of Multi-layer insulation from a satellite.  The metal coated plastic layers and the scrim separator are visible.\n\n\n\nMulti-layer insulation, or MLI, is thermal insulation composed of multiple layers of thin sheets and is often used on spacecraft. It is one of the main items of the spacecraft thermal design,  primarily intended to reduce heat loss by thermal radiation.  In its basic form, it does not appreciably insulate against other thermal losses such as heat conduction or convection.  It is therefore commonly used on satellites and other applications in vacuum where conduction and convection are much less significant and radiation dominates.  MLI gives many satellites and other space probes the appearance of being covered with gold foil.\n\n\nContents\n\n\n\t1 Function and design\n\t2 Additional properties\n\t3 See also\n\t4 References\n\t5 External links\n\n\n\n\n\nFunction and design[edit]\n\n  \nThe golden areas are MLI blankets on the Mars Reconnaissance Orbiter\n\n\n\nThe principle behind MLI is radiation balance.  To see why it works, start with a concrete example - imagine a square meter of a surface in outer space, held at a fixed temperature of 300 K, with an emissivity of 1, facing away from the sun or other heat sources.  From the Stefan–Boltzmann law, this surface will radiate 460 W.  Now imagine placing a thin (but opaque) layer 1 cm away from the plate, also with an emissivity of 1. This new layer will cool until it is radiating 230 W from each side, at which point everything is in balance.  The new layer receives 460 W from the original plate. 230 W is radiated back to the original plate, and 230 W to space.  The original surface still radiates 460 W, but gets 230 W back from the new layers, for a net loss of 230 W.  So overall, the radiation losses from the surface have been reduced by half by adding the additional layer.\n\n\n  \nMLI covering the heat shield of the Huygens probe\n\n\n\nMore layers can be added to reduce the loss further. The blanket can be further improved by making the outside surfaces highly reflective to thermal radiation, which reduces both absorption and emission. The performance of a layer stack can be quantified in terms of its overall heat transfer coefficient U, which defines the radiative heat flow rate Q between two parallel surfaces with a temperature difference \n  \n    \n      \n        Δ\n        T\n      \n    \n    {\\displaystyle \\Delta T}\n  \n and area A as\n\n\n\t\n  \n    \n      \n        Q\n        =\n        U\n        A\n        Δ\n        T\n        .\n      \n    \n    {\\displaystyle Q=UA\\Delta T.}\n  \n\n\n\nTheoretically, the heat transfer coefficient between two layers with emissivities \n  \n    \n      \n        \n          ϵ\n          \n            1\n          \n        \n      \n    \n    {\\displaystyle \\epsilon _{1}}\n  \n and \n  \n    \n      \n        \n          ϵ\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle \\epsilon _{2}}\n  \n, under vacuum, is\n\n\n\t\n  \n    \n      \n        U\n        =\n        4\n        σ\n        \n          T\n          \n            3\n          \n        \n        \n          \n            1\n            \n              1\n              \n                /\n              \n              \n                ϵ\n                \n                  1\n                \n              \n              +\n              1\n              \n                /\n              \n              \n                ϵ\n                \n                  2\n                \n              \n              −\n              1\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle U=4\\sigma T^{3}{\\frac {1}{1/\\epsilon _{1}+1/\\epsilon _{2}-1}},}\n  \n\n\n\nwhere T is the mean of the temperatures (in K) of the two layers and \n  \n    \n      \n        σ\n        =\n        5.7\n        ×\n        \n          10\n          \n            −\n            8\n          \n        \n      \n    \n    {\\displaystyle \\sigma =5.7\\times 10^{-8}}\n  \n Wm−2K−4 is the Stefan-Boltzmann Constant. If each layer has the same emissivity \n  \n    \n      \n        ϵ\n      \n    \n    {\\displaystyle \\epsilon }\n  \n on both sides, then a stack of N layers placed between two high-emissivity surfaces will have an overall heat transfer coefficient\n\n\n\t\n  \n    \n      \n        U\n        =\n        4\n        σ\n        \n          T\n          \n            3\n          \n        \n        \n          \n            1\n            \n              N\n              (\n              2\n              \n                /\n              \n              ϵ\n              −\n              1\n              )\n              +\n              1\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle U=4\\sigma T^{3}{\\frac {1}{N(2/\\epsilon -1)+1}}.}\n  \n\n\n\nClearly, increasing the number of layers and decreasing the emissivity both lower the heat transfer coefficient, which is equivalent to a higher insulation value. In this equation, it is assumed that the temperature difference is small compared to the absolute temperature. In space, where the apparent outside temperature could be 3 K (cosmic background radiation), the exact U value is different.\n\n\n  \nAluminum coated on both sides of these MLI sheets with thicker outer layer (left), white netting spacer (middle), and thinner inner layer (right) which is also crinkled to provide additional separation between the layers. The sheets are perforated to allow air passage during launch.\n\n\n\nThe layers of MLI can be arbitrarily close to each other, as long as they are not in thermal contact. The separation space only needs to be minute, which is the function of the extremely thin scrim or polyester 'bridal veil' as shown in the photo.  To reduce weight and blanket thickness, the internal layers are made very thin, but they must be opaque to thermal radiation. Since they don't need much structural strength, these internal layers are usually made of very thin plastic, about 6 μm (1/4 mil) thick, such as Mylar or Kapton, coated on one side with a thin layer of metal on both sides, typically silver or aluminium.[1]  For compactness, the layers are spaced as close to each other as possible, though without touching, since there should be little or no thermal conduction between the layers. A typical insulation blanket has 40 or more layers.[1]  The layers may be embossed or crinkled, so they only touch at a few points, or held apart by a thin cloth mesh, or scrim, which can be seen in the picture above.  The outer layers must be stronger, and are often thicker and stronger plastic, reinforced with a stronger scrim material such as fiberglass.\n\nIn satellite applications, the MLI will be full of air at launch time.  As the rocket ascends, this air must be able to escape without damaging the blanket. This may require holes or perforations in the layers,[2] even though this reduces their effectiveness.[3]\n\nMLI blankets are constructed with sewing technology. The layers are cut, stacked on top of each other, and sewn together at the edges.  Seams and gaps in the insulation are responsible for most of the heat leakage through MLI blankets. A new method is being developed to use polyetheretherketone (PEEK) tag pins (similar to plastic hooks used to attach price tags to garments) to fix the film layers in place instead of sewing to improve the thermal performance.[3]\n\n\nAdditional properties[edit]\n\nSpacecraft also may use MLI as a first line of defense against dust impacts.  This normally means spacing it a cm or so away from the surface it is insulating. Also, one or more of the layers may be replaced by a mechanically strong material, such as beta cloth.\n\nIn some applications the insulating layers must be grounded, so they cannot build up a charge and arc, causing radio interference.  Since the normal construction results in electrical as well as thermal insulation, these applications may include aluminum spacers as opposed to cloth scrim at the points where the blankets are sewn together.\n\n\nSee also[edit]\n\n\tLiquid hydrogen tank car, on which a form of multi-layer insulation is applied\n\tThermal Control Subsystem\n\n\nReferences[edit]\n\n\n\t^ a b Savage, Chris J. (2003). \"Thermal Control of Spacecraft\".  In Peter W. Fortescue; John Stark; Graham Swinerd (eds.). Spacecraft Systems Engineering (3 ed.). John Wiley and Sons. pp. 378–379. ISBN 978-0-470-85102-9.\n\n\t^ \"Perforating\". Dunmore. Retrieved 27 April 2014.\n\n\n\t^ a b Ryuta Hatakenaka; Takeshi Miyakita; Hiroyuki Sugita (14–18 July 2013). \"Thermal Performance and Practical Utility of a MLI Blanket using Plastic Pins for Space Use\". 43rd International Conference on Environmental Systems 2013 : Vail, Colorado, USA, 14-18 July 2013. p. 2432. ISBN 978-1-62748-896-9. Retrieved 27 April 2014.\n\n\n\n\n\n\nExternal links[edit]\n\n\t\"As Good as Gold: Are satellites covered in gold foil?\". National Environmental Satellite, Data, and Information Service. January 8, 2016.\n\n\tSatellite Thermal Control Handbook, ed. David Gilmore.  \nISBN 1-884989-00-4.  In particular, Chapter 5, Insulation, by Martin Donabedian and David Gilmore.\n\tTutorial on temperature control of spacecraft by JPL\n\t\"Cassini dons its thermal cloak\" (Press release). NASA JPL. 1997-01-03. Archived from the original on 2007-09-04. Retrieved 2009-01-08.\n\n\tTypical specialist article on tests of Cassini's MLI\n\tMulti-layer Insulation (MLI) Applications\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Multi-layer_insulation&oldid=894177251\"\n\n\t\t\n\t\tCategories: \tHeat conduction\n\tThermal protection\n\tInsulators\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tDeutsch\n\tEspañol\n\tFrançais\n\tPortuguês\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 26 April 2019, at 04:10 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Multi-layer insulation - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/3/37/MultiLayerInsulationCloseup.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-multi-layer_insulation", "title": "Multi-layer insulation - Wikipedia"}}