{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNew Horizons - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tNew Horizons\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article is about the space probe. For other uses, see New Horizons (disambiguation).\n\n\n\n\nFirst mission of the New Frontiers program; flyby reconnaissance of the dwarf planet Pluto\n\nNew Horizons\tNew Horizons space probe\n\n\t\n\tMission type\tFlyby \n(Jupiter · Pluto · 2014 MU69)\n\tOperator\tNASA\n\tCOSPAR ID\t2006-001A\n\tSATCAT no.\t28928\n\tWebsite\tpluto.jhuapl.edu \n nasa.gov/newhorizons\n\tMission duration\tPrimary mission: 9.5 years \n Elapsed: 13 years, 8 months, 12 days\n\t\n\n\t\n\tSpacecraft properties\n\tManufacturer\tAPL / SwRI\n\tLaunch mass\t478 kg (1,054 lb)\n\tDry mass\t401 kg (884 lb)\n\tPayload mass\t30.4 kg (67 lb)\n\tDimensions\t2.2 × 2.1 × 2.7 m (7.2 × 6.9 × 8.9 ft)\n\tPower\t245 watts\n\t\n\n\t\n\tStart of mission\n\tLaunch date\tJanuary 19, 2006, 19:00 (2006-01-19UTC19) UTC\n\tRocket\tAtlas V (551) AV-010\n\tLaunch site\tCape Canaveral SLC-41\n\tContractor\tInternational Launch Services[1]\n\t\n\n\t\n\tOrbital parameters\n\tEccentricity\t1.41905\n\tInclination\t2.23014°\n\tRAAN\t225.016°\n\tArgument of periapsis\t293.445°\n\tEpoch\tJanuary 1, 2017 (JD 2457754.5)[2]\n\t\n\n\t\n\tFlyby of (132524) APL (incidental)\n\tClosest approach\tJune 13, 2006, 04:05 UTC\n\tDistance\t101,867 km (63,297 mi)\n\tFlyby of Jupiter (gravity assist)\n\tClosest approach\tFebruary 28, 2007, 05:43:40 UTC\n\tDistance\t2,300,000 km (1,400,000 mi)\n\tFlyby of Pluto\n\tClosest approach\tJuly 14, 2015, 11:49:57 UTC\n\tDistance\t12,500 km (7,800 mi)\n\tFlyby of (486958) 2014 MU69\n\tClosest approach\tJanuary 1, 2019, 05:33:00 UTC\n\tDistance\t3,500 km (2,200 mi)\n\t\n\n\t\tInstruments\n\tAlice\tUltraviolet Imaging Spectrometer\n\tLORRI\tLong-Range Reconnaissance Imager\n\tSWAP\tSolar Wind Around Pluto\n\tPEPSSI\tPluto Energetic Particle Spectrometer Science Investigation\n\tREX\tRadio Science Experiment\n\tRalph\tRalph Telescope\n\tSDC\tVenetia Burney Student Dust Counter\n\n\n\t\nNew Frontiers program\nJuno →\n\n \n\n\nNew Horizons is an interplanetary space probe that was launched as a part of NASA's New Frontiers program.[3] Engineered by the Johns Hopkins University Applied Physics Laboratory (APL) and the Southwest Research Institute (SwRI), with a team led by S. Alan Stern,[4] the spacecraft was launched in 2006 with the primary mission to perform a flyby study of the Pluto system in 2015, and a secondary mission to fly by and study one or more other Kuiper belt objects (KBOs) in the decade to follow, which as of 2019 includes 2014 MU69.[5][6][7][8][9] It is the fifth space probe to achieve the escape velocity needed to leave the Solar System.\n\nOn January 19, 2006, New Horizons was launched from Cape Canaveral Air Force Station by an Atlas V rocket directly into an Earth-and-solar escape trajectory with a speed of about 16.26 km/s (10.10 mi/s; 58,500 km/h; 36,400 mph). It was the fastest man-made object ever launched from Earth.[10][11][12][13] After a brief encounter with asteroid 132524 APL, New Horizons proceeded to Jupiter, making its closest approach on February 28, 2007, at a distance of 2.3 million kilometers (1.4 million miles). The Jupiter flyby provided a gravity assist that increased New Horizons' speed; the flyby also enabled a general test of New Horizons' scientific capabilities, returning data about the planet's atmosphere, moons, and magnetosphere.\n\nMost of the post-Jupiter voyage was spent in hibernation mode to preserve on-board systems, except for brief annual checkouts.[14] On December 6, 2014, New Horizons was brought back online for the Pluto encounter, and instrument check-out began.[15] On January 15, 2015, the spacecraft began its approach phase to Pluto.\n\nOn July 14, 2015, at 11:49 UTC, it flew 12,500 km (7,800 mi) above the surface of Pluto,[16][17] making it the first spacecraft to explore the dwarf planet.[8][18] In August 2016, New Horizons was reported to have traveled at speeds of more than 84,000 km/h (52,000 mph).[19] On October 25, 2016, at 21:48 UTC, the last of the recorded data from the Pluto flyby was received from New Horizons.[20] Having completed its flyby of Pluto,[21] New Horizons then maneuvered for a flyby of Kuiper belt object (486958) 2014 MU69 \"Ultima Thule\",[22][23][24] which occurred on January 1, 2019,[25][26] when it was 43.4 AU from the Sun.[22][23] In August 2018, NASA cited results by Alice on New Horizons to confirm the existence of a \"hydrogen wall\" at the outer edges of the Solar System. This \"wall\" was first detected in 1992 by the two Voyager spacecraft.[27][28] \n\n\n\n\nContents\n\n\n\t1 History\n\t2 Mission profile\n\t3 Goal\n\t4 Design and construction\n\t4.1 Spacecraft subsystems\n\t4.1.1 Propulsion and attitude control\n\t4.1.2 Power\n\t4.1.3 Flight computer\n\t4.1.4 Telecommunications and data handling\n\n\n\n\n\n\n\t5 Science payload\n\t5.1 Long-Range Reconnaissance Imager (LORRI)\n\t5.2 Solar Wind Around Pluto (SWAP)\n\t5.3 Pluto Energetic Particle Spectrometer Science Investigation (PEPSSI)\n\t5.4 Alice\n\t5.5 Ralph telescope\n\t5.6 Venetia Burney Student Dust Counter (VBSDC)\n\t5.7 Radio Science Experiment (REX)\n\n\n\n\t6 Journey to Pluto\n\t6.1 Launch\n\t6.2 Inner Solar System\n\t6.2.1 Trajectory corrections\n\t6.2.2 In-flight tests and crossing of Mars orbit\n\t6.2.3 Asteroid 132524 APL\n\t6.2.4 First Pluto sighting\n\n\n\n\t6.3 Jupiter encounter\n\t6.3.1 Jovian moons\n\n\n\n\t6.4 Outer Solar System\n\t6.4.1 Possible Neptune trojan targets\n\t6.4.2 Observations of Pluto and Charon 2013–14\n\n\n\n\t6.5 Pluto approach\n\t6.5.1 Software glitch\n\n\n\n\n\n\n\t7 Pluto system encounter\n\t7.1 Objectives\n\t7.2 Flyby details\n\t7.3 Satellite observations\n\n\n\n\t8 Post-Pluto events\n\t9 Mission extension\n\t9.1 Kuiper belt object mission\n\t9.1.1 Target background\n\t9.1.2 Search\n\t9.1.3 Suitable KBOs\n\t9.1.4 KBO selection\n\n\n\n\t9.2 Observations of other KBOs\n\n\n\n\t10 Encounter with (486958) 2014 MU69\n\t10.1 Objectives\n\t10.2 Targeting maneuvers\n\t10.3 Approach phase\n\t10.4 Core phase\n\t10.5 Data download\n\n\n\n\t11 Post 2014 MU69 encounter events\n\t12 Speed\n\t13 Gallery\n\t13.1 Images of the launch\n\t13.2 Videos\n\n\n\n\t14 Timeline\n\t14.1 Preparation phase\n\t14.2 Launch phase\n\t14.3 Jupiter pre-encounter phase\n\t14.4 Jupiter encounter phase\n\t14.5 Pluto pre-encounter phase\n\t14.6 Pluto Science phase\n\t14.7 (486958) 2014 MU69 pre-encounter phase\n\t14.8 2014 MU69 Science phase and beyond\n\t14.9 Post-mission phase\n\n\n\n\t15 See also\n\t16 Notes\n\t17 References\n\t18 Further reading\n\t19 External links\n\n\n\n\n\nHistory[edit]\n\nMain article: Exploration of Pluto\n\n  \nEarly concept art of the New Horizons spacecraft. The mission, led by the Applied Physics Laboratory and Alan Stern, eventually became the first mission to Pluto.\n\n\n\nIn August 1992, JPL scientist Robert Staehle called Pluto discoverer Clyde Tombaugh, requesting permission to visit his planet. \"I told him he was welcome to it,\" Tombaugh later remembered, \"though he's got to go one long, cold trip.\"[29] The call eventually led to a series of proposed Pluto missions, leading up to New Horizons.\n\nStamatios \"Tom\" Krimigis, head of the Applied Physics Laboratory's space division, one of many entrants in the New Frontiers Program competition, formed the New Horizons team with Alan Stern in December 2000.  Appointed as the project's principal investigator, Stern was described by Krimigis as \"the personification of the Pluto mission\".[30] New Horizons was based largely on Stern's work since Pluto 350 and involved most of the team from Pluto Kuiper Express.[31] The New Horizons proposal was one of five that were officially submitted to NASA. It was later selected as one of two finalists to be subject to a three-month concept study, in June 2001. The other finalist, POSSE (Pluto and Outer Solar System Explorer), was a separate, but similar Pluto mission concept by the University of Colorado Boulder, led by principal investigator Larry W. Esposito, and supported by the JPL, Lockheed Martin and the University of California.[32] However, the APL, in addition to being supported by Pluto Kuiper Express developers at the Goddard Space Flight Center and Stanford University,[32] were at an advantage; they had recently developed NEAR Shoemaker for NASA, which had successfully entered orbit around 433 Eros earlier in the year, and would later land on the asteroid to scientific and engineering fanfare.[33]\n\nIn November 2001, New Horizons was officially selected for funding as part of the New Frontiers program.[34] However, the new NASA Administrator appointed by the Bush Administration, Sean O'Keefe, was not supportive of New Horizons, and effectively cancelled it by not including it in NASA's budget for 2003. NASA's Associate Administrator for the Science Mission Directorate Ed Weiler prompted Stern to lobby for the funding of New Horizons in hopes of the mission appearing in the Planetary Science Decadal Survey; a prioritized \"wish list\", compiled by the United States National Research Council, that reflects the opinions of the scientific community. After an intense campaign to gain support for New Horizons, the Planetary Science Decadal Survey of 2003–2013 was published in the summer of 2002. New Horizons topped the list of projects considered the highest priority among the scientific community in the medium-size category; ahead of missions to the Moon, and even Jupiter. Weiler stated that it was a result that \"[his] administration was not going to fight\".[30] Funding for the mission was finally secured following the publication of the report, and Stern's team were finally able to start building the spacecraft and its instruments, with a planned launch in January 2006 and arrival at Pluto in 2015.[30] Alice Bowman became Mission Operations Manager.[35]\n\n\nMission profile[edit]\n\n  \nArtist's impression of New Horizons' close encounter with the Plutonian system\n\n\n\nNew Horizons is the first mission in NASA's New Frontiers mission category, larger and more expensive than the Discovery missions but smaller than the Flagship Program. The cost of the mission (including spacecraft and instrument development, launch vehicle, mission operations, data analysis, and education/public outreach) is approximately $700 million over 15 years (2001–2016).[36] The spacecraft was built primarily by Southwest Research Institute (SwRI) and the Johns Hopkins Applied Physics Laboratory. The mission's principal investigator is Alan Stern of the Southwest Research Institute (formerly NASA Associate Administrator).\n\nAfter separation from the launch vehicle, overall control was taken by Mission Operations Center (MOC) at the Applied Physics Laboratory in Howard County, Maryland. The science instruments are operated at Clyde Tombaugh Science Operations Center (T-SOC) in Boulder, Colorado.[37] Navigation is performed at various contractor facilities, whereas the navigational positional data and related celestial reference frames are provided by the Naval Observatory Flagstaff Station through Headquarters NASA and JPL; KinetX is the lead on the New Horizons navigation team and is responsible for planning trajectory adjustments as the spacecraft speeds toward the outer Solar System. Coincidentally the Naval Observatory Flagstaff Station was where the photographic plates were taken for the discovery of Pluto's moon Charon; and the Naval Observatory is itself not far from the Lowell Observatory where Pluto was discovered.\n\nNew Horizons was originally planned as a voyage to the only unexplored planet in the Solar System. When the spacecraft was launched, Pluto was still classified as a planet, later to be reclassified as a dwarf planet by the International Astronomical Union (IAU). Some members of the New Horizons team, including Alan Stern, disagree with the IAU definition and still describe Pluto as the ninth planet.[38] Pluto's satellites Nix and Hydra also have a connection with the spacecraft: the first letters of their names (N and H) are the initials of New Horizons. The moons' discoverers chose these names for this reason, plus Nix and Hydra's relationship to the mythological Pluto.[39]\n\nIn addition to the science equipment, there are several cultural artifacts traveling with the spacecraft. These include a collection of 434,738 names stored on a compact disc,[40] a piece of Scaled Composites's SpaceShipOne,[41] a \"Not Yet Explored\" USPS stamp,[42][43] and a Flag of the United States, along with other mementos.[44]\n\nAbout 30 grams (1 oz) of Clyde Tombaugh's ashes are aboard the spacecraft, to commemorate his discovery of Pluto in 1930.[45][46] A Florida-state quarter coin, whose design commemorates human exploration, is included, officially as a trim weight.[47] One of the science packages (a dust counter) is named after Venetia Burney, who, as a child, suggested the name \"Pluto\" after its discovery.\n\n\nGoal[edit]\n\n  \nView of Mission Operations at the Applied Physics Laboratory in Laurel, Maryland (July 14, 2015)\n\n\n\nThe goal of the mission is to understand the formation of the Plutonian system, the Kuiper belt, and the transformation of the early Solar System.[48] The spacecraft collected data on the atmospheres, surfaces, interiors, and environments of Pluto and its moons. It will also study other objects in the Kuiper belt.[49] \"By way of comparison, New Horizons gathered 5,000 times as much data at Pluto as Mariner did at the Red Planet.\"[50]\n\nSome of the questions the mission attempts to answer are: What is Pluto's atmosphere made of and how does it behave? What does its surface look like? Are there large geological structures? How do solar wind particles interact with Pluto's atmosphere?[51]\n\nSpecifically, the mission's science objectives are to:[52]\n\n\n\tmap the surface composition of Pluto and Charon\n\tcharacterize the geology and morphology of Pluto and Charon\n\tcharacterize the neutral atmosphere of Pluto and its escape rate\n\tsearch for an atmosphere around Charon\n\tmap surface temperatures on Pluto and Charon\n\tsearch for rings and additional satellites around Pluto\n\tconduct similar investigations of one or more Kuiper belt objects\n\n\nDesign and construction[edit]\n\n  \nInteractive 3D model of New Horizons\n\n\n\nSpacecraft subsystems[edit]\n\n  \nNew Horizons at Kennedy Space Center in 2005\n\n\n\nThe spacecraft is comparable in size and general shape to a grand piano and has been compared to a piano glued to a cocktail bar-sized satellite dish.[53] As a point of departure, the team took inspiration from the Ulysses spacecraft,[54] which also carried a radioisotope thermoelectric generator (RTG) and dish on a box-in-box structure through the outer Solar System. Many subsystems and components have flight heritage from APL's CONTOUR spacecraft, which in turn had heritage from APL's TIMED spacecraft.\n\nNew Horizons' body forms a triangle, almost 0.76 m (2.5 ft) thick. (The Pioneers have hexagonal bodies, whereas the Voyagers, Galileo, and Cassini–Huygens have decagonal, hollow bodies.) A 7075 aluminium alloy tube forms the main structural column, between the launch vehicle adapter ring at the \"rear\", and the 2.1 m (6 ft 11 in) radio dish antenna affixed to the \"front\" flat side. The titanium fuel tank is in this tube. The RTG attaches with a 4-sided titanium mount resembling a gray pyramid or stepstool. Titanium provides strength and thermal isolation. The rest of the triangle is primarily sandwich panels of thin aluminium facesheet (less than 1⁄64 in or 0.40 mm) bonded to aluminium honeycomb core. The structure is larger than strictly necessary, with empty space inside. The structure is designed to act as shielding, reducing electronics errors caused by radiation from the RTG. Also, the mass distribution required for a spinning spacecraft demands a wider triangle.\n\nThe interior structure is painted black to equalize temperature by radiative heat transfer. Overall, the spacecraft is thoroughly blanketed to retain heat. Unlike the Pioneers and Voyagers, the radio dish is also enclosed in blankets that extend to the body. The heat from the RTG adds warmth to the spacecraft while it is in the outer Solar System. While in the inner Solar System, the spacecraft must prevent overheating, hence electronic activity is limited, power is diverted to shunts with attached radiators, and louvers are opened to radiate excess heat. While the spacecraft is cruising inactively in the cold outer Solar System, the louvers are closed, and the shunt regulator reroutes power to electric heaters.\n\n\nPropulsion and attitude control[edit]\n\nNew Horizons has both spin-stabilized (cruise) and three-axis stabilized (science) modes controlled entirely with hydrazine monopropellant. Additional post launch delta-v of over 290 m/s (1,000 km/h; 650 mph) is provided by a 77 kg (170 lb) internal tank. Helium is used as a pressurant, with an elastomeric diaphragm assisting expulsion. The spacecraft's on-orbit mass including fuel is over 470 kg (1,040 lb) on the Jupiter flyby trajectory, but would have been only 445 kg (981 lb) for the backup direct flight option to Pluto. Significantly, had the backup option been taken, this would have meant less fuel for later Kuiper belt operations.\n\nThere are 16 thrusters on New Horizons: four 4.4 N (1.0 lbf) and twelve 0.9 N (0.2 lbf) plumbed into redundant branches. The larger thrusters are used primarily for trajectory corrections, and the small ones (previously used on Cassini and the Voyager spacecraft) are used primarily for attitude control and spinup/spindown maneuvers. Two star cameras are used to measure the spacecraft attitude. They are mounted on the face of the spacecraft and provide attitude information while in spin-stabilized or 3-axis mode. In between the time of star camera readings, spacecraft orientation is provided by dual redundant miniature inertial measurement units. Each unit contains three solid-state gyroscopes and three accelerometers. Two Adcole Sun sensors provide attitude determination. One detects the angle to the Sun, whereas the other measures spin rate and clocking.\n\n\nPower[edit]\n\n  \nNew Horizons' RTG\n\n\n\nA cylindrical radioisotope thermoelectric generator (RTG) protrudes in the plane of the triangle from one vertex of the triangle. The RTG provided 245.7 W of power at launch, and was predicted to drop approximately 3.5 W every year, decaying to 202 W by the time of its encounter with the Plutonian system in 2015 and will decay too far to power the transmitters in the 2030s.[4] There are no onboard batteries since RTG output is predictable, and load transients are handled by a capacitor bank and fast circuit breakers. As of January 2019, the power output of the RTG is about 190 W.[55]\n\nThe RTG, model \"GPHS-RTG\", was originally a spare from the Cassini mission. The RTG contains 9.75 kg (21.5 lb) of plutonium-238 oxide pellets.[31] Each pellet is clad in iridium, then encased in a graphite shell. It was developed by the U.S. Department of Energy at the Materials and Fuels Complex, a part of the Idaho National Laboratory.[56]\nThe original RTG design called for  10.9 kg (24 lb) of plutonium, but a unit less powerful than the original design goal was produced because of delays at the United States Department of Energy, including security activities, that delayed plutonium production.[57] The mission parameters and observation sequence had to be modified for the reduced wattage; still, not all instruments can operate simultaneously. The Department of Energy transferred the space battery program from Ohio to Argonne in 2002 because of security concerns.\n\nThe amount of radioactive plutonium in the RTG is about one-third the amount on board the Cassini–Huygens probe when it launched in 1997. The Cassini launch was protested by multiple organizations due to the launch of such a large amount of plutonium into the atmosphere. The United States Department of Energy estimated the chances of a launch accident that would release radiation into the atmosphere at 1 in 350, and monitored the launch[58] because of the inclusion of an RTG on board. It was estimated that a worst-case scenario of total dispersal of on-board plutonium would spread the equivalent radiation of 80% the average annual dosage in North America from background radiation over an area with a radius of 105 km (65 mi).[59]\n\n\nFlight computer[edit]\n\nThe spacecraft carries two computer systems: the Command and Data Handling system and the Guidance and Control processor. Each of the two systems is duplicated for redundancy, for a total of four computers. The processor used for its flight computers is the Mongoose-V, a 12 MHz radiation-hardened version of the MIPS R3000 CPU. Multiple redundant clocks and timing routines are implemented in hardware and software to help prevent faults and downtime. To conserve heat and mass, spacecraft and instrument electronics are housed together in IEMs (integrated electronics modules). There are two redundant IEMs. Including other functions such as instrument and radio electronics, each IEM contains 9 boards.[60] The software of the probe runs on Nucleus RTOS operating system.[61]\n\nThere have been two \"safing\" events, that sent the spacecraft into safe mode:\n\n\n\tOn March 19, 2007, the Command and Data Handling computer experienced an uncorrectable memory error and rebooted itself, causing the spacecraft to go into safe mode. The craft fully recovered within two days, with some data loss on Jupiter's magnetotail. No impact on the subsequent mission was expected.[62]\n\tOn July 4, 2015, there was a CPU safing event caused by over-assignment of commanded science operations on the craft's approach to Pluto. Fortunately, the craft was able to recover within two days without major impacts on its mission.[63][64]\n\n\nTelecommunications and data handling[edit]\n\n  \nNew Horizons' antenna, with some test equipment attached.\n\n\n\nCommunication with the spacecraft is via X band. The craft had a communication rate of 38 kbit/s at Jupiter; at Pluto's distance, a rate of approximately 1 kbit/s per transmitter was expected. Besides the low data rate, Pluto's distance also causes a latency of about 4.5 hours (one-way). The 70 m (230 ft) NASA Deep Space Network (DSN) dishes are used to relay commands once it is beyond Jupiter.  The spacecraft uses dual modular redundancy transmitters and receivers, and either right- or left-hand circular polarization.  The downlink signal is amplified by dual redundant 12-watt traveling-wave tube amplifiers (TWTAs) mounted on the body under the dish. The receivers are new, low-power designs. The system can be controlled to power both TWTAs at the same time, and transmit a dual-polarized downlink signal to the DSN that nearly doubles the downlink rate. DSN tests early in the mission with this dual polarization combining technique were successful, and the capability is now considered operational (when the spacecraft power budget permits both TWTAs to be powered).\n\nIn addition to the high-gain antenna, there are two backup low-gain antennas and a medium-gain dish. The high-gain dish has a Cassegrain reflector layout, composite construction, of 2.1-meter (7 ft) diameter providing over 42 dBi of gain and a half-power beam width of about a degree. The prime-focus medium-gain antenna, with a 0.3-meter (1 ft) aperture and 10° half-power beam width, is mounted to the back of the high-gain antenna's secondary reflector. The forward low-gain antenna is stacked atop the feed of the medium-gain antenna. The aft low-gain antenna is mounted within the launch adapter at the rear of the spacecraft. This antenna was used only for early mission phases near Earth, just after launch and for emergencies if the spacecraft had lost attitude control.\n\nNew Horizons recorded scientific instrument data to its solid-state memory buffer at each encounter, then transmitted the data to Earth. Data storage is done on two low-power solid-state recorders (one primary, one backup) holding up to 8 gigabytes each. Because of the extreme distance from Pluto and the Kuiper belt, only one buffer load at those encounters can be saved. This is because New Horizons would require approximately 16 months after leaving the vicinity of Pluto to transmit the buffer load back to Earth.[65] At Pluto's distance, radio signals from the space probe back to Earth took four hours and 25 minutes to traverse 4.7 billion km of space.[66]\n\nPart of the reason for the delay between the gathering of and transmission of data is that all of the New Horizons instrumentation is body-mounted. In order for the cameras to record data, the entire probe must turn, and the one-degree-wide beam of the high-gain antenna was not pointing toward Earth.  Previous spacecraft, such as the Voyager program probes, had a rotatable instrumentation platform (a \"scan platform\") that could take measurements from virtually any angle without losing radio contact with Earth.  New Horizons was mechanically simplified to save weight, shorten the schedule, and improve reliability during its 15-year lifetime.\n\nThe Voyager 2 scan platform jammed at Saturn, and the demands of long time exposures at outer planets led to a change of plans such that the entire probe was rotated to make photos at Uranus and Neptune, similar to how New Horizons rotated.\n\n\nScience payload[edit]\n\nNew Horizons carries seven instruments: three optical instruments, two plasma instruments, a dust sensor and a radio science receiver/radiometer. The instruments are to be used to investigate the global geology, surface composition, surface temperature, atmospheric pressure, atmospheric temperature and escape rate of Pluto and its moons. The rated power is 21 watts, though not all instruments operate simultaneously.[67] In addition, New Horizons has an Ultrastable Oscillator subsystem, which may be used to study and test the Pioneer anomaly towards the end of the spacecraft's life.[68]\n\n\nLong-Range Reconnaissance Imager (LORRI)[edit]\n\n  \nLORRI—long-range camera\n\n\n\nMain article: Long Range Reconnaissance Imager\n\nThe Long-Range Reconnaissance Imager (LORRI) is a long-focal-length imager designed for high resolution and responsivity at visible wavelengths. The instrument is equipped with a 1024×1024 pixel by 12-bits-per-pixel monochromatic CCD imager giving a resolution of 5 μrad (~1 arcsec).[69] The CCD is chilled far below freezing by a passive radiator on the antisolar face of the spacecraft. This temperature differential requires insulation, and isolation from the rest of the structure. The 208.3 mm (8.20 in) aperture Ritchey–Chretien mirrors and metering structure are made of silicon carbide, to boost stiffness, reduce weight, and prevent warping at low temperatures. The optical elements sit in a composite light shield, and mount with titanium and fiberglass for thermal isolation. Overall mass is 8.6 kg (19 lb), with the optical tube assembly (OTA) weighing about 5.6 kg (12 lb),[70] for one of the largest silicon-carbide telescopes flown at the time (now surpassed by Herschel). For viewing on public web sites the 12-bit per pixel LORRI images are converted to 8-bit per pixel JPEG images.[69] These public images do not contain the full dynamic range of brightness information available from the raw LORRI images files.[69]\n\n\n\tPrincipal investigator: Andy Cheng, Applied Physics Laboratory, Data: LORRI image search at jhuapl.edu[71]\n\n\nSolar Wind Around Pluto (SWAP)[edit]\n\n  \nSWAP – Solar Wind Around Pluto\n\n\n\nMain article: SWAP (New Horizons)\n\nSolar Wind Around Pluto (SWAP) is a toroidal electrostatic analyzer and retarding potential analyzer (RPA), that makes up one of the two instruments comprising New Horizons' Plasma and high-energy particle spectrometer suite (PAM), the other being PEPSSI. SWAP measures particles of up to 6.5 keV and, because of the tenuous solar wind at Pluto's distance, the instrument is designed with the largest aperture of any such instrument ever flown.[72]\n\n\n\tPrincipal investigator: David McComas, Southwest Research Institute\n\n\nPluto Energetic Particle Spectrometer Science Investigation (PEPSSI)[edit]\n\nMain article: Pluto Energetic Particle Spectrometer Science Investigation\n\nPluto Energetic Particle Spectrometer Science Investigation (PEPSSI) is a time of flight ion and electron sensor that makes up one of the two instruments comprising New Horizons' plasma and high-energy particle spectrometer suite (PAM), the other being SWAP. Unlike SWAP, which measures particles of up to 6.5 keV, PEPSSI goes up to 1 MeV.[72]\n\n\n\tPrincipal investigator: Ralph McNutt Jr., Applied Physics Laboratory\n\n\nAlice[edit]\n\nMain article: Alice (spacecraft instrument)\n\nAlice is an ultraviolet imaging spectrometer that is one of two photographic instruments comprising New Horizons' Pluto Exploration Remote Sensing Investigation (PERSI); the other being the Ralph telescope. It resolves 1,024 wavelength bands in the far and extreme ultraviolet (from 50–180 nm), over 32 view fields. Its goal is to determine the composition of Pluto's atmosphere. This Alice instrument is derived from another Alice aboard ESA's Rosetta spacecraft.[72]\n\n\n\tPrincipal investigator: Alan Stern, Southwest Research Institute\n\n\nIn August 2018, NASA confirmed, based on results by Alice on the New Horizons spacecraft, a \"hydrogen wall\" at the outer edges of the Solar System that was first detected in 1992 by the two Voyager spacecraft.[27][28]\n\n\nRalph telescope[edit]\n\n  \nRalph—telescope and color camera\n\n\n\nMain article: Ralph (New Horizons)\n\nThe Ralph telescope,  75 mm[73] in aperture, is one of two photographic instruments that make up New Horizons' Pluto Exploration Remote Sensing Investigation (PERSI), with the other being the Alice instrument. Ralph has two separate channels: MVIC (Multispectral Visible Imaging Camera), a visible-light CCD imager with broadband and color channels; and LEISA (Linear Etalon Imaging Spectral Array), a near-infrared imaging spectrometer. LEISA is derived from a similar instrument on the Earth Observing-1 spacecraft. Ralph was named after Alice's husband on The Honeymooners, and was designed after Alice.[74]\n\nOn June 23, 2017, NASA announced that it has renamed the LEISA instrument to the \"Lisa Hardaway Infrared Mapping Spectrometer\" in honor of Lisa Hardaway, the Ralph program manager at Ball Aerospace, who died in January 2017 at age 50.[75]\n\n\n\tPrincipal investigator: Alan Stern, Southwest Research Institute\n\n\nVenetia Burney Student Dust Counter (VBSDC)[edit]\n\n  \nVBSDC—Venetia Burney Student Dust Counter\n\n\n\nThe Venetia Burney Student Dust Counter (VBSDC), built by students at the University of Colorado Boulder, is operating periodically to make dust measurements.[76][77] It consists of a detector panel, about 460 mm × 300 mm (18 in × 12 in), mounted on the anti-solar face of the spacecraft (the ram direction), and an electronics box within the spacecraft. The detector contains fourteen polyvinylidene difluoride (PVDF) panels, twelve science and two reference, which generate voltage when impacted. Effective collecting area is 0.125 m2 (1.35 sq ft). No dust counter has operated past the orbit of Uranus; models of dust in the outer Solar System, especially the Kuiper belt, are speculative. The VBSDC is always turned on measuring the masses of the interplanetary and interstellar dust particles (in the range of nano- and picograms) as they collide with the PVDF panels mounted on the New Horizons spacecraft. The measured data is expected to greatly contribute to the understanding of the dust spectra of the Solar System. The dust spectra can then be compared with those from observations of other stars, giving new clues as to where Earth-like planets can be found in the universe. The dust counter is named for Venetia Burney, who first suggested the name \"Pluto\" at the age of 11. A thirteen-minute short film about the VBSDC garnered an Emmy Award for student achievement in 2006.[78]\n\n\n\tPrincipal investigator: Mihaly Horanyi, University of Colorado Boulder\n\n\nRadio Science Experiment (REX)[edit]\n\nMain article: REX (New Horizons)\n\nThe Radio Science Experiment (REX) used an ultrastable crystal oscillator (essentially a calibrated crystal in a miniature oven) and some additional electronics to conduct radio science investigations using the communications channels. These are small enough to fit on a single card. Because there are two redundant communications subsystems, there are two, identical REX circuit boards.\n\n\n\tPrincipal investigators: Len Tyler and Ivan Linscott, Stanford University\n\n\n\n\nJourney to Pluto[edit]\n\nLaunch[edit]\n\n\n\n\n\n\nLaunch of New Horizons. The Atlas V rocket on the launchpad (left) and lift off from Cape Canaveral.\n\n\n\n\nOn September 24, 2005, the spacecraft arrived at the Kennedy Space Center on board a C-17 Globemaster III for launch preparations.[79] The launch of New Horizons was originally scheduled for January 11, 2006, but was initially delayed until January 17, 2006, to allow for borescope inspections of the Atlas V's kerosene tank. Further delays related to low cloud ceiling conditions downrange, and high winds and technical difficulties—unrelated to the rocket itself—prevented launch for a further two days.[80][81]\n\nThe probe finally lifted off from Pad 41 at Cape Canaveral Air Force Station, Florida, directly south of Space Shuttle Launch Complex 39, at 19:00 UTC on January 19, 2006.[82][83] The Centaur second stage ignited at 19:04:43 UTC and burned for 5 minutes 25 seconds. It reignited at 19:32 UTC and burned for 9 minutes 47 seconds. The ATK Star 48B third stage ignited at 19:42:37 UTC and burned for 1 minute 28 seconds.[84] Combined, these burns successfully sent the probe on a solar-escape trajectory at 16.26 kilometers per second (58,536 km/h; 36,373 mph).[11] New Horizons took only nine hours to pass the Moon's orbit.[85] Although there were backup launch opportunities in February 2006 and February 2007, only the first twenty-three days of the 2006 window permitted the Jupiter flyby. Any launch outside that period would have forced the spacecraft to fly a slower trajectory directly to Pluto, delaying its encounter by five to six years.[86]\n\nThe probe was launched by a Lockheed Martin Atlas V 551 rocket, with a third stage added to increase the heliocentric (escape) speed. This was the first launch of the Atlas V 551 configuration, which uses five solid rocket boosters, and the first Atlas V with a third stage. Previous flights had used zero, two, or three solid boosters, but never five. The vehicle, AV-010, weighed 573,160 kilograms (1,263,600 lb) at lift-off,[84] and had earlier been slightly damaged when Hurricane Wilma swept across Florida on October 24, 2005. One of the solid rocket boosters was hit by a door. The booster was replaced with an identical unit, rather than inspecting and requalifying the original.[87]\n\nThe launch was dedicated to the memory of launch conductor Daniel Sarokon, who was described by space program officials as one of the most influential people in the history of space travel.[88]\n\n\nInner Solar System[edit]\n\nTrajectory corrections[edit]\n\nOn January 28 and 30, 2006, mission controllers guided the probe through its first trajectory-correction maneuver (TCM), which was divided into two parts (TCM-1A and TCM-1B). The total velocity change of these two corrections was about 18 meters per second (65 km/h; 40 mph). TCM-1 was accurate enough to permit the cancellation of TCM-2, the second of three originally scheduled corrections.[89] On March 9, 2006, controllers performed TCM-3, the last of three scheduled course corrections. The engines burned for 76 seconds, adjusting the spacecraft's velocity by about 1.16 m/s (4.2 km/h; 2.6 mph).[90] Further trajectory maneuvers were not needed until September 25, 2007 (seven months after the Jupiter flyby), when the engines were fired for 15 minutes and 37 seconds, changing the spacecraft's velocity by 2.37 m/s (8.5 km/h; 5.3 mph),[91] followed by another TCM, almost three years later on June 30, 2010, that lasted 35.6 seconds, when New Horizons had already reached the halfway point (in time traveled) to Pluto.[92]\n\n\nIn-flight tests and crossing of Mars orbit[edit]\n\nDuring the week of February 20, 2006, controllers conducted initial in-flight tests of three onboard science instruments, the Alice ultraviolet imaging spectrometer, the PEPSSI plasma-sensor, and the LORRI long-range visible-spectrum camera. No scientific measurements or images were taken, but instrument electronics, and in the case of Alice, some electromechanical systems were shown to be functioning correctly.[93]\n\nOn April 7, 2006, the spacecraft passed the orbit of Mars, moving at roughly 21 km/s (76,000 km/h; 47,000 mph) away from the Sun at a solar distance of 243 million kilometers.[94][95][96]\n\n\nAsteroid 132524 APL[edit]\n\n\n\nAsteroid 132524 APL viewed by New Horizons in June 2006\n\n\nFirst images of Pluto in September 2006\n\n\n\n\n\nBecause of the need to conserve fuel for possible encounters with Kuiper belt objects subsequent to the Pluto flyby, intentional encounters with objects in the asteroid belt were not planned. After launch, the New Horizons team scanned the spacecraft's trajectory to determine if any asteroids would, by chance, be close enough for observation. In May 2006 it was discovered that New Horizons would pass close to the tiny asteroid 132524 APL on June 13, 2006. Closest approach occurred at 4:05 UTC at a distance of 101,867 km (63,297 mi). The asteroid was imaged by Ralph (use of LORRI was not possible because of proximity to the Sun), which gave the team a chance to test Ralph's capabilities, and make observations of the asteroid's composition as well as light and phase curves. The asteroid was estimated to be 2.5 km (1.6 mi) in diameter.[97][98][99] The spacecraft successfully tracked the rapidly moving asteroid over June 10–12, 2006.\n\n\nFirst Pluto sighting[edit]\n\nThe first images of Pluto from New Horizons were acquired September 21–24, 2006, during a test of LORRI. They were released on November 28, 2006.[100] The images, taken from a distance of approximately 4.2 billion km (2.6 billion mi; 28 AU), confirmed the spacecraft's ability to track distant targets, critical for maneuvering toward Pluto and other Kuiper belt objects.\n\n\nJupiter encounter[edit]\n\nMain article: Exploration of Jupiter\n\n  \nInfrared image of Jupiter by New Horizons\n\n\n\nNew Horizons used LORRI to take its first photographs of Jupiter on September 4, 2006, from a distance of 291 million kilometers (181 million miles).[101] More detailed exploration of the system began in January 2007 with an infrared image of the moon Callisto, as well as several black-and-white images of Jupiter itself.[102] New Horizons received a gravity assist from Jupiter, with its closest approach at 05:43:40 UTC on February 28, 2007, when it was 2.3 million kilometers (1.4 million miles) from Jupiter. The flyby increased New Horizons' speed by 4 km/s (14,000 km/h; 9,000 mph), accelerating the probe to a velocity of 23 km/s (83,000 km/h; 51,000 mph) relative to the Sun and shortening its voyage to Pluto by three years.[103]\n\nThe flyby was the center of a four-month intensive observation campaign lasting from January to June. Being an ever-changing scientific target, Jupiter has been observed intermittently since the end of the Galileo mission in September 2003. Knowledge about Jupiter benefited from the fact that New Horizons' instruments were built using the latest technology, especially in the area of cameras, representing a significant improvement over Galileo's cameras, which were modified versions of Voyager cameras, which, in turn, were modified Mariner cameras. The Jupiter encounter also served as a shakedown and dress rehearsal for the Pluto encounter. Because Jupiter is much closer to Earth than Pluto, the communications link can transmit multiple loadings of the memory buffer; thus the mission returned more data from the Jovian system than it was expected to transmit from Pluto.[104]\n\nOne of the main goals during the Jupiter encounter was observing its atmospheric conditions and analyzing the structure and composition of its clouds. Heat-induced lightning strikes in the polar regions and \"waves\" that indicate violent storm activity were observed and measured. The Little Red Spot, spanning up to 70% of Earth's diameter, was imaged from up close for the first time.[103] Recording from different angles and illumination conditions, New Horizons took detailed images of Jupiter's faint ring system, discovering debris left over from recent collisions within the rings or from other unexplained phenomena. The search for undiscovered moons within the rings showed no results. Travelling through Jupiter's magnetosphere, New Horizons collected valuable particle readings.[103] \"Bubbles\" of plasma that are thought to be formed from material ejected by the moon Io, were noticed in the magnetotail.[105]\n\n\nJovian moons[edit]\n\nThe four largest moons of Jupiter were in poor positions for observation; the necessary path of the gravity-assist maneuver meant that New Horizons passed millions of kilometers from any of the Galilean moons. Still, its instruments were intended for small, dim targets, so they were scientifically useful on large, distant moons. Emphasis was put on Jupiter's innermost Galilean moon, Io, whose active volcanoes shoot out tons of material into Jupiter's magnetosphere, and further. Out of eleven observed eruptions, three were seen for the first time. That of Tvashtar reached an altitude of up to 330 km (210 mi). The event gave scientists an unprecedented look into the structure and motion of the rising plume and its subsequent fall back to the surface. Infrared signatures of a further 36 volcanoes were noticed.[103] Callisto's surface was analyzed with LEISA, revealing how lighting and viewing conditions affect infrared spectrum readings of its surface water ice.[106] Minor moons such as Amalthea had their orbit solutions refined. The cameras determined their positions, acting as \"reverse optical navigation\".\n\n\n\nJovian moons imaged by New Horizons\n\n\nIo imaged on February 28, 2007. The feature near the north pole of the moon is a 290 km (180 mi) high plume from the volcano Tvashtar.\n\n\nEuropa imaged on February 27, 2007, from a distance of 3.1 million km (1.9 million mi). Image scale is 15 km per pixel (9.3 mi/px).\n\n\nGanymede imaged on February 27, 2007, from a distance of 3.5 million km (2.2 million mi). Image scale is 17 km per pixel (11 mi/px).\n\n\nCallisto imaged on February 27, 2007, from a distance of 4.7 million km (2.9 million mi).\n\n\n Media related to Photos of Jupiter system by New Horizons at Wikimedia Commons\n\n\n\n\nOuter Solar System[edit]\n\n  \nHeliocentric positions of the five interstellar probes (squares) and other bodies (circles) until 2020, with launch and flyby dates. Markers denote positions on 1 January of each year, with every fifth year labelled.\nPlot 1 is viewed from the north ecliptic pole, to scale; plots 2 to 4 are third-angle projections at 20% scale.\nIn the SVG file, hover over a trajectory or orbit to highlight it and its associated launches and flybys.\n\n\n\nAfter passing Jupiter, New Horizons spent most of its journey towards Pluto in hibernation mode: redundant components as well as guidance and control systems were shut down to extend their life cycle, decrease operation costs and free the Deep Space Network for other missions.[107] During hibernation mode, the onboard computer monitored the probe's systems and transmitted a signal back to Earth: a \"green\" code if everything was functioning as expected or a \"red\" code if mission control's assistance was needed.[107] The probe was activated for about two months a year so that the instruments could be calibrated and the systems checked. The first hibernation mode cycle started on June 28, 2007,[107] the second cycle began on December 16, 2008,[108] the third cycle on August 27, 2009,[109] and the fourth cycle on August 29, 2014, after a 10-week test.[110]\n\nNew Horizons crossed the orbit of Saturn on June 8, 2008,[111] and Uranus on March 18, 2011.[112] After astronomers announced the discovery of two new moons in the Pluto system, Kerberos and Styx, mission planners started contemplating the possibility of the probe running into unseen debris and dust left over from ancient collisions between the moons. A study based on 18 months of computer simulations, Earth-based telescope observations and occultations of the Pluto system revealed that the possibility of a catastrophic collision with debris or dust was less than 0.3% on the probe's scheduled course.[113][114] If the hazard increased, New Horizons could have used one of two possible contingency plans, the so-called SHBOTs (Safe Haven by Other Trajectories): the probe could have continued on its present trajectory with the antenna facing the incoming particles so the more vital systems would be protected, or, it could have positioned its antenna to make a course correction that would take it just 3000 km from the surface of Pluto where it was expected that the atmospheric drag would have cleaned the surrounding space of possible debris.[114]\n\nWhile in hibernation mode in July 2012, New Horizons started gathering scientific data with SWAP, PEPSSI and VBSDC. Although it was originally planned to activate just the VBSDC, other instruments were powered on the initiative of principal investigator Alan Stern who decided they could use the opportunity to collect valuable heliospheric data. Before activating the other two instruments, ground tests were conducted to make sure that the expanded data gathering in this phase of the mission would not limit available energy, memory and fuel in the future and that all systems are functioning during the flyby.[115] The first set of data was transmitted in January 2013 during a three-week activation from hibernation. The command and data handling software was updated to address the problem of computer resets.[116]\n\n\n Possible Neptune trojan targets[edit]\n\nOther possible targets were Neptune trojans. The probe's trajectory to Pluto passed near Neptune's trailing Lagrange point (\"L5\"), which may host hundreds of bodies in 1:1 resonance. In late 2013, New Horizons passed within 1.2 AU (180,000,000 km; 110,000,000 mi) of the high-inclination L5 Neptune trojan 2011 HM102,[117] which was identified shortly before by the New Horizons KBO Search survey team while searching for more distant objects for New Horizons to fly by after its 2015 Pluto encounter. At that range, 2011 HM102 would have been bright enough to be detectable by New Horizons' LORRI instrument; however, the New Horizons team eventually decided that they would not target 2011 HM102 for observations because the preparations for the Pluto approach took precedence.[118]\n\n\nObservations of Pluto and Charon 2013–14[edit]\n\nImages from July 1 to 3, 2013, by LORRI were the first by the probe to resolve Pluto and Charon as separate objects.[119] On July 14, 2014, mission controllers performed a sixth trajectory-correction maneuver (TCM) since its launch to enable the craft to reach Pluto.[120] Between July 19–24, 2014, New Horizons' LORRI snapped 12 images of Charon revolving around Pluto, covering almost one full rotation at distances ranging from about 429 to 422 million kilometers (267,000,000 to 262,000,000 mi).[121] In August 2014, astronomers made high-precision measurements of Pluto's location and orbit around the Sun using the Atacama Large Millimeter/submillimeter Array (ALMA) to help NASA's New Horizons spacecraft accurately home in on Pluto.[122] On December 6, 2014, mission controllers sent a signal for the craft to \"wake up\" from its final Pluto-approach hibernation and begin regular operations. The craft's response that it was \"awake\" arrived to Earth on December 7, 2014, at 02:30 UTC.[123][124][125]\n\n\nPluto approach[edit]\n\n\n\n\n\n\n\nPluto and Charon photographed on April 9, 2015, (left) by Ralph and on June 29, 2015, (right) by LORRI.\n\n\n\n\nDistant-encounter operations at Pluto began on January 4, 2015.[126] At this date images of the targets with the onboard LORRI imager plus the Ralph telescope would only be a few pixels in width. Investigators began taking Pluto and background starfield images to assist mission navigators in the design of course-correcting engine maneuvers that would precisely modify the trajectory of New Horizons to aim the approach. On January 15, 2015, NASA gave a brief update of the timeline of the approach and departure phases.[127]\n\nOn February 12, 2015, NASA released new images of Pluto (taken from January 25 to 31) from the approaching probe.[128][129] New Horizons was more than 203 million kilometers (126,000,000 mi) away from Pluto when it began taking the photos, which showed Pluto and its largest moon, Charon. The exposure time was too short to see Pluto's smaller, much fainter, moons.\n\nInvestigators compiled a series of images of the moons Nix and Hydra taken from January 27 through February 8, 2015, beginning at a range of 201 million kilometers (125,000,000 mi).[130] Pluto and Charon appear as a single overexposed object at the center. The right side image has been processed to remove the background starfield. The yet smaller two moons, Kerberos and Styx were seen on photos taken on April 25.[131] Starting May 11 a hazard search was performed, by looking for unknown objects that could be a danger to the spacecraft, such as rings or more moons, which were possible to avoid by a course change.[132]\n\nAlso in regards to the approach phase during January 2015, on August 21, 2012, the team announced that they would spend mission time attempting long-range observations of the Kuiper belt object temporarily designated VNH0004 (now designated 2011 KW48), when the object was at a distance from New Horizons of 75 gigameters (0.50 AU).[133] The object would be too distant to resolve surface features or take spectroscopy, but it would be able to make observations that cannot be made from Earth, namely a phase curve and a search for small moons. A second object was planned to be observed in June 2015, and a third in September after the flyby; the team hoped to observe a dozen such objects through 2018.[133] On April 15, 2015, Pluto was imaged showing a possible polar cap.[134]\n\n\nSoftware glitch[edit]\n\nOn July 4, 2015, New Horizons experienced a software anomaly and went into safe mode, preventing the spacecraft from performing scientific observations until engineers could resolve the problem.[135][136] On July 5, NASA announced that the problem was determined to be a timing flaw in a command sequence used to prepare the spacecraft for its flyby, and the spacecraft would resume scheduled science operations on July 7. The science observations lost because of the anomaly were judged to have no impact on the mission's main objectives and minimal impact on other objectives.[137]\n\nThe timing flaw consisted of performing two tasks simultaneously—compressing previously acquired data to release space for more data, and making a second copy of the approach command sequence—that together overloaded the spacecraft's primary computer. After the overload was detected, the spacecraft performed as designed: it switched from the primary computer to the backup computer, entered safe mode, and sent a distress call back to Earth. The distress call was received the afternoon of July 4, which alerted engineers that they needed to contact the spacecraft to get more information and resolve the issue. The resolution was that the problem happened as part of preparations for the approach, and was not expected to happen again because no similar tasks were planned for the remainder of the encounter.[137][138]\n\n\nPluto system encounter[edit]\n\n  \nAlan Stern and the New Horizons team celebrate after the spacecraft successfully completed its flyby of Pluto.\n\n\n\nThe closest approach of the New Horizons spacecraft to Pluto occurred at 11:49 UTC on July 14, 2015, at a range of 12,472 km (7,750 mi) from the surface[139] and 13,658 km (8,487 mi) from the center of Pluto. Telemetry data confirming a successful flyby and a healthy spacecraft were received on Earth from the vicinity of the Pluto system on July 15, 2015, 00:52:37 UTC,[140] after 22 hours of planned radio silence due to the spacecraft being pointed toward the Pluto system. Mission managers estimated a one in 10,000 chance that debris could have destroyed it during the flyby, preventing it from sending data to Earth.[141] The first details of the encounter were received the next day, but the download of the complete data set through the 2 kbps data downlink took just over 15 months,[20] and analysis of the data will take longer.\n\n\nObjectives[edit]\n\nThe mission's science objectives are grouped in three distinct priorities. The \"primary objectives\" were required; the \"secondary objectives\" were expected to be met but were not demanded. The \"tertiary objectives\" were desired. These objectives could have been skipped in favor of the above objectives. An objective to measure any magnetic field of Pluto was dropped. A magnetometer instrument could not be implemented within a reasonable mass budget and schedule, and SWAP and PEPSSI could do an indirect job detecting some magnetic field around Pluto.[142]\n\n\n\tPrimary objectives (required)\n\tCharacterize the global geology and morphology of Pluto and Charon\n\tMap chemical compositions of Pluto and Charon surfaces\n\tCharacterize the neutral (non-ionized) atmosphere of Pluto and its escape rate\n\n\n\tSecondary objectives (expected)\n\tCharacterize the time variability of Pluto's surface and atmosphere\n\tImage select Pluto and Charon areas in stereo\n\tMap the terminators (day/night border) of Pluto and Charon with high resolution\n\tMap the chemical compositions of select Pluto and Charon areas with high resolution\n\tCharacterize Pluto's ionosphere (upper layer of the atmosphere) and its interaction with the solar wind\n\tSearch for neutral species such as molecular hydrogen, hydrocarbons, hydrogen cyanide and other nitriles in the atmosphere\n\tSearch for any Charon atmosphere\n\tDetermine bolometric Bond albedos for Pluto and Charon\n\tMap surface temperatures of Pluto and Charon\n\tMap any additional surfaces of outermost moons: Nix, Hydra, Kerberos, and Styx\n\n\n\tTertiary objectives (desired)\n\tCharacterize the energetic particle environment at Pluto and Charon\n\tRefine bulk parameters (radii, masses) and orbits of Pluto and Charon\n\tSearch for additional moons and any rings\n\n\n\n\n\"The New Horizons flyby of the Pluto system was fully successful, meeting and in many cases exceeding, the Pluto objectives set out for it by NASA and the National Academy of Sciences.\"[143]\n\n\nFlyby details[edit]\n\n\n\nPluto's \"encounter hemisphere\" viewed by New Horizons on July 13, 2015\n\n\nPluto's Charon-facing opposing hemisphere viewed on July 11, 2015\n\n\n\n\n\nPlay media\n  \nAnimation of New Horizons' flyby of Pluto in Eyes on the Solar System.\n\n\n\nNew Horizons passed within 12,500 km (7,800 mi) of Pluto, with this closest approach on July 14, 2015, at 11:50 UTC. New Horizons had a relative velocity of 13.78 km/s (49,600 km/h; 30,800 mph) at its closest approach, and came as close as 28,800 km (17,900 mi) to Charon. Starting 3.2 days before the closest approach, long-range imaging included the mapping of Pluto and Charon to 40 km (25 mi) resolution. This is half the rotation period of the Pluto–Charon system and allowed imaging of all sides of both bodies. Close range imaging was repeated twice per day in order to search for surface changes caused by localized snow fall or surface cryovolcanism. Because of Pluto's tilt, a portion of the northern hemisphere would be in shadow at all times. During the flyby, engineers expected LORRI to be able to obtain select images with resolution as high as 50 m per pixel (160 ft/px) if closest distance were around 12,500 km, and MVIC was expected to obtain four-color global dayside maps at 1.6 km (1 mi) resolution. LORRI and MVIC attempted to overlap their respective coverage areas to form stereo pairs. LEISA obtained hyperspectral near-infrared maps at 7 km/px (4.3 mi/px) globally and 0.6 km/px (0.37 mi/px) for selected areas.\n\n\n  \nPatterns of blue-gray ridges and reddish material observed in the Tartarus Dorsa region on July 14, 2015\n\n\n\nMeanwhile, Alice characterized the atmosphere, both by emissions of atmospheric molecules (airglow), and by dimming of background stars as they pass behind Pluto (occultation). During and after closest approach, SWAP and PEPSSI sampled the high atmosphere and its effects on the solar wind. VBSDC searched for dust, inferring meteoroid collision rates and any invisible rings. REX performed active and passive radio science. The communications dish on Earth measured the disappearance and reappearance of the radio occultation signal as the probe flew by behind Pluto. The results resolved Pluto's diameter (by their timing) and atmospheric density and composition (by their weakening and strengthening pattern). (Alice can perform similar occultations, using sunlight instead of radio beacons.) Previous missions had the spacecraft transmit through the atmosphere, to Earth (\"downlink\"). Pluto's mass and mass distribution were evaluated by the gravitational tug on the spacecraft. As the spacecraft speeds up and slows down, the radio signal exhibited a Doppler shift. The Doppler shift was measured by comparison with the ultrastable oscillator in the communications electronics.\n\nReflected sunlight from Charon allowed some imaging observations of the nightside. Backlighting by the Sun gave an opportunity to highlight any rings or atmospheric hazes. REX performed radiometry of the nightside.\n\n\n\n\nSatellite observations[edit]\n\nNew Horizons' best spatial resolution of the small satellites is 330 m per pixel (1,080 ft/px) at Nix, 780 m/px (2,560 ft/px) at Hydra, and approximately 1.8 km/px (1.1 mi/px) at Kerberos and Styx. Estimates for the dimensions of these bodies are: Nix at 49.8 × 33.2 × 31.1 km (30.9 × 20.6 × 19.3 mi); Hydra at 50.9 × 36.1 × 30.9 km (31.6 × 22.4 × 19.2 mi); Kerberos at 19 × 10 × 9 km (11.8 × 6.2 × 5.6 mi); and Styx at 16 × 9 × 8 km (9.9 × 5.6 × 5.0 mi).[144]\n\nInitial predictions envisioned Kerberos as a relatively large and massive object whose dark surface led to it having a faint reflection. This proved to be wrong as images obtained by New Horizons on July 14 and sent back to Earth in October 2015 revealed that Kerberos was smaller in size, 19 km (12 mi) across with a highly reflective surface suggesting the presence of relatively clean water ice similarly to the rest of Pluto's smaller moons.[145]\n\n\n\nSatellites of Pluto imaged by New Horizons\n\n\nCharon\n\n\nHydra\n\n\nNix\n\n\nKerberos\n\n\nStyx\n\n\n Media related to Photos of Pluto system by New Horizons at Wikimedia Commons\n\n\n\n\nPost-Pluto events[edit]\n\n  \nView of Pluto as New Horizons left the system, catching the Sun's rays passing through Pluto's atmosphere, forming a ring\n\n\n\nSoon after the Pluto flyby, in July 2015, New Horizons reported that the spacecraft was healthy, its flight path was within the margins, and science data of the Pluto–Charon system had been recorded.[146][147] The spacecraft's immediate task was to begin returning the 6.25 gigabytes of information collected.[20] The free-space path loss at its distance of 4.5 light-hours (3,000,000,000 km) is approximately 303 dB at 7 GHz. Using the high gain antenna and transmitting at full power, the signal from EIRP is +83 dBm, and at this distance the signal reaching Earth is −220 dBm. The received signal level (RSL) using one, un-arrayed Deep Space Network antenna with 72 dBi of forward gain equals −148 dBm.[148] Because of the extremely low RSL, it could only transmit data at 1 to 2 kilobits per second.[149]\n\nBy March 30, 2016, New Horizons had reached the halfway point of transmitting this data.[150] The transfer was completed on October 25, 2016 at 21:48 UTC, when the last piece of data—part of a Pluto–Charon observation sequence by the Ralph/LEISA imager—was received by the Johns Hopkins University Applied Physics Laboratory.[20][151]\n\nAt a distance of 43 AU (6.43 billion km; 4.00 billion mi) from the Sun and 0.4 AU (60 million km; 37 million mi) from Ultima Thule as of November 2018,[152] New Horizons is heading in the direction of the constellation Sagittarius[153] at 14.10 km/s (8.76 mi/s; 2.97 AU/a) relative to the Sun.[152] The brightness of the Sun from the spacecraft is magnitude −18.5.[153]\n\n\nMission extension[edit]\n\n  \nBig picture: from the inner Solar System to the Oort cloud with the Kuiper belt in between\n\n\n\nThe New Horizons team requested, and received, a mission extension through 2021 to explore additional Kuiper belt objects (KBOs). Funding was secured on July 1, 2016.[154] During this Kuiper Belt Extended Mission (KEM), the spacecraft has performed a close fly-by of Ultima Thule and will conduct more distant observations on an additional two dozen objects,[155][154][156] and possibly make a fly-by of another KBO.[citation needed]\n\n\nKuiper belt object mission[edit]\n\nTarget background[edit]\n\nMission planners searched for one or more additional Kuiper belt objects (KBOs) of the order of 50–100 km (31–62 mi) in diameter as targets for flybys similar to the spacecraft's Plutonian encounter. However, despite the large population of KBOs, many factors limited the number of possible targets. Because the flight path was determined by the Pluto flyby, and the probe only had 33 kilograms of hydrazine propellant remaining, the object to be visited needed to be within a cone of less than a degree's width extending from Pluto. The target also needed to be within 55 AU, because beyond 55 AU, the communications link will become too weak, and the RTG power output will have decayed significantly enough to hinder observations.[157] Desirable KBOs would be well over 50 km (30 mi) in diameter, neutral in color (to contrast with the reddish Pluto), and, if possible, have a moon that imparts a wobble.[citation needed]\n\n\nSearch[edit]\n\nIn 2011, mission scientists started a dedicated search for suitable KBOs using ground telescopes. Large ground telescopes with wide-field cameras, notably the twin 6.5-meter Magellan Telescopes in Chile, the 8.2-meter Subaru Observatory in Hawaii, and the Canada–France–Hawaii Telescope[117][158] were used to search for potential targets. By participating in a citizen-science project called Ice Hunters, the public helped to scan telescopic images for possible suitable mission candidates.[159][160][161][162][163] The ground-based search resulted in the discovery of about 143 KBOs of potential interest,[164] but none of these were close enough to the flight path of New Horizons.[158] Only the Hubble Space Telescope was deemed likely to find a suitable target in time for a successful KBO mission.[165] On June 16, 2014, time on Hubble was granted for a search.[166] Hubble has a much greater ability to find suitable KBOs than ground telescopes. The probability that a target for New Horizons would be found was estimated beforehand at about 95%.[167]\n\n\nSuitable KBOs[edit]\n\n  \n(486958) 2014 MU69, the announced target for the Kuiper belt object mission\n\n\n\nOn October 15, 2014, it was revealed that Hubble's search had uncovered three potential targets,[168][169][170][171][172] temporarily designated PT1 (\"potential target 1\"), PT2 and PT3 by the New Horizons team. All are objects with estimated diameters in the 30–55 km (19–34 mi) range and were too small to be seen by ground telescopes. Each were at distances from the Sun of ranging from 43 to 44 AU, which would put the encounters in the 2018–2019 period.[169] The initial estimated probabilities that these objects were reachable within New Horizons' fuel budget are 100%, 7%, and 97%, respectively.[169] All are members of the \"cold\" (low-inclination, low-eccentricity) classical Kuiper belt, and thus are very different from Pluto.  PT1 (given the temporary designation \"1110113Y\" on the HST web site[173]), the most favorably situated object, has a magnitude of 26.8, is 30–45 km (19–28 mi) in diameter, and was encountered in January 2019.[174] A course change to reach it required about 35% of New Horizons' available trajectory-adjustment fuel supply.  A mission to PT3 was in some ways preferable, in that it is brighter and therefore probably larger than PT1, but the greater fuel requirements to reach it would have left less for maneuvering and unforeseen events.[169] Once sufficient orbital information was provided, the Minor Planet Center gave provisional designations to the three target KBOs: 2014 MU69 (PT1), 2014 OS393 (PT2), and 2014 PN70 (PT3). By the fall of 2014, a possible fourth target, 2014 MT69, had been eliminated by follow-up observations. PT2 was out of the running before the Pluto flyby.[175][176]  The spacecraft will also study almost 20 KBOs from afar.[177]\n\n\nKBO selection[edit]\n\nOn August 28, 2015, (486958) 2014 MU69 (PT1) was chosen as the flyby target. The necessary course adjustment was performed with four engine firings between October 22 and November 4, 2015.[178][179] The flyby occurred on January 1, 2019, at 00:33 UTC.[180][181]\n\n\nObservations of other KBOs[edit]\n\nAside from its flyby of (486958) 2014 MU69, the extended mission for New Horizons calls for the spacecraft to conduct observations of, and look for ring systems around, between 25 and 35 different KBOs.[182] In addition, it will continue to study the gas, dust and plasma composition of the Kuiper belt before the mission extension ends in 2021.[155][156]\n\nOn November 2, 2015, New Horizons imaged KBO 15810 Arawn with the LORRI instrument from 280 million km away (170 million mi; 1.9 AU), showing the shape of the object and one or two details.[183] This KBO was again imaged by the LORRI instrument on April 7–8, 2016, from a distance of 111 million km (69 million mi; 0.74 AU). The new images allowed the science team to further refine the location of 15810 Arawn to within 1,000 km (620 mi) and to determine its rotational period of 5.47 hours.[184][185]\n\nIn July 2016, the LORRI camera captured some distant images of Quaoar from 2.1 billion km away (1.3 billion mi; 14 AU); the oblique view will complement Earth-based observations to study the object's light-scattering properties.[186]\n\nOn December 5, 2017, when New Horizons was 40.9 AU from Earth, a calibration image of the Wishing Well cluster marked the most distant image from Earth ever taken by a spacecraft (breaking the 27-year record set by Voyager 1's famous Pale Blue Dot). Two hours later, New Horizons surpassed its own record, imaging the Kuiper belt objects 2012 HZ84 and 2012 HE85 from a distance of 0.50 and 0.34 AU, respectively. These are the closest images taken of a Kuiper belt object besides Pluto and Ultima Thule as of February 2018[update].[187][188]\n\n\n\nExtended mission imaging targets\n\n\n15810 Arawn in April 2016\n\n\n50000 Quaoar in July 2016 at a distance of about 14 AU[186]\n\n\nCalibration image of the Wishing Well cluster from December 2017\n\n\nFalse-color image of 2012 HZ84 from December 2017\n\n\nFalse-color image of 2012 HE85 from December 2017\n\n\n Media related to Photos of Kuiper belt objects by New Horizons at Wikimedia Commons\n\n\n\n\nEncounter with (486958) 2014 MU69[edit]\n\nPlay media\n  \nAnimation of New Horizons' flyby of 2014 MU69 in Eyes on the Solar System.\n\n\n\n  \nAnimation of New Horizons's trajectory from January 19, 2006 to  December 30, 2030\n    New Horizons  ·   (486958) 2014 MU69 ·   Earth ·   132524 APL ·   Jupiter  ·   Pluto \n\n\n\n  \nNew Horizons image of 2014 MU69. The larger lobe at the bottom is nicknamed \"Ultima\", and the smaller \"Thule\".\n\n\nSee also: (486958) 2014 MU69 § Exploration\n\nObjectives[edit]\n\nScience objectives of the flyby included characterizing the geology and morphology of 2014 MU69 (nicknamed \"Ultima Thule\"),[189][190]  and mapping the surface composition (by searching for ammonia, carbon monoxide, methane, and water ice). Searches will be conducted for orbiting moonlets, a coma, rings, and the surrounding environment.[191] Additional objectives include:[192]\n\n\n\tMapping the surface geology to learn how it formed and evolved\n\tMeasuring the surface temperature\n\tMapping the 3-D surface topography and surface composition to learn how it is similar to and different from comets such as 67P/Churyumov–Gerasimenko and dwarf planets such as Pluto\n\tSearching for any signs of activity, such as a cloud-like coma\n\tSearching for, and studying, any satellites or rings\n\tMeasuring or constraining the mass\n\n\nTargeting maneuvers[edit]\n\n2014 MU69 is the first object to be targeted for a flyby that was discovered after the spacecraft was launched.[193] New Horizons is planned to come within 3,500 km (2,200 mi) of 2014 MU69, three times closer than the spacecraft's earlier encounter with Pluto. Images with a resolution of up to 30 m (98 ft) per pixel are expected.[194]\n\nThe new mission began on October 22, 2015, when New Horizons carried out the first in a series of four initial targeting maneuvers designed to send it toward 2014 MU69. The maneuver, which started at approximately 19:50 UTC and used two of the spacecraft's small hydrazine-fueled thrusters, lasted approximately 16 minutes and changed the spacecraft's trajectory by about 10 meters per second (33 ft/s). The remaining three targeting maneuvers took place on October 25, October 28, and November 4, 2015.[195][196]\n\n\nApproach phase[edit]\n\nThe craft was brought out of its hibernation at approximately 00:33 UTC SCET on June 5, 2018 (06:12 UTC ERT, Earth-Received Time),[a] in order to prepare for the approach phase.[198][199] After verifying its health status, the spacecraft transitioned from a spin-stabilized mode to a three-axis-stabilized mode on August 13, 2018. The official approach phase began on August 16, 2018, and continued through December 24, 2018.[200] The first distant images from New Horizons were acquired starting in early September 2018.\n\nNew Horizons made its first detection of 2014 MU69 on August 16, 2018, from a distance of 107 million mi (172 million km). At that time, 2014 MU69 was visible at magnitude 20, against a crowded stellar background in the direction of the constellation Sagittarius.[201][202]\n\n\nCore phase[edit]\n\nThe Core phase began a week before the encounter, and continued for two days after the encounter. The spacecraft flew by the object at a speed of 51,500 km/h (32,000 mph; 14.3 km/s) and within 3,500 km (2,200 mi).[203] The majority of the science data was collected within 48 hours of the closest approach in a phase called the Inner Core.[200] Closest approach occurred January 1, 2019, at 05:33 UTC[204] SCET at which point it was 43.4 AU from the Sun.[205] At this distance, the one-way transit time for radio signals between Earth and New Horizons was six hours.[191] Confirmation that the craft had succeeded in filling its digital recorders with data only arrived on Earth ten hours later, at 15:29 UTC.[206]\n\n\nData download[edit]\n\nAfter the encounter, preliminary, high-priority data was sent to Earth on January 1 and 2, 2019. On January 9, New Horizons returned to a spin-stabilized mode, to prepare to send the remainder of its data back to Earth.[200] This download is expected to take 20 months at a data rate of 1–2 kilobits per second.[207] The download of data is expected to be completed in September 2020.[208]\n\n\nPost 2014 MU69 encounter events[edit]\n\n  \nNew Horizons'  position as of December 2018[152]\n\n\n\nAfter the spacecraft's passage by 2014 MU69, the instrument continues to have sufficient power to be operational until the 2030s. Team leader Alan Stern stated the potential for a third flyby in the 2020s at the outer edges of the Kuiper belt.[209][210] This depends on a suitable Kuiper belt object still to be found or confirmed close enough to the spacecraft's current trajectory.\n\nIn addition, New Horizons may take a picture of Earth from its distance in the Kuiper belt, but only after completing all planned KBO flybys.[211] This is because pointing a camera towards Earth risks it being damaged by sunlight.[212]\n\n\nSpeed[edit]\n\n  \nSpeed and distance from the Sun\n\n\n\nNew Horizons has been called \"the fastest spacecraft ever launched\"[10] because it left Earth at 16.26 kilometers per second (58,536 km/h; 36,373 mph), faster than any other spacecraft.[11][12] It is also the first spacecraft launched directly into a solar escape trajectory, which requires an approximate speed while near Earth of 16.5 km/s (59,000 km/h; 37,000 mph),[b] plus additional delta-v to cover air and gravity drag, all to be provided by the launch vehicle.\n\nHowever, it is not the fastest spacecraft to leave the Solar System. As of January 2018[update], this record is held by Voyager 1, traveling at 16.985 km/s (61,146 km/h; 37,994 mph) relative to the Sun.[153] Voyager 1 attained greater hyperbolic excess velocity than New Horizons thanks to gravity assists by Jupiter and Saturn.  When New Horizons reaches the distance of 100 AU, it will be travelling at about 13 km/s (47,000 km/h; 29,000 mph), around 4 km/s (14,000 km/h; 8,900 mph) slower than Voyager 1 at that distance.[213] The Parker Solar Probe can also be measured as the fastest object, because of its orbital speed relative to the Sun at perihelion: 95.3 km/s (343,000 km/h; 213,000 mph).[c] Because it remains in solar orbit, its specific orbital energy relative to the Sun is lower than New Horizons and other artificial objects escaping the Solar System.\n\n\nNew Horizons' Star 48B third stage is also on a hyperbolic escape trajectory from the Solar System, and reached Jupiter before the New Horizons spacecraft; it was expected to cross Pluto's orbit on October 15, 2015.[214] Because it is not in controlled flight, it did not receive the correct gravity assist, and passed within 200 million km (120 million mi) of Pluto.[214] The Centaur second stage did not achieve solar escape velocity, and remains in a heliocentric orbit.[215][c]\n\n\n\nGallery[edit]\n\nImages of the launch[edit]\n\n\n\nThe Atlas V 551 rocket, used to launch New Horizons, being processed a month before launch.\n\n\nView of Cape Canaveral Launch Complex 41, with the Atlas V carrying New Horizons on the pad.\n\n\nDistant view of Cape Canaveral during the launch of New Horizons on January 19, 2006.\n\nPlay media\n\nNASA TV footage of New Horizons' launch from Cape Canaveral. (4:00)\n\n\n\n\n\nVideos[edit]\n\n\nPlay media\n\n(00:30; released September 18, 2015)\n\nPlay media\n\n(00:50; released December 5, 2015)\n\n\n\n\n\n\n\nTimeline[edit]\n\nPreparation phase[edit]\n\n\tJanuary 8, 2001: Proposal team meets face-to-face for the first time at the Johns Hopkins University Applied Physics Laboratory.[217]\n\tFebruary 5, 2001: New Horizons name chosen.[217][218]\n\tApril 6, 2001: New Horizons proposal submitted to NASA. It was one of five proposals submitted, which were later narrowed to two for Phase A study: POSSE (Pluto and Outer Solar System Explorer) and New Horizons.[217]\n\tNovember 29, 2001: New Horizons proposal selected by NASA. Started Phase B study.[219]\n\tMarch 2002: Budget zeroed by Bush administration, later overridden.[220][221]\n\tJune 13, 2005: Spacecraft departed Applied Physics Laboratory for final testing. It undergoes final testing at Goddard Space Flight Center (GSFC).[222]\n\tSeptember 24, 2005: Spacecraft shipped to Cape Canaveral. It was moved through Andrews Air Force Base aboard a C-17 Globemaster III cargo aircraft.[79]\n\tDecember 17, 2005: Spacecraft ready for in rocket positioning. Transported from Hazardous Servicing Facility to Vertical Integration Facility at Space Launch Complex 41.[223]\n\tJanuary 11, 2006: Primary launch window opened. The launch was delayed for further testing.[224]\n\tJanuary 16, 2006: Rocket moved onto launch pad. Atlas V launcher, serial number AV-010, rolled out onto pad.[225]\n\tJanuary 17, 2006: Launch delayed. First day launch attempts scrubbed because of unacceptable weather conditions (high winds).[80][81]\n\tJanuary 18, 2006: Launch delayed again. Second launch attempt scrubbed because of morning power outage at the Applied Physics Laboratory.[226]\n\n\nLaunch phase[edit]\n\n\tJanuary 19, 2006: Successful launch at 19:00 UTC after a brief delay due to cloud cover.[82][83]\n\n\nJupiter pre-encounter phase[edit]\n\n\tApril 7, 2006: The probe passed Mars' orbit 1.5 AU from Earth.[94][227]\n\tJune 13, 2006: Flyby of asteroid 132524 APL. The probe passed closest to the asteroid 132524 APL in the Asteroid Belt at about 101,867 km at 04:05 UTC. Pictures were taken.[228]\n\tNovember 28, 2006: First image of Pluto. The image of Pluto was taken from a great distance.[100]\n\n\nJupiter encounter phase[edit]\n\n\tJanuary 10, 2007: Navigation exercise near Jupiter. Long-distance observations of Jupiter's outer moon Callirrhoe as a navigation exercise.[229]\n\tFebruary 28, 2007: Jupiter flyby. Closest approach occurred at 05:43:40 UTC at 2.305 million km, 21.219 km/s.[230]\n\n\nPluto pre-encounter phase[edit]\n\n\tJune 8, 2008: The probe passed Saturn's orbit 9.5 AU from Earth.[230][231]\n\tDecember 29, 2009: The probe becomes closer to Pluto than to Earth. Pluto was then 32.7 AU from Earth, and the probe was 16.4 AU from Earth.[232][233][234]\n\tFebruary 25, 2010: New Horizons completed 2.38 billion km (1.48 billion mi), half the total travel distance of 4.76 billion km (2.96 billion mi).[235]\n\tMarch 18, 2011: The probe passes Uranus's orbit. This is the fourth planetary orbit the spacecraft crossed since its start. New Horizons reached Uranus's orbit at 22:00 UTC.[236][237]\n\tDecember 2, 2011: New Horizons draws closer to Pluto than any other spacecraft has ever been. Previously, Voyager 1 held the record for the closest approach. (~10.58 AU)[238]\n\tFebruary 11, 2012: New Horizons reaches the distance of 10 AU from the Pluto system, at around 4:55 UTC.[239]\n\tJuly 1, 2013: New Horizons captures its first image of Charon. Charon is clearly separated from Pluto using the Long-Range Reconnaissance Imager (LORRI).[240][241]\n\tOctober 25, 2013: New Horizons reaches the distance of 5 AU from the Pluto system.[239][242]\n\tJuly 20, 2014: Photos of Pluto and Charon. Images obtained showing both bodies orbiting each other, distance 2.8 AU.[243]\n\tAugust 25, 2014: The probe passes Neptune's orbit. This was the fifth planetary orbit crossed.[244]\n\tDecember 7, 2014: New Horizons awakes from hibernation. NASA's Deep Sky Network station at Tidbinbilla, Australia received a signal confirming that it successfully awoke from hibernation.[123][124]\n\tJanuary 2015: Observation of Kuiper belt object 2011 KW48. Distant observations from a distance of roughly 75 million km (~0.5 AU)[245]\n\tJanuary 15, 2015: Start of Pluto observations. New Horizons is now close enough to Pluto and begins observing the system.[246][247]\n\tMarch 10–11, 2015: New Horizons reaches a distance of 1 AU from the Pluto system.[248]\n\tMarch 20, 2015: NASA invites the general public to suggest names for surface features that may be discovered on Pluto and Charon.[249]\n\tMay 15, 2015: Images exceed best Hubble Space Telescope resolution.[250]\n\n\nPluto Science phase[edit]\n\n\tJuly 14, 2015: Flyby of the Pluto system: Pluto, Charon, Hydra, Nix, Kerberos and Styx. \n •  Flyby of Pluto around 11:49:57 UTC at 12,500 km, 13.78 km/s. \n •  Pluto is 32.9 AU from Sun. \n •  Flyby of Charon around 12:03:50 UTC at 28,858 km, 13.87 km/s.[251]\n\tJuly 14, 2015 to October 25, 2016: Transmission of collected data back to Earth, and ongoing science discovery based on the observations. The bit rate of the downlink is limited to 1–2 kb/s,[149] so it took until October 25, 2016, to transmit all the data.[20][252][253][254]\n\n\n(486958) 2014 MU69 pre-encounter phase[edit]\n\n\tOctober 22 – November 4, 2015: Trajectory correction maneuver. A course adjustment for the January 2019 flyby of Ultima Thule was performed in a series of four thruster firings of 22 minutes each.[178][255]\n\tNovember 2, 2015: Observation of KBO 15810 Arawn. Long-range observations from a distance of 274 million kilometres (1.83 AU), the closest ever for any Trans-Neptunian Object other than Pluto and Ultima Thule. More images were taken on April 7–8, 2016, at a range of 179 million kilometres (1.20 AU) as well.[256]\n\tJuly 13–14, 2016: Observation of KBO 50000 Quaoar. Long-range observations from a distance of 2 million kilometres (0.013 AU) gives mission scientists a different perspective in order to study the light-scattering properties of Quaoar's surface.[257]\n\tFebruary 1, 2017: Trajectory correction maneuver. A small course adjustment towards the January 2019 flyby of 2014 MU69 was performed with a 44-second thruster firing.[258][178]\n\t2017–2020: Observations of Kuiper belt objects (KBOs). The probe will have opportunities to perform observations of 10 to 20 KBOs visible from the spacecraft's trajectory after the Pluto system flyby. Heliosphere data collection is expected to begin.[193][259][260]\n\tDecember 9, 2017: Trajectory correction maneuver. This delays the arrival at 2014 MU69 by a few hours, optimizing coverage by ground-based radio telescopes.[261][262]\n\tDecember 23, 2017 – June 4, 2018: Final hibernation period before the (KBO) 2014 MU69 encounter.[263][261]\n\tAugust 2018 – March 2019: Distant observations of at least a dozen distant KBOs. Recovered by Subaru Telescope in 2014–2017, enabling New Horizons observations[182]\n\tAugust 13, 2018: Switch from spin mode to 3-axis mode.[261]\n\tAugust 16, 2018 – December 24, 2018: Approach phase. Optical navigation, search for hazardous material around 2014 MU69[261]\n\tAugust 16, 2018: First detection of Kuiper belt object 2014 MU69[201]\n\tOctober 4, 2018 – December 2, 2018: Opportunities for trajectory correction maneuvers. Maneuvers scheduled for October 4 and November 20, with backups on October 23 and December 2, respectively[261]\n\n\n2014 MU69 Science phase and beyond[edit]\n\n\tJanuary 1, 2019: Flyby of Ultima Thule. The flyby occurred at 05:33 UTC, and is the outermost close encounter of any Solar System object.[204]\n\tJanuary 9, 2019: Switch from 3-axis mode to spin mode. This ends the Ultima Thule flyby, marking the beginning of the downlink phase.[261]\n\t2019–2020: Downlink of data from the Ultima Thule flyby. Predicted to take approximately 20 months.[261]\n\tApril 30, 2021: End of extended mission. It is expected that the mission will be extended further if the spacecraft remains operational.[261]\n\t2020s: The probe may be able to fly by a third KBO. The probe approached Ultima Thule along its rotational axis, which simplified trajectory correction maneuvers, saving fuel that could be used to target another KBO.[264][265] After the flyby, the spacecraft was left with 11 kg (24 lb) of fuel.[266]\n\tMid to late 2030s: Expected end of the mission, based on RTG decay. Heliosphere data collection expected to be intermittent if instrument power sharing is required.[267][265]\n\n\nPost-mission phase[edit]\n\n\t2038: New Horizons will be 100 AU from the Sun. If still functioning, the probe will explore the outer heliosphere and interstellar space along with the Voyager spacecraft.[213]\n\n\nSee also[edit]\n\n\n\t2006 in spaceflight\n\tExploration of Pluto\n\tList of artificial objects leaving the Solar System\n\tList of missions to the outer planets\n\tList of New Horizons topics\n\tMariner Mark II, a planned family of NASA spacecraft including a Pluto mission\n\tNew Horizons 2, a proposed trans-Neptunian object flyby mission\n\tPioneer 10\n\tPioneer 11\n\tPluto Kuiper Express, a cancelled NASA Pluto flyby mission\n\tTAU, a proposed mission to fly by Pluto\n\tTimeline of Solar System exploration\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\tAstronomy portal\n\tSpaceflight portal\n\tSpace portal\n\tSolar System portal\n\tScience portal\n\tTechnology portal\n\tUnited States portal\n\tPolitics portal\n\n\n\n\n\nNotes[edit]\n\n\n\t^ Confirmation that New Horizons exited hibernation was received by ground stations at 06:12 UTC. Spacecraft Event Time is calculated by subtracting the one-way light-travel time (5 hours, 38 minutes, 38 seconds) from Earth-received time.[197]\n\n\t^ To escape the Sun the spacecraft needs a speed relative to the Sun of the square root of 2 times the speed of the Earth (29.78 km/s), or 42.1 km/s. Relative to the Earth this is just 12.3 km/s. But the kinetic energy when near the surface of the Earth must include the energy to exit the gravity well of the Earth, which requires a speed of about 11 km/s. The total speed needed is the square root of the sum of the squares of these two speeds.[citation needed]\n\n\t^ a b The Parker Solar Probe is expected to beat this record at its next perihelion in April 2019. Following several more gravity assists at Venus, the spacecraft is expected to reach a maximum speed at perihelion of approximately 200 km/s (720,000 km/h; 450,000 mph) on December 24, 2024.[216]\n\n\n\n\n\nReferences[edit]\n\n\n\t^ \"Atlas Launch Archives\". International Launch Services. Retrieved April 21, 2018.\n\n\t^ \"HORIZONS Web-Interface\". NASA/JPL. Retrieved July 25, 2016.\n To find results, change Target Body to \"New Horizons\" and change Time Span to include \"2017-01-01\".\n\n\t^ Chang, Kenneth (July 18, 2015). \"The Long, Strange Trip to Pluto, and How NASA Nearly Missed It\". The New York Times. Retrieved July 19, 2015.\n\n\n\t^ a b Leo Laporte (August 31, 2015). \"Alan Stern: principal investigator for New Horizons\". TWiT.tv (Podcast). TWiT.tv. Retrieved September 1, 2015.\n\n\n\t^ \"New Horizons to Pluto, Mission Website\". US National Aeronautics and Space Administration (NASA). July 2, 2015. Retrieved July 7, 2015.\n\n\n\t^ Chang, Kenneth (July 13, 2015). \"A Close-Up for Pluto After Spacecraft's 3-Billion-MileTrip\". The New York Times. Retrieved July 13, 2015.\n\n\n\t^ Chang, Kenneth (July 6, 2015). \"Almost Time for Pluto's Close-Up\". The New York Times. Retrieved July 6, 2015.\n\n\n\t^ a b Overbye, Dennis (July 6, 2015). \"Reaching Pluto, and the End of an Era of Planetary Exploration\". The New York Times. Retrieved July 7, 2015.\n\n\n\t^ Roston, Michael (August 28, 2015). \"NASA's Next Horizon in Space\". The New York Times. Retrieved August 28, 2015.\n\n\n\t^ a b \"New Horizons, The First Mission to Pluto and the Kuiper Belt: Exploring Frontier Worlds\" (PDF) (Press Kit). Applied Physics Laboratory. January 16, 2007.\n\n\n\t^ a b c Scharf, Caleb A. (February 25, 2013). \"The Fastest Spacecraft Ever?\". Scientific American. Retrieved July 12, 2017.\n\n\n\t^ a b Dvorsky, George (June 9, 2015). \"Here's Why The New Horizons Spacecraft Won't Be Stopping At Pluto\". io9. Retrieved July 12, 2017.\n\n\n\t^ Whitwam, Ryan (December 13, 2017). \"New Horizons Space Probe Target May Have its Own Tiny Moonlet – ExtremeTech\". Ziff Davis. Retrieved January 24, 2019.\n\n\n\t^ \"New Horizons: NASA's Mission to Pluto\". NASA. Retrieved April 15, 2015.\n\n\n\t^ \"New Horizons – News\". Johns Hopkins Applied Physics Laboratory. December 6, 2014. Retrieved April 15, 2015.\n\n\n\t^ Chang, Kenneth (July 14, 2015). \"NASA's New Horizons Spacecraft Completes Flyby of Pluto\". The New York Times. Retrieved July 14, 2015.\n\n\n\t^ Dunn, Marcia (July 14, 2015). \"Pluto close-up: Spacecraft makes flyby of icy, mystery world\". Excite. Associated Press (AP). Retrieved July 14, 2015.\n\n\n\t^ Brown, Dwayne; Cantillo, Laurie; Buckley, Mike; Stotoff, Maria (July 14, 2015). \"15-149 NASA's Three-Billion-Mile Journey to Pluto Reaches Historic Encounter\". NASA. Retrieved July 14, 2015.\n\n\n\t^ Cofield, Calia (August 24, 2016). \"How We Could Visit the Possibly Earth-Like Planet Proxima b\". Space.com. Retrieved October 1, 2019.\n\n\n\t^ a b c d e Chang, Kenneth (October 28, 2016). \"No More Data From Pluto\". The New York Times. Retrieved October 28, 2016.\n\n\n\t^ Jayawardhana, Ray (December 11, 2015). \"Give It Up for Pluto\". The New York Times. Retrieved December 11, 2015.\n\n\n\t^ a b Talbert, Tricia (August 28, 2015). \"NASA's New Horizons Team Selects Potential Kuiper Belt Flyby Target\". NASA. Retrieved September 4, 2015.\n\n\n\t^ a b Cofield, Calla (August 28, 2015). \"Beyond Pluto: 2nd Target Chosen for New Horizons Probe\". Space.com. Retrieved August 30, 2015.\n\n\n\t^ Dunn, Marcia (October 22, 2015). \"NASA's New Horizons on new post-Pluto mission\". Associated Press. Retrieved October 25, 2015.\n\n\n\t^ Corum, Jomathan (February 10, 2019). \"New Horizons Glimpses the Flattened Shape of Ultima Thule - NASA's New Horizons spacecraft flew past the most distant object ever visited: a tiny fragment of the early solar system known as 2014 MU69 and nicknamed Ultima Thule. - Interactive\". The New York Times. Retrieved February 11, 2019.\n\n\n\t^ Chang, Kenneth (December 31, 2018). \"New Horizons Spacecraft Completes Flyby of Ultima Thule, the Most Distant Object Ever Visited\". The New York Times. Retrieved January 1, 2019.\n\n\n\t^ a b Gladstone, G. Randall;  et al. (August 7, 2018). \"The Lyman‐α Sky Background as Observed by New Horizons\". Geophysical Research Letters. 45 (16): 8022. arXiv:1808.00400. Bibcode:2018GeoRL..45.8022G. doi:10.1029/2018GL078808.\n\n\n\t^ a b Letzter, Rafi (August 9, 2018). \"NASA Spotted a Vast, Glowing 'Hydrogen Wall' at the Edge of Our Solar System\". Live Science. Retrieved August 10, 2018.\n\n\n\t^ Sobel, Dava (May 1993). \"The Last World\". Discover. Retrieved April 13, 2007.\n\n\n\t^ a b c Hand, Eric (June 25, 2015). \"Feature: How Alan Stern's tenacity, drive, and command got a NASA spacecraft to Pluto\". Science. American Association for the Advancement of Science. Retrieved July 8, 2015.\n\n\n\t^ a b Stern, Alan; Christopher, Russell (2009). New Horizons: Reconnaissance of the Pluto-Charon System and the Kuiper Belt. Springer Publishing. pp. 6, 7. ISBN 978-0-387-89518-5. Retrieved July 8, 2015.\n\n\n\t^ a b Savage, Donald (June 6, 2001). \"NASA Selects Two Investigations for Pluto-Kuiper Belt Mission Feasibility Studies\". National Aeronautics and Space Administration (NASA). Archived from the original on December 31, 2015. Retrieved July 9, 2015.\n\n\n\t^ Savage, Donald (February 14, 2001). \"NEAR Shoemaker's Historic Landing on Eros Exceeds Science, Engineering Expectations\". National Aeronautics and Space Administration (NASA). Archived from the original on July 9, 2015. Retrieved July 8, 2015.\n\n\n\t^ Savage, Donald (November 29, 2001). \"NASA Selects Pluto-Kuiper Belt Mission Phase B Study\". National Aeronautics and Space Administration (NASA). Archived from the original on March 8, 2011. Retrieved July 9, 2015.\n\n\n\t^ \"Alice Bowman: APL's First Female MOM\". Johns Hopkins Applied Physics Laboratory. Retrieved April 11, 2016.\n\n\n\t^ Knapp, Alex (July 14, 2015). \"How Do New Horizons Costs Compare To Other Space Missions?\". Forbes.\n\n\n\t^ \"Departments of Space Studies & Space Operations\" (PDF). Southwest Research Institute Planetary Science Directorate website. Southwest Research Institute. Retrieved March 14, 2010.\n\n\n\t^ \"Unabashedly Onward to the Ninth Planet\". New Horizons website. Johns Hopkins/APL. Archived from the original on November 13, 2014. Retrieved October 25, 2008.\n\n\n\t^ \"Pluto's Two Small Moons Christened Nix and Hydra\". New Horizons website (Press release). Johns Hopkins APL. Archived from the original on January 13, 2011. Retrieved October 25, 2008.\n\n\n\t^ \"Send Your Name to Pluto\". New Horizons website. Johns Hopkins APL. Archived from the original on November 13, 2014. Retrieved January 30, 2009.\n\n\n\t^ \"Pluto Mission to Carry Piece of SpaceShipOne\". Space.com. December 20, 2005. Archived from the original on December 24, 2010.\n\n\n\t^ Betz, Eric (June 26, 2015). \"Postage for Pluto: A 29-cent stamp pissed off scientists so much they tacked it to New Horizons\". Astronomy. Kalmbach Publishing. Retrieved July 8, 2015.\n\n\n\t^ \"'Not Yet Explored' no more: New Horizons flying Pluto stamp to dwarf planet\". collectSPACE. Robert Pearlman. July 7, 2015. Retrieved July 8, 2015.\n\n\n\t^ \"To Pluto, With Postage\". collectSPACE. October 28, 2008. Archived from the original on December 13, 2010.\n\n\n\t^ \"New Horizons launches on voyage to Pluto and beyond\". spaceFlightNow. January 19, 2006. Archived from the original on June 7, 2011. Retrieved December 1, 2010.\n\n\n\t^ \"To Pluto, with postage: Nine mementos fly with NASA's first mission to the last planet\". collectSPACE. Retrieved October 29, 2013.\n\n\n\t^ \"NASA – A 'State' of Exploration\". Nasa.gov. March 8, 2006. Retrieved October 29, 2013.\n\n\n\t^ \"The Everest of Planetary Exploration: New Horizons Explores The Pluto System 2015\" (PowerPoint Presentation). NASA. Retrieved April 15, 2015.\n\n\n\t^ \"Solar System Exploration – New Horizons\". NASA. February 27, 2015. Retrieved April 15, 2015.\n\n\n\t^ New Horizons: Pluto map shows 'whale' of a feature by Jonathan Amos, on July 8, 2015 (BBC – Science & Environment section)\n\n\t^ \"New Horizons Spacecraft and Instruments\". NASA. November 10, 2014. Retrieved April 15, 2015.\n\n\n\t^ \"New Frontiers Program: New Horizons Science Objectives\". NASA – New Frontiers Program. Archived from the original on April 15, 2015. Retrieved April 15, 2015.\n\n\n\t^ Moore, Patrick (2010). The Sky at Night. Springer. p. 35. ISBN 978-1-4419-6408-3.\n\n\n\t^ Fountain, G. H.;  et al. (2008). \"The New Horizons Spacecraft\". Space Science Reviews. 140 (1–4): 23–47. arXiv:0709.4288. Bibcode:2008SSRv..140...23F. doi:10.1007/s11214-008-9374-8.\n\n\n\t^ \"New Horizons Systems and Components\".\n\n\n\t^ Friederich, Steven (December 16, 2003). \"Argonne Lab is developing battery for NASA missions\". Idaho State Journal. Archived from the original on December 17, 2003.\n\n\n\t^ Betts, Bruce. \"Planetary Radio trivia question at 38m28s\". The Planetary Society. Retrieved August 7, 2015.\n\n\n\t^ \"Pluto Probe Launch Scrubbed for Tuesday\". Fox News. January 18, 2006. Archived from the original on February 23, 2011.\n\n\n\t^ \"Draft Environmental Impact Statement for the New Horizons Mission\" (PDF). Johns Hopkins APL. Archived from the original (PDF) on November 13, 2014. Retrieved May 16, 2014.\n\n\n\t^ \"New Horizons\". jhuapl.edu.\n\n\n\t^ Voica, Alexandru. \"MIPS in space: Inside NASA's New Horizons mission to Pluto\". Imagination.\n\n\n\t^ \"The PI's Perspective: Trip Report\". NASA/Johns Hopkins University/APL/New Horizons Mission. March 27, 2007. Retrieved August 5, 2009.\n\n\n\t^ Los Angeles Times (July 6, 2015). \"Computer glitch doesn't stop New Horizons: Pluto encounter almost a week away\". latimes.com. Retrieved July 13, 2015.\n\n\n\t^ \"Pluto Probe Suffers Glitch 10 Days Before Epic Flyby\". Space.com. Retrieved July 13, 2015.\n\n\n\t^ Brown, Dwayne; Buckley, Michael; Stothoff, Maria (April 14, 2015). \"NASA's New Horizons Nears Historic Encounter with Pluto\". Johns Hopkins University Applied Physics Laboratory. Retrieved March 25, 2018.\n\n\n\t^ Rincon, Paul (July 15, 2015). \"New Horizons: Spacecraft survives Pluto encounter\". BBC.\n\n\n\t^ Y. Guo; R. W. Farquhar (2006). \"Baseline design of New Horizons mission to Pluto and the Kuiper belt\". Acta Astronautica. 58 (10): 550–559. Bibcode:2006AcAau..58..550G. doi:10.1016/j.actaastro.2006.01.012.\n\n\n\t^ M.M. Nieto (2008). \"New Horizons and the onset of the Pioneer anomaly\". Physics Letters B. 659 (3): 483–485. arXiv:0710.5135. Bibcode:2008PhLB..659..483N. doi:10.1016/j.physletb.2007.11.067.\n\n\n\t^ a b c \"About LORRI Images\". The Johns Hopkins University – Applied Physics Laboratory.\n\n\n\t^ Cheng, A. F.;  et al. \"Long-Range Reconnaissance Imager on New Horizons\" (PDF). Archived from the original (PDF) on July 9, 2009.\n\n\n\t^ \"Science Photos: LORRI\". JHUAPL.edu. Archived from the original on April 28, 2015. Retrieved May 2, 2015.\n\n\n\t^ a b c \"New Horizons\". pluto.jhuapl.edu. Archived from the original on May 1, 2018. Retrieved May 1, 2018.\n\n\n\t^ [1]\n\n\t^ David, Leonard (July 11, 2015). \"Meet Ralph, the New Horizons Camera Bringing Pluto into Sharp Focus\". Space News. Retrieved July 16, 2015.\n\n\n\t^ Gipson, Lillian, ed. (June 23, 2017). \"NASA's New Horizons Mission Honors Memory of Engineer Lisa Hardaway\". NASA. Retrieved June 27, 2017.\n\n\n\t^ \"Pluto-Bound, Student-Built Dust Detector Renamed \"Venetia,\" Honoring Girl Who Named Ninth Planet\". The Johns Hopkins University Applied Physics Laboratory.\n\n\n\t^ [2]\n\n\t^ \"Destination: Pluto and Beyond\". YouTube.com. Archived from the original on June 19, 2014.\n\n\n\t^ a b \"NASA'S Pluto Space Probe Begins Launch Preparations\". SpaceDaily. September 27, 2005. Archived from the original on December 31, 2009. Retrieved January 12, 2011.\n\n\n\t^ a b Leary, Warren E. (January 17, 2006). \"Winds Delay Launching for NASA Mission to Pluto\". The New York Times.\n\n\n\t^ a b \"Launch of NASA's Pluto Probe Delayed for 24 Hours\". Space.com. January 17, 2006. Retrieved June 3, 2013.\n\n\n\t^ a b Alexander, Amir (January 19, 2006). \"New Horizons Launched on its Way to Pluto\". The Planetary Society. Archived from the original on March 18, 2012.\n\n\n\t^ a b Harwood, William (January 19, 2006). \"New Horizons launches on voyage to Pluto and beyond\". Spaceflight Now. Archived from the original on November 30, 2010. Retrieved January 12, 2011.\n\n\n\t^ a b \"New Horizons: Mission Overview\" (PDF). International Launch Services. January 2006. Archived from the original (PDF) on September 9, 2016. Retrieved April 21, 2018.\n\n\n\t^ Neufeld, Michael (July 10, 2015). \"First Mission to Pluto: The Difficult Birth of New Horizons\". Smithsonian. Retrieved April 21, 2018.\n\n\n\t^ Granath, Bob (July 2, 2015). \"NASA Met Unprecedented Challenges Sending Spacecraft to Pluto\". NASA. Retrieved April 21, 2018.\n\n\n\t^ Ray, Justin (November 2, 2005). \"Damage prompts booster replacement for Pluto probe\". Spaceflight Now. Archived from the original on April 24, 2011. Retrieved July 31, 2007.\n\n\n\t^ Schuster, Patrick (January 16, 2006). \"Spacecraft will carry memory of Sagamore native\". TribLIVE. Retrieved June 3, 2013.\n\n\n\t^ Stern, Alan (January 31, 2006). \"Our Aim Is True\". The PI's Perspective. Johns Hopkins APL. Archived from the original on October 10, 2014. Retrieved June 11, 2006.\n\n\n\t^ \"New Horizons Adjusts Course Towards Jupiter\". Johns Hopkins APL. March 9, 2006. Archived from the original on November 13, 2014. Retrieved May 29, 2011.\n\n\n\t^ \"Maneuver Puts New Horizons on a Straight Path to Pluto\" (Press release). Johns Hopkins APL. September 27, 2007. Archived from the original on July 25, 2008. Retrieved July 16, 2015.\n\n\n\t^ \"Course Correction Keeps New Horizons on Path to Pluto\" (Press release). Johns Hopkins APL. July 1, 2010. Archived from the original on November 13, 2014. Retrieved July 16, 2015.\n\n\n\t^ Stern, Alan (February 27, 2006). \"Boulder and Baltimore\". The PI's Perspective. Johns Hopkins APL. Archived from the original on September 1, 2006. Retrieved June 11, 2006.\n\n\n\t^ a b Malik, T. (April 7, 2006). \"Pluto-Bound Probe Passes Mars' Orbit\". Space.com. Archived from the original on November 27, 2011. Retrieved January 14, 2011.\n\n\n\t^ \"Outbound for the Frontier, New Horizons Crosses the Orbit of Mars\". Johns Hopkins APL. April 7, 2006. Archived from the original on February 13, 2015.\n\n\n\t^ \"Outbound for the Frontier, NASA New Horizons Crosses the Orbit of Mars\". Pluto Today. SpaceRef Interactive Inc. April 7, 2006. Archived from the original on April 26, 2006. Retrieved February 3, 2013.\n\n\n\t^ Stern, Alan (June 1, 2006). \"A Summer's Crossing of the Asteroid Belt\". The PI's Perspective. Johns Hopkins APL. Archived from the original on November 13, 2014. Retrieved June 20, 2010.\n\n\n\t^ \"JF56 Encounter, Encounter Date June 13, 2006 UT\". Pluto New Horizons Mission, Supporting Observations for 2002. International Astronomical Union. Archived from the original on August 5, 2007. Retrieved June 20, 2010.\n\n\n\t^ \"New Horizons Tracks an Asteroid\". Johns Hopkins APL. June 15, 2006. Archived from the original on November 13, 2014. Retrieved June 20, 2010.\n\n\n\t^ a b K. Beisser (November 28, 2006). \"New Horizons, Not Quite to Jupiter, Makes First Pluto Sighting\". JHU/APL. Archived from the original on November 13, 2014. Retrieved January 13, 2011.\n\n\n\t^ \"Jupiter Ahoy!\". Johns Hopkins APL. September 26, 2006. Archived from the original on September 7, 2008. Retrieved October 27, 2008.\n\n\n\t^ \"Jupiter Encounter Begins\". Johns Hopkins APL. Archived from the original on November 13, 2014. Retrieved December 17, 2013.\n\n\n\t^ a b c d \"Pluto-Bound New Horizons Spacecraft Gets a Boost from Jupiter\". Johns Hopkins APL. February 28, 2007. Archived from the original on November 13, 2014. Retrieved December 17, 2008.\n\n\n\t^ Malik, Tariq (February 28, 2007). \"Pluto probe gets an eyeful in Jupiter flyby\". MSNBC. Archived from the original on November 3, 2012. Retrieved May 29, 2011.\n\n\n\t^ Than, Ker (October 9, 2007). \"Spacecraft Surfs Jupiter's Magnetic Tail\". Space.com. Retrieved December 17, 2013.\n\n\n\t^ \"Capturing Callisto\". Johns Hopkins APL. Archived from the original on November 13, 2014. Retrieved December 17, 2013.\n\n\n\t^ a b c \"New Horizons Slips into Electronic Slumber\". Johns Hopkins APL. 2007. Archived from the original on November 13, 2014. Retrieved December 14, 2013.\n\n\n\t^ New Horizons Earns a Holiday Archived November 13, 2014, at the Wayback Machine JHUAPL December 19, 2008\n\n\t^ New Horizons Checks Out, Enters Hibernation Archived November 13, 2014, at the Wayback Machine JHUAPL August 28, 2009\n\n\t^ New Horizons Commanded into Last Pre-Pluto Slumber Archived November 13, 2014, at the Wayback Machine JHUAPL August 29, 2014\n\n\t^ \"New Horizons Ventures Beyond Saturn's Orbit\". Johns Hopkins APL. 2008. Archived from the original on November 13, 2014. Retrieved December 14, 2013.\n\n\n\t^ \"Later, Uranus: New Horizons Passes Another Planetary Milestone\". Johns Hopkins APL. 2011. Archived from the original on November 13, 2014. Retrieved December 14, 2013.\n\n\n\t^ \"At Pluto, Moons and Debris May Be Hazardous to New Horizons\". Johns Hopkins APL. 2012. Archived from the original on November 13, 2014. Retrieved December 14, 2013.\n\n\n\t^ a b \"New Horizons Team Sticking to Original Flight Plan at Pluto\". Johns Hopkins APL. 2013. Archived from the original on November 13, 2014. Retrieved December 14, 2013.\n\n\n\t^ \"New Horizons Doing Science in Its Sleep\". Johns Hopkins APL. 2012. Archived from the original on November 13, 2014. Retrieved December 14, 2013.\n\n\n\t^ \"New Horizons Gets a New Year's Workout\". Johns Hopkins APL. 2013. Archived from the original on November 13, 2014. Retrieved December 14, 2013.\n\n\n\t^ a b Parker, Alex H.; and 21 co-authors. (2013). \"2011 HM102: Discovery of a High-Inclination L5 Neptune Trojan in the Search for a post-Pluto New Horizons Target\". The Astronomical Journal. 145 (4): 96. arXiv:1210.4549. Bibcode:2013AJ....145...96P. doi:10.1088/0004-6256/145/4/96.\n\n\n\t^ Parker, Alex (April 30, 2013). \"2011 HM102: A new companion for Neptune\". The Planetary Society. Retrieved October 7, 2014.\n\n\n\t^ Atkinson, Nancy (July 10, 2013). \"New Horizons: I Spy Pluto and Charon!\". Universe Today. Retrieved October 7, 2014.\n\n\n\t^ New Horizons Marks a 'Year Out' with a Successful Course Correction Archived November 13, 2014, at the Wayback Machine, New Horizons NASA July 17, 2014\n\n\t^ \"A Moon over Pluto (Close up)\". Johns Hopkins APL. August 7, 2014. Archived from the original on August 26, 2016. Retrieved February 11, 2015.\n\n\n\t^ \"ALMA Pinpoints Pluto to Help Guide New Horizons Spacecraft\". ESO Announcement. Retrieved August 7, 2014.\n\n\n\t^ a b \"NASA New Horizons (@NASANewHorizons) – Twitter\".\n\n\n\t^ a b Nally, Jonathan. \"Ready for a Close Encounter\". Australian Sky & Telescope (83): 14. ISSN 1832-0457.\n\n\n\t^ \"It's Alive! NASA's New Horizons Pluto Probe 'Wakes Up' for Work\". NBC News. December 6, 2014.\n\n\n\t^ \"New Horizons Commanded into Last Pre-Pluto Slumber\". Applied Physics Laboratory. August 29, 2014. Retrieved October 7, 2014.\n\n\n\t^ \"New Horizons Begins First Stages of Pluto Encounter\". Applied Physics Laboratory. January 15, 2015. Retrieved November 5, 2016.\n\n\n\t^ \"Happy Birthday Clyde Tombaugh: New Horizons Returns New Images of Pluto\". Applied Physics Laboratory. February 4, 2015. Retrieved November 5, 2016.\n\n\n\t^ \"The View from New Horizons: A Full Day on Pluto-Charon\". Applied Physics Laboratory. February 12, 2015. Retrieved November 5, 2016.\n\n\n\t^ \"85 Years after Pluto's Discovery, New Horizons Spots Small Moons Orbiting Pluto\". Applied Physics Laboratory. February 18, 2015. Retrieved November 5, 2016.\n\n\n\t^ \"New Horizons Spots Pluto's Faintest Known Moons\". Applied Physics Laboratory. May 12, 2015. Retrieved November 5, 2016.\n\n\n\t^ \"So Far, All Clear: New Horizons Team Completes First Search for Pluto System Hazards\". Applied Physics Laboratory. May 28, 2015. Retrieved November 5, 2016.\n\n\n\t^ a b \"New Horizons to Encounter KBO Ahead of Pluto Flyby\". Americaspace.com. 2012. Retrieved April 22, 2014.\n\n\n\t^ Brown, Dwayne; Buckley, Michael (April 29, 2015). \"NASA's New Horizons Detects Surface Features, Possible Polar Cap on Pluto\". NASA. Retrieved April 30, 2015.\n\n\n\t^ Gipson, Lillian (July 4, 2015). \"New Horizons Team Responds to Spacecraft Anomaly\". NASA. Retrieved July 5, 2015.\n\n\n\t^ Klotz, Irene (July 5, 2015). \"New Horizons space probe suffers glitch on approach to Pluto\". Reuters. Reuters.\n\n\n\t^ a b \"NASA's New Horizons Plans July 7 Return to Normal Science Operations\". NASA.gov. NASA. July 5, 2015.\n\n\n\t^ Feltman, Rachel (July 6, 2015). \"New Horizons computer overload won't hurt the mission to Pluto, NASA says\". The Washington Post.\n\n\n\t^ \"NASA's Three-Billion-Mile Journey to Pluto Reaches Historic Encounter\". Johns Hopkins University Applied Physics Laboratory. July 14, 2015.\n\n\n\t^ Lakdawalla, Emily (July 15, 2015). \"New Horizons \"phones home\" after Pluto flyby\". The Planetary Society.\n\n\n\t^ Phipps, Claire (July 15, 2015). \"Pluto: New Horizons probe makes contact with Earth\". The Guardian.\n\n\n\t^ Jones, Barrie W. (2010). Pluto: Sentinel of the Outer Solar System. Cambridge University Press. p. 189. ISBN 9781139490221. Retrieved May 1, 2018.\n\n\n\t^ \"The New Horizons Kuiper Belt Extended Mission (PDF)\". S.A. Stern, H.A. Weaver, J.R. Spencer, H.A. Elliott, the New Horizons Team. 2018. p. 4. Retrieved January 4, 2019.\n\n\n\t^ Verbiscer, A. J.; Porter, S. B.; Buratti, B. J.; Weaver, H. A.; Spencer, J. R.; Showalter, M. R.; Buie, M. W.; Hofgartner, J. D.; Hicks, M. D.; Ennico-Smith, K.; Olkin, C. B.; Stern, S. A.; Young, L. A.; Cheng, A. (2018). \"Phase Curves of Nix and Hydra from the New Horizons Imaging Cameras\". The Astrophysical Journal. 852 (2): L35. doi:10.3847/2041-8213/aaa486.\n\n\n\t^ \"Last of Pluto's moons – mysterious Kerberos – revealed by New Horizons\". Astronomy.com. October 23, 2015. Retrieved December 6, 2015.\n\n\n\t^ Chang, Kenneth (July 14, 2015). \"NASA's New Horizons Spacecraft Sends Signal From Pluto to Earth\". The New York Times. Retrieved July 14, 2015.\n\n\n\t^ Boyle, Alan (July 14, 2015). \"NASA's New Horizons Probe Phones Home After Historic Pluto Flyby\". NBC News. Retrieved July 14, 2015.\n\n\n\t^ \"How Much Bandwidth Does a Satellite Have | Microwaves | Planet Fox\".\n\n\n\t^ a b Rienzi, Greg (July 17, 2015). \"How exactly does New Horizons send all that data back from Pluto?\". The Hub. Johns Hopkins University. Retrieved July 17, 2015.\n\n\n\t^ Smith-Strickland, Kiona (March 30, 2016). \"New Horizons is Still Only Halfway Through Its Download from Pluto\". Air & Space/Smithsonian. Retrieved November 5, 2016.\n\n\n\t^ Talbert, Tricia, ed. (October 27, 2016). \"New Horizons Returns Last Bits of 2015 Flyby Data to Earth\". NASA. Retrieved October 27, 2016.\n\n\n\t^ a b c \"New Horizons Current Position\". Applied Physics Laboratory. Retrieved November 26, 2018.\n\n\n\t^ a b c Peat, Chris. \"Spacecraft escaping the Solar System\". Heavens-Above. Retrieved November 26, 2018.\n\n\n\t^ a b Wall, Mike (July 1, 2016). \"It's Official! NASA Pluto Probe to Fly by Another Object in 2019\". Space.com. Retrieved July 3, 2016.\n\n\n\t^ a b Wall, Mike (April 25, 2016). \"New Horizons Encore? Pluto Probe's Team Proposes Extension\". Space.com. Retrieved April 27, 2016.\n\n\n\t^ a b Grush, Loren (July 1, 2016). \"NASA extends the New Horizons mission to fly by another small world beyond Pluto\". The Verge. Retrieved September 11, 2016.\n\n\n\t^ Chris Gebhardt (2015). \"New Horizons conducts flyby of Pluto in historic Kuiper Belt encounter\". NASA. Retrieved August 30, 2019.\n\n\n\t^ a b Pluto-bound probe faces crisis (nature.com May 20, 2014)\n\n\t^ \"IceHunters\". Zooniverse. 2011. Archived from the original on May 5, 2014. Retrieved June 27, 2011.\n\n\n\t^ \"IceHunters project complete\". Zooniverse. 2012. Retrieved August 7, 2012.\n\n\n\t^ \"Ice Hunters web site\". Zooniverse.Org. Archived from the original on July 21, 2012. Retrieved July 8, 2011.\n\n\n\t^ \"Citizen Scientists: Discover a New Horizons Flyby Target\". NASA. June 21, 2011. Retrieved August 23, 2011.\n\n\n\t^ Lakdawalla, Emily (June 21, 2011). \"The most exciting citizen science project ever (to me, anyway)\". The Planetary Society. Retrieved August 31, 2011.\n\n\n\t^ \"Confirmed KBOs\". New Horizons Ice Hunters. Zooniverse. Archived from the original on December 11, 2014. Retrieved August 21, 2012.\n\n\n\t^ Witze, Alexandra (May 20, 2014). \"Pluto-Bound Spacecraft Faces Crisis\". Nature. Retrieved May 26, 2014.\n\n\n\t^ \"Hubble recruited to find New Horizons probe post-Pluto target\". nasaspaceflight.com.\n\n\n\t^ Hubble To Lend Pluto Probe Helping Hand in Search for Secondary Target spacenews.com June 25, 2014.\n\n\t^ Brown, Dwayne; Villard, Ray (October 15, 2014). \"RELEASE 14-281 NASA's Hubble Telescope Finds Potential Kuiper Belt Targets for New Horizons Pluto Mission\". NASA. Retrieved October 16, 2014.\n\n\n\t^ a b c d Lakdawalla, Emily (October 15, 2014). \"Finally! New Horizons has a second target\". Planetary Society blog. Planetary Society. Archived from the original on October 15, 2014. Retrieved October 15, 2014.\n\n\n\t^ \"NASA's Hubble Telescope Finds Potential Kuiper Belt Targets for New Horizons Pluto Mission\". press release. Johns Hopkins Applied Physics Laboratory. October 15, 2014. Archived from the original on October 16, 2014. Retrieved October 16, 2014.\n\n\n\t^ Wall, Mike (October 15, 2014). \"Hubble Telescope Spots Post-Pluto Targets for New Horizons Probe\". Space.com. Archived from the original on October 15, 2014. Retrieved October 15, 2014.\n\n\n\t^ Buie, Marc (October 15, 2014). \"New Horizons HST KBO Search Results: Status Report\" (PDF). Space Telescope Science Institute. p. 23.\n\n\n\t^ \"Hubble to Proceed with Full Search for New Horizons Targets\". HubbleSite news release. Space Telescope Science Institute. July 1, 2014. Retrieved October 15, 2014.\n\n\n\t^ Stromberg, Joseph (April 14, 2015). \"NASA's New Horizons probe is visiting Pluto – and just sent back its first color photos\". Vox. Retrieved April 14, 2015.\n\n\n\t^ Corey S. Powell (March 29, 2015). \"Alan Stern on Pluto's Wonders, New Horizons' Lost Twin, and That Whole \"Dwarf Planet\" Thing\". Discover.\n\n\n\t^ http://www.hou.usra.edu/meetings/lpsc2015/pdf/1301.pdf\n\n\t^ Stern, Alan (October 1, 2015). \"New Horizons: A Billion Miles to 2014 MU69\". Sky & Telescope. Retrieved October 7, 2015.\n\n\n\t^ a b c Stockton, Nick (November 4, 2015). \"How NASA Is Steering New Horizons Toward a Tiny Space Rock in the Kuiper Belt\". Wired. Retrieved May 30, 2017.\n\n\n\t^ Gebhardt, Chris (January 3, 2017). \"New Horizons prepares for New Year's Day 2019 Kuiper Belt Object encounter\". NASASpaceFlight.com.\n\n\n\t^ \"NASA's New Horizons Team Selects Potential Kuiper Belt Flyby Target\". Johns Hopkins University Applied Physics Laboratory. August 15, 2015.\n\n\n\t^ McKinnon, Mika (August 28, 2015). \"New Horizons Locks Onto Next Target: Let's Explore the Kuiper Belt!\". io9.\n\n\n\t^ a b Porter, Simon;  et al. (December 11, 2017). Constraints on the Shapes and Rotational States of the Distant New Horizons Kuiper Belt Targets. AGU Fall Meeting. December 11–15, 2017. New Orleans, Louisiana. 1:22:55–1:36:00. P13F-07.\n\n\n\t^ \"New Horizons' catches a wandering Kuiper Belt Object not far off\". Space Daily. December 7, 2015. Retrieved December 19, 2015.\n\n\n\t^ Gough, Evan (June 13, 2016). \"New Horizons Sends Back First Science On Distant Kuiper Belt Object\". Universe Today. Retrieved November 5, 2016.\n\n\n\t^ \"New Horizons Collects First Science on a Post-Pluto Object\". Applied Physics Laboratory. May 18, 2016. Retrieved November 5, 2016.\n\n\n\t^ a b Talbert, Tricia (August 31, 2016). \"New Horizons Spies a Kuiper Belt Companion\". NASA. Retrieved September 12, 2016.\n\n\n\t^ Keeter, Bill, ed. (February 8, 2018). \"New Horizons Captures Record-Breaking Images in the Kuiper Belt\". NASA. Retrieved February 9, 2018.\n\n\n\t^ \"HORIZONS Web-Interface, Ephemeris Type: VECTORS, Target Body: Asteroid (2012 HE85), Coordinate Origin: New Horizons Spacecraft [500@-98], Time Span: Start=2017-12-05, Stop=2017-12-06, Intervals=1\". JPL Horizons On-Line Ephemeris System. Retrieved February 8, 2018.\n\n\n\t^ Chang, Kenneth (December 31, 2018). \"NASA's New Horizons Will Visit Ultima Thule on New Year's Day – The probe that visited Pluto will study a mysterious icy world just after midnight. Ultima Thule will be the most distant object ever visited by a spacecraft\". The New York Times. Retrieved December 31, 2018.\n\n\n\t^ Chang, Kenneth (December 30, 2018). \"A Journey Into the Solar System's Outer Reaches, Seeking New Worlds to Explore\". The New York Times. Retrieved December 30, 2018.\n\n\n\t^ a b Green, Jim (December 12, 2017). \"New Horizons Explores the Kuiper Belt\". 2017 American Geophysical Union (AGU) Fall Meeting in New Orleans: 12–15. Archived from the original on December 13, 2017. Retrieved December 13, 2017.\n\n\n\t^ Stern, Alan (October 1, 2015). \"New Horizons: A Billion Miles to (486958) 2014 MU69\". Sky & Telescope. Retrieved October 3, 2015.\n\n\n\t^ a b Lakdawalla, Emily (September 1, 2015). \"New Horizons extended mission target selected\". The Planetary Society.\n\n\n\t^ \"New Horizons Files Flight Plan for 2019 Flyby\". Johns Hopkins University Applied Physics Laboratory. September 6, 2017.\n\n\n\t^ \"New Horizons Completes Targeting Maneuvers\". Space Daily. November 6, 2015. Retrieved December 19, 2015.\n\n\n\t^ \"On Track: New Horizons Carries Out Third KBO Targeting Maneuver\". Johns Hopkins University Applied Physics Laboratory. October 29, 2015. Retrieved December 19, 2015.\n\n\n\t^ \"New Horizons: Current Position\". Johns Hopkins University Applied Physics Laboratory. June 6, 2018. Archived from the original on June 7, 2018.\n\n\n\t^ Grush, Loren (June 5, 2018). \"NASA's New Horizons probe woke up today to prep for its next deep space flyby\". The Verge. Retrieved June 6, 2018.\n\n\n\t^ \"New Horizons Wakes for Historic Kuiper Belt Flyby\". Johns Hopkins University Applied Physics Laboratory. June 5, 2018. Retrieved June 6, 2018.\n\n\n\t^ a b c Lakdawalla, Emily (January 24, 2018). \"New Horizons prepares for encounter with 2014 MU69\". The Planetary Society. Retrieved January 26, 2018.\n\n\n\t^ a b \"Ultima in View: NASA's New Horizons Makes First Detection of Kuiper Belt Flyby Target\". NASA. August 28, 2018. Retrieved August 28, 2018.\n\n\n\t^ \"JPL Horizons\". JPL. Retrieved August 28, 2018.\n\n\n\t^ New Horizons: Ultima Thule is Dead Ahead. Allan Stern, Sky and Telescope. December 26, 2018.\n\n\t^ a b Clark, Stephen (January 6, 2018). \"Plot thickens as New Horizons moves within year of next flyby\". Spaceflight Now. Retrieved January 11, 2018.\n\n\n\t^ \"Maneuver Moves New Horizons Spacecraft toward Next Potential Target\". October 23, 2015. Retrieved November 5, 2015.\n\n\n\t^ \"New Horizons Successfully Explores Ultima Thule\". Johns Hopkins Applied Physics Laboratory. January 1, 2019.\n\n\n\t^ \"New Horizons Data Collection\". Johns Hopkins Applied Physics Center. Retrieved January 1, 2019.\n\n\n\t^ Lakdawalla, Emily (December 17, 2018). \"What to Expect When New Horizons Visits 2014 MU69, Ultima Thule, And When We Will Get Pictures\". planetary.org. Retrieved December 27, 2018.\n\n\n\t^ \"New Horizons May Make Yet Another Flyby After Ultima Thule\". December 21, 2018. Retrieved January 2, 2019.\n\n\n\t^ \"New Horizons planning additional extended missions\". SpaceNews.com. September 11, 2017. Retrieved January 1, 2019.\n\n\n\t^ Stern, Alan. \"Hi, I am Alan Stern, head of NASA's New Horizons spacecraft on its way to explore Ultima Thule, a Kuiper Belt object one billion miles beyond Pluto! AMA\".\n\n\n\t^ Koren, Marina (February 13, 2018). \"Astronomers Are Already Planning for the Next 'Pale Blue Dot'\". The Atlantic. Retrieved January 1, 2019.\n\n\n\t^ a b \"New Horizons Salutes Voyager\". Johns Hopkins APL. August 17, 2006. Archived from the original on November 13, 2014. Retrieved November 3, 2009.\n\n\n\t^ a b Malik, Tariq (January 26, 2006). \"Derelict Booster to Beat Pluto Probe to Jupiter\". Space.com. Archived from the original on August 23, 2010. Retrieved September 22, 2006.\n\n\n\t^ Stern, Alan; Guo, Yanping (October 28, 2010). \"Where Is the New Horizons Centaur Stage?\". Applied Physics Laboratory.\n\n\n\t^ Hollingum, Ben (October 30, 2018). \"NASA probe breaks speed records as it tops 150,000 mph on way to the Sun\". Guinness World Records. Retrieved November 1, 2018.\n\n\n\t^ a b c Stern, Alan (2008). \"The New Horizons Pluto Kuiper belt Mission: An Overview with Historical Context\" (PDF). Space Science Reviews. 140 (1–4): 3–21. arXiv:0709.4417. Bibcode:2008SSRv..140....3S. doi:10.1007/s11214-007-9295-y. Archived (PDF) from the original on September 23, 2015. Retrieved May 20, 2015.\n\n\n\t^ Stern, S. Alan (May 9, 2005). \"New Horizons indeed\". The Space Review.\n\n\n\t^ Savage, D. (November 29, 2001). \"NASA Selects Pluto-Kuiper Belt Mission For Phase B Study\". NASA. Archived from the original on March 8, 2011. Retrieved January 12, 2011.\n\n\n\t^ \"Cuts threaten mission to Pluto\". Retrieved May 13, 2015.\n\n\n\t^ \"The Planetary Society\". Retrieved May 13, 2015.\n\n\n\t^ Buckley, Michael; Brown, Dwayne; Diller, George (September 26, 2005). \"APL-Built Pluto Spacecraft Begins Launch Preparations\" (Press release). Johns Hopkins University Applied Physics Laboratory. Archived from the original on January 15, 2015. Retrieved August 30, 2014.\n\n\n\t^ Granath, Bob (June 30, 2015). \"NASA Met Unprecedented Challenges Sending Spacecraft to Pluto\". NASA. Retrieved May 1, 2018.\n\n\n\t^ Leonard, David (September 1, 2005). \"New Horizons Pluto Probe Readied For Launch\".\n\n\n\t^ Cooper, Ben (January 2006). \"New Horizons Rollout\". Launch Photography. Retrieved July 5, 2015.\n\n\n\t^ Malik, Tariq. \"Power Outage Delays Launch of NASA's Pluto Probe\". Space.com. Retrieved May 12, 2015.\n\n\n\t^ \"Distance between Mars and Earth on April 7, 2006\".\n\n\n\t^ Olkin, Catherine B.; Reuter; Lunsford; Binzel;  et al. (2006). \"The New Horizons Distant Flyby of Asteroid 2002 JF56\". Bulletin of the American Astronomical Society. 38: 597. Bibcode:2006DPS....38.5922O.\n\n\n\t^ \"New Horizons Jupiter Encounter Timeline\". The Planetary Society. Retrieved October 24, 2014.\n\n\n\t^ a b \"Mission Timeline\". Johns Hopkins APL. Archived from the original on July 23, 2008. Retrieved August 1, 2012.\n\n\n\t^ \"Distance between Saturn and Earth on June 8, 2008\". Retrieved March 14, 2011.\n\n\n\t^ Villard, R. (December 29, 2009). \"New Horizons Crosses Halfway Point to Pluto\". Discovery Communications, LLC. Archived from the original on December 25, 2010. Retrieved January 12, 2011.\n\n\n\t^ \"Distance between Pluto and Earth on December 29, 2009\". Retrieved March 14, 2011.\n\n\n\t^ \"New Horizon properties on December 29, 2009\". Retrieved March 14, 2011.\n\n\n\t^ \"Spacecraft Hits Midpoint on Flight to Pluto\". Space.com. February 26, 2010. Retrieved August 11, 2011.\n\n\n\t^ \"Space Spin – New Horizons ventures beyond Saturn's orbit\". June 9, 2008. Archived from the original on July 23, 2011. Retrieved March 14, 2011.\n\n\n\t^ SPACE.com Staff (March 18, 2011). \"NASA Pluto Probe Passes Orbit of Uranus\". SPACE.com. Retrieved March 19, 2011.\n\n\n\t^ \"Twitter.com – NewHorizons2015\".\n\n\n\t^ a b \"New Horizons on Approach: 22 AU Down, Just 10 to Go\". JHU/APL. February 10, 2012. Archived from the original on November 13, 2014. Retrieved March 22, 2012.\n\n\n\t^ Plait, Phil (July 11, 2013). \"New Horizons Gets a First Glimpse of Pluto's Moon Charon\". Slate.\n\n\n\t^ \"Charon Revealed! New Horizons Camera Spots Pluto's Largest Moon\". New Horizons; Headlines. The Johns Hopkins University Applied Physics Laboratory. July 10, 2013. Archived from the original on December 8, 2013.\n\n\n\t^ \"On the Path to Pluto, 5 AU and Closing\". New Horizons; Headlines. The Johns Hopkins University Applied Physics Laboratory. October 25, 2013. Archived from the original on November 13, 2014.\n\n\n\t^ \"New Horizons Spies Charon Orbiting Pluto\". Johns Hopkins APL. Archived from the original on August 8, 2014.\n\n\n\t^ \"Passing the Planets\". Johns Hopkins APL. March 18, 2011. Archived from the original on July 14, 2014. Retrieved April 3, 2012.\n\n\n\t^ NewHorizons2015. \"About the Jan 21o5 KBO, It's VNH0004\". Retrieved August 21, 2012.\n Buie, Marc W. \"Orbit Fit and Astrometric record for VNH0004\". User pages. Southwest Research Institute Planetary Science Directorate. Retrieved August 21, 2012.\n\n\n\t^ Brown, Dwayne; Buckley, Michael; Stothoff, Maria (January 15, 2015). \"January 15, 2015 Release 15-011 – NASA's New Horizons Spacecraft Begins First Stages of Pluto Encounter\". NASA. Retrieved January 15, 2015.\n\n\n\t^ \"New Frontier News\". December 6, 2014. Archived from the original on January 8, 2015. Retrieved January 8, 2015.\n\n\n\t^ \"New Horizons\". jhuapl.edu. Retrieved July 13, 2015.\n\n\n\t^ \"pluto-update\". ourpluto.org. Archived from the original on April 23, 2016. Retrieved July 13, 2015.\n\n\n\t^ \"Countdown to Pluto Encounter!\". seeplutonow.com. Retrieved July 13, 2015.\n\n\n\t^ \"New Horizons Pluto Flyby Press Kit\" (PDF). July 2, 2015. Retrieved July 4, 2015.\n\n\n\t^ Szondy, David (September 7, 2015). \"New Horizons begins massive 'treasure trove' data downlink\". Gizmag. Retrieved February 28, 2016.\n\n\n\t^ Lakdawalla, Emily (September 10, 2015). \"Pretty Pictures: Downlink of the Full New Horizons Data Set Has Begun\". The Planetary Society. Retrieved February 28, 2016.\n\n\n\t^ Talbert, Tricia (September 10, 2015). \"New Pluto Images from NASA's New Horizons: It's Complicated\". NASA. Retrieved February 28, 2016.\n\n\n\t^ Gebhardt, Chris (January 3, 2017). \"New Horizons prepares for New Year's Day 2019 Kuiper Belt Object encounter\". NASASpaceflight.com. Retrieved May 30, 2017.\n\n\n\t^ \"A Distant Close-up: New Horizons' Camera Captures a Wandering Kuiper Belt Object\". New Horizons. NASA/JHUAPL. December 4, 2015. Retrieved July 23, 2016.\n\n\n\t^ Talbert, Tricia (August 31, 2016). \"New Horizons Spies a Kuiper Belt Companion\". NASA. Retrieved July 16, 2017.\n\n\n\t^ Talbert, Tricia (February 1, 2017). \"New Horizons Refines Course for Next Flyby\". NASA. Retrieved May 30, 2017.\n\n\n\t^ Stern, Alan (August 2015). \"OPAG: We Did It!\" (PDF). Presentation to the Outer Planets Assessment Group (OPAG) of the Lunar and Planetary Institute. Universities Space Research Association. pp. 32, 35.\n\n\n\t^ \"Why Go to Pluto?\". Johns Hopkins APL. Retrieved December 5, 2015.\n\n\n\t^ a b c d e f g h Lakdawalla, Emily (January 24, 2018). \"New Horizons prepares for encounter with 2014 MU69\". Planetary Society.\n\n\n\t^ \"New Horizons Corrects Its Course in the Kuiper Belt\". December 9, 2017.\n\n\n\t^ Kornfeld, Laurel (December 24, 2017). \"New Horizons put in final hibernation before 2019 KBO flyby\". Spaceflight Insider. Retrieved January 11, 2018.\n\n\n\t^ Clark, Stephen (September 21, 2017). \"Scientists firm up flyby plan for New Horizons's next destination\". Spaceflight Now.\n\n\n\t^ a b Wall, Mike (December 21, 2018). \"New Horizons May Make Yet Another Flyby After Ultima Thule\". space.com.\n\n\n\t^ New Horizons: Nasa waits for signal from Ultima Thule probe. Jonathan Amos, BBC News. January 1, 2019.\n\n\t^ NASA (July 20, 2011). \"New Horizons\". NASA Solar System Exploration. National Aeronautics and Space Administration. Archived from the original on October 26, 2003. Retrieved February 21, 2012.\n\n\n\n\n\nFurther reading[edit]\n\n\tGuo, Yanping; Farquhar, Robert W. (February 2005). \"New Horizons Pluto–Kuiper Belt mission: design and simulation of the Pluto–Charon encounter\" (PDF). Acta Astronautica. 56 (3): 421–429. Bibcode:2005AcAau..56..421G. doi:10.1016/j.actaastro.2004.05.076.\n\n\tNeufeld, Michael J. (November 2012). \"First Mission to Pluto: Policy, Politics, Science, and Technology in the Origins of New Horizons, 1989–2003\" (PDF). Historical Studies in the Natural Sciences. 44 (3): 234–276. doi:10.1525/hsns.2014.44.3.234. Archived from the original (PDF) on September 7, 2015.\n\n\tRussell, Christopher T. (2009). New Horizons: Reconnaissance of the Pluto-Charon System and the Kuiper Belt. Springer. ISBN 978-0-387-89517-8.\n\n\tStern, Alan; Grinspoon, David (2018). Chasing New Horizons: Inside the Epic First Mission to Pluto. Picador. ISBN 978-125009896-2.\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to New Horizons.\n\n\n\t\tWikiquote has quotations related to: New Horizons\n\n\n\tNew Horizons website by NASA\n\tNew Horizons website by the Applied Physics Laboratory\n\tNew Horizons profile by NASA's Planetary Science Division\n\tNew Horizons profile by the National Space Science Data Center\n\tNew Horizons Flyby of Ultima Thule – Best Places to Follow Future News.\n\tNew Horizons Flyby – Musical Tribute by astrophysicist Brian May (who consulted on the project[1]) and the band Queen.\n\tNew Horizons Mission Archive at the NASA Planetary Data System, Small Bodies Node\n\tNew Horizons: Kuiper Belt Extended Mission (KEM) Mission Archive at the NASA Planetary Data System, Small Bodies Node\n\n\n\t\tv\n\tt\n\te\n\n\nNew Horizons\n\n\t\tExploration of Pluto\n\tList of New Horizons topics\n\tNew Frontiers program\n\n\n\n\n\tTargets\t\n\tFlybys\t\n\t132524 APL\n\tJupiter\n\tPluto\n\t(486958) 2014 MU69\n\n\n\n\n\tObservations\t\n\tNeptune\n\t2011 KW48\n\t15810 Arawn\n\t50000 Quaoar\n\n\n\n\n\tRejected\t\n\t2011 HM102\n\t2014 MT69\n\t2014 OS393\n\t2014 PN70\n\n\n\n\n\n\n\t\n\n\tSpacecraft\t\n\tInstruments\t\n\tAlice\n\tLong Range Reconnaissance Imager\n\tPEPSSI\n\tRalph\n\tREX\n\tVenetia Burney Student Dust Counter\n\tSWAP\n\n\n\n\n\tSubsystems\t\n\tGPHS-RTG\n\n\n\n\n\n\n\n\tPersonnel\t\n\tInstitutions\t\n\tApplied Physics Laboratory\n\tBall Aerospace\n\tGoddard Space Flight Center\n\tJet Propulsion Laboratory\n\tKinetX\n\tSouthwest Research Institute\n\tStanford University\n\tUniversity of Colorado\n\n\n\n\n\tPeople\t\n\tFrances Bagenal\n\tRichard Binzel\n\tAlice Bowman\n\tMarc Buie\n\tLisa Hardaway\n\tBrian May\n\tCathy Olkin\n\tDaniel Sarokon\n\tMark Showalter\n\tAlan Stern\n\tHal Weaver\n\n\n\n\n\n\n\n\tLogistics\t\n\tAtlas V (launch vehicle)\n\tCentaur (upper stage)\n\tStar 48B (3rd stage)\n\tCape Canaveral Air Force Station Space Launch Complex 41 (launch site)\n\tDeep Space Network\n\n\n\n\n\tRelated\t\n\tHubble Space Telescope\n\tKuiper belt\n\tNew Horizons 2\n\tPluto Kuiper Express\n\n\n\n\n\t Category\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nPluto\n\n\tGeography\n(features)\t\n\tRegions\t\n\t\"Brass Knuckles\"\n\tKrun\n\tAla\n\tBalrog\n\tVucub-Came\n\tHun-Came\n\tMeng-p'o\n\n\n\tCadejo\n\tCthulhu\n\tHayabusa\n\tLowell\n\tMorgoth\n\tPioneer\n\tTombaugh \"The Heart\"\n\tVenera\n\tViking\n\tVoyager\n\n\n\n\n\tMountains\t\n\tChallenger Colles\n\tColeta de Dados Colles\n\tHillary Montes\n\tTenzing Montes\n\n\n\n\n\tPlains\t\n\tSputnik Planitia\n\n\n\n\n\tValleys and\ndepressions\t\n\tQuidlivun Cavus\n\n\n\n\n\tLineae\t\n\tLuna Linea\n\n\n\n\n\tGeneral\t\n\tAtmosphere\n\tGeology\n\n\n\n\n\n\n\t\n\n\n\n\tMoons\t\n\tCharon\n(features)\t\n\tRegions\t\n\tGallifrey\n\tMordor\n\tVulcan\n\n\n\n\n\tMountains\t\n\tKubrick Mons\n\n\n\n\n\tChasms\t\n\tNostromo Chasma\n\n\n\n\n\tCraters\t\n\tKirk Crater\n\tRipley Crater\n\tVader Crater\n\n\n\n\n\tGeology\t\n\tGeology\n\n\n\n\n\n\n\n\tOther moons\t\n\tStyx\n\tNix\n\tKerberos\n\tHydra\n\n\n\n\n\n\n\n\tAstronomy\t\n\tDefinition\t\n\tAlan Stern\n\tDefinition of planet\n\tDouble planet\n\tDwarf planet\n\tIAU definition of planet\n\tInternational Astronomical Union\n\tMichael E. Brown\n\tNeil deGrasse Tyson\n\tPlanet\n\tPlutino\n\tPlutoid\n\tTrans-Neptunian object\n\n\n\n\n\tDiscovery\t\n\tClyde Tombaugh\n\tJames W. Christy\n\tLowell Observatory\n\tPercival Lowell\n\tPlanet X\n\tRoger Putnam\n\n\n\n\n\tEclipses\t\n\tSolar eclipses on Pluto\n\n\n\n\n\tGeneral\t\n\tKuiper belt\n\n\n\n\n\n\n\n\tExploration\t\n\tCurrent\t\n\tHubble Space Telescope\n\n\n\n\n\tFormer\t\n\tNew Horizons\n\n\n\n\n\tCancelled\t\n\tPluto Fast Flyby/Pluto Kuiper Express\n\tMariner Mark II\n\n\n\n\n\tOld proposals\t\n\tVoyager 1\n\tTAU\n\n\n\n\n\n\n\n\tRelated\t\n\tVenetia Burney\n\tPluto in fiction\n\tMythology\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nGanymede\n\n\tGeology\t\n\tLists\t\n\tList of geological features on Ganymede\n\tList of quadrangles on Ganymede\n\tList of craters on Ganymede\n\n\n\n\n\tImpact craters\t\n\tAchelous\n\tEl\n\tGula\n\tKhensu\n\tKittu\n\tNeith\n\tNergal\n\n\n\n\n\tRegions\t\n\tGalileo Regio\n\n\n\n\n\tSulci\t\n\tUruk Sulcus\n\n\n\n\n\tFaculae\t\n\tMemphis Facula\n\n\n\n\n\tCatenae\t\n\tEnki Catena\n\n\n\n\n\n\n\t\n\n\tExploration\t\n\tPast\t\n\tPioneer 10\n\tPioneer 11\n\tVoyager 1\n\tVoyager 2\n\tGalileo\n\tCassini–Huygens\n\tNew Horizons\n\n\n\n\n\tPlanned\t\n\tJupiter Icy Moons Explorer (2022)\n\n\n\n\n\tProposed\t\n\tLaplace-P\n\n\n\n\n\tCancelled\t\n\tJupiter Ganymede Orbiter\n\tJupiter Icy Moons Orbiter\n\n\n\n\n\n\n\n\tOther\t\n\tGanymede in fiction\n\tLife\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nIo\n\n\tMain articles\t\n\tIo\n\tVolcanology of Io\n\tExploration of Io\n\n\n\n\t\n\n\tGeology\t\n\tLists\t\n\tRegions\n\tMountains\n\tVolcanic Features\n\tQuadrangles\n\n\n\n\n\tPaterae\t\n\tAh Peku\n\tAmaterasu\n\tAsha\n\tBabbar\n\tDazhbog\n\tEstan\n\tFuchi\n\tGish Bar\n\tKami-Nari\n\tKinich Ahau\n\tLoki\n\tManua\n\tMaui\n\tMithra\n\tMonan\n\tPillan\n\tPrometheus\n\tPyerun\n\tReiden\n\tShango\n\tSvarog\n\tTawhaki\n\tThomagata\n\tTupan\n\tTvashtar\n\tViracocha\n\n\n\n\n\tMountains\t\n\tEgypt\n\tEuboea\n\tSilpium\n\tTohil\n\n\n\n\n\tLava flows\nor channels\t\n\tTawhaki\n\n\n\n\n\tVolcanoes\t\n\tAmirani\n\tMasubi\n\tPele\n\tPrometheus\n\tSurt\n\tThor\n\tZamama\n\n\n\n\n\tFluctūs\t\n\tKanehekili Fluctus\n\n\n\n\n\tPlains\n and plateaus\t\n\tDanube Planum\n\n\n\n\n\n\n\n\tExploration\t\n\tPast\t\n\tPioneer program\n\tPioneer 10\n\tPioneer 11\n\n\n\tVoyager program\n\tVoyager 1\n\tVoyager 2\n\n\n\tGalileo\n\tCassini\n\tNew Horizons\n\n\n\n\n\tProposed\t\n\tFIRE\n\tIo Volcano Observer\n\n\n\n\n\tCancelled/\nConcepts\t\n\tJupiter Icy Moons Orbiter\n\tJupiter Magnetospheric Orbiter\n\n\n\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nEuropa\n\n\tGeology\t\n\tChaotic\nterrain\t\n\tConamara Chaos\n\n\n\n\n\tCraters\t\n\tPwyll\n\tCilix\n\n\n\n\n\tLists\t\n\tList of lineae on Europa\n\tList of geological features on Europa\n\tList of craters on Europa\n\n\n\n\n\n\n\t\n\n\tExploration\t\n\tPast\t\n\tPioneer 10\n\tPioneer 11\n\tVoyager 1\n\tVoyager 2\n\tGalileo\n\tCassini–Huygens\n\tNew Horizons\n\n\n\n\n\tPlanned\t\n\tJupiter Icy Moons Explorer (2022)\n\tEuropa Clipper (2025)\n\n\n\n\n\tCancelled/\nConcepts\t\n\tJupiter Europa Orbiter\n\tEuropa Lander\n\tEuropa Orbiter\n\tJupiter Icy Moons Orbiter\n\tJovian Europa Orbiter\n\tEuropa Lander (rerouted to Ganymede as Laplace-P)\n\n\n\n\n\n\n\n\tOther\t\n\tColonization of Europa\n\tLife\n\tEuropa in fiction\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nCallisto\n\n\tGeology\t\n\tLists\t\n\tList of geological features on Callisto\n\tList of craters on Callisto\n\n\n\n\n\tCraters\t\n\tAdlinda\n\tArcas\n\tAsgard\n\tBurr\n\tDoh\n\tNjord\n\tOmol'\n\tTornarsuk\n\tUtgard\n\n\n\tHár\n\tJalkr\n\tKeelut\n\tLofn\n\tTindr\n\tValhalla\n\tEgdir\n\tMimir\n\n\n\n\n\n\n\tCatenae\t\n\tGomul Catena\n\n\n\n\n\n\n\t\n\n\tExploration\t\n\tPast\t\n\tPioneer 10\n\tPioneer 11\n\tVoyager 1\n\tVoyager 2\n\tGalileo\n\tCassini–Huygens\n\tNew Horizons\n\n\n\n\n\tFuture\t\n\tJupiter Icy Moons Explorer (2022)\n\n\n\n\n\tCancelled\t\n\tJupiter Icy Moons Orbiter\n\tJupiter Magnetospheric Orbiter\n\n\n\n\n\tProposed manned\t\n\tColonization\n\n\n\n\n\n\n\n\tOther\t\n\tCallisto in fiction\n\tGalilean moons\n\tLife\n\tMoons of Jupiter\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNASA Planetary Missions Program Office\n\n\t\n\tDiscovery program\n\n\t\n\tMissions\t\n\tMain\t\n\tNEAR Shoemaker\n\tMars Pathfinder\n\tLunar Prospector\n\tStardust\n\tGenesis\n\tCONTOUR†\n\tMESSENGER\n\tDeep Impact\n\tDawn\n\tKepler\n\tGRAIL\n\tInSight\n\tLucy\n\tPsyche\n\n\n\n\n\tOpportunity - instruments\t\n\tASPERA-3 (on Mars Express)\n\tMoon Mineralogy Mapper (on Chandrayaan-1)\n\tStrofio (on BepiColombo MPO)\n\n\n\n\n\tOpportunity - retasking\t\n\tEPOXI\n\tNExT\n\n\n\n\n\n\n\t\n\n\tProposals\t\n\tFinalists\t\n\tMission 12\n\tComet Hopper\n\tTitan Mare Explorer\n\n\n\tMission 13 and 14\n\tDAVINCI\n\tNEOCam\n\tVERITAS\n\n\n\n\n\n\n\tCandidates\t\n\tEnceladus Life Finder\n\tIcebreaker Life\n\tIo Volcano Observer\n\tISOCHRON\n\tJET\n\tLIFE\n\tMANTIS\n\tMars Geyser Hopper\n\tMoon Diver\n\tPADME\n\tPhobos Surveyor\n\tTrident\n\tWhipple\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tNew Frontiers program\n\n\t\n\tMissions\t\n\tMain\t\n\tNew Horizons\n\tJuno\n\tOSIRIS-REx\n\tDragonfly\n\n\n\n\n\n\n\t\n\n\tProposals\t\n\tFinalists\t\n\tMission 2\n\tMoonRise\n\n\n\tMission 3\n\tMoonRise\n\tVISAGE\n\n\n\tMission 4\n\tCAESAR\n\n\n\n\n\n\n\tCandidates\t\n\tCONDOR\n\tCORSAIR\n\tELF\n\tELSAH\n\tOceanus (Titan orbiter)\n\tSPRITE\n\tVICI\n\tVOX\n\n\n\n\n\tConcepts\t\n\tCamilla\n\tFIRE\n\tIo Volcano Observer\n\tNew Horizons 2\n\tOceanus (Uranus orbiter)\n\tSaturn Atmospheric Entry Probe\n\tTHEO\n\tVenus In Situ Explorer\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tSolar System Exploration program\n\n\t\n\tMissions\t\n\tMain\t\n\tDART\n\tEuropa Clipper\n\n\n\n\n\tOpportunity - instruments\t\n\tUVS (on JUICE)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tGreen titles indicates active current missions\n\tItalics indicate missions yet to launch\n\tSymbol † indicates failure en route or before intended mission data returned\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft missions to minor planets and comets\n\n\t\n\tList of minor planets and comets visited by spacecraft\n\n\n\n\n\tFlybys\t\n\tCassini–Huygens\n\tChang'e 2\n\tClementine†\n\tCONTOUR†\n\tDeep Impact\n\tEPOXI\n\n\n\tDeep Space 1\n\tGalileo\n\tHalley Armada\n\tGiotto\n\tSakigake\n\tSuisei\n\tVega 1\n\tVega 2\n\n\n\tInternational Cometary Explorer\n\tNEAR Shoemaker\n\tNew Horizons\n\tPioneer 7\n\tPROCYON†\n\tRosetta\n\tStardust/NExT\n\tUlysses\n\n\n\n\t\n\n\n\n\n\tOrbiters\t\n\tDawn\n\tHayabusa\n\tHayabusa2\n\tNEAR Shoemaker\n\tOSIRIS-REx\n\tRosetta\n\tTimeline\n\n\n\n\n\n\n\tLanders\t\n\tHayabusa\n\tMINERVA†\n\n\n\tHayabusa2\n\tHIBOU\n\tMASCOT\n\tMINERVA-II 2\n\tOWL\n\n\n\tNEAR Shoemaker\n\tPhilae\n\n\n\n\n\tImpactors\t\n\tDeep Impact\n\n\n\n\n\tSample return\t\n\tHayabusa\n\tHayabusa2\n\tOSIRIS-REx\n\tStardust\n\n\n\n\n\tPlanned\t\n\tNEA Scout (flyby, 2020)\n\tASTER (orbiter, 2021)\n\tLucy (multiple flybys, 2021)\n\tDART (impactor, 2021)\n\tDESTINY+ (multiple flybys, 2022)\n\tPsyche (orbiter, 2022)\n\tComet Interceptor (flyby, 2028)\n\n\n\n\n\tProposed\t\n\tHera (orbiter and landers, 2023)\n\tAthena (flyby of Pallas)\n\tCAESAR (sample return, 2024)\n\tZhengHe (multiple flybys and sample return, 2024)\n\tHAMMER (nuclear impactor concept)\n\tOKEANOS (multiple flybys and sample return, 2026)\n\n\n\n\n\tCancelled or \nnot developed\t\n\tAGORA\n\tAIM\n\tAsteroid Redirect Mission\n\tCastalia\n\tClementine 2\n\tComet Hopper\n\tCONDOR\n\tCORSAIR\n\tCRAF\n\tDon Quijote\n\tHayabusa Mk2\n\tMAOSEP\n\tMarco Polo\n\tNew Horizons 2\n\tVesta\n\n\n\n\n\tRelated\t\n\tAsteroid belt\n\tAsteroid capture\n\tAsteroid mining\n\tColonization of asteroids\n\tCeres\n\tColonization\n\n\n\tList of artificial objects on extra-terrestrial surfaces\n\tPluto\n\tExploration\n\n\n\tSmall Solar System bodies\n\tNear-Earth object\n\tTrans-Neptunian object\n\tColonization\n\n\n\tTrojan\n\n\n\tVesta\n\n\n\n\n\t\n\tProbes are listed in chronological order of launch. Italics indicate currently active missions. † indicates mission failures.\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft missions to Jupiter\n\n\tFlybys\t\n\tPioneer program\n\tPioneer 10\n\t11\n\n\n\tVoyager program\n\tVoyager 1\n\t2\n\n\n\tUlysses\n\tCassini–Huygens\n\tNew Horizons\n\n\n\n\t\n\n\tOrbiters\t\n\tGalileo\n\tJuno (active)\n\n\n\n\n\tAtmospheric probes\t\n\tGalileo Probe\n\n\n\n\n\tPlanned missions\t\n\tJupiter Icy Moons Explorer (JUICE) (2022)\n\tEuropa Clipper (2023)\n\n\n\n\n\tProposed missions\t\n\tIo Volcano Observer (2021)\n\tLaplace-P (2023)\n\tEuropa Lander (2024)\n\tFIRE (2024)\n\tOKEANOS (2027)\n\tSmara (2030)\n\n\n\n\n\tCancelled / Concepts\t\n\tArgo (proposed)\n\tEuropa Jupiter System Mission-Laplace\n\tJupiter Europa Orbiter\n\tJupiter Ganymede Orbiter\n\tJupiter Magnetospheric Orbiter\n\n\n\tEuropa Orbiter\n\tInnovative Interstellar Explorer\n\tJovian Europa Orbiter\n\tJupiter Icy Moons Orbiter\n\tNeptune Orbiter\n\tNew Horizons 2\n\tPioneer H\n\tTsiolkovsky mission\n\n\n\n\n\tRelated topics\t\n\tExploration of Jupiter\n\tAtmosphere of Jupiter\n\tMagnetosphere of Jupiter\n\tMoons of Jupiter\n\tIo\n\tExploration\n\n\n\tEuropa\n\tColonization\n\n\n\tGanymede\n\tCallisto\n\n\n\tRings of Jupiter\n\tDeep Space Network\n\tMissions to the outer planets\n\tColonization of the outer Solar System\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nJupiter\n\n\t\n\tOutline of Jupiter\n\n\n\n\n\tGeography\t\n\tAtmosphere\n\tGreat Red Spot\n\n\n\tMagnetosphere\n\tRings\n\n\n\n\t\n\n\tMoons\t\n\tInner moons\t\n\tAdrastea\n\tAmalthea\n\tMetis\n\tThebe\n\n\n\n\n\tGalilean moons\t\n\tCallisto\n\tEuropa\n\tGanymede\n\tIo\n\n\n\n\n\tIrregular moons\t\n\tAnanke group\n\tCarme group\n\tHimalia group\n\tPasiphae group\n\n\n\n\n\tUngrouped moons\t\n\tCarpo\n\tThemisto\n\tValetudo\n\n\n\n\n\n\n\n\tAstronomy\t\n\tGeneral\t\n\tJupiter-crossing minor planets\n\tSolar eclipses\n\n\n\n\n\tTrojans\t\n\tGreek camp\n\tTrojan camp\n\n\n\n\n\tImpact events\t\n\tComet Shoemaker–Levy 9\n\t2009 Jupiter impact event\n\t2010 Jupiter impact event\n\n\n\n\n\n\n\n\tExploration and\norbiting missions\t\n\tCurrent\t\n\tJuno\n\n\n\n\n\tPast\t\n\tCassini\n\tGalileo\n\tNew Horizons\n\tPioneer program\n\tPioneer 10\n\tPioneer 11\n\n\n\tUlysses\n\tVoyager program\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\n\n\tFuture\t\n\tJupiter Icy Moons Explorer (2022)\n\tEuropa Clipper (2025)\n\n\n\n\n\tProposed\t\n\tIo Volcano Observer (2021)\n\tLaplace-P (2023)\n\tSmara (2030)\n\n\n\n\n\n\n\n\tRelated\t\n\tFiction\n\tJovian\n\tMoons\n\n\n\tMythology\n\n\n\n\n\t\n\t Book\n\t Category\n\t Solar System portal\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nPlanetary defense\n\n\tMain topics\t\n\tAsteroid\n\tBolide\n\tEarth-grazing fireball\n\tImpact event\n\tList of meteor air bursts\n\n\n\tMeteor procession\n\tMeteor shower\n\tMeteorite\n\tMeteoroid\n\tNear-Earth object\n\tPotentially hazardous object\n\n\n\n\n\tDefense\t\n\tAsteroid impact avoidance\n\tAsteroid laser ablation\n\tGravity tractor\n\tIon-beam shepherd\n\n\n\tAsteroid close approaches\n\tEarth-crossing minor planets\n\tDamage scales\n\tPalermo scale\n\tTorino scale\n\n\n\n\n\n\n\tSpace probes\t\n\tDawn\n\tDeep Impact\n\tAIDA\n\tHera\n\tDART\n\n\n\tHalley Armada\n\tHayabusa\n\tHayabusa2\n\tMASCOT\n\n\n\tNEAR Shoemaker\n\tNEA Scout\n\tNew Horizons\n\tOSIRIS-REx\n\tPROCYON\n\tRosetta\n\tPhilae\n\n\n\tStardust\n\n\n\n\n\tNEO tracking\t\n\tATLAS\n\tCatalina Sky Survey\n\tLINEAR\n\tLONEOS\n\tNEAT\n\tNEOSSat\n\tNEOCam\n\tNEODyS\n\tOGS Telescope\n\tOrbit@home\n\tPan-STARRS\n\tSCAP\n\tSentinel Space Telescope\n\tSentry\n\tSpacewatch\n\tWISE\n\n\n\n\n\tOrganizations\t\n\tB612 Foundation\n\tJapan Spaceguard Association\n\tMeteoritical Society\n\tNEOShield\n\tSpaceguard\n\tThe Spaceguard Foundation\n\tSpace Situational Awareness Programme\n\tPlanetary Defense Coordination Office\n\n\n\n\n\tPotential threats\t\n\t1950 DA\n\t1994 WR12\n\t101955 Bennu\n\t2002 MN\n\t(410777) 2009 FD\n\t2010 RF12\n\t99942 Apophis\n\n\n\n\n\tFilms / video\t\n\tThe End of the World (1916)\n\tWhen Worlds Collide (1951)\n\tGorath (1962)\n\tThe Green Slime (1968)\n\tThe Paradise Syndrome (1968)\n\tA Fire in the Sky (1978)\n\tMeteor (1979)\n\tNOVA: Doomsday Asteroid (1995)\n\tAsteroid (1997)\n\tDeep Impact (1998)\n\tArmageddon (1998)\n\tJudgment Day (1999)\n\tPost Impact (2004)\n\tDeadly Skies (2006)\n\tSuper Comet: After the Impact (2007)\n\tImpact (2009)\n\tNOVA: Last Extinction (2009)\n\tMeteor Storm (2010)\n\tHORIZON: Asteroids–The Good, the Bad and the Ugly (2010)\n\tMelancholia (2011)\n\tNOVA: Meteor Strike (2013)\n\tNOVA: Asteroid: Doomsday or Payday? (2013)\n\tImpact Earth (2015)\n\tAvengers: Age of Ultron (2015)\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n21st-century space probes\n\n\tActive space probes\n(deep space missions)\t\n\tMoon\t\n\tARTEMIS\n\tChandrayaan-2\n\tChang'e 3\n\tChang'e 4 (Yutu-2)\n\tLunar Reconnaissance Orbiter\n\n\n\n\n\tMars\t\n\tExoMars TGO\n\tInSight\n\tMars Orbiter Mission\n\tMars Express\n\t2001 Mars Odyssey\n\tMAVEN\n\tMRO\n\tMSL Curiosity\n\n\n\n\n\tVenus\t\n\tAkatsuki\n\n\n\n\n\tMinor planet\t\n\tChang'e 2\n\tHayabusa2 / MINERVA-II\n\tNew Horizons\n\tOSIRIS-REx\n\n\n\n\n\tSolar science\t\n\tACE\n\tDSCOVR\n\tParker Solar Probe\n\tSOHO\n\tSTEREO\n\tWind\n\n\n\n\n\tOthers\t\n\tBepiColombo\n\tGaia\n\tJuno\n\tTHEMIS\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\n\n\n\tCompleted after 2000\n(by termination date)\t\n\t2000s\t\n\t2001\n\tNEAR Shoemaker\n\tDeep Space 1\n\n\n\t2003\n\tPioneer 10\n\tGalileo\n\tNozomi\n\n\n\t2004\n\tGenesis\n\n\n\t2005\n\tHuygens\n\n\n\t2006\n\tMars Global Surveyor\n\n\n\t2008\n\tPhoenix\n\n\n\t2009\n\tChang'e 1\n\tUlysses\n\tChandrayaan-1\n\tSELENE\n\tLCROSS\n\n\n\n\n\n\n\t2010s\t\n\t2010\n\tHayabusa\n\tMER Spirit\n\n\n\t2011\n\tStardust\n\n\n\t2012\n\tGRAIL\n\n\n\t2013\n\tDeep Impact\n\n\n\t2014\n\tLADEE\n\tVenus Express\n\tChang'e 5-T1\n\n\n\t2015\n\tMESSENGER\n\tPROCYON\n\tIKAROS\n\n\n\t2016\n\tRosetta / Philae\n\tYutu\n\tExoMars Schiaparelli\n\n\n\t2017\n\tLISA Pathfinder\n\tCassini\n\n\n\t2018\n\tMASCOT\n\tDawn\n\tLongjiang-1\n\n\n\t2019\n\tMarCO\n\tMER Opportunity\n\tBeresheet\n\tLongjiang-2\n\tVikram / Pragyan\n\n\n\n\n\n\n\n\n\n\t\n\tList of Solar System probes\n\tList of lunar probes\n\tList of space telescopes\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n← 2005  ·  Orbital launches in 2006  ·  2007 →\n\n\tNew Horizons | Daichi | EchoStar X | Himawari 7 | Akari ·  CUTE-1.7 + APD | Arabsat-4A | SpainSat-1 ·  Hot Bird 7A | ST-5 | FalconSAT-2 | Soyuz TMA-8 | JCSAT-5A | COSMIC | Astra 1KR | Progress M-56 | EROS-B | Yaogan 1 | CALIPSO ·  CloudSat | Kosmos 2420 | GOES 13 | Satmex 6 ·  Thaicom 5 | Resurs-DK No.1 | KazSat-1 | Galaxy 16 | USA-187 ·  USA-188 ·  USA-189 | Progress M-57 | Kosmos 2421 | USA-184 | STS-121 (MPLM) | INSAT-4C | Genesis I | Kosmos 2422 | BelKA ·  Baumanets ·  PicPot ·  SACRED ·  ION ·  Rincon 1 ·  ICECube-1 ·  KUTESat Pathfinder ·  SEEDS ·  nCube ·  HAUSAT-1 ·  MEROPE ·  CP-2 ·  AeroCube-1 ·  CP-1 ·  Mea Huaka'i ·  ICECube-2 | Arirang-2 | Hot Bird 8 | JCSAT-3A ·  Syracuse 3B | Koreasat 5 | Shijian 8 | STS-115 (ITS P3/4) | IGS-3A | Chinasat-22A | Kosmos 2423 | Soyuz TMA-9 | Hinode ·  HIT-SAT ·  SSSAT | USA-190 | DirecTV-9S ·  Optus D1 ·  LDREX | MetOp-A | Progress M-58 | Shijian 6C ·  Shijian 6D | STEREO | Sinosat-2 | XM-4 | USA-191 | Badr-4 | USA-192 | Fengyun 2-05 | WildBlue 1 ·  AMC-18 | STS-116 (ITS P5 ·  SpaceHab LSM ·  ANDE-MAA ·  ANDE-FACL ·  RAFT1 ·  MARScom ·  MEPSI-2) | MEASAT-3 | USA-193 | TacSat-2 ·  GeneSat | Kiku 8 | SAR-Lupe 1 | Meridian 1 | Kosmos 2424 ·  Kosmos 2425 ·  Kosmos 2426 | CoRoT\n\n\tPayloads are separated by bullets ( · ), launches by pipes ( | ). Crewed flights are indicated in bold text. Uncatalogued launch failures are listed in italics. Payloads deployed from other spacecraft are denoted in brackets.\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNASA\n\n\tPolicy and history\t\n\tHistory\t\n\tNACA (1915)\n\tNational Aeronautics and Space Act (1958)\n\tSpace Task Group (1958)\n\tPaine (1986)\n\tRogers (1986)\n\tRide (1987)\n\tSpace Exploration Initiative (1989)\n\tAugustine (1990)\n\tU.S. National Space Policy (1996)\n\tCFUSAI (2002)\n\tCAIB (2003)\n\tVision for Space Exploration (2004)\n\tAldridge (2004)\n\tAugustine (2009)\n\n\n\n\n\tGeneral\t\n\tSpace Race\n\tAdministrator and Deputy Administrator\n\tChief Scientist\n\tAstronaut Corps\n\tRanks and positions\n\tChief\n\n\n\tBudget\n\tSpin-off technologies\n\tNASA TV\n\tNASA Social\n\tLaunch Services Program\n\tMercury Control Center\n\tKennedy Space Center\n\tVehicle Assembly Building\n\tLaunch Complex 39\n\tLaunch Control Center\n\tOperations and Checkout Building\n\n\n\tJohnson Space Center\n\tMission Control\n\tLunar Sample Laboratory\n\n\n\n\n\n\n\n\n\t\n\n\tRobotic programs\t\n\tPast\t\n\tHitchhiker\n\tMariner\n\tMariner Mark II\n\tMESUR\n\tMars Surveyor '98\n\tNew Millennium\n\tLunar Orbiter\n\tPioneer\n\tPlanetary Observer\n\tRanger\n\tSurveyor\n\tViking\n\tProject Prometheus\n\tMars Scout\n\tMars Exploration Rover\n\n\n\n\n\tCurrent\t\n\tLiving With a Star\n\tLunar Precursor Robotic Program\n\tEarth Observing System\n\tGreat Observatories program\n\tExplorer\n\tSmall explorer\n\tVoyager\n\tDiscovery\n\tNew Frontiers\n\tSolar Terrestrial Probes\n\tCommercial Lunar Payload Services\n\n\n\n\n\n\n\n\tHuman spaceflight\nprograms\t\n\tPast\t\n\tX-15 (suborbital)\n\tMercury\n\tGemini\n\tApollo\n\tApollo–Soyuz Test Project (with the Soviet space program)\n\tSkylab\n\tSpace Shuttle\n\tShuttle–Mir (with Roscosmos State Corporation)\n\tConstellation\n\n\n\n\n\tCurrent\t\n\tInternational Space Station\n\tCommercial Orbital Transportation Services\n\tCommercial Crew Development\n\tOrion\n\tArtemis\n\tLunar Gateway\n\n\n\n\n\n\n\n\tIndividual featured\n missions\n(human and robotic)\t\n\tPast\t\n\tCOBE\n\tMercury 3\n\tMercury-Atlas 6\n\tMagellan\n\tPioneer 10\n\tPioneer 11\n\tGalileo\n\tGALEX\n\tGRAIL\n\tWMAP\n\tSpace Shuttle\n\tSojourner rover\n\tSpirit rover\n\tLADEE\n\tMESSENGER\n\tAquarius\n\tCassini\n\tDawn\n\tKepler space telescope\n\tOpportunity rover\n\tRHESSI\n\tobserved\n\n\n\n\n\n\n\tCurrently\noperating\t\n\tMars Reconnaissance Orbiter\n\t2001 Mars Odyssey\n\tNew Horizons\n\tInternational Space Station\n\tHubble Space Telescope\n\tSpitzer\n\tSwift\n\tTHEMIS\n\tMars Exploration Rover\n\tCuriosity rover\n\ttimeline\n\n\n\tInSight\n\tGOES 14\n\tLunar Reconnaissance Orbiter\n\tGOES 15\n\tVan Allen Probes\n\tSolar Dynamics Observatory\n\tJuno\n\tMars Science Laboratory\n\ttimeline\n\n\n\tNuSTAR\n\tVoyager 1\n\tVoyager 2\n\tWISE\n\tMAVEN\n\tMMS\n\tOSIRIS-REx\n\tTransiting Exoplanet Survey Satellite\n\n\n\n\n\tFuture\t\n\tJoint Polar Satellite System\n\tJames Webb Space Telescope\n\tWide Field Infrared Survey Telescope\n\tMars 2020\n\tNISAR\n\tEuropa Clipper\n\n\n\n\n\n\n\n\tCommunications\nand navigation\t\n\tNear Earth Network\n\tSpace Network\n\tDeep Space Network (Goldstone\n\tMadrid\n\tCanberra\n\tSpace Flight Operations Facility)\n\tDeep Space Atomic Clock\n\n\n\n\n\tNASA lists\t\n\tAstronauts\n\tby name\n\tby year\n\tGemini astronauts\n\tApollo astronauts\n\n\n\tList of NASA aircraft\n\tList of NASA missions\n\tuncrewed missions\n\n\n\tList of NASA contractors\n\tList of United States rockets\n\tList of NASA cancellations\n\tList of Space Shuttle missions\n\tcrews\n\n\n\tList of NASA cameras on spacecraft\n\n\n\n\n\tNASA images\nand artwork\t\n\tEarthrise\n\tThe Blue Marble\n\tFamily Portrait\n\tPale Blue Dot\n\n\n\tPillars of Creation\n\tMystic Mountain\n\tSolar System Family Portrait\n\tThe Day the Earth Smiled\n\tFallen Astronaut\n\tLunar plaques\n\tPioneer plaques\n\tVoyager Golden Record\n\tApollo 11 goodwill messages\n\tNASA insignia\n\tGemini and Apollo medallions\n\tMission patches\n\n\n\n\n\tRelated\t\n\tApollo 15 postal covers incident\n\tSpace Mirror Memorial\n\tThe Astronaut Monument\n\tU.S. Astronaut Hall of Fame\n\tSpace program on U.S. stamps\n\tApollo 17 Moon mice\n\tOther primates in space\n\tNASA spinoff technologies\n\n\n\n\n\t\n\t Category\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n2015 in space\n\n\t\n\t « 2014 \n 2016 » \n\n\n\n\n\n\tLaunches\t\n\tSpace probes\t\n\tLISA Pathfinder\n\tSMAP\n\n\n\n\n\tSpace observatories\t\n\tAstrosat\n\tDSCOVR\n\n\n\n\n\n\n\t\n\n\n\n\tImpact events\t\n\t2015 Kerala meteorite\n\t2015 Thailand bolide\n\tWT1190F impact\n\n\n\n\n\tSelected comets\t\n\t15P/Finlay\n\tC/2014 Q2 (Lovejoy)\n\t88P/Howell\n\t22P/Kopff\n\t10P/Tempel\n\tC/2013 US10\n\n\n\n\n\tSelected NEOs\t\n\tClosest asteroid approaches in 2015\n\t2015 BP513\n\t(357439) 2004 BL86\n\t2015 AZ43\n\t1566 Icarus\n\t2015 TB145\n\t2007 VE191\n\t(33342) 1998 WT24\n\t(85989) 1999 JD6\n\t2015 SO2\n\n\n\n\n\tExoplanets\t\n\tAldebaran b\n\tβ Circini b\n\tEPIC 2037 b\n\tEPIC 2037 c\n\tGliese 1132 b\n\tHD 155233 b\n\tHD 164595 b\n\tHD 219134 b\n\tHD 219134 c\n\tHD 219134 d\n\tHD 219134 e\n\tHD 219134 f\n\tHD 219134 g\n\tHD 219134 h\n\tHIP 11915 b\n\tKELT-4Ab\n\tKepler-438b\n\tKepler-440b\n\tKepler-442b\n\tKepler-444\n\tKepler-451b\n\tKepler-452b\n\tKepler-453b\n\tK2-3d\n\tK2-18b\n\tK2-22b\n\tWASP-121b\n\tWolf 1061c\n\n\n\n\n\tDiscoveries\t\n\tGW150914 (first observation of gravitational waves, announced in 2016)\n\tGW151226 (announced in 2016)\n\t2015 TH367 (TNO)\n\tWISE J224607.57−052635.0 (galaxy)\n\n\n\n\n\tSpace\nexploration\t\n\tDawn (Ceres orbit injection)\n\tRosetta (orbiting comet 67P)\n\tMESSENGER (end of mission)\n\tNew Horizons (flyby of Pluto)\n\tAkatsuki (Venus orbit injection)\n\n\n\n\n\t\n\t Category:2014 in space — Category:2015 in space — Category:2016 in space\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n2018 in space\n\n\t\n\t « 2017\n 2019 »\n\n\n\n\n\n\tSpace probe launches  \t\n\tTESS (lunar flyby; Apr 2018)\n\tInSight / Mars Cube One (mission to Mars; May 2018)\n\tParker Solar Probe (solar space mission; Aug 2018)\n\tBepiColombo (mission to Mercury; Oct 2018)\n\tChang'e 4 / Yutu-2 (mission to the Moon; Dec 2018)\n\n\n\n\t\n\n\n\tImpact events\t\n\t2018 LA\n\tKamchatka meteor\n\n\n\n\n\tSelected NEOs\t\n\tAsteroid close approaches\n\t2010 WC9\n\t2017 VR12\n\t2017 YE5\n\t2017 YZ1\n\t2018 AH\n\t2018 BD\n\t2018 BF3\n\t2018 CB\n\t2018 CC\n\t2018 CF2\n\t2018 CL\n\t2018 CN2\n\t2018 CY2\n\t2018 DV1\n\t2018 GE3\n\t2018 PD20\n\t2018 LF16\n\t2018 WV1\n\t(276033) 2002 AJ129\n\t(163899) 2003 SD220\n\t(505657) 2014 SR339\n\n\n\n\n\tExoplanets \t\n\tGliese 1132 c\n\tK2-141b\n\tK2-146b\n\tK2-148b\n\tK2-155d\n\tK2-229b\n\tK2-239b\n\tK2-239c\n\tK2-239d\n\tK2-288Bb\n\tBarnard's Star b\n\tEPIC 211945201 b\n\tHD 89345 b\n\tKELT-21b\n\tNGTS-3Ab\n\n\n\n\n\tDiscoveries\t\n\tAT2018cow\n\tNovae (List)\n\tCarina\n\tMusca\n\tPerseus\n\n\n\tMACS J1149 Lensed Star 1\n\tHyperion proto-supercluster\n\t2015 TH367 (orbit announced)\n\t2015 TG387 (orbit announced)\n\t2017 OF69 (announced)\n\t2018 VG18\n\n\n\n\n\tComets  \t\n\tC/2018 V1\n\t46P/Wirtanen\n\tHyperbolic comets\n\tC/2017 U7 (announced in 2018)\n\tC/2018 C2 (Lemmon)\n\tC/2018 F4 (PANSTARRS)\n\n\n\n\n\n\n\tSpace exploration\t\n\tHayabusa2 (asteroid Ryugu arrival; June 2018)\n\tOSIRIS-REx (asteroid Bennu arrival; Dec 2018)\n\tNew Horizons (encounter with (486958) 2014 MU69; Dec 2018 / Jan 2019)\n\tDawn retirement\n\tKepler retirement\n\n\n\n\n\t\n\t Category:2017 in space — Category:2018 in space — Category:2019 in space\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n2019 in space\n\n\t\n\t « 2018\n 2020 »\n\n\n\n\n\n\tSpace probe launches \t\n\tBeresheet (lunar lander; Feb 2019)\n\tChandrayaan-2 / Vikram / Pragyan (lunar obiter, lander and rover; Jul 2019)\n\n\n\n\t\n\n\n\tImpact events\t\n\tKamchatka meteor (announced)\n\t2019 MO\n\n\n\n\n\tSelected NEOs\t\n\tAsteroid close approaches\n\t2018 XB4\n\t(12538) 1998 OH\n\t(66391) 1999 KW4\n\t1620 Geographos\n\t2100 Ra-Shalom\n\t2006 QV89\n\n\n\n\n\tExoplanets \t\n\tK2-288Bb\n\tWolf 359 b and c\n\tStruve 2398 Bb and Bc\n\tLuyten's Star d and e\n\tL 1159-16 b, c, and d\n\tGliese 687 c\n\tAD Leonis b\n\tGliese 251 c\n\tLP 816-60 b\n\tGliese 754 b\n\tGliese 588 b and c\n\tGliese 784 b\n\tGliese 555 b\n\tTeegarden's Star b and c\n\n\n\n\n\tDiscoveries\t\n\t2019 AQ3\n\tFarFarOut\n\tEPIC 204376071\n\tMessier 87's supermassive black hole M87* imaged\n\t2I/Borisov\n\tWater vapor on exoplanet K2-18b\n\tASASSN-19bt\n\n\n\n\n\tComets \t\n\t289P/Blanpain\n\t78P/Gehrels\n\t168P/Hergenrother\n\t163P/NEAT\n\t138P/Shoemaker–Levy\n\t171P/Spahr\n\n\n\n\n\tSpace exploration\t\n\tNew Horizons (encounter with (486958) 2014 MU69; Dec 2018 / Jan 2019)\n\tChang'e 4 / Yutu-2 (landing on the far side of the Moon; Jan 2019)\n\tHayabusa2 (departure from 162173 Ryugu; Dec 2019)\n\n\n\n\n\t\n\t Category:2018 in space — Category:2019 in space — Category:2020 in space\n\n\n\n\n\n\n\n\t^ \"NASA Gets Some Help From Guitarist Brian May On Its New Horizons Probe\", NPR, aired January 2, 2019.\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=New_Horizons&oldid=919050784\"\n\n\t\t\n\t\tCategories: \tNew Horizons\n\tNASA space probes\n\tNew Frontiers program\n\tMissions to Pluto\n\tMissions to Jupiter\n\tMissions to minor planets\n\tRadio frequency propagation\n\tSpacecraft escaping the Solar System\n\tSpace probes launched in 2006\n\tSpacecraft launched by Atlas rockets\n\tNuclear-powered robots\n\n\nHidden categories: \tAll articles with unsourced statements\n\tArticles with unsourced statements from January 2018\n\tWebarchive template wayback links\n\tUse mdy dates from January 2019\n\tArticles with short description\n\tPages using multiple image with auto scaled images\n\tCommons category link is locally defined\n\tArticles with unsourced statements from January 2019\n\tArticles containing potentially dated statements from February 2018\n\tAll articles containing potentially dated statements\n\tArticles containing potentially dated statements from January 2018\n\tCommons category link is on Wikidata\n\tUse American English from March 2018\n\tAll Wikipedia articles written in American English\n\tArticles containing video clips\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\tWikiquote\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tالعربية\n\tঅসমীয়া\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tБългарски\n\tBosanski\n\tBrezhoneg\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGaelg\n\tGalego\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tქართული\n\tLatina\n\tLatviešu\n\tLietuvių\n\tLimburgs\n\tLingua Franca Nova\n\tLumbaart\n\tMagyar\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tမြန်မာဘာသာ\n\tNederlands\n\tनेपाली\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپښتو\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tSicilianu\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t吴语\n\tYorùbá\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 October 2019, at 15:38 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "33", "dc:title": "New Horizons - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/e/ee/New_Horizons_spacecraft_model_1.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-new_horizons", "title": "New Horizons - Wikipedia"}}