{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOrbital decay - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tOrbital decay\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\"Decaying Orbit\" redirects here. For the 2007 film, see Decaying Orbit (film).\n\n  \nAltitude of Tiangong-1 during its final year of uncontrolled reentry.[1]\n\n\n\n\tPart of a series on\n\tAstrodynamics\n\t\n\t\nOrbital mechanics\n\n\t\nOrbital parameters\n\n\tApsis\n\tArgument of periapsis\n\tAzimuth\n\tEccentricity\n\tInclination\n\tMean anomaly\n\tOrbital nodes\n\tSemi-major axis\n\tTrue anomaly\n\n\n\n\n\t\nTypes of two-body orbits, by \neccentricity\n\n\tCircular orbit\n\tElliptic orbit\n\n\nTransfer orbit \t(Hohmann transfer orbit\n\tBi-elliptic transfer orbit)\n\n\n\n\n\tParabolic orbit\n\tHyperbolic orbit\n\tRadial orbit\n\tDecaying orbit\n\n\n\n\n\t\nEquations\n\n\tDynamical friction\n\tEscape velocity\n\tKepler's equation\n\tKepler's laws of planetary motion\n\tOrbital period\n\tOrbital velocity\n\tSurface gravity\n\tSpecific orbital energy\n\tVis-viva equation\n\n\n\n\n\t\nCelestial mechanics\n\n\t\nGravitational influences\n\n\tBarycenter\n\tHill sphere\n\tPerturbations\n\tSphere of influence\n\n\n\n\n\t\nN-body orbits\nLagrangian points \t(Halo orbits)\n\n\n\n\n\tLissajous orbits\n\tLyapunov orbits\n\n\n\n\n\t\nEngineering and efficiency\n\n\t\nPreflight engineering\n\n\tMass ratio\n\tPayload fraction\n\tPropellant mass fraction\n\tTsiolkovsky rocket equation\n\n\n\n\n\t\nEfficiency measures\n\n\tGravity assist\n\tOberth effect\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nIn orbital mechanics, decay is a gradual decrease of the distance between two orbiting bodies at their closest approach (the periapsis) over many orbital periods. These orbiting bodies can be a planet and its satellite, a star and any object orbiting it, or components of any binary system. Orbits do not decay without some friction-like mechanism which transfers energy from the orbital motion.  This can be any of a number of mechanical, gravitational, or electromagnetic effects. For bodies in low Earth orbit, the most significant effect is atmospheric drag.\n\nIf left unchecked, the decay eventually results in termination of the orbit when the smaller object strikes the surface of the primary; or for objects where the primary has an atmosphere, the smaller object burns, explodes, or otherwise breaks up in the larger object's atmosphere; or for objects where the primary is a star, ends with incineration by the star's radiation (such as for comets), and so on.\n\nCollisions of stellar-mass objects usually produce cataclysmic effects, such as gamma-ray bursts.\n\nDue to atmospheric drag, the lowest altitude above the Earth at which an object in a circular orbit can complete at least one full revolution without propulsion is approximately 150 km (90 mi).\n\n\nContents\n\n\n\t1 Causes\n\t1.1 Atmospheric drag\n\t1.2 Tidal effects\n\t1.3 Light and thermal radiation\n\t1.4 Gravitational radiation\n\t1.5 Electromagnetic drag\n\n\n\n\t2 Stellar collision\n\t3 Mass concentration\n\t4 References\n\t5 External links\n\n\n\n\n\nCauses[edit]\n\nAtmospheric drag[edit]\n\nFurther information: Atmospheric drag\n\nAtmospheric drag at orbital altitude is caused by frequent collisions of gas molecules with the satellite.\nIt is the major cause of orbital decay for satellites in low Earth orbit. It results in the reduction in the altitude of a satellite's orbit. For the case of Earth, atmospheric drag resulting in satellite re-entry can be described by the following sequence:\n\n\n\tlower altitude → denser atmosphere → increased drag → increased heat → usually burns on re-entry\n\n\nOrbital decay thus involves a positive feedback effect, where the more the orbit decays, the lower its altitude drops, and the lower the altitude, the faster the decay. Decay is also particularly sensitive to external factors of the space environment such as solar activity, which are not very predictable. During solar maxima the Earth's atmosphere causes significant drag up to a hundred kilometers higher than during solar minima.[citation needed]\n\nAtmospheric drag exerts a significant effect at the altitudes of space stations, space shuttles and other manned Earth-orbit spacecraft, and satellites with relatively high \"low earth orbits\" such as the Hubble Space Telescope. Space stations typically require a regular altitude boost to counteract orbital decay (see also orbital station-keeping). Uncontrolled orbital decay brought down the Skylab space station, and (relatively) controlled orbital decay was used to de-orbit the Mir space station.[citation needed]\n\nReboosts for the Hubble Space Telescope are less frequent due to its much higher altitude.  However, orbital decay is also a limiting factor to the length of time the Hubble can go without a maintenance rendezvous, the most recent having been performed successfully by STS-125, with space shuttle Atlantis in 2009.  Newer space telescopes are in much higher orbits, or in some cases in solar orbit, so orbital boosting may not be needed.[2]\n\n\nTidal effects[edit]\n\n\t\n\tThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (February 2014) (Learn how and when to remove this template message)\n\n\n\nFurther information: Tidal locking\n\nAn orbit can also decay by tidal effects when the orbiting body is large enough to raise a significant tidal bulge[clarification needed] on the body it is orbiting and is either in a retrograde orbit or is below the synchronous orbit. The resulting tidal interaction saps momentum from the orbiting body and transfers it to the primary's rotation, lowering the orbit's altitude until frictional effects come into play.\n\nExamples of satellites undergoing tidal orbital decay are Mars' moon Phobos, Neptune's moon Triton, and the extrasolar planet TrES-3b.\n\n\nLight and thermal radiation[edit]\n\nMain articles: Poynting–Robertson effect and Yarkovsky effect\n\nSmall objects in the Solar System also experience an orbital decay due to the forces applied by asymmetric radiation pressure. Ideally, energy absorbed would equal blackbody energy emitted at any given point, resulting in no net force. However, the Yarkovsky effect is the phenomenon that, because absorption and radiation of heat are not instantaneous, objects which are not terminally locked absorb sunlight energy on surfaces exposed to the Sun, but those surfaces do not re-emit much of that energy until after the object has rotated, so that the emission is parallel to the object's orbit. This results in a very small acceleration parallel to the orbital path, yet one which can be significant for small objects over millions of years. The Poynting-Robertson effect is a force opposing the object's velocity caused by asymmetric incidence of light, i.e., aberration of light. For an object with prograde rotation, these two effects will apply opposing, but generally unequal, forces.\n\n\nGravitational radiation[edit]\n\nMain article: Two-body problem in general relativity\n\nGravitational radiation is another mechanism of orbital decay. It is negligible for orbits of planets and planetary satellites (when considering their orbital motion on time scales of centuries, decades, and less), but is noticeable for systems of compact objects, as seen in observations of neutron star orbits. All orbiting bodies radiate gravitational energy, hence no orbit is infinitely stable.\n\n\nElectromagnetic drag[edit]\n\nSatellites using an electrodynamic tether, moving through the Earth's magnetic field, creates drag force that could eventually deorbit the satellite.\n\n\nStellar collision[edit]\n\nFurther information: Stellar collision\n\nThe coming together of two binary stars when they lose energy and approach each other. Several things can cause the loss of energy including tidal forces, mass transfer, and gravitational radiation. The stars describe the path of a spiral as they approach each other. This sometimes results in a merger of the two stars or the creation of a black hole. In the latter case, the last several revolutions of the stars around each other take only a few seconds.[3]\n\n\nMass concentration[edit]\n\nFurther information: Mass concentration (astronomy)\n\nWhile not a direct cause of orbital decay, uneven mass distributions (known as mascons) of the body being orbited can perturb orbits over time, and extreme distributions can cause orbits to be highly unstable. The resulting unstable orbit can mutate into an orbit where one of the direct causes of orbital decay can take place.\n\n\nReferences[edit]\n\n\n\t^ \"Tiangong-1 Orbital Status\". Official Website of China Manned Space. China Manned Space Engineering Office. 1 April 2018. Retrieved 1 April 2018.\n\n\t^ The Hubble Program - Servicing Missions - SM4\n\n\t^ \"INSPIRAL GRAVITATIONAL WAVES\". LIGO. Retrieved 1 May 2015.\n\n\n\n\n\n\nExternal links[edit]\n\n\tOrbital decay calculations, with discussion and examples\n\n\n\n\tPhysics portal\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Orbital_decay&oldid=919182610\"\n\n\t\t\n\t\tCategories: \tEffects of gravitation\n\tOrbits\n\tBlack holes\n\n\nHidden categories: \tAll articles with unsourced statements\n\tArticles with unsourced statements from January 2010\n\tArticles with unsourced statements from November 2016\n\tArticles needing additional references from February 2014\n\tAll articles needing additional references\n\tWikipedia articles needing clarification from February 2014\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tEspañol\n\tBahasa Indonesia\n\tItaliano\n\tPortuguês\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 2 October 2019, at 08:52 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "8", "dc:title": "Orbital decay - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Altitude_of_Tiangong-1.svg/1200px-Altitude_of_Tiangong-1.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-orbital_decay", "title": "Orbital decay - Wikipedia"}}