{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOrbit determination - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tOrbit determination\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Orbit determination\" – news · newspapers · books · scholar · JSTOR  (August 2009) (Learn how and when to remove this template message)\n\n\n\n  \nDiagram showing how orbit-de­ter­mi­na­tion data was handled in a 1962 NASA mission. (Of historical interest only.)\n\n\n\nOrbit determination is the estimation of orbits of objects such as moons, planets, and spacecraft. One major application is to allow tracking newly observed asteroids and verify that they have not been previously discovered. The basic methods were discovered in the 17th century and have been continuously refined.\n\nObservations are the raw data fed into orbit determination algorithms.  Observations made by a ground-based observer typically consist of time-tagged azimuth, elevation, range, and/or range-rate values.  Telescopes or radar apparatus are used, because naked-eye observations are inadequate for precise orbit determination.  With more or better observations, the accuracy of the orbit determination process also improves, and fewer \"false alarms\" result.\n\nAfter orbits are determined, mathematical propagation techniques can be used to predict the future positions of orbiting objects.  As time goes by, the actual path of an orbiting object tends to diverge from the predicted path (especially if the object is subject to difficult-to-predict perturbations such as atmospheric drag), and a new orbit determination using new observations serves to re-calibrate knowledge of the orbit.\n\nSatellite tracking is another major application. For the US and partner countries, to the extent that optical and radar resources allow, the Joint Space Operations Center gathers observations of all objects in Earth orbit.  The observations are used in new orbit determination calculations that maintain the overall accuracy of the satellite catalog.  Collision avoidance calculations may use this data to calculate the probability that one orbiting object will collide with another.  A satellite's operator may decide to adjust the orbit, if the risk of collision in the present orbit is unacceptable.  (It is not possible to adjust the orbit for events of very low probability; it would soon use up the of propellant the satellite carries for orbital station-keeping.)    Other countries, including Russia and China, have similar tracking assets.\n\n\nContents\n\n\n\t1 History\n\t2 Observational data\n\t3 Methods\n\t4 References\n\t5 Further reading\n\n\n\n\n\nHistory[edit]\n\nOrbit determination has a long history, beginning with the prehistoric discovery of the planets and subsequent attempts to predict their motions. Johannes Kepler used Tycho Brahe's careful observations of Mars to deduce the elliptical shape of its orbit and its orientation in space, deriving his three laws of planetary motion in the process.\n\nThe mathematical methods for orbit determination originated with the publication in 1687 of the first edition of Newton's Principia, which gave a method for finding the orbit of a body following a parabolic path from three observations.[1] This was used by Edmund Halley to establish the orbits of various comets, including that which bears his name. Newton's method of successive approximation was formalised into an analytic method by Euler in 1744, whose work was in turn generalised to elliptical and hyperbolic orbits by Lambert in 1761–1777.\n\nAnother milestone in orbit determination was Carl Friedrich Gauss' assistance in the \"recovery\" of the dwarf planet Ceres in 1801.  Gauss's method was able to use just three observations (in the form of celestial coordinates) to find the six orbital elements that completely describe an orbit.  The theory of orbit determination has subsequently been developed to the point where today it is applied in GPS receivers as well as the tracking and cataloguing of newly observed minor planets.\n\n\nObservational data[edit]\n\nIn order to determine the unknown orbit of a body, some observations of its motion with time are required. In early modern astronomy, the only available observational data for celestial objects were the right ascension and declination, obtained by observing the body as it moved in its observation arc, relative to the fixed stars, using an optical telescope. This corresponds to knowing the object's relative direction in space, measured from the observer, but without knowledge of the distance of the object, i.e. the resultant measurement contains only direction information, like a unit vector.\n\nWith radar, relative distance measurements (by timing of the radar echo) and relative velocity measurements (by measuring the Doppler effect of the radar echo) are possible using radio telescopes. However, the returned signal strength from radar decreases rapidly, as the inverse fourth power of the range to the object. This generally limits radar observations to objects relatively near the Earth, such as artificial satellites and Near-Earth objects. Larger apertures permit tracking of transponders on interplanetary spacecraft, and natural bodies, throughout the solar system.\n\nVarious space agencies and commercial providers operate tracking networks to provide these observations.  See Category:Deep Space Network for a partial listing.  Space-based tracking of satellites is also regularly performed.  See List of radio telescopes#Space-based and Space Network.\n\n\nMethods[edit]\n\nOrbit determination must take into account that the apparent celestial motion of the body is influenced by the observer's own motion.  For instance, an observer on Earth tracking an asteroid must take into account the motion of the Earth around the Sun, the rotation of the Earth, and the observer's local latitude and longitude, as these affect the apparent position of the body.\n\nA key observation is that (to a close approximation) all objects move in orbits that are conic sections, with the attracting body (such as the Sun or the Earth) in the prime focus, and that the orbit lies in a fixed plane. Vectors drawn from the attracting body to the body at different points in time will all lie in the orbital plane.\n\nIf the position and velocity relative to the observer are available (as is the case with radar observations), these observational data can be adjusted by the known position and velocity of the observer relative to the attracting body at the times of observation. This yields the position and velocity with respect to the attracting body. If two such observations are available, along with the time difference between them, the orbit can be determined using Lambert's method, invented in the 18th century.  See Lambert's problem for details.\n\nEven if no distance information is available, an orbit can still be determined if three or more observations of the body's right ascension and declination have been made.  Gauss's method, made famous in his 1801 \"recovery\" of the first lost minor planet, Ceres, has been subsequently polished. \n\nOne use is in the determination of asteroid masses via the dynamic method.  In this procedure Gauss's method is used twice, both before and after a close interaction between two asteroids.  After both orbits have been determined the mass of one or both of the asteroids can be worked out.[citation needed]\n\n\nReferences[edit]\n\n\n\t^ Bate RR, Mueller DD, White JE. Fundamentals of astrodynamics. Courier Corporation; 1971. Ch 2 p 51 et seq.\n\n\n\n\n\nFurther reading[edit]\n\n\tCurtis, H.; Orbital Mechanics for Engineering Students, Chapter 5; Elsevier (2005) ISBN 0-7506-6169-0.\n\tTaff, L.; Celestial Mechanics, Chapters 7, 8; Wiley-Interscience (1985) \nISBN 0-471-89316-1.\n\tBate, Mueller, White; Fundamentals of Astrodynamics, Chapters 2, 5; Dover (1971) \nISBN 0-486-60061-0.\n\tMadonna, R.; Orbital Mechanics, Chapter 3; Krieger (1997) \nISBN 0-89464-010-0.\n\tSchutz, Tapley, Born; Statistical Orbit Determination, Academic Press. \nISBN 978-0126836301\n\tSatellite Orbit Determination, Coastal Bend College, Texas\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Orbit_determination&oldid=894327919\"\n\n\t\t\n\t\tCategories: \tAstrometry\n\tSpaceflight technologies\n\tOrbits\n\n\nHidden categories: \tArticles needing additional references from August 2009\n\tAll articles needing additional references\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from May 2012\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tDeutsch\n\tFrançais\n\tLëtzebuergesch\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 27 April 2019, at 04:41 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "6", "dc:title": "Orbit determination - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/1/11/Functional_block_diagram_of_orbit_determination_operations.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-orbit_determination", "title": "Orbit determination - Wikipedia"}}