{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGeocentric orbit - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tGeocentric orbit\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Orbital altitude)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tFor the motion of Earth around the Sun, see Earth's orbit. For the shuttle simulator, see Space Cadets (TV series) § Simulator.\n\n\t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Geocentric orbit\" – news · newspapers · books · scholar · JSTOR  (December 2015) (Learn how and when to remove this template message)\n\n\n\nA geocentric orbit or Earth orbit involves any object orbiting the Earth, such as the Moon or artificial satellites. In 1997 NASA estimated there were approximately 2,465 artificial satellite payloads orbiting the Earth and 6,216 pieces of space debris as tracked by the Goddard Space Flight Center.[1] Over 16,291 previously launched objects have decayed into the Earth's atmosphere.[1]\n\nA spacecraft enters orbit when its centripetal acceleration due to gravity is less than or equal to the centrifugal acceleration due to the horizontal component of its velocity. For a low Earth orbit, this velocity is about 7,800 m/s (28,100 km/h; 17,400 mph);[2] by contrast, the fastest manned airplane speed ever achieved (excluding speeds achieved by deorbiting spacecraft) was 2,200 m/s (7,900 km/h; 4,900 mph) in 1967 by the North American X-15.[3] The energy required to reach Earth orbital velocity at an altitude of 600 km (370 mi) is about 36 MJ/kg, which is six times the energy needed merely to climb to the corresponding altitude.[4]\n\nSpacecraft with a perigee below about 2,000 km (1,200 mi) are subject to drag from the Earth's atmosphere,[5] which decreases the orbital altitude. The rate of orbital decay depends on the satellite's cross-sectional area and mass, as well as variations in the air density of the upper atmosphere. Below about 300 km (190 mi), decay becomes more rapid with lifetimes measured in days. Once a satellite descends to 180 km (110 mi), it has only hours before it vaporizes in the atmosphere.[6] The escape velocity required to pull free of Earth's gravitational field altogether and move into interplanetary space is about 11,200 m/s (40,300 km/h; 25,100 mph).[7]\n\n\nContents\n\n\n\t1 List of terms and concepts\n\t2 Geocentric orbit types\n\t2.1 Altitude classifications\n\t2.2 Inclination classifications\n\t2.3 Eccentricity classifications\n\t2.4 Directional classifications\n\t2.5 Geosynchronous classifications\n\t2.6 Special classifications\n\t2.7 Non-geocentric classifications\n\n\n\n\t3 Tangential velocities at altitude\n\t4 See also\n\t5 References\n\t6 External links\n\n\n\n\n\nList of terms and concepts[edit]\n\nThe following words may have more than one definition or other non-Earth specific definition(s).\nIn the spirit of brevity some of the definitions have been altered or truncated to reflect only their usage on this page.\n\n\tAltitude\n\tas used here, the height of an object above the average surface of the Earth's oceans.\n\n\n\tAnalemma\n\ta term in astronomy used to describe the plot of the positions of the Sun on the celestial sphere throughout one year. Closely resembles a figure-eight.\n\n\n\tApogee\n\tis the farthest point that a satellite or celestial body can go from Earth, at which the  orbital velocity will be at its minimum.\n\n\n\tEccentricity\n\ta measure of how much an orbit deviates from a perfect circle. Eccentricity is strictly defined for all circular and elliptical orbits, and parabolic and hyperbolic trajectories.\n\n\n\tEquatorial plane\n\tas used here, an imaginary plane extending from the equator on the Earth to the celestial sphere.\n\n\n\tEscape velocity\n\tas used here, the minimum velocity an object without propulsion needs to have to move away indefinitely from the Earth. An object at this velocity will enter a parabolic trajectory; above this velocity it will enter a hyperbolic trajectory.\n\n\n\tImpulse\n\tthe integral of a force over the time during which it acts. Measured in (N·sec or lb * sec).\n\n\n\tInclination\n\tthe angle between a reference plane and another plane or axis. In the sense discussed here the reference plane is the Earth's equatorial plane.\n\n\n\tOrbital characteristics\n\tthe six parameters of the Keplerian elements needed to specify that orbit uniquely.\n\n\n\tOrbital period\n\tas defined here, time it takes a satellite to make one full orbit around the Earth.\n\n\n\tPerigee\n\tis the nearest approach point of a satellite or celestial body from Earth, at which the orbital velocity will be at its maximum.\n\n\n\tSidereal day\n\tthe time it takes for a celestial object to rotate 360°. For the Earth this is: 23 hours, 56 minutes, 4.091 seconds.\n\n\n\tSolar time\n\tas used here, the local time as measured by a sundial.\n\n\n\tVelocity\n\tan object's speed in a particular direction. Since velocity is defined as a vector, both speed and direction are required to define it.:\n\t\n\n\nGeocentric orbit types[edit]\n\nThe following is a list of different geocentric orbit classifications.\n\n\nAltitude classifications[edit]\n\n  \nLow (cyan) and Medium (yellow) Earth orbit regions to scale. The black dashed line is the geosynchronous orbit. The green dashed line is the 20,230 km orbit used for GPS satellites.\n\n\n\n\tLow Earth orbit (LEO) - Geocentric orbits ranging in altitude from 160 kilometers (100 statute miles) to 2,000 kilometres (1,200 mi) above mean sea level. At 160 km, one revolution takes approximately 90 minutes, and the circular orbital speed is 8,000 metres per second (26,000 ft/s).\n\n\n\tMedium Earth orbit (MEO) - Geocentric orbits with altitudes at apogee ranging between 2,000 kilometres (1,200 mi) and that of the geosynchronous orbit at 35,786 kilometres (22,236 mi).\n\n\n\tGeosynchronous orbit (GEO) - Geocentric circular orbit with an altitude of 35,786 kilometres (22,236 mi).  The period of the orbit equals one sidereal day, coinciding with the rotation period of the Earth. The speed is approximately 3,000 metres per second (9,800 ft/s).\n\n\n\tHigh Earth orbit (HEO) - Geocentric orbits with altitudes at apogee higher than that of the geosynchronous orbit. A special case of high Earth orbit is the highly elliptical orbit, where altitude at perigee is less than 2,000 kilometres (1,200 mi).[8]\n\n\nInclination classifications[edit]\n\n\tInclined orbit - An orbit whose inclination in reference to the equatorial plane is not 0.\n\n\n\t\t\tPolar orbit - A satellite that passes above or nearly above both poles of the planet on each revolution. Therefore it has an inclination of (or very close to) 90 degrees.\n\n\n\n\n\n\n\t\t\tPolar sun synchronous orbit - A nearly polar orbit that passes the equator at the same local time on every pass. Useful for image-taking satellites because shadows will be the same on every pass.\n\n\n\n\n\n\nEccentricity classifications[edit]\n\n\tCircular orbit - An orbit that has an eccentricity of 0 and whose path traces a circle.\n\n\n\tElliptic orbit - An orbit with an eccentricity greater than 0 and less than 1 whose orbit traces the path of an ellipse.\n\n\n\t\tHohmann transfer orbit - An orbital maneuver that moves a spacecraft from one circular orbit to another using two engine impulses. This maneuver was named after Walter Hohmann.\n\n\n\n\n\t\tGeosynchronous transfer orbit (GTO) - A geocentric-elliptic orbit where the perigee is at the altitude of a Low Earth Orbit (LEO) and the apogee at the altitude of a geosynchronous orbit.\n\n\n\n\n\t\tHighly elliptical orbit (HEO) - Geocentric orbit with apogee above 35,786 km and low perigee (about 1,000 km) that result in long dwell times near apogee.\n\n\n\n\n\t\t\tMolniya orbit - A highly elliptical orbit with inclination of 63.4° and orbital period of ½ of a sidereal day (roughly 12 hours). Such a satellite spends most of its time over a designated area of the Earth.\n\n\n\n\n\n\n\t\t\tTundra orbit - A highly elliptical orbit with inclination of 63.4° and orbital period of one sidereal day (roughly 24 hours). Such a satellite spends most of its time over a designated area of the Earth.\n\n\n\n\n\n\n\tHyperbolic trajectory - An \"orbit\" with eccentricity greater than 1. The object's velocity reaches some value in excess of the escape velocity, therefore it will escape the gravitational pull of the Earth and continue to travel infinitely with a velocity (relative to Earth) decelerating to some finite value, known as the hyperbolic excess velocity.\n\tEscape Trajectory - This trajectory must be used to launch an interplanetary probe away from Earth, because the excess over escape velocity is what changes its heliocentric orbit from that of Earth.\n\tCapture Trajectory - This is the mirror image of the escape trajectory; an object traveling with sufficient speed, not aimed directly at Earth, will move toward it and accelerate. In the absence of a decelerating engine impulse to put it into orbit, it will follow the escape trajectory after periapsis.\n\n\n\n\n\tParabolic trajectory - An \"orbit\" with eccentricity exactly equal to 1. The object's velocity equals the escape velocity, therefore it will escape the gravitational pull of the Earth and continue to travel with a velocity (relative to Earth) decelerating to 0. A spacecraft launched from Earth with this velocity would travel some distance away from it, but follow it around the Sun in the same heliocentric orbit. It is possible, but not likely that an object approaching Earth could follow a parabolic capture trajectory, but speed and direction would have to be precise.\n\n\nDirectional classifications[edit]\n\n\tPrograde orbit - an orbit in which the projection of the object onto the equatorial plane revolves about the Earth in the same direction as the rotation of the Earth.\n\tRetrograde orbit - an orbit in which the projection of the object onto the equatorial plane revolves about the Earth in the direction opposite that of the rotation of the Earth.\n\n\nGeosynchronous classifications[edit]\n\n\tSemi-synchronous orbit (SSO) - An orbit with an altitude of approximately 20,200 km (12,600 mi) and an orbital period of approximately 12 hours\n\n\n\tGeosynchronous orbit (GEO) - Orbits with an altitude of approximately 35,786 km (22,236 mi). Such a satellite would trace an analemma (figure 8) in the sky.\n\n\n\t\t\tGeostationary orbit (GSO): A geosynchronous orbit with an inclination of zero. To an observer on the ground this satellite would appear as a fixed point in the sky.\n\n\n\n\n\n\n\t\t\tClarke orbit - Another name for a geostationary orbit. Named after the writer Arthur C. Clarke.\n\n\n\n\n\n\n\t\t\t\tEarth orbital libration points: The libration points for objects orbiting Earth are at 105 degrees west and 75 degrees east. More than 160 satellites are gathered at these two points.[9]\n\n\n\n\n\n\n\n\n\t\t\tSupersynchronous orbit - A disposal / storage orbit above GSO/GEO. Satellites will drift west.\n\n\n\n\n\n\n\t\t\tSubsynchronous orbit - A drift orbit close to but below GSO/GEO. Satellites will drift east.\n\n\n\n\n\n\n\t\t\tGraveyard orbit - An orbit a few hundred kilometers above geosynchronous that satellites are moved into at the end of their operation.\n\n\n\n\n\n\n\t\t\t\tDisposal orbit - A synonym for graveyard orbit.\n\n\n\n\n\n\n\n\n\t\t\t\tJunk orbit - A synonym for graveyard orbit.\n\n\n\n\n\n\n\n\nSpecial classifications[edit]\n\n\tSun-synchronous orbit - An orbit which combines altitude and inclination in such a way that the satellite passes over any given point of the planet's surface at the same local solar time. Such an orbit can place a satellite in constant sunlight and is useful for imaging, spy, and weather satellites.\n\n\n\tMoon orbit - The orbital characteristics of Earth's Moon. Average altitude of 384,403 kilometres (238,857 mi), elliptical–inclined orbit.\n\n\nNon-geocentric classifications[edit]\n\n\tHorseshoe orbit - An orbit that appears to a ground observer to be orbiting a planet but is actually in co-orbit with it. See asteroids 3753 (Cruithne) and 2002 AA29.\n\n\n\t Sub-orbital flight - A launch where a spacecraft approaches the height of orbit but lacks the velocity to sustain it.\n\n\nTangential velocities at altitude[edit]\n\n\tOrbit\n\tCenter-to-center\ndistance\n\tAltitude above\nthe Earth's surface\n\tSpeed\n\tOrbital period\n\tSpecific orbital energy\n\n\tEarth's own rotation at surface (for comparison – not an orbit)\n\t6,378 km\t0 km\n\t465.1 m/s (1,674 km/h or 1,040 mph)\n\t23 h 56 min\t−62.6 MJ/kg\n\n\tOrbiting at Earth's surface (equator)\n\t6,378 km\t0 km\t7.9 km/s (28,440 km/h or 17,672 mph)\t1 h 24 min 18 sec\t−31.2 MJ/kg\n\n\tLow Earth orbit\n\t6,600–8,400 km\t200–2,000 km\n\t\tCircular orbit: 6.9–7.8 km/s (24,840–28,080 km/h or 14,430–17,450 mph) respectively\n\tElliptic orbit: 6.5–8.2 km/s respectively\n\n\n\n\t1 h 29 min – 2 h 8 min\t−29.8 MJ/kg\n\n\tMolniya orbit\n\t6,900–46,300 km\t500–39,900 km\t1.5–10.0 km/s (5,400–36,000 km/h or 3,335–22,370 mph) respectively\t11 h 58 min\t−4.7 MJ/kg\n\n\tGeostationary\n\t42,000 km\t35,786 km\t3.1 km/s (11,600 km/h or 6,935 mph)\t23 h 56 min\t−4.6 MJ/kg\n\n\tOrbit of the Moon\n\t363,000–406,000 km\t357,000–399,000 km\t0.97–1.08 km/s (3,492–3,888 km/h or 2,170–2,416 mph) respectively\t27.3 days\t−0.5 MJ/kg\n\n\n\nSee also[edit]\n\n\n\tSpaceflight portal\n\n\n\n\tEarth's orbit\n\tList of orbits\n\tAstrodynamics\n\tCelestial sphere\n\tHeliocentric orbit\n\tAreosynchronous satellite\n\tAreostationary satellite\n\tEscape velocity\n\tSatellite\n\tSpace station\n\n\nReferences[edit]\n\n\n\t^ a b \"Satellite Situation Report, 1997\". NASA Goddard Space Flight Center. 2000-02-01. Archived from the original on 2006-08-23. Retrieved 2006-09-10.\n\n\t^ Hill, James V. H. (April 1999), \"Getting to Low Earth Orbit\", Space Future, archived from the original on 2012-03-19, retrieved 2012-03-18.\n\n\n\t^ Shiner, Linda (November 1, 2007), X-15 Walkaround, Air & Space Magazine, retrieved 2009-06-19.\n\n\n\t^ Dimotakis, P.;  et al. (October 1999), 100 lbs to Low Earth Orbit (LEO): Small-Payload Launch Options, The Mitre Corporation, pp. 1–39, archived from the original on 2017-08-29, retrieved 2012-01-21.\n\n\n\t^ Ghosh, S. N. (2000), Atmospheric Science and Environment, Allied Publishers, pp. 47–48, ISBN 978-8177640434\n\n\n\t^ Kennewell, John; McDonald, Andrew (2011), Satellite Lifetimes and Solar Activity, Commonwealth of Australia Bureau of Weather, Space Weather Branch, archived from the original on 2011-12-28, retrieved 2011-12-31.\n\n\n\t^ Williams, David R. (November 17, 2010), \"Earth Fact Sheet\", Lunar & Planetary Science, NASA, archived from the original on October 30, 2010, retrieved 2012-05-10.\n\n\n\t^ Definitions of geocentric orbits from the Goddard Space Flight Center Archived May 27, 2010, at the Wayback Machine\n\n\t^ Out-of-Control Satellite Threatens Other Nearby Spacecraft, by Peter B. de Selding, SPACE.com, 5/3/10. Archived May 5, 2010, at the Wayback Machine\n\n\n\n\n\nExternal links[edit]\n\n\thttp://www.freemars.org/jeff/speed/index.htm\n\thttp://www.tech-faq.com/medium-earth-orbit.shtml\n\thttp://www.hq.nasa.gov/office/pao/History/conghand/traject.htm\n\thttps://web.archive.org/web/20100221072300/http://www.space.com/scienceastronomy/solarsystem/second_moon_991029.html\n\thttp://www.astro.uwo.ca/~wiegert/3753/3753.html\n\thttp://www.astro.uwo.ca/~wiegert/AA29/AA29.html\n\n\n\t\tv\n\tt\n\te\n\n\nEarth-related topics\n\n\tHistory\t\n\tAge of the Earth\n\tCool early Earth\n\tEarly Earth\n\tEvolutionary history of life\n\tFaint young Sun paradox\n\tFormation and evolution of the Solar System\n\tFuture of Earth\n\tGeological history of Earth\n\tGeologic time scale\n\tHistory of Earth\n\tTimeline of evolution\n\n\n\n\t\n\n\t\tGeography\n\tGeology\n\n\n\t\n\tClairaut's theorem\n\tContinents\n\tEarthquake\n\tEquatorial bulge\n\tExtremes on Earth\n\tGeology of solar terrestrial planets\n\tGeophysics\n\tPlate tectonics\n\tStructure of the Earth\n\tTime zones\n\n\n\n\n\tEcology\t\n\tEarth Day\n\tGlobal warming\n\tHuman impact on the environment\n\n\n\n\n\tImaging\t\n\tApple Maps\n\tBaidu Maps\n\tBhuvan\n\tBing Maps\n\tGlobal Map\n\tGoogle Earth\n\tGoogle Maps\n\tMapmyIndia\n\tNASA World Wind\n\tHere\n\tOpenStreetMap\n\tRemote sensing\n\tWikimapia\n\tYahoo! Maps\n\t Yandex Maps\n\n\n\n\n\t\tArts\n\tCulture\n\tSociety\n\n\n\t\n\tEarth in culture\n\tEarth in science fiction\n\tEtymology of the word \"Earth\"\n\tHistory of the world\n\tInternational law\n\tLandscape painting\n\tList of countries\n\tWorld economy\n\n\n\n\n\tFormation\nand evolution\t\n\tAccretion\n\tAccretion disk\n\tAsteroid belt\n\tCircumplanetary disk\n\tCircumstellar disc\n\tCircumstellar envelope\n\tCosmic dust\n\tDebris disk\n\tDetached object\n\tDisrupted planet\n\tExcretion disk\n\tExoplanetary Circumstellar Environments and Disk Explorer\n\tExozodiacal dust\n\tExtraterrestrial materials\n\tExtraterrestrial sample curation\n\tGiant-impact hypothesis\n\tGravitational collapse\n\tHills cloud\n\tInterplanetary dust cloud\n\tInterplanetary medium\n\tInterplanetary space\n\tInterstellar cloud\n\tInterstellar dust\n\tInterstellar medium\n\tInterstellar space\n\tKuiper belt\n\tList of interstellar and circumstellar molecules\n\tMerging stars\n\tMolecular cloud\n\tNebular hypothesis\n\tOort cloud\n\tOuter space\n\tPlanetary migration\n\tPlanetary system\n\tPlanetesimal\n\tPlanet formation\n\tProtoplanetary disk\n\tRing system\n\tRubble pile\n\tSample-return mission\n\tScattered disc\n\tStar formation\n\n\n\n\n\tRelated\t\n\tBiosphere\n\tClaimed moons of Earth\n\tEarliest known life forms\n\tEarth's location in the Universe\n\tEarth's orbit\n\tEarth phase\n\tEarth trojan\n\tEarthling\n\tThe ecliptic\n\tFlag of Earth\n\tGravity\n\tKordylewski cloud\n\tLife timeline\n\tLocation of Earth in the Universe\n\tMagnetic field\n\tNature timeline\n\tSolar System\n\tThe Moon\n\tTheia\n\t2006 RH120\n\tEarthrise (1968 photograph)\n\tThe Blue Marble (1972 photograph)\n\tPale Blue Dot (1990 photograph)\n\tThe Day the Earth Smiled\n\n\n\n\n\t\n\t Earth sciences portal\n\t Solar System portal\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nGravitational orbits\n\n\tTypes\t\n\tGeneral\t\n\tBox\n\tCapture\n\tCircular\n\tElliptical / Highly elliptical\n\tEscape\n\tHorseshoe\n\tHyperbolic trajectory\n\tInclined / Non-inclined\n\tLagrangian point\n\tOsculating\n\tParabolic trajectory\n\tParking\n\tSynchronous\n\tsemi\n\tsub\n\n\n\tTransfer orbit\n\n\n\n\n\tGeocentric\t\n\tGeosynchronous\n\tGeostationary\n\tGeostationary transfer\n\n\n\tGraveyard\n\tHigh Earth\n\tLow Earth\n\tMedium Earth\n\tMolniya\n\tNear-equatorial\n\tOrbit of the Moon\n\tPolar\n\tSun-synchronous\n\tTundra\n\n\n\n\n\tAbout other points\t\n\tMars\n\tAreosynchronous\n\tAreostationary\n\n\n\tLagrange points\n\tHalo\n\tLissajous\n\n\n\tLunar\n\tSun\n\tHeliocentric\n\tEarth's orbit\n\n\n\tHeliosynchronous\n\n\n\n\n\n\n\n\n\n\tParameters\t\n\t\tShape\n\tSize\n\n\n\t\n\te  Eccentricity\n\ta  Semi-major axis\n\tb  Semi-minor axis\n\tQ, q  Apsides\n\n\n\n\n\tOrientation\t\n\ti  Inclination\n\tΩ  Longitude of the ascending node\n\tω  Argument of periapsis\n\tϖ  Longitude of the periapsis\n\n\n\n\n\tPosition\t\n\tM  Mean anomaly\n\tν, θ, f  True anomaly\n\tE  Eccentric anomaly\n\tL  Mean longitude\n\tl  True longitude\n\n\n\n\n\tVariation\t\n\tT  Orbital period\n\tn  Mean motion\n\tv  Orbital speed\n\tt0  Epoch\n\n\n\n\n\n\n\n\tManeuvers\t\n\tBi-elliptic transfer\n\tCollision avoidance (spacecraft)\n\tDelta-v\n\tDelta-v budget\n\tGravity assist\n\tGravity turn\n\tHohmann transfer\n\tInclination change\n\tLow energy transfer\n\tOberth effect\n\tPhasing\n\tRocket equation\n\tRendezvous\n\tTransposition, docking, and extraction\n\n\n\n\n\tOrbital mechanics\t\n\tCelestial coordinate system\n\tCharacteristic energy\n\tEscape velocity\n\tEphemeris\n\tEquatorial coordinate system\n\tGround track\n\tHill sphere\n\tInterplanetary Transport Network\n\tKepler's laws of planetary motion\n\tLagrangian point\n\tn-body problem\n\tOrbit equation\n\tOrbital state vectors\n\tPerturbation\n\tRetrograde motion\n\tSpecific orbital energy\n\tSpecific relative angular momentum\n\tTwo-line elements\n\n\n\n\n\t\n\tList of orbits\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpaceflight\n\n\tGeneral\t\n\tAstrodynamics\n\tHistory\n\tTimeline\n\tSpace Race\n\tAsian Space Race\n\tRecords\n\tAccidents and incidents\n\n\n\tSpace policy\n\tAustralia\n\tChina\n\tEuropean Union\n\tIndia\n\tJapan\n\tRussia\n\tSoviet Union\n\tUnited States\n\n\n\tSpace law\n\tOuter Space Treaty\n\tRescue Agreement\n\tSpace Liability Convention\n\tRegistration Convention\n\tMoon Treaty\n\n\n\tPrivate spaceflight\n\n\n\n\t\n\n\tApplications\t\n\tAstronomy\n\tEarth observation\n\tArchaeology\n\tImagery and mapping\n\tReconnaissance\n\tWeather and environment monitoring\n\n\n\tSatellite communications\n\tInternet\n\tRadio\n\tTelephone\n\tTelevision\n\n\n\tSatellite navigation\n\tCommercial use of space\n\tSpace launch market competition\n\tMilitarisation of space\n\tSpace architecture\n\tSpace exploration\n\tSpace research\n\tSpace technology\n\tSpace weather\n\n\n\n\n\tHuman spaceflight\t\n\tGeneral\t\n\tAstronaut\n\tcommercial\n\n\n\tLife support system\n\tAnimals in space\n\tBioastronautics\n\tSpace suit\n\n\n\tExtravehicular activity\n\tWeightlessness\n\tSpace toilet\n\tSpace tourism\n\tSpace colonization\n\n\n\n\n\tPrograms\t\n\tVostok\n\tMercury\n\tVoskhod\n\tGemini\n\tSoyuz\n\tApollo\n\tSkylab\n\tApollo–Soyuz\n\n\n\tSpace Shuttle\n\tMir\n\tShuttle–Mir\n\n\n\tInternational Space Station\n\tShenzhou\n\tTiangong\n\n\n\n\n\tHealth issues\t\n\tEffect of spaceflight on the human body\n\tSpace adaptation syndrome\n\n\n\tHealth threat from cosmic rays\n\tSpace psychology\n\tPsychological and sociological effects\n\n\n\tSpace and survival\n\tSpace medicine\n\tSpace nursing\n\n\n\n\n\n\n\n\tSpacecraft\t\n\tLaunch vehicle\n\tRocket\n\tSpaceplane\n\tRobotic spacecraft\n\tSatellite\n\tSpace probe\n\tLander\n\tRover\n\tSelf-replicating spacecraft\n\tSpace telescope\n\n\n\tSpacecraft propulsion\n\tRocket engine\n\tElectric propulsion\n\tSolar sail\n\tGravity assist\n\n\n\n\n\n\n\tDestinations\t\n\tSub-orbital\n\tOrbital\n\tGeocentric\n\tGeosynchronous\n\n\n\tInterplanetary\n\tInterstellar\n\tIntergalactic\n\n\n\n\n\tSpace launch\t\n\tDirect ascent\n\tEscape velocity\n\tExpendable and reusable launch systems\n\tLaunch pad\n\tNon-rocket spacelaunch\n\tSpaceport\n\n\n\n\n\tGround segment\t\n\tFlight controller\n\tGround station\n\tPass\n\tMission control center\n\n\n\n\n\tSpace agencies\t\n\t CoNAE\n\t ASA\n\t AEB\n\t CSA\n\t CNSA\n\t ESA\n\t CNES\n\t DLR\n\t ISRO\n\t LAPAN\n\t ISA\n\t ISA\n\t ASI\n\t AEM\n\t JAXA\n\t NADA\n\t KARI\n\t SUPARCO\n\t Roscosmos\n\t SNSA\n\t SSAU\n\t UKSA\n\t NASA\n\n\n\n\n\t\n\t  Category\n\t  Portal\n\t  WikiProject\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Geocentric_orbit&oldid=916668266#Altitude_classifications\"\n\n\t\t\n\t\tCategories: \tEarth orbits\n\n\nHidden categories: \tWebarchive template wayback links\n\tArticles needing additional references from December 2015\n\tAll articles needing additional references\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tCatalà\n\tČeština\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tفارسی\n\tFrançais\n\tहिन्दी\n\tBahasa Indonesia\n\tItaliano\n\tLatviešu\n\tMagyar\n\tBahasa Melayu\n\tМонгол\n\t日本語\n\tPortuguês\n\tРусский\n\tСрпски / srpski\n\tSuomi\n\tதமிழ்\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 20 September 2019, at 01:18 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "6", "dc:title": "Geocentric orbit - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-orbital_altitude", "title": "Geocentric orbit - Wikipedia"}}