{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPacket switching - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tPacket switching\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\ta method of grouping data which is transmitted over a digital network into packets\n\nPacket switching is a method of grouping data that is transmitted over a digital network into packets. Packets are made of a header and a payload. Data in the header are used by networking hardware to direct the packet to its destination where the payload is extracted and used by application software. Packet switching is the primary basis for data communications in computer networks worldwide.\n\nIn the early 1960s, American computer scientist Paul Baran developed the concept Distributed Adaptive Message Block Switching with the goal to provide a fault-tolerant, efficient routing method for telecommunication messages as part of a research program at the RAND Corporation, funded by the US Department of Defense.[1] This concept contrasted with, and contradicted, then-established principles of pre-allocation of network bandwidth, largely fortified by the development of telecommunications in the Bell System. The new concept found little resonance among network implementers until the independent work of British computer scientist Donald Davies at the National Physical Laboratory (United Kingdom) in 1965. Davies is credited with coining the modern term packet switching and inspiring numerous packet switching networks in the decade following, including the incorporation of the concept in the early ARPANET in the United States.[2][3]\n\n\n\tMultiplexing\n\t\n\t\nAnalog modulation\n\t\n\n\tAM\n\tFM\n\tPM\n\tQAM\n\tSM\n\tSSB\n\n\n\n\n\t\nCircuit mode\n(constant bandwidth)\n\n\t\n\n\tTDM\n\tFDM / WDM\n\tSDMA\n\tPolarization\n\tSpatial\n\tOAM\n\n\n\n\n\t\nStatistical multiplexing\n\n(variable bandwidth)\n\n\t\n\n\tPacket switching\n\tDynamic TDMA\n\tFHSS\n\tDSSS\n\tOFDMA\n\tSC-FDM\n\tMC-SS\n\n\n\n\n\t\nRelated topics\n\t\n\tChannel access methods\n\tMedia access control\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nContents\n\n\n\t1 Concept\n\t2 History\n\t3 Connectionless and connection-oriented modes\n\t4 Packet switching in networks\n\t5 Packet-switched networks\n\t5.1 Early networks\n\t5.1.1 AppleTalk\n\t5.1.2 ARPANET\n\t5.1.3 BNRNET\n\t5.1.4 CYCLADES\n\t5.1.5 DECnet\n\t5.1.6 DDX-1\n\t5.1.7 EIN née COST II\n\t5.1.8 EPSS\n\t5.1.9 GEIS\n\t5.1.10 IPSANET\n\t5.1.11 IPX/SPX\n\t5.1.12 Merit Network\n\t5.1.13 NPL\n\t5.1.14 OCTOPUS\n\t5.1.15 Philips Research\n\t5.1.16 PUP\n\t5.1.17 RCP\n\t5.1.18 RETD\n\t5.1.19 SCANNET\n\t5.1.20 SITA HLN\n\t5.1.21 IBM Systems Network Architecture\n\t5.1.22 Telenet\n\t5.1.23 Tymnet\n\t5.1.24 XNS\n\n\n\n\t5.2 X.25 era\n\t5.2.1 AUSTPAC\n\t5.2.2 ConnNet\n\t5.2.3 Datanet 1\n\t5.2.4 Datapac\n\t5.2.5 Datex-P\n\t5.2.6 Eirpac\n\t5.2.7 HIPA-NET\n\t5.2.8 Iberpac\n\t5.2.9 JANET\n\t5.2.10 PSS\n\t5.2.11 TRANSPAC\n\t5.2.12 VENUS-P\n\t5.2.13 Venepaq\n\n\n\n\t5.3 Internet era\n\t5.3.1 CSNET\n\t5.3.2 Internet2\n\t5.3.3 NSFNET\n\t5.3.4 NSFNET regional networks\n\t5.3.5 National LambdaRail\n\t5.3.6 TransPAC, TransPAC2, and TransPAC3\n\t5.3.7 Very high-speed Backbone Network Service (vBNS)\n\n\n\n\n\n\n\t6 See also\n\t7 References\n\t7.1 Bibliography\n\n\n\n\t8 Further reading\n\t9 External links\n\n\n\n\n\n\nConcept[edit]\n\n  \nAn animation demonstrating datagram type of packet switching across a network\n\n\n\nA simple definition of packet switching is:\n\n\nThe routing and transferring of data by means of addressed packets so that a channel is occupied during the transmission of the packet only, and upon completion of the transmission the channel is made available for the transfer of other traffic[4][5]\n\n\n\nPacket switching allows delivery of variable bit rate data streams, realized as sequences of packets, over a computer network which allocates transmission resources as needed using statistical multiplexing or dynamic bandwidth allocation techniques. As they traverse networking hardware, such as switches and routers, packets are received, buffered, queued, and retransmitted (stored and forwarded), resulting in variable latency and throughput depending on the link capacity and the traffic load on the network. Packets are normally forwarded by intermediate network nodes asynchronously using first-in, first-out buffering, but may be forwarded according to some scheduling discipline for fair queuing, traffic shaping, or for differentiated or guaranteed quality of service, such as weighted fair queuing or leaky bucket. Packet-based communication may be implemented with or without intermediate forwarding nodes (switches and routers). In case of a shared physical medium (such as radio or 10BASE5), the packets may be delivered according to a multiple access scheme. \n\nPacket switching contrasts with another principal networking paradigm, circuit switching, a method which pre-allocates dedicated network bandwidth specifically for each communication session, each having a constant bit rate and latency between nodes. In cases of billable services, such as cellular communication services, circuit switching is characterized by a fee per unit of connection time, even when no data is transferred, while packet switching may be characterized by a fee per unit of information transmitted, such as characters, packets, or messages.\n\nA packet switch has four components: input ports, output ports, routing processor, and switching fabric.[citation needed]\n\n\nHistory[edit]\n\nFurther information: History of the Internet\n\nThe concept of switching small blocks of data was first explored independently by Paul Baran at the RAND Corporation starting in the late 1950s in the US and Donald Davies at the National Physical Laboratory (NPL) in the UK.[6][7][8]\n\nIn the late 1950s, the US Air Force established a wide area network for the Semi-Automatic Ground Environment (SAGE) radar defense system. They sought a system that might survive a nuclear attack to enable a response, thus diminishing the attractiveness of the first strike advantage by enemies (see Mutual assured destruction).[9] Baran developed the concept of distributed adaptive message block switching in support of the Air Force initiative.[10] The concept was first presented to the Air Force in the summer of 1961 as briefing B-265,[9] later published as RAND report P-2626 in 1962,[11] and finally in report RM 3420 in 1964.[12] Report P-2626 described a general architecture for a large-scale, distributed, survivable communications network. The work focuses on three key ideas: use of a decentralized network with multiple paths between any two points, dividing user messages into message blocks, and delivery of these messages by store and forward switching.\n\nDavies developed a similar message routing concept in 1965. He called it simply packet switching, and proposed building a nationwide network in the UK.[13] He gave a talk on the proposal in 1966, after which a person from the Ministry of Defence (MoD) told him about Baran's work. Roger Scantlebury, a member of Davies' team met Lawrence Roberts at the 1967 ACM Symposium on Operating System Principles and suggested it for use in the ARPANET.[14] Davies had chosen some of the same parameters for his original network design as did Baran, such as a packet size of 1024 bits. In 1966, Davies proposed that a network should be built at the laboratory to serve the needs of NPL and prove the feasibility of packet switching. After a pilot experiment in 1967,[15][16] the NPL Data Communications Network entered service in 1969.[17]\n\nLeonard Kleinrock conducted early research in queueing theory for his doctoral dissertation at MIT in 1961-2 and published it as a book in 1964 in the field of digital message switching.[18] Following the 1967 ACM Symposium,  Lawrence Roberts asked Kleinrock to carry out theoretical work to model the performance of packet-switched networks, which underpinned the development of the ARPANET. The NPL team also carried out simulation work on packet networks.[17]\n\nThe French CYCLADES network, designed by Louis Pouzin in the early 1970s, was the first to employ what came to be known as the end-to-end principle, and make the hosts responsible for the reliable delivery of data on a packet-switched network, rather than this being a centralized service of the network itself.\n\nIn 1974, Vint Cerf and Bob Kahn published the specifications for Transmission Control Protocol (TCP), an internetworking protocol for sharing resources using packet-switching among the nodes[19] (this monolithic protocol was later layered as TCP atop the Internet Protocol, or IP).\n\n\nConnectionless and connection-oriented modes[edit]\n\nPacket switching may be classified into connectionless packet switching, also known as datagram switching, and connection-oriented packet switching, also known as virtual circuit switching. Examples of connectionless systems are Ethernet, Internet Protocol (IP), and the User Datagram Protocol (UDP). Connection-oriented systems include X.25, Frame Relay, Multiprotocol Label Switching (MPLS), and the Transmission Control Protocol (TCP).\n\nIn connectionless mode each packet is labeled with a destination address, source address, and port numbers. It may also be labeled with the sequence number of the packet. This information eliminates the need for a pre-established path to help the packet find its way to its destination, but means that more information is needed in the packet header, which is therefore larger. The packets are routed individually, sometimes taking different paths resulting in out-of-order delivery. At the destination, the original message may be reassembled in the correct order, based on the packet sequence numbers. Thus a virtual circuit carrying a byte stream is provided to the application by a transport layer protocol, although the network only provides a connectionless network layer service.\n\nConnection-oriented transmission requires a setup phase to establish the parameters of communication before any packet is transferred. The signaling protocols used for setup allow the application to specify its requirements and discover link parameters. Acceptable values for service parameters may be negotiated. The packets transferred may include a connection identifier rather than address information and the packet header can be smaller, as it only needs to contain this code and any information, such as length, timestamp, or sequence number, which is different for different packets. In this case, address information is only transferred to each node during the connection setup phase, when the route to the destination is discovered and an entry is added to the switching table in each network node through which the connection passes. When a connection identifier is used, routing a packet requires the node to look up the connection identifier in a table. \n\nConnection-oriented transport layer protocols such as TCP provide a connection-oriented service by using an underlying connectionless network. In this case, the end-to-end principle dictates that the end nodes, not the network itself, are responsible for the connection-oriented behavior.\n\n\nPacket switching in networks[edit]\n\nPacket switching is used to optimize the use of the channel capacity available in digital telecommunication networks, such as computer networks, and minimize the transmission latency (the time it takes for data to pass across the network), and to increase robustness of communication.\n\nPacket switching is used in the Internet and most local area networks. The Internet is implemented by the Internet Protocol Suite using a variety of Link Layer technologies. For example, Ethernet and Frame Relay are common. Newer mobile phone technologies (e.g., GPRS, i-mode) also use packet switching. Packet switching is associated with connectionless networking because, in these systems, no connection agreement needs to be established between communicating parties prior to exchanging data. \n\nX.25 is a notable use of packet switching in that, despite being based on packet switching methods, it provides virtual circuits to the user. These virtual circuits carry variable-length packets. In 1978, X.25 provided the first international and commercial packet switching network, the International Packet Switched Service (IPSS). Asynchronous Transfer Mode (ATM) also is a virtual circuit technology, which uses fixed-length cell relay connection oriented packet switching. Technologies such as Multiprotocol Label Switching (MPLS) and the Resource Reservation Protocol (RSVP) create virtual circuits on top of datagram networks. MPLS and its predecessors, as well as ATM, have been called \"fast packet\" technologies. MPLS, indeed, has been called \"ATM without cells\".[20] Virtual circuits are especially useful in building robust failover mechanisms and allocating bandwidth for delay-sensitive applications.\n\n\nPacket-switched networks[edit]\n\nFurther information: History of the Internet\n\nThe history of packet-switched networks can be divided into three overlapping eras: early networks before the introduction of X.25 and the OSI model, the X.25 era when many postal, telephone, and telegraph companies introduced networks with X.25 interfaces, and the Internet era.[21][22]\n\n\nEarly networks[edit]\n\nResearch into packet switching at the National Physical Laboratory (NPL) began with a proposal for a wide-area network in 1965,[2] and a local-area network in 1966.[23] ARPANET funding was secured in 1966 by Bob Taylor, and planning began in 1967 when he hired Larry Roberts. The NPL network, ARPANET, and SITA HLN became operational in 1969. Before the introduction of X.25 in 1973,[24] about twenty different network technologies had been developed. Two fundamental differences involved the division of functions and tasks between the hosts at the edge of the network and the network core. In the datagram system, the hosts have the responsibility to ensure orderly delivery of packets. The User Datagram Protocol (UDP) is an example of a datagram protocol. In the virtual call system, the network guarantees sequenced delivery of data to the host. This results in a simpler host interface with less functionality than in the datagram model. The X.25 protocol suite uses this network type.\n\n\nAppleTalk[edit]\n\nAppleTalk is a proprietary suite of networking protocols developed by Apple in 1985 for Apple Macintosh computers. It was the primary protocol used by Apple devices through the 1980s and 1990s. AppleTalk included features that allowed local area networks to be established ad hoc without the requirement for a centralized router or server. The AppleTalk system automatically assigned addresses, updated the distributed namespace, and configured any required inter-network routing. It was a plug-n-play system.[25][26]\n\nAppleTalk versions were also released for the IBM PC and compatibles, and the Apple IIGS. AppleTalk support was available in most networked printers, especially laser printers, some file servers and routers. AppleTalk support was terminated in 2009, replaced by TCP/IP protocols.[25]\n\n\nARPANET[edit]\n\nThe ARPANET was a progenitor network of the Internet and the first network to run the TCP/IP suite using packet switching technologies.\n\n\nBNRNET[edit]\n\nBNRNET was a network which Bell Northern Research developed for internal use. It initially had only one host but was designed to support many hosts. BNR later made major contributions to the CCITT X.25 project.[27]\n\n\nCYCLADES[edit]\n\nThe CYCLADES packet switching network was a French research network designed and directed by Louis Pouzin. First demonstrated in 1973, it was developed to explore alternatives to the early ARPANET design and to support network research generally. It was the first network to make the hosts responsible for reliable delivery of data, rather than the network itself, using unreliable datagrams and associated end-to-end protocol mechanisms. Concepts of this network influenced later ARPANET architecture.[28][29]\n\n\nDECnet[edit]\n\nDECnet is a suite of network protocols created by Digital Equipment Corporation, originally released in 1975 in order to connect two PDP-11 minicomputers. It evolved into one of the first peer-to-peer network architectures, thus transforming DEC into a networking powerhouse in the 1980s. Initially built with three layers, it later (1982) evolved into a seven-layer OSI-compliant networking protocol. The DECnet protocols were designed entirely by Digital Equipment Corporation. However, DECnet Phase II (and later) were open standards with published specifications, and several implementations were developed outside DEC, including one for Linux.[30]\n\n\nDDX-1[edit]\n\nThis was an experimental network from Nippon PTT. It mixed circuit switching and packet switching. It was succeeded by DDX-2.[31]\n\n\nEIN née COST II[edit]\n\nEuropean Informatics Network was a project to link several national networks. It became operational in 1976.[32]\n\n\nEPSS[edit]\n\nThe Experimental Packet Switching System (EPSS) was an experiment of the UK Post Office. It was the first public packet switching network in the UK when it began operating in 1977, based on protocols defined by the UK academic community in 1975.[33] Ferranti supplied the hardware and software. The handling of link control messages (acknowledgements and flow control) was different from that of most other networks.[34][35]\n\n\nGEIS[edit]\n\nAs General Electric Information Services (GEIS), General Electric was a major international provider of information services. The company originally designed a telephone network to serve as its internal (albeit continent-wide) voice telephone network.\n\nIn 1965, at the instigation of Warner Sinback, a data network based on this voice-phone network was designed to connect GE's four computer sales and service centers (Schenectady, New York, Chicago, and Phoenix) to facilitate a computer time-sharing service, apparently the world's first commercial online service. (In addition to selling GE computers, the centers were computer service bureaus, offering batch processing services. They lost money from the beginning, and Sinback, a high-level marketing manager, was given the job of turning the business around. He decided that a time-sharing system, based on Kemeny's work at Dartmouth—which used a computer on loan from GE—could be profitable. Warner was right.)\n\nAfter going international some years later, GEIS created a network data center near Cleveland, Ohio. Very little has been published about the internal details of their network. (Though it has been stated by some that Tymshare copied the GEIS system to create their network, Tymnet.) The design was hierarchical with redundant communication links.\n[36]\n[37]\n\n\nIPSANET[edit]\n\nIPSANET was a semi-private network constructed by I. P. Sharp Associates to serve their time-sharing customers. It became operational in May 1976.\n\n\nIPX/SPX[edit]\n\nThe Internetwork Packet Exchange (IPX) and Sequenced Packet Exchange (SPX) are Novell networking protocols derived from Xerox Network Systems' IDP and SPP protocols, respectively. They were used primarily on networks using the Novell NetWare operating systems.[38]\n\n\nMerit Network[edit]\n\nMerit Network, Inc., an independent non-profit 501(c)(3) corporation governed by Michigan's public universities,[39] was formed in 1966 as the Michigan Educational Research Information Triad to explore computer networking between three of Michigan's public universities as a means to help the state's educational and economic development.[40] With initial support from the State of Michigan and the National Science Foundation (NSF), the packet-switched network was first demonstrated in December 1971 when an interactive host-to-host connection was made between the IBM mainframe computer systems at the University of Michigan in Ann Arbor and Wayne State University in Detroit.[41] In October 1972, connections to the CDC mainframe at Michigan State University in East Lansing completed the triad. Over the next several years, in addition to host-to-host interactive connections, the network was enhanced to support terminal-to-host connections, host-to-host batch connections (remote job submission, remote printing, batch file transfer), interactive file transfer, gateways to the Tymnet and Telenet public data networks, X.25 host attachments, gateways to X.25 data networks, Ethernet attached hosts, and eventually TCP/IP; additionally, public universities in Michigan joined the network.[41][42] All of this set the stage for Merit's role in the NSFNET project starting in the mid-1980s.\n\n\nNPL[edit]\n\nIn 1965, Donald Davies of the National Physical Laboratory (United Kingdom) designed and proposed a national data network based on packet switching. The proposal was not taken up nationally, but by 1967, a pilot experiment had demonstrated the feasibility of packet switched networks.[15][16]\n\nBy 1969 Davies had begun building the Mark I packet-switched network to meet the needs of the multidisciplinary laboratory and prove the technology under operational conditions.[43][17][44] In 1976, 12 computers and 75 terminal devices were attached,[45] and more were added until the network was replaced in 1986. NPL, followed by ARPANET, were the first two networks in the world to use packet switching,[46][47] and were interconnected in the early 1970s.\n\n\nOCTOPUS[edit]\n\nOctopus was a local network at Lawrence Livermore National Laboratory. It connected sundry hosts at the lab to interactive terminals and various computer peripherals including a bulk storage system.[48][49][50]\n\n\nPhilips Research[edit]\n\nPhilips Research Laboratories in Redhill, Surrey developed a packet switching network for internal use. It was a datagram network with a single switching node.[51]\n\n\nPUP[edit]\n\nPARC Universal Packet (PUP or Pup) was one of the two earliest internetwork protocol suites; it was created by researchers at Xerox PARC in the mid-1970s. The entire suite provided routing and packet delivery, as well as higher level functions such as a reliable byte stream, along with numerous applications. Further developments led to Xerox Network Systems (XNS).[52]\n\n\nRCP[edit]\n\nRCP was an experimental network created by the French PTT. It was used to gain experience with packet switching technology before the specification of TRANSPAC was frozen[53]. RCP was a virtual-circuit network in contrast to CYCLADES which was based on datagrams. RCP emphasised terminal-to-host and terminal-to-terminal connection; CYCLADES was concerned with host-to-host communication. TRANSPAC was introduced as an X.25 network. RCP influenced the specification of X.25[54][55][56]\n\n\nRETD[edit]\n\nRed Especial de Transmisión de Datos was a network developed by Compañía Telefónica Nacional de España. It became operational in 1972 and thus was the first public network.[57][58][59]\n\n\nSCANNET[edit]\n\n\"The experimental packet-switched Nordic telecommunication network SCANNET was implemented in Nordic technical libraries in the 1970s, and it included first Nordic electronic journal Extemplo. Libraries were also among first ones in universities to accommodate microcomputers for public use in the early 1980s.\"[60]\n\n\nSITA HLN[edit]\n\nSITA is a consortium of airlines. Its High Level Network became operational in 1969 at about the same time as ARPANET. It carried interactive traffic and message-switching traffic. As with many non-academic networks, very little has been published about it.[61]\n\n\nIBM Systems Network Architecture[edit]\n\nIBM Systems Network Architecture (SNA) is IBM's proprietary networking architecture created in 1974. An IBM customer could acquire hardware and software from IBM and lease private lines from a common carrier to construct a private network.[62]\n\n\nTelenet[edit]\n\nTelenet was the first FCC-licensed public data network in the United States. It was founded by former ARPA IPTO director Larry Roberts as a means of making ARPANET technology public. He had tried to interest AT&T in buying the technology, but the monopoly's reaction was that this was incompatible with their future. Bolt, Beranack and Newman (BBN) provided the financing. It initially used ARPANET technology but changed the host interface to X.25 and the terminal interface to X.29. Telenet designed these protocols and helped standardize them in the CCITT. Telenet was incorporated in 1973 and started operations in 1975. It went public in 1979 and was then sold to GTE.[63][64]\n\n\nTymnet[edit]\n\nTymnet was an international data communications network headquartered in San Jose, CA that utilized virtual call packet switched technology and used X.25, SNA/SDLC, BSC and ASCII interfaces to connect host computers (servers) at thousands of large companies, educational institutions, and government agencies. Users typically connected via dial-up connections or dedicated async connections. The business consisted of a large public network that supported dial-up users and a private network business that allowed government agencies and large companies (mostly banks and airlines) to build their own dedicated networks. The private networks were often connected via gateways to the public network to reach locations not on the private network. Tymnet was also connected to dozens of other public networks in the U.S. and internationally via X.25/X.75 gateways. (Interesting note: Tymnet was not named after Mr. Tyme. Another employee suggested the name.)\n[65]\n[66]\n\n\nXNS[edit]\n\nXerox Network Systems (XNS) was a protocol suite promulgated by Xerox, which provided routing and packet delivery, as well as higher level functions such as a reliable stream, and remote procedure calls. It was developed from PARC Universal Packet (PUP).[67][68]\n\n\nX.25 era[edit]\n\nThere were two kinds of X.25 networks. Some such as DATAPAC and TRANSPAC were initially implemented with an X.25 external interface. Some older networks such as TELENET and TYMNET were modified to provide a X.25 host interface in addition to older host connection schemes. DATAPAC was developed by Bell Northern Research which was a joint venture of Bell Canada (a common carrier) and Northern Telecom (a telecommunications equipment supplier). Northern Telecom sold several DATAPAC clones to foreign PTTs including the Deutsche Bundespost. X.75 and X.121 allowed the interconnection of national X.25 networks. A user or host could call a host on a foreign network by including the DNIC of the remote network as part of the destination address.[citation needed]\n\n\nAUSTPAC[edit]\n\nAUSTPAC was an Australian public X.25 network operated by Telstra. Started by Telecom Australia in the early 1980s, AUSTPAC was Australia's first public packet-switched data network, supporting applications such as on-line betting, financial applications—the Australian Tax Office made use of AUSTPAC—and remote terminal access to academic institutions, who maintained their connections to AUSTPAC up until the mid-late 1990s in some cases. Access can be via a dial-up terminal to a PAD, or, by linking a permanent X.25 node to the network.[69]\n\n\nConnNet[edit]\n\nConnNet was a packet-switched data network operated by the Southern New England Telephone Company serving the state of Connecticut.[70][citation needed]\n\n\nDatanet 1[edit]\n\nDatanet 1 was the public switched data network operated by the Dutch PTT Telecom (now known as KPN). Strictly speaking Datanet 1 only referred to the network and the connected users via leased lines (using the X.121 DNIC 2041), the name also referred to the public PAD service Telepad (using the DNIC 2049). And because the main Videotex service used the network and modified PAD devices as infrastructure the name Datanet 1 was used for these services as well. Although this use of the name was incorrect all these services were managed by the same people within one department of KPN contributed to the confusion.[71]\n\n\nDatapac[edit]\n\nDATAPAC was the first operational X.25 network (1976). It covered major Canadian cities and was eventually extended to smaller centres.[citation needed]\n\n\nDatex-P[edit]\n\nDeutsche Bundespost operated this national network in Germany. The technology was acquired from Northern Telecom.[citation needed]\n\n\nEirpac[edit]\n\nEirpac is the Irish public switched data network supporting X.25 and X.28. It was launched in 1984, replacing Euronet. Eirpac is run by Eircom.[72][73][74]\n\n\nHIPA-NET[edit]\n\nHitachi designed a private network system for sale as a turnkey package to multi-national organizations. In addition to providing X.25 packet switching, message switching software was also included. Messages were buffered at the nodes adjacent to the sending and receiving terminals. Switched virtual calls were not supported, but through the use of \"logical ports\" an originating terminal could have a menu of pre-defined destination terminals.\n[75]\n\n\nIberpac[edit]\n\nIberpac is the Spanish public packet-switched network, providing X.25 services. Iberpac is run by Telefonica.[citation needed]\n\n\nJANET[edit]\n\nJANET was the UK academic and research network, linking all universities, higher education establishments, publicly funded research laboratories.[76] The X.25 network was based mainly on GEC 4000 series switches, and run X.25 links at up to 8 Mbit/s in its final phase before being converted to an IP based network. The JANET network grew out of the 1970s SRCnet (later called SERCnet) network.[77]\n\n\nPSS[edit]\n\nPacket Switch Stream (PSS) was the UK Post Office (later to become British Telecom) national X.25 network with a DNIC of 2342. British Telecom renamed PSS under its GNS (Global Network Service) name, but the PSS name has remained better known. PSS also included public dial-up PAD access, and various InterStream gateways to other services such as Telex.[citation needed]\n\n\nTRANSPAC[edit]\n\nTRANSPAC was the national X.25 network in France[78]. It was developed locally at about the same time as DATAPAC in Canada. The development was done by the French PTT and influenced by the experimental RCP network[53]. It began operation in 1978, and served both commercial users and, after Minitel began, consumers.[79]\n\n\nVENUS-P[edit]\n\nVENUS-P was an international X.25 network that operated from April 1982 through March 2006. At its subscription peak in 1999, VENUS-P connected 207 networks in 87 countries.[80]\n\n\nVenepaq[edit]\n\nVenepaq is the national X.25 public network in Venezuela. It is run by Cantv and allow direct connection and dial up connections. Provides nationalwide access at very low cost. It provides national and international access. Venepaq allow connection from 19.2 kbit/s to 64 kbit/s in direct connections, and 1200, 2400 and 9600 bit/s in dial up connections.\n\n\nInternet era[edit]\n\n\tInternet\n\tAn Opte Project visualization of routing paths through a portion of the Internet\n\n\t\nGeneral\n\n\tAccess\n\tCensorship\n\tDemocracy\n\tDigital divide\n\tDigital rights\n\tFreedom of information\n\tHistory of the Internet\n\tInternet phenomena\n\tNet neutrality\n\tOldest domain names\n\tPioneers\n\tPrivacy\n\tSociology\n\tUsage\n\n\n\n\n\n\n\t\nGovernance\n\n\tICANN\n\tInternet Engineering Task Force\n\n\tInternet Governance Forum\n\tInternet Society\n\n\n\n\n\n\n\t\nInformation infrastructure\n\n\tDomain Name System\n\tHypertext Transfer Protocol\n\tInternet exchange point\n\tInternet Protocol\n\tInternet protocol suite\n\tInternet service provider\n\tIP address\n\tInternet Message Access Protocol\n\tSimple Mail Transfer Protocol\n\n\n\n\n\n\n\t\nServices\n\n\tBlogs\n\tMicroblogging\n\n\n\tEmail\n\tFax\n\tFile sharing\n\tFile transfer\n\tGames\n\tInstant messaging\n\tPodcasts\n\tShopping\n\tTelevision\n\tVoice over IP\n\tWorld Wide Web\n\tsearch\n\n\n\n\n\n\n\n\n\t\nGuides\n\n\t Book\n\t Index\n\tOutline\n\n\n\n\n\n\n\t\n Internet portal\n\t\tv\n\tt\n\te\n\n\n\n\n\nWhen Internet connectivity was made available to anyone who could pay for an ISP subscription, the distinctions between national networks blurred. The user no longer saw network identifiers such as the DNIC. Some older technologies such as circuit switching have resurfaced with new names such as fast packet switching. Researchers have created some experimental networks to complement the existing Internet.[81]\n\n\nCSNET[edit]\n\nThe Computer Science Network (CSNET) was a computer network funded by the U.S. National Science Foundation (NSF) that began operation in 1981. Its purpose was to extend networking benefits, for computer science departments at academic and research institutions that could not be directly connected to ARPANET, due to funding or authorization limitations. It played a significant role in spreading awareness of, and access to, national networking and was a major milestone on the path to development of the global Internet.[82][83]\n\n\nInternet2[edit]\n\nInternet2 is a not-for-profit United States computer networking consortium led by members from the research and education communities, industry, and government.[84] The Internet2 community, in partnership with Qwest, built the first Internet2 Network, called Abilene, in 1998 and was a prime investor in the National LambdaRail (NLR) project.[85] In 2006, Internet2 announced a partnership with Level 3 Communications to launch a brand new nationwide network, boosting its capacity from 10 Gbit/s to 100 Gbit/s.[86] In October, 2007, Internet2 officially retired Abilene and now refers to its new, higher capacity network as the Internet2 Network.\n\n\nNSFNET[edit]\n\n  \nNSFNET Traffic 1991, NSFNET backbone nodes are shown at the top, regional networks below, traffic volume is depicted from purple (zero bytes) to white (100 billion bytes), visualization by NCSA using traffic data provided by the Merit Network.\n\n\n\nMain article: NSFNET\n\nThe National Science Foundation Network (NSFNET) was a program of coordinated, evolving projects sponsored by the National Science Foundation (NSF) beginning in 1985 to promote advanced research and education networking in the United States.[87] NSFNET was also the name given to several nationwide backbone networks operating at speeds of 56 kbit/s, 1.5 Mbit/s (T1), and 45 Mbit/s (T3) that were constructed to support NSF's networking initiatives from 1985-1995. Initially created to link researchers to the nation's NSF-funded supercomputing centers, through further public funding and private industry partnerships it developed into a major part of the Internet backbone.\n\n\nNSFNET regional networks[edit]\n\nIn addition to the five NSF supercomputer centers, NSFNET provided connectivity to eleven regional networks and through these networks to many smaller regional and campus networks in the United States. The NSFNET regional networks were:[88][89]\n\n\n\tBARRNet, the Bay Area Regional Research Network in Palo Alto, California;\n\tCERFNET, California Education and Research Federation Network in San Diego, California, serving California and Nevada;\n\tCICNet, the Committee on Institutional Cooperation Network via the Merit Network in Ann Arbor, Michigan and later as part of the T3 upgrade via Argonne National Laboratory outside of Chicago, serving the Big Ten Universities and the University of Chicago in Illinois, Indiana, Michigan, Minnesota, Ohio, and Wisconsin;\n\tMerit/MichNet in Ann Arbor, Michigan serving Michigan, formed in 1966, still in operation as of 2016;[90]\n\tMIDnet in Lincoln, Nebraska serving Arkansas, Iowa, Kansas, Missouri, Nebraska, Oklahoma, and South Dakota;\n\tNEARNET, the New England Academic and Research Network in Cambridge, Massachusetts, added as part of the upgrade to T3, serving Connecticut, Maine, Massachusetts, New Hampshire, Rhode Island, and Vermont, established in late 1988, operated by BBN under contract to MIT, BBN assumed responsibility for NEARNET on 1 July 1993;[91]\n\tNorthWestNet in Seattle, Washington, serving Alaska, Idaho, Montana, North Dakota, Oregon, and Washington, founded in 1987;[92]\n\tNYSERNet, New York State Education and Research Network in Ithaca, New York;\n\tJVNCNet, the John von Neumann National Supercomputer Center Network in Princeton, New Jersey, serving Delaware and New Jersey;\n\tSESQUINET, the Sesquicentennial Network in Houston, Texas, founded during the 150th anniversary of the State of Texas;\n\tSURAnet, the Southeastern Universities Research Association network in College Park, Maryland and later as part of the T3 upgrade in Atlanta, Georgia serving Alabama, Florida, Georgia, Kentucky, Louisiana, Maryland, Mississippi, North Carolina, South Carolina, Tennessee, Virginia, and West Virginia, sold to BBN in 1994; and\n\tWestnet in Salt Lake City, Utah and Boulder, Colorado, serving Arizona, Colorado, New Mexico, Utah, and Wyoming.\n\n\nNational LambdaRail[edit]\n\nThe National LambdaRail was launched in September 2003. It is a 12,000-mile high-speed national computer network owned and operated by the U.S. research and education community that runs over fiber-optic lines. It was the first transcontinental 10 Gigabit Ethernet network. It operates with high aggregate capacity of up to 1.6 Tbit/s and a high 40 Gbit/s bitrate, with plans for 100 Gbit/s.[93][94] The upgrade never took place and NLR ceased operations in March 2014.\n\n\nTransPAC, TransPAC2, and TransPAC3[edit]\n\nTransPAC2 and TransPAC3, continuations of the TransPAC project, a high-speed international Internet service connecting research and education networks in the Asia-Pacific region to those in the US.[95][96] TransPAC is part of the NSF’s International Research Network Connections (IRNC) program.[97]\n\n\nVery high-speed Backbone Network Service (vBNS)[edit]\n\nThe Very high-speed Backbone Network Service (vBNS) came on line in April 1995 as part of a National Science Foundation (NSF) sponsored project to provide high-speed interconnection between NSF-sponsored supercomputing centers and select access points in the United States.[98] The network was engineered and operated by MCI Telecommunications under a cooperative agreement with the NSF. By 1998, the vBNS had grown to connect more than 100 universities and research and engineering institutions via 12 national points of presence with DS-3 (45 Mbit/s), OC-3c (155 Mbit/s), and OC-12c (622 Mbit/s) links on an all OC-12c backbone, a substantial engineering feat for that time. The vBNS installed one of the first ever production OC-48c (2.5 Gbit/s) IP links in February 1999 and went on to upgrade the entire backbone to OC-48c.[99]\n\nIn June 1999 MCI WorldCom introduced vBNS+ which allowed attachments to the vBNS network by organizations that were not approved by or receiving support from NSF.[100] After the expiration of the NSF agreement, the vBNS largely transitioned to providing service to the government. Most universities and research centers migrated to the Internet2 educational backbone. In January 2006, when MCI and Verizon merged,[101] vBNS+ became a service of Verizon Business.[102]\n\n\nSee also[edit]\n\n\tCircuit switching\n\tCompuServe\n\tMessage switching\n\tMulti-bearer network\n\tOptical burst switching\n\tPacket radio\n\tPublic data network\n\tPublic switched data network\n\tStore and forward\n\tTime-Driven Switching - a bufferless approach to packet switching\n\tTransmission delay\n\tVirtual circuit\n\tVirtual private network\n\n\nReferences[edit]\n\n\n\t^ Paul Baran, On Distributed Communications, Volume I–XI, Rand Corporation Research Report, August 1964\n\n\t^ a b Roberts, Dr. Lawrence G. (November 1978). \"The Evolution of Packet Switching\". Retrieved 5 September 2017. Almost immediately after the 1965 meeting, Donald Davies conceived of the details of a store-and-forward packet switching system\n\n\t^ Kirstein, Peter (28 July 1998). \"Early Experiences with the ARPANET and INTERNET in the UK\" (PDF). University College London. Retrieved 21 August 2017.\n\n\n\t^ Martin Weik - Fiber Optics Standard Dictionary Springer Science & Business Media 6 Dec 2012, 1219 pages, \nISBN 1461560233 [Retrieved 2015-08-04]\n\n\t^ National Telecommunication Information Administration - Telecommunications: Glossary of Telecommunications Terms published by Government Institutes 1 Apr 1997, 480 pages, \nISBN 1461732328, Volume 1037, Part 3 of Federal Standard [Retrieved 2015-08-04]\n\n\t^ Abbate, Jane (2000). Inventing the Internet. MIT Press. p. 38. ISBN 978-0262261333.\n\n\n\t^ \"Inductee Details - Donald Watts Davies\". National Inventors Hall of Fame. Retrieved 6 September 2017.\n\n\n\t^ \"Inductee Details - Paul Baran\". National Inventors Hall of Fame. Retrieved 6 September 2017.\n\n\n\t^ a b Stewart, Bill (2000-01-07). \"Paul Baran Invents Packet Switching\". Living Internet. Retrieved 2008-05-08.\n\n\n\t^ Baran, Paul (May 27, 1960). \"Reliable Digital Communications Using Unreliable Network Repeater Nodes\" (PDF). The RAND Corporation: 1. Retrieved July 7, 2016. Cite journal requires |journal= (help)\n\n\n\t^ Baran, Paul (1962). \"RAND Paper P-2626\".\n\n\n\t^ On Distributed Communications\n\n\t^ Davies, D. W. (17 March 1986), Oral History 189: D. W. Davies interviewed by Martin Campbell-Kelly at the National Physical Laboratory, Charles Babbage Institute University of Minnesota, Minneapolis, retrieved 21 July 2014\n\n\n\t^ Gillies, James; Cailliau, Robert (2000). How the Web was Born: The Story of the World Wide Web. Oxford University Press. p. 25. ISBN 978-0192862075.\n\n\n\t^ a b K.G. Coffman; A.M. Odlyzco (22 May 2002). \"Optics and Photonics\".  In I. Kaminow; T. Li (eds.). Optical Fiber Telecommunications IV-B: Systems and Impairments. Academic Press. ISBN 978-0080513195. Retrieved 2015-08-15.\n\n\n\t^ a b B. Steil; David G. Victor; Richard R. Nelson, eds. (1 Jan 2002). Technological Innovation and Economic Performance. Princeton University Press. ISBN 978-0691090917. Retrieved 2015-08-15.\n\n\n\t^ a b c C. Hempstead; W. Worthington (2005). Encyclopedia of 20th-Century Technology. Routledge. ISBN 9781135455514.\n\n\n\t^ Isaacson, Walter (2014). The Innovators: How a Group of Hackers, Geniuses, and Geeks Created the Digital Revolution. Simon and Schuster. p. 246. ISBN 9781476708690.\n\n\n\t^ Vinton G. Cerf; Robert E. Kahn (May 1974). \"A Protocol for Packet Network Intercommunication\" (PDF). IEEE Transactions on Communications. 22 (5): 637–648. doi:10.1109/tcom.1974.1092259. Archived from the original (PDF) on March 4, 2016.\n\n\n\t^ Interview with the author (of an MPLS-based VPN article) Archived 2007-09-29 at the Wayback Machine, G. Pildush\n\n\t^ Moore, Roger D. (August 2006). \"This is a temporary index for a collection of papers about packet-switching in the 1970s\". Retrieved 5 September 2017.\n\n\n\t^ Kirstein, Peter T. (1973). \"A SURVEY OF PRESENT AMD PLANNED GENERAL PURPOSE EUROPEAN DATA AND COMPUTER NETWORKS\". Retrieved 5 September 2017.\n\n\n\t^ \"A SURVEY OF THE CAPABILITIES OF 8 PACKET SWITCHING NETWORKS\". 1975. Retrieved 5 September 2017. Research in packet switching networks at the British National Physical Laboratory (NPL) predates ARPANET, having commenced in 1966.\n\n\n\t^ Taylor, Steve; Jim Metzler (2008). \"Vint Cerf on why TCP/IP was so long in coming\".\n\n\n\t^ a b \"A History of Macintosh Networking\" Archived 2006-10-16 at the Wayback Machine, Alan Oppenheimer, MacWorld Expo, January 2004\n\n\t^ Inside AppleTalk, Second Edition, Gursharan Sidhu, Richard Andrews and Alan Oppenheiner, Addison-Wesley, 1989, \nISBN 0-201-55021-0\n\n\t^ Martel, C. C.; J. M. Cunningham; M. S. Grushcow. \"THE BNR NETWORK: A CANADIAN EXPERIENCE WITH PACKET SWITCHING TECHNOLOGY\". IFIP Congress 1974. pp. 10–14.\n\n\n\t^ \"A Technical History of CYCLADES\". Technical Histories of the Internet & other Network Protocols. Computer Science Department, University of Texas Austin. Archived from the original on 2013-09-01.\n\n\n\t^ \n\"The Cyclades Experience: Results and Impacts\", Zimmermann, H., Proc. IFIP'77 Congress, Toronto, August 1977, pp. 465–469\n\n\t^ [1] \"Digital Equipment Corporation, Nineteen Fifty-Seven to the Present\", Digital Equipment Corporation, 1978, page 53. Retrieved 3 September 2013.\n\n\t^ Wood, David C. (1975). \"A SURVEY OF THE CAPABILITIES OF 8 PACKET SWITCHING NETWORKS\". Proceedings of Symposium on Computer Networks. pp. 1–7.\n\n\n\t^ Hardy, Daniel; Malleus, Guy (2002). Networks: Internet, Telephony, Multimedia : Convergences and Complementarities. Springer Science & Business Media. p. 505. ISBN 9783540005599.\n\n\n\t^ Davies, Howard; Bressan, Beatrice, eds. (2010). A history of international research networking: the people who made it happen. John Wiley & Sons. p. 2. ISBN 978-3527327102.\n\n\n\t^ Bright, Roy D.; Smith, Michael A. (1973). \"EXPERIMENTAL PACKET SWITCHING PROJECT OF THE UK POST OFFICE\". Proceedings of the NATO Advanced Study Institute on Computer Communication Networks. Sussex, United Kingdom: Noordhoff International Publishing. pp. 435–44.\n\n\n\t^ Pearson, DJ; Wilkin, D (1974). \"Some Design Aspects of a public packet switching network\". Proceedings of the 2nd ICCC 74. pp. 199–213.\n\n\n\t^ Kirstein, Peter T. (1973). \"A SURVEY OF PRESENT AND PLANNED GENERAL PURPOSE EUROPEAN DATA AND COMPUTER NETWORKS\". Proceedings of the NATO Advanced Study Institute on Computer Communication Networks. Sussex, United Kingdom: Noordhoff International Publishing.\n\n\n\t^ Schwartz, Mischa; Boorstyn, Rober R.; Pickholtz, Raymond L. (November 1972). \"Terminal-Oriented Computer-Communication Networks\". Proceedings of the IEEE. 60 (11): 1408–23. doi:10.1109/proc.1972.8912.\n\n\n\t^ \"Maintaining IPX Compatibility During a Migration to TCP/IP on a NetWare Network\", Rich Lee, Novell, 1 March 1998. Retrieved 3 September 2013.\n\n\t^ Merit receives administrative services under an agreement with the University of Michigan.\n\n\t^ A Chronicle of Merit's Early History, John Mulcahy, 1989, Merit Network, Ann Arbor, Michigan\n\n\t^ a b Merit Network Timeline: 1970–1979, Merit Network, Ann Arbor, Michigan\n\n\t^ Merit Network Timeline: 1980–1989, Merit Network, Ann Arbor, Michigan\n\n\t^ Scantlebury, R. A.; Wilkinson, P.T. (1974). \"The National Physical Laboratory Data Communications Network\". Proceedings of the 2nd ICCC 74. pp. 223–228.\n\n\n\t^ Ward, Mark (October 29, 2009). \"Celebrating 40 years of the net\". BBC News.\n\n\n\t^ \"The National Physical Laboratory Data Communications Netowrk\". 1974. Retrieved 5 September 2017.\n\n\n\t^ \"Donald Davies\". thocp.net.\n\n\n\t^ \"Donald Davies\". internethalloffame.org.\n\n\n\t^ Mendicino, Samuel F. (1972). \"1970 OCTOPUS: THE LAWRENCE RADIATION LABORATORY NETWORK\". Computer Networks. Englewood Cliffs, N.J.: Prentice-Hall Inc.: 95–100.\n\n\n\t^ Pehrson, David L. (1970). \"AN ENGINEERING VIEW OF THE LRL OCTOPUS COMPUTER NETWORK\".\n\n\n\t^ Fletcher, John G. (1975). \"Principles of Design in the Octopus Computer network\".\n\n\n\t^ Burnett, D.J.; Sethi, H.R. (1977). \"Packet Switching at Philips Research Laboratories\". Computer Networks. 1 (6): 341–348. doi:10.1016/0376-5075(77)90010-1.\n\n\n\t^ David R. Boggs; John F. Shoch; Edward A. Taft; Robert M. Metcalfe (April 1980). \"Pup: An Internetwork Architecture\". IEEE Transactions on Communications. 28 (4): 612–624. doi:10.1109/TCOM.1980.1094684.\n\n\n\t^ a b \"Discussion of Technical Choices made for Transpac\" (PDF).\n\n\n\t^ Després, R. (1974). \"RCP, THE EXPERIMENTAL PACKET-SWITCHED DATA TRANSMISSION SERVICE OF THE FRENCH PTT\". Proceedings of ICCC 74. pp. 171–85.\n\n\n\t^ Bache, A.; Matras, Y. (1976). \"Fundamental Choices in the Development of RCP, the Experimental Packet-Switching Data Transmission Service of the French PTT\". Proceedings of ICCC 76. pp. 311–16.\n\n\n\t^ Bache, A.; L. Guillou; H. Layec; B. Long; Y. Matras (1976). \"RCP, the Experimental Packet-Switched Data Transmission Service of the French PTT: History, Connections, Control\". Proceedings of ICCC 76.\n\n\n\t^ Alarcia, G.; Herrera, S. (1974). \"C.T.N.E.'s PACKET SWITCHING NETWORK. ITS APPLICATIONS\". Proceedings of 2nd ICCC 74. pp. 163–170.\n\n\n\t^ Cuenca, L. (1980). \"A PUBLIC PACKET SWITCHING DATA COMMUNICATIONS NETWORK: EIGHT YEARS OF OPERATING EXPERIENCE\". Conference Record of ICC 80. IEEE. pp. 39.3.1–39.3.5.\n\n\n\t^ Lavandera, Luis (1980). \"ARCHITECTURE, PROTOCOLS AND PERFORMANCE OF RETD\". Conference Record of ICC 80. IEEE. pp. 28.4.1–28.4.5.\n\n\n\t^ Haarala, Arja-Riitta (2001). \"Libraries as key players at the local level\". doi:10.18452/1040. Cite journal requires |journal= (help)\n\n\n\t^ Chretien, G.J.; Konig, W.M.; Rech, J.H. (1973). \"The SITA Network\". Proceedings of the NATO Advanced Study Institute on Computer Communication Networks. Sussex, United Kingdom: Noordhoff International Publishing. pp. 373–396.\n\n\n\t^ Sundstrom, R.J.; G.D. Schultz (1980). \"1980 SNA'S First Six Years: 1974-1980\". Proceedings of 5th ICCC 80. pp. 578–585.\n\n\n\t^ \"Electronic post for switching data\". Timothy Johnson. New Scientist. May 13, 1976\n\n\t^ Mathison, S.L.\nRoberts, L.G.; Walker, P.M., The history of telenet and the commercialization of packet switching in the U.S., Communications Magazine, IEEE, May 2012\n\n\t^ TYMES, LA ROY W. \"TYMNET — A terminal oriented communication network\". Proceedings of the SJCC 1971. 38. pp. 211–16.\n\n\n\t^ TYMES, LA ROY W. (April 1981). \"Routing and Flow Control in TYMNET\". IEEE Transactions on Communications. COM-29 (4): 392–98. doi:10.1109/tcom.1981.1095020.\n\n\n\t^ Xerox System Integration Standard - Internet Transport Protocols, Xerox, Stamford, 1981.\n\n\t^ \"Chapter 12: Xerox Network Systems\", AIX Version 4.3 Communications Programming Concepts, International Business Machines, October 1997.\n\n\t^ Andrew Colley (28 January 2004). \"Telstra drops Austpac; reaches for finance market\". Retrieved 21 December 2018.\n\n\n\t^ Maidasani, Dinesh (June 2009). Straight To The Point - Networking. Laxmi Publications Pvt Limited. ISBN 9788131805299.\n\n\n\t^ H.J. Steneker: Graduation Report on X.25 data services in GSM network Electrical Engineering - TUE, 16 May 1991. Chapter 3: page 20 and further, Retrieved 15 June 2011\n\n\t^ Telecommunications Directory. Gale Research. 2000. p. 593. ISBN 978-0-7876-3352-3.\n\n\n\t^ Gareth Locksley (1990). The Single European Market and the Information and Communication Technologies. Belhaven Press. p. 194. ISBN 978-1-85293-101-8.\n\n\n\t^ \"Eircom Plc and the Department of Agriculture and Food; Mr Mark Henry and the Department of Agriculture and Food; Eircom Plc and the Department of Finance and Eircom Plc and Office of the Revenue Commissioners. - Office of the Information Commissioner\". Retrieved 23 May 2017.\n\n\n\t^ Tomaru, K.; T. Kato; S.I. Yamaguchi (1980). \"A Private Packet Network and Its Application in A Worldwide Integrated Communication Network\". Proceedings of ICCC '80. pp. 517–22.\n\n\n\t^ \"1984-2014: 30 years of the Janet network\" (PDF). Disc. Retrieved 23 September 2017.\n\n\n\t^ National Research Council (U.S.). National Research Network Review Committee, Leonard Kleinrock;  et al. (1988). Toward a National Research Network. National Academies. p. 40.\n\n\n\t^ \"X.25 Virtual Circuits - Transpac in France - Pre-Internet Data Networking\".\n\n\n\t^ Epstein, Nadine (1986-03-09). \"Et Voila! Le Minitel\". The New York Times.\n\n\n\t^ \"KDDI to Close VENUS-P International Public Data Communications Service\" Archived 2013-09-04 at Archive.today, KDDI, 9 November 2005. Retrieved 3 September 2013.\n\n\t^ Mike C. Smith (7 September 2017). \"What is Dedicated Internet Access?\". Retrieved 21 December 2018.\n\n\n\t^ \"The Internet—From Modest Beginnings\". NSF website. Archived from the original on August 28, 2011. Retrieved September 30, 2011.\n\n\n\t^ Douglas Comer (October 1983). \"History and overview of CSNET\". Communications. 26 (10): 747–753. doi:10.1145/358413.358423.\n\n\n\t^ \"About Internet2\", Retrieved on 2009-06-26\n\n\t^ \"Optical networking: The next generation\", Marguerite Reardon, CNET News, October 11, 2004\n\n\t^ \"Speedy Internet2 gets 10x boost\", Anick Jesdanun (AP), USAToday.com, October 11, 2007, Retrieved 26 June 2009.\n\n\t^ NSFNET: The Partnership That Changed The World, Web site for an event held to celebrate the NSFNET, November 2007\n\n\t^ \"Retiring the NSFNET Backbone Service: Chronicling the End of an Era\" Archived 2013-08-17 at the Wayback Machine, Susan R. Harris and Elise Gerich, ConneXions, Vol. 10, No. 4, April 1996\n\n\t^ \"NSFNET: The Community\", panel presentation slides, Doug Gale moderator, NSFNET: The Partnership That Changed The World, 29 November 2007\n\n\t^ \"Merit–Who, What, and Why, Part One: The Early Years, 1964-1983\" Archived 2013-04-23 at the Wayback Machine, Eric M. Aupperle, Merit Network, Inc., in Library Hi Tech, vol. 16, No. 1 (1998)\n\n\t^ \"BBN to operate NEARnet\", MIT News, 14 July 1993\n\n\t^ \"About NorthWestNet\", NorthWestNet User Services Internet Resource Guide, NorthWestNet Academic Computing Consortium, Inc., 24 March 1992 accessed 3 July 2012\n\n\t^ Michael Feldman (October 28, 2008). \"National LambdaRail Opens for Business\". HPCwire. Retrieved June 6, 2013.\n\n\n\t^ \"About NLR\" Archived 2013-09-04 at Archive.today, National LambdaRail, 3 September 2013.\n\n\t^ \"International TransPAC2 Inaugurated\" Archived 2013-06-20 at Archive.today, HPC Wire, 8 April 2005.\n\n\t^ \"TransPAC website\". Retrieved 3 September 2013.\n\n\t^ \"TransPAC3 - Asia-US High Performance International Networking\", International Research Network Connections Program (IRNC), U.S. National Science Foundation, October 2011. Retrieved 3 September 2013.\n\n\t^ NSF Solicitation 93-52 Archived 2016-03-05 at the Wayback Machine - Network Access Point Manager, Routing Arbiter, Regional Network Providers, and Very High Speed Backbone Network Services Provider for NSFNET and the NREN(SM) Program, May 6, 1993\n\n\t^ \"vBNS: not your father's Internet\", John Jamison, Randy Nicklas, Greg Miller, Kevin Thompson, Rick Wilder, Laura Cunningham and Chuck Song, IEEE Spectrun, Volume 35 Issue 7 (July 1998), pp. 38-46.\n\n\t^ \"MCI WorldCom Introduces Next Generation vBNS+ For All Higher Education And Research Organizations\", Verizon Business News, June 23, 1999\n\n\t^ \"Verizon and MCI Close Merger, Creating a Stronger Competitor for Advanced Communications Services\", Verizon Business News, January 6, 2006\n\n\t^ vBNS+, at http://www.verizonbusiness.com Home > Solutions > Government > Federal Government > Contract Vehicles > FTS2001 Bridge > Products\n\n\n\n\nBibliography[edit]\n\n\tLeonard Kleinrock, Information Flow in Large Communication Nets, (MIT, Cambridge, May 31, 1961) Proposal for a Ph.D. Thesis\n\tLeonard Kleinrock. Information Flow in Large Communication Nets (RLE Quarterly Progress Report, July 1961)\n\tLeonard Kleinrock. Communication Nets: Stochastic Message Flow and Delay (McGraw-Hill, New York, 1964)\n\tPaul Baran et al., On Distributed Communications, Volumes I-XI (RAND Corporation Research Documents, August, 1964)\n\tPaul Baran, On Distributed Communications: I Introduction to Distributed Communications Network (RAND Memorandum RM-3420-PR. August 1964)\n\n\n\tPaul Baran, On Distributed Communications Networks, (IEEE Transactions on Communications Systems, Vol. CS-12 No. 1, pp. 1–9, March 1964)\n\tD. W. Davies, K. A. Bartlett, R. A. Scantlebury, and P. T. Wilkinson, A digital communications network for computers giving rapid response at remote terminals (ACM Symposium on Operating Systems Principles. October 1967)\n\tR. A. Scantlebury, P. T. Wilkinson, and K. A. Bartlett, The design of a message switching Centre for a digital communication network (IFIP 1968)\n\tLarry Roberts and Tom Merrill, Toward a Cooperative Network of Time-Shared Computers (Fall AFIPS Conference. October 1966)\n\tLawrence Roberts, The Evolution of Packet Switching (Proceedings of the IEEE, November, 1978)\n\n\nFurther reading[edit]\n\n\tAbbate, Janet (2000), Inventing the Internet, MIT Press, ISBN 9780262511155\n\n\tHafner, Katie Where Wizards Stay Up Late (Simon and Schuster, 1996) pp 52–67\n\tNorberg, Arthur; O'Neill, Judy E. Transforming Computer Technology: Information Processing for the Pentagon, 1962-1982 (Johns Hopkins University, 1996)\n\n\nExternal links[edit]\n\n\tOral history interview with Paul Baran. Charles Babbage Institute University of Minnesota, Minneapolis. Baran describes his working environment at RAND, as well as his initial interest in survivable communications, and the evolution, writing and distribution of his eleven-volume work, \"On Distributed Communications\". Baran discusses his interaction with the group at ARPA who were responsible for the later development of the ARPANET.\n\tNPL Data Communications Network NPL video, 1970s\n\tPacket Switching History and Design, site reviewed by Baran, Roberts, and Kleinrock\n\tPaul Baran and the Origins of the Internet\n\tA Brief History of the Internet\n\t\"Hobbes' Internet Timeline v8.1\", Robert H'obbes' Zakon, Zakon Group LLC\n\t20+ articles on packet switching in the 1970s\n\t\"An Introduction to Packet Switched Networks\", Phrack, 05/3/88\n\n\nThis article is based on material taken from  the Free On-line Dictionary of Computing  prior to 1 November 2008 and incorporated under the \"relicensing\" terms of the GFDL, version 1.3 or later.\n\n\n\t\tv\n\tt\n\te\n\n\nTelecommunications\n\n\tHistory\t\n\tBeacon\n\tBroadcasting\n\tCable protection system\n\tCable TV\n\tCommunications satellite\n\tComputer network\n\tDrums\n\tElectrical telegraph\n\tFax\n\tHeliographs\n\tHydraulic telegraph\n\tInternet\n\tMass media\n\tMobile phone\n\tOptical telecommunication\n\tOptical telegraphy\n\tPager\n\tPhotophone\n\tPrepaid mobile phone\n\tRadio\n\tRadiotelephone\n\tSatellite communications\n\tSemaphore\n\tSmartphone\n\tSmoke signals\n\tTelecommunications history\n\tTelautograph\n\tTelegraphy\n\tTeleprinter (teletype)\n\tTelephone\n\tThe Telephone Cases\n\tTelevision\n\tUndersea telegraph line\n\tVideoconferencing\n\tVideophone\n\tVideotelephony\n\tWhistled language\n\n\n\n\t\n\n\tPioneers\t\n\tEdwin Howard Armstrong\n\tJohn Logie Baird\n\tPaul Baran\n\tAlexander Graham Bell\n\tTim Berners-Lee\n\tJagadish Chandra Bose\n\tVint Cerf\n\tClaude Chappe\n\tDonald Davies\n\tLee de Forest\n\tPhilo Farnsworth\n\tReginald Fessenden\n\tElisha Gray\n\tErna Schneider Hoover\n\tCharles K. Kao\n\tHedy Lamarr\n\tInnocenzo Manzetti\n\tGuglielmo Marconi\n\tAntonio Meucci\n\tRadia Perlman\n\tAlexander Stepanovich Popov\n\tJohann Philipp Reis\n\tHenry Sutton\n\tNikola Tesla\n\tCamille Tissot\n\tAlfred Vail\n\tCharles Wheatstone\n\tVladimir K. Zworykin\n\n\n\n\n\tTransmission\nmedia\t\n\tCoaxial cable\n\tFiber-optic communication\n\tOptical fiber\n\n\n\tFree-space optical communication\n\tMolecular communication\n\tRadio waves\n\tTransmission line\n\n\n\n\n\tNetwork topology\nand switching\t\n\tLinks\n\tNodes\n\tTerminal node\n\tNetwork switching (circuit\n\tpacket)\n\tTelephone exchange\n\n\n\n\n\tMultiplexing\t\n\tSpace-division\n\tFrequency-division\n\tTime-division\n\tPolarization-division\n\tOrbital angular-momentum\n\tCode-division\n\n\n\n\n\tNetworks\t\n\tARPANET\n\tBITNET\n\tCellular network\n\tComputer\n\tCYCLADES\n\tEthernet\n\tFidoNet\n\tInternet\n\tInternet2\n\tISDN\n\tLAN\n\tMobile\n\tNGN\n\tNPL network\n\tPublic Switched Telephone\n\tRadio\n\tTelecommunications equipment\n\tTelevision\n\tTelex\n\tWAN\n\tWireless network\n\tWorld Wide Web\n\n\n\n\n\t\n\t Category\n\t Outline\n\t Portal\n\t Commons\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Packet_switching&oldid=917351285\"\n\n\t\t\n\t\tCategories: \tComputer networking\n\tHistory of the Internet\n\tNetwork protocols\n\tPackets (information technology)\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tWebarchive template wayback links\n\tCS1: long volume value\n\tWebarchive template archiveis links\n\tArticles with short description\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from May 2019\n\tArticles with unsourced statements from February 2011\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tAsturianu\n\tCatalà\n\tČeština\n\tDeutsch\n\tΕλληνικά\n\tEspañol\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\tGalego\n\t한국어\n\tBahasa Indonesia\n\tInterlingua\n\tItaliano\n\tעברית\n\tLatina\n\tLatviešu\n\tМакедонски\n\tBahasa Melayu\n\tNederlands\n\t日本語\n\tNorsk\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tSimple English\n\tSlovenčina\n\tСрпски / srpski\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 23 September 2019, at 12:43 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "9", "dc:title": "Packet switching - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Multiplexing_diagram.svg/1200px-Multiplexing_diagram.svg.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-packet_switching", "title": "Packet switching - Wikipedia"}}