{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPhotovoltaics - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tPhotovoltaics\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Photovoltaic)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tMethod of generating electrical power by converting solar radiation into direct current electricity\n\n\n\n\n  \nThe Solar Settlement, a sustainable housing community project in Freiburg, Germany.\n\n\n\n  \nPhotovoltaic SUDI shade is an autonomous and mobile station in France that provides energy for electric cars using solar energy.\n\n\n\n  \nSolar panels on the International Space Station\n\n\n\nPhotovoltaics (PV) is the conversion of light into electricity using semiconducting materials that exhibit the photovoltaic effect, a phenomenon studied in physics, photochemistry, and electrochemistry.\n\nA  photovoltaic system employs solar modules, each comprising a number of solar cells, which generate electrical power.  PV installations may be ground-mounted, rooftop mounted, wall mounted or floating.  The mount may be fixed, or use a solar tracker to follow the sun across the sky.\n\nSolar PV has specific advantages as an energy source: once installed, its operation generates no pollution and no greenhouse gas emissions, it shows simple scalability in respect of power needs and silicon has large availability in the Earth’s crust.[1]\n\nPhotovoltaic systems have long been used in specialized applications as stand-alone installations and grid-connected PV systems have been in use since the 1990s.[2] Photovoltaic modules were first mass-produced in 2000, when German environmentalists and the Eurosolar organization got government funding for a ten thousand roof program.[3]\n\nAdvances in technology and increased manufacturing scale have in any case reduced the cost,[4] increased the reliability, and increased the efficiency of photovoltaic installations.[2][5] \nNet metering and financial incentives, such as preferential feed-in tariffs for solar-generated electricity, have supported solar PV installations in many countries.[6] More than 100 countries now use solar PV.\n\nAfter hydro and wind powers, PV is the third renewable energy source in terms of global capacity. At the end of 2016, worldwide installed PV capacity increased to more than 300 gigawatts (GW),[7] covering approximately two percent of global electricity demand.[8] China, followed by Japan and the United States, is the fastest growing market, while Germany remains the world's largest producer, with solar PV providing seven percent of annual domestic electricity consumption.[9] With current technology (as of 2013), photovoltaics recoups the energy needed to manufacture them in 1.5 years in Southern Europe and 2.5 years in Northern Europe.[10]\n\n\nContents\n\n\n\t1 Etymology\n\t2 Solar cells\n\t3 Current developments\n\t3.1 Efficiency\n\t3.2 Growth\n\t3.3 Environmental impacts of photovoltaic technologies\n\n\n\n\t4 Economics\n\t5 Manufacturing\n\t6 Applications\n\t6.1 Photovoltaic systems\n\n\n\n\t7 Advantages\n\t8 Limitations\n\t9 See also\n\t10 References\n\t11 Further reading\n\n\n\n\n\nEtymology[edit]\n\nThe term \"photovoltaic\" comes from the Greek φῶς (phōs) meaning \"light\", and from \"volt\", the unit of electromotive force, the volt, which in turn comes from the last name of the Italian physicist Alessandro Volta, inventor of the battery (electrochemical cell). The term \"photovoltaic\" has been in use in English since 1849.[11]\n\n\nand the concept of photovoltaic is develop by raymart capul\n\n\nSolar cells[edit]\n\nMain article: Solar cell\n\n  \nSolar cells generate electricity directly from sunlight.\n\n\n\n  \nPhotovoltaic power potential map estimates, how many kWh of electricity can be produced from a 1 kWp free-standing c-Si modules, optimally inclined towards the Equator. The resulting long-term average (daily or yearly) is calculated based on the time-series weather data of at least recent 10 years. The map is published by the World Bank and provided by Solargis.\n\n\n\nPhotovoltaics are best known as a method for generating electric power by using solar cells to convert energy from the sun into a flow of electrons by the photovoltaic effect.[12][13]\n\nSolar cells produce direct current electricity from sunlight which can be used to power equipment or to recharge a battery. The first practical application of photovoltaics was to power orbiting satellites and other spacecraft, but today the majority of photovoltaic modules are used for grid-connected systems for power generation. In this case an inverter is required to convert the DC to AC. There is still a smaller market for stand alone systems for remote dwellings, boats, recreational vehicles, electric cars, roadside emergency telephones, remote sensing, and cathodic protection of pipelines.\n\nPhotovoltaic power generation employs solar modules composed of a number of solar cells containing a semiconductor material.[14] Copper solar cables connect modules (module cable), arrays (array cable), and sub-fields. Because of the growing demand for renewable energy sources, the manufacturing of solar cells and photovoltaic arrays has advanced considerably in recent years.[15][16][17]\n\nSolar photovoltaic power generation has long been seen as a clean energy technology which draws upon the planet’s most plentiful and widely distributed renewable energy source – the sun.  Cells require protection from the environment and are usually packaged tightly in solar modules.\n\nPhotovoltaic module power is measured under standard test conditions (STC) in \"Wp\" (watts peak).[18] The actual power output at a particular place may be less than or greater than this rated value, depending on geographical location, time of day, weather conditions, and other factors.[19] Solar photovoltaic array capacity factors are typically under 25%, which is lower than many other industrial sources of electricity.[20]\n\n\nCurrent developments[edit]\n\nFor best performance, terrestrial PV systems aim to maximize the time they face the sun. Solar trackers achieve this by moving PV modules to follow the sun. The increase can be by as much as 20% in winter and by as much as 50% in summer. Static mounted systems can be optimized by analysis of the sun path. PV modules are often set to latitude tilt, an angle equal to the latitude, but performance can be improved by adjusting the angle for summer or winter. Generally, as with other semiconductor devices, temperatures above room temperature reduce the performance of photovoltaic modules.[21]\n\nA number of solar modules may also be mounted vertically above each other in a tower, if the zenith distance of the Sun is greater than zero, and the tower can be turned horizontally as a whole and each module additionally around a horizontal axis. In such a tower the modules can follow the Sun exactly. Such a device may be described as a ladder mounted on a turnable disk. Each step of that ladder is the middle axis of a rectangular solar panel. In case the zenith distance of the Sun reaches zero, the \"ladder\" may be rotated to the north or the south to avoid a solar module producing a shadow on a lower one. Instead of an exactly vertical tower one can choose a tower with an axis directed to the polar star, meaning that it is parallel to the rotation axis of the Earth. In this case the angle between the axis and the Sun is always larger than 66 degrees. During a day it is only necessary to turn the panels around this axis to follow the Sun. Installations may be ground-mounted (and sometimes integrated with farming and grazing)[22] or built into the roof or walls of a building (building-integrated photovoltaics).\n\nAnother recent development involves the makeup of solar cells. Perovskite is a very inexpensive material which is being used to replace the expensive crystalline silicon which is still part of a standard PV cell build to this day. Michael Graetzel, Director of the Laboratory of Photonics and Interfaces at EPFL says, \"Today, efficiency has peaked at 18 percent, but it's expected to get even higher in the future.\"[23] This is a significant claim, as 20% efficiency is typical among solar panels which use more expensive materials.\n\n\nEfficiency[edit]\n\nMain article: Solar cell efficiency\n\n  \nBest Research-Cell Efficiencies\n\n\n\nThe electrical efficiency of a PV cell is a physical property which represents how much electrical power a cell can produce for a given Solar irradiance. The basic expression for maximum efficiency of a photovoltaic cell is given by the ratio of output power to the incident solar power (radiation flux times area)\n\n\n\t\n  \n    \n      \n        η\n        =\n        \n          \n            \n              P\n              \n                m\n                a\n                x\n              \n            \n            \n              E\n              ⋅\n              \n                A\n                \n                  c\n                  e\n                  l\n                  l\n                \n              \n            \n          \n        \n        .\n      \n    \n    {\\displaystyle \\eta ={\\frac {P_{max}}{E\\cdot A_{cell}}}.}\n  \n[24]\n\n\nThe efficiency is measured under ideal laboratory conditions and represents the maximum achievable efficiency of the PV cell or module. Actual efficiency is influenced by temperature, irradiance and spectrum.[citation needed]\n\nThe most efficient type of solar cell to date is a multi-junction concentrator solar cell with an efficiency of 46.0%[25] produced by Fraunhofer ISE in December 2014. The highest efficiencies achieved without concentration include a material by Sharp Corporation at 35.8% using a proprietary triple-junction manufacturing technology in 2009,[26] and Boeing Spectrolab (40.7% also using a triple-layer design). The US company SunPower produces cells that have an efficiency of 21.5%, well above the market average of 12–18%.[27]\n\nThere is an ongoing effort to increase the conversion efficiency of PV cells and modules, primarily for competitive advantage. In order to increase the efficiency of solar cells, it is important to choose a semiconductor material with an appropriate band gap that matches the solar spectrum. This will enhance the electrical and optical properties. Improving the method of charge collection is also useful for increasing the efficiency. There are several groups of materials that are being developed. Ultrahigh-efficiency devices (η>30%)[28] are made by using GaAs and GaInP2 semiconductors with multijunction tandem cells. High-quality, single-crystal silicon materials are used to achieve high-efficiency, low cost cells (η>20%).\n\nRecent developments in Organic photovoltaic cells (OPVs) have made significant advancements in power conversion efficiency from 3% to over 15% since their introduction in the 1980s.[29] To date, the highest reported power conversion efficiency ranges from 6.7% to 8.94% for small molecule, 8.4%–10.6% for polymer OPVs, and 7% to 21% for perovskite OPVs.[30][31]  OPVs are expected to play a major role in the PV market. Recent improvements have increased the efficiency and lowered cost, while remaining environmentally-benign and renewable.\n\nPerovskite cells are also rapidly (as of 2019) progressing, with top efficiencies increasing from 13% to 23,7 % for non stabilized cells and up to 28% for perovskite/Si tandem monolithic cells between 2012 and 2018.\n\nSeveral companies have begun embedding power optimizers into PV modules called smart modules. These modules perform maximum power point tracking (MPPT) for each module individually, measure performance data for monitoring, and provide additional safety features. Such modules can also compensate for shading effects, wherein a shadow falling across a section of a module causes the electrical output of one or more strings of cells in the module to decrease.[32]\n\nOne of the major causes for the decreased performance of cells is overheating. The efficiency of a solar cell declines by about 0.5% for every 1 degree Celsius increase in temperature. This means that a 100 degree increase in surface temperature could decrease the efficiency of a solar cell by about half. Self-cooling solar cells are one solution to this problem. Rather than using energy to cool the surface, pyramid and cone shapes can be formed from silica, and attached to the surface of a solar panel. Doing so allows visible light to reach the solar cells, but reflects infrared rays (which carry heat).[33]\n\n\nGrowth[edit]\n\nMain article: Growth of photovoltaics\n\n  \nWorldwide growth of photovoltaics on a semi-log plot since 1992\n\n\n\n\nProjected Global Growth (MW)\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n100,000\n\n\n\n200,000\n\n\n\n300,000\n\n\n\n400,000\n\n\n\n500,000\n\n\n\n600,000\n\n\n\n\n\n\n2009\n\n\n\n2011\n\n\n\n2013\n\n\n\n2015\n\n\n\n2017\n\n\n\n2019\n\n\n\n\n\n\n\n\n\n\n\nProjected global cumulative capacity (SPE)\n\n  historical cumulative capacity\n  average projection for 2015 (+55 GW, 233 GW)\n  low scenario reaches 396 GW by 2019\n  high scenario reaches 540 GW by 2019\n\n\n\nFurther: Growth of photovoltaics#Forecast\n\n\n\nSolar photovoltaics is growing rapidly and worldwide installed capacity reached about 300 gigawatts (GW) by the end of 2016.[7] Since 2000, installed capacity has seen a growth factor of about 57.[34] The total power output of the world’s PV capacity in a calendar year in 2014 is now beyond 200 TWh of electricity. This represents 1% of worldwide electricity demand. More than 100 countries use solar PV.[9][35] China, followed by Japan and the United States is now the fastest growing market, while Germany remains the world's largest producer, contributing more than 7% to its national electricity demands.[9] Photovoltaics is now, after hydro and wind power, the third most important renewable energy source in terms of globally installed capacity.[36]\n\nSeveral market research and financial companies foresee record-breaking global installation of more than 50 GW in 2015.[37][38][39][40] China is predicted to take the lead from Germany and to become the world's largest producer of PV power by installing another targeted 17.8 GW in 2015.[41] India is expected to install 1.8 GW, doubling its annual installations.[39] By 2018, worldwide photovoltaic capacity is projected to double or even triple to 430 GW. Solar Power Europe (formerly known as EPIA) also estimates that photovoltaics will meet 10% to 15% of Europe's energy demand in 2030.[42][43]\n\nIn 2017 a study in Science estimated that by 2030 global PV installed capacities will be between 3,000 and 10,000 GW.[34] The EPIA/Greenpeace Solar Generation Paradigm Shift Scenario (formerly called Advanced Scenario) from 2010 shows that by the year 2030, 1,845 GW of PV systems could be generating approximately 2,646 TWh/year of electricity around the world. Combined with energy use efficiency improvements, this would represent the electricity needs of more than 9% of the world's population. By 2050, over 20% of all electricity could be provided by photovoltaics.[44]\n\nMichael Liebreich, from Bloomberg New Energy Finance, anticipates a tipping point for solar energy. The costs of power from wind and solar are already below those of conventional electricity generation in some parts of the world, as they have fallen sharply and will continue to do so. He also asserts, that the electrical grid has been greatly expanded worldwide, and is ready to receive and distribute electricity from renewable sources. In addition, worldwide electricity prices came under strong pressure from renewable energy sources, that are, in part, enthusiastically embraced by consumers.[45]\n\nDeutsche Bank sees a \"second gold rush\" for the photovoltaic industry to come. Grid parity has already been reached in at least 19 markets by January 2014. Photovoltaics will prevail beyond feed-in tariffs, becoming more competitive as deployment increases and prices continue to fall.[46]\n\nIn June 2014 Barclays downgraded bonds of U.S. utility companies. Barclays expects more competition by a growing self-consumption due to a combination of decentralized PV-systems and residential electricity storage. This could fundamentally change the utility's business model and transform the system over the next ten years, as prices for these systems are predicted to fall.[47]\n\n\n\n\nTop 10 PV countries in 2015 (MW)\n\t\nInstalled and Total Solar Power Capacity in 2015 (MW)[48]\n\t#\tNation\tTotal Capacity\tAdded Capacity\n\n\t1\t China\t43,530\t15,150\n\n\t2\t Germany\t39,700\t1,450\n\n\t3\t Japan\t34,410\t11,000\n\n\t4\t United States\t25,620\t7,300\n\n\t5\t Italy\t18,920\t300\n\n\t6\t United Kingdom\t8,780\t3,510\n\n\t7\t France\t6,580\t879\n\n\t8\t Spain\t5,400\t56\n\n\t9\t Australia\t5,070\t935\n\n\t10\t India\t5,050\t2,000\n\n\n\n\n\t\nData: IEA-PVPS Snapshot of Global PV 1992–2015 report, March 2015[48]:15\nAlso see Solar power by country for a complete  and continuously updated list\n\n\n\n\n\nEnvironmental impacts of photovoltaic technologies[edit]\n\nTypes of impacts\n\nWhile solar photovoltaic (PV) cells are promising for clean energy production, their deployment is hindered by production costs, material availability, and toxicity.[49] Data required to investigate their impact are sometimes affected by a rather large amount of uncertainty. The values of human labor and water consumption, for example, are not precisely assessed due to the lack of systematic and accurate analyses in the scientific literature.[1]\n\nLife cycle assessment (LCA) is one method of determining environmental impacts from PV. Many studies have been done on the various types of PV including first generation, second generation, and third generation. Usually these PV LCA studies select a cradle to gate system boundary because often at the time the studies are conducted, it is a new technology not commercially available yet and their required balance of system components and disposal methods are unknown.[50]\n\nA traditional LCA can look at many different impact categories ranging from global warming potential, ecotoxicity, human toxicity, water depletion, and many others.\n\nMost LCAs of PV have focused on two categories: carbon dioxide equivalents per kWh and energy pay-back time (EPBT). The  EPBT is defined as \" the time needed to compensate for the total renewable- and non-renewable- primary energy required during the life cycle of a PV system\".[51] A 2015 review of EPBT from first and second generation PV[52] suggested that there was greater variation in embedded energy than in efficiency of the cells implying that it was mainly the embedded energy that needs to reduce to have a greater reduction in EPBT. One difficulty in determining impacts due to PV is to determine if the wastes are released to the air, water, or soil during the manufacturing phase.[53] Research is underway to try to understand emissions and releases during the lifetime of PV systems.[53]\n\nImpacts from first-generation PV\n\nCrystalline silicon modules are the most extensively studied PV type in terms of LCA since they are the most commonly used. Mono-crystalline silicon photovoltaic systems (mono-si) have an average efficiency of 14.0%.[54] The cells tend to follow a structure of front electrode, anti-reflection film, n-layer, p-layer, and back electrode, with the sun hitting the front electrode. EPBT ranges from 1.7 to 2.7 years.[55] The cradle to gate of CO2-eq/kWh ranges from 37.3 to 72.2 grams.[56]\n\nTechniques to produce multi-crystalline silicon (multi-si) photovoltaic cells are simpler and cheaper than mono-si, however tend to make less efficient cells, an average of 13.2%.[54] EPBT ranges from 1.5 to 2.6 years.[55] The cradle to gate of CO2-eq/kWh ranges from 28.5 to 69 grams.[56] Some studies have looked beyond EPBT and GWP to other environmental impacts. In one such study, conventional energy mix in Greece was compared to multi-si PV and found a 95% overall reduction in impacts including carcinogens, eco-toxicity, acidification, eutrophication, and eleven others.[57]\n\nImpacts from second generation\n\nCadmium telluride (CdTe) is one of the fastest-growing thin film based solar cells which are collectively known as second generation devices. This new thin film device also shares similar performance restrictions (Shockley-Queisser efficiency limit) as conventional Si devices but promises to lower the cost of each device by both reducing material and energy consumption during manufacturing. Today the global market share of CdTe is 5.4%, up from 4.7% in 2008.[53] This technology’s highest power conversion efficiency is 21%.[58] The cell structure includes glass substrate (around 2 mm), transparent conductor layer, CdS buffer layer (50–150 nm), CdTe absorber and a metal contact layer.\n\nCdTe PV systems require less energy input in their production than other commercial PV systems per unit electricity production. The average CO2-eq/kWh is around 18 grams (cradle to gate). CdTe has the fastest EPBT of all commercial PV technologies, which varies between 0.3 and 1.2 years.[59]\n\nCopper Indium Gallium Diselenide (CIGS) is a thin film solar cell based on the copper indium diselenide (CIS) family of chalcopyrite semiconductors. CIS and CIGS are often used interchangeably within the CIS/CIGS community. The cell structure includes soda lime glass as the substrate, Mo layer as the back contact, CIS/CIGS as the absorber layer, cadmium sulfide (CdS) or Zn (S,OH)x  as the buffer layer, and ZnO:Al as the front contact.[60] CIGS is approximately 1/100th the thickness of conventional silicon solar cell technologies. Materials necessary for assembly are readily available, and are less costly per watt of solar cell. CIGS based solar devices resist performance degradation over time and are highly stable in the field.\n\nReported global warming potential impacts of CIGS range from 20.5 – 58.8 grams CO2-eq/kWh of electricity generated for different solar irradiation (1,700 to 2,200 kWh/m2/y) and power conversion efficiency (7.8 – 9.12%).[61] EPBT ranges from 0.2 to 1.4 years,[59] while harmonized value of EPBT was found 1.393 years.[52] Toxicity is an issue within the buffer layer of CIGS modules because it contains cadmium and gallium.[50][62] CIS modules do not contain any heavy metals.\n\nImpacts from third generation\n\nThird-generation PVs are designed to combine the advantages of both the first and second generation devices and they do not have Shockley-Queisser limit, a theoretical limit for first and second generation PV cells. The thickness of a third generation device is less than 1 µm.[63]\n\nOne emerging alternative and promising technology is based on an organic-inorganic hybrid solar cell made of methylammonium lead halide perovskites. Perovskite PV cells have progressed rapidly over the past few years and have become one of the most attractive areas for PV research.[64] The cell structure includes a metal back contact (which can be made of Al, Au or Ag), a hole transfer layer (spiro-MeOTAD, P3HT, PTAA, CuSCN, CuI, or NiO), and absorber layer (CH3NH3PbIxBr3-x, CH3NH3PbIxCl3-x or CH3NH3PbI3), an electron transport layer (TiO, ZnO, Al2O3 or SnO2) and a top contact layer (fluorine doped tin oxide or tin doped indium oxide).\n\nThere are a limited number of published studies to address the environmental impacts of perovskite solar cells.[64][65][66] The major environmental concern is the lead used in the absorber layer. Due to the instability of perovskite cells lead may eventually be exposed to fresh water during the use phase. These LCA  studies looked at human and ecotoxicity of perovskite solar cells and found they were  surprisingly low and may not be an environmental issue.[65][66]  Global warming potential of perovskite PVs were found to be in the range of 24–1500 grams CO2-eq/kWh electricity production. Similarly, reported EPBT of the published paper range from 0.2 to 15 years. The large range of reported values highlight the uncertainties associated with these studies. Celik et al. (2016) critically discussed the assumptions made in perovskite PV LCA studies.[64]\n\nTwo new promising thin film technologies are copper zinc tin sulfide (Cu2ZnSnS4 or CZTS),[50] zinc phosphide (Zn3P2)[50] and single-walled carbon nano-tubes (SWCNT).[67] These thin films are currently only produced in the lab but may be commercialized in the future. The manufacturing of CZTS and (Zn3P2) processes are expected to be similar to those of current thin film technologies of CIGS and CdTe, respectively. While the absorber layer of SWCNT PV is expected to be synthesized with CoMoCAT method.[68] by  Contrary to established thin films such as CIGS and CdTe, CZTS,  Zn3P2, and SWCNT PVs are made from earth abundant, nontoxic materials and have the potential to produce more electricity annually than the current worldwide consumption.[69][70] While CZTS and Zn3P2 offer good promise for these reasons, the specific environmental implications of their commercial production are not yet known. Global warming potential of CZTS and Zn3P2 were found 38 and 30 grams CO2-eq/kWh while their corresponding EPBT were found 1.85 and 0.78 years, respectively.[50] Overall, CdTe and Zn3P2 have similar environmental impacts but can slightly outperform CIGS and CZTS.[50] Celik et al. performed the first LCA study on environmental impacts of SWCNT PVs, including a laboratory-made 1% efficient device and an aspirational 28% efficient four-cell tandem device and interpreted the results by using mono-Si as a reference point.[67] the results show that compared to monocrystalline Si (mono-Si), the environmental impacts from 1% SWCNT was ∼18 times higher due mainly to the short lifetime of three years. However, even with the same short lifetime, the 28% cell had lower environmental impacts than mono-Si.\n\nOrganic and polymer photovoltaic (OPV) are a relatively new area of research. The tradition OPV cell structure layers consist of a semi-transparent electrode, electron blocking layer, tunnel junction, holes blocking layer, electrode, with the sun hitting the transparent electrode. OPV replaces silver with carbon as an electrode material lowering manufacturing cost and making them more environmentally friendly.[71] OPV are flexible, low weight, and work well with roll-to roll manufacturing for mass production.[72] OPV uses \"only abundant elements coupled to an extremely low embodied energy through very low processing temperatures using only ambient processing conditions on simple printing equipment enabling energy pay-back times\".[73] Current efficiencies range from 1–6.5%,[51][74] however theoretical analyses show promise beyond 10% efficiency.[73]\n\nMany different configurations of OPV exist using different materials for each layer. OPV technology rivals existing PV technologies in terms of EPBT even if they currently present a shorter operational lifetime. A 2013 study analyzed 12 different configurations all with 2% efficiency, the EPBT ranged from 0.29–0.52 years for 1 m² of PV.[75] The average CO2-eq/kWh for OPV is 54.922 grams.[76]\n\n\nEconomics[edit]\n\nSee also: Photovoltaic system § Costs and economy\n\n\t\n\nSource: Apricus[77]\n\n\n\n\n\nThere have been major changes in the underlying costs, industry structure and market prices of solar photovoltaics technology, over the years, and gaining a coherent picture of the shifts occurring across the industry value chain globally is a challenge. This is due to: \"the rapidity of cost and price changes, the complexity of the PV supply chain, which involves a large number of manufacturing processes, the balance of system (BOS) and installation costs associated with complete PV systems, the choice of different distribution channels, and differences between regional markets within which PV is being deployed\". Further complexities result from the many different policy support initiatives that have been put in place to facilitate photovoltaics commercialisation in various countries.[2]\n\nThe PV industry has seen dramatic drops in module prices since 2008. In late 2011, factory-gate prices for crystalline-silicon photovoltaic modules dropped below the $1.00/W mark. The $1.00/W installed cost, is often regarded in the PV industry as marking the achievement of grid parity for PV. Technological advancements, manufacturing process improvements, and industry re-structuring, mean that further price reductions are likely in coming years.[2] As of 2017 power-purchase agreement prices for solar farms below $0.05/kWh are common in the United States and the lowest bids in several international countries were about $0.03/kWh.[34]\n\nFinancial incentives for photovoltaics, such as feed-in tariffs, have often been offered to electricity consumers to install and operate solar-electric generating systems. Government has sometimes also offered incentives in order to encourage the PV industry to achieve the economies of scale needed to compete where the cost of PV-generated electricity is above the cost from the existing grid. Such policies are implemented to promote national or territorial energy independence, high tech job creation and reduction of carbon dioxide emissions which cause climate change. Due to economies of scale solar panels get less costly as people use and buy more—as manufacturers increase production to meet demand, the cost and price is expected to drop in the years to come.\n\nSolar cell efficiencies vary from 6% for amorphous silicon-based solar cells to 44.0% with multiple-junction concentrated photovoltaics.[78] Solar cell energy conversion efficiencies for commercially available photovoltaics are around 14–22%.[79][80] Concentrated photovoltaics (CPV) may reduce cost by concentrating up to 1,000 suns (through magnifying lens) onto a smaller sized photovoltaic cell. However, such concentrated solar power requires sophisticated heat sink designs, otherwise the photovoltaic cell overheats, which reduces its efficiency and life. To further exacerbate the concentrated cooling design, the heat sink must be passive, otherwise the power required for active cooling would reduce the overall efficiency and economy.\n\nCrystalline silicon solar cell prices have fallen from $76.67/Watt in 1977 to an estimated $0.74/Watt in 2013.[81] This is seen as evidence supporting Swanson's law, an observation similar to the famous Moore's Law that states that solar cell prices fall 20% for every doubling of industry capacity.[81]\n\nAs of 2011, the price of PV modules has fallen by 60% since the summer of 2008, according to Bloomberg New Energy Finance estimates, putting solar power for the first time on a competitive footing with the retail price of electricity in a number of sunny countries; an alternative and consistent price decline figure of 75% from 2007 to 2012 has also been published,[82] though it is unclear whether these figures are specific to the United States or generally global. The levelised cost of electricity (LCOE) from PV is competitive with conventional electricity sources in an expanding list of geographic regions,[83] particularly when the time of generation is included, as electricity is worth more during the day than at night.[84] There has been fierce competition in the supply chain, and further improvements in the levelised cost of energy for solar lie ahead, posing a growing threat to the dominance of fossil fuel generation sources in the next few years.[85] As time progresses, renewable energy technologies generally get cheaper,[86][87] while fossil fuels generally get more expensive:\n\n\nThe less solar power costs, the more favorably it compares to conventional power, and the more attractive it becomes to utilities and energy users around the globe. Utility-scale solar power can now be delivered in California at prices well below $100/MWh ($0.10/kWh) less than most other peak generators, even those running on low-cost natural gas. Lower solar module costs also stimulate demand from consumer markets where the cost of solar compares very favorably to retail electric rates.[88]\n\n\n\n  \nPrice per watt history for conventional (c-Si) solar cells since 1977.\n\n\n\nAs of 2011, the cost of PV has fallen well below that of nuclear power and is set to fall further. The average retail price of solar cells as monitored by the Solarbuzz group fell from $3.50/watt to $2.43/watt over the course of 2011.[89]\n\n\nFor large-scale installations, prices below $1.00/watt were achieved. A module price of 0.60 Euro/watt ($0.78/watt) was published for a large scale 5-year deal in April 2012.[90]\n\n\nBy the end of 2012, the \"best in class\" module price had dropped to $0.50/watt, and was expected to drop to $0.36/watt by 2017.[91]\n\nIn many locations, PV has reached grid parity, which is usually defined as PV production costs at or below retail electricity prices (though often still above the power station prices for coal or gas-fired generation without their distribution and other costs). However, in many countries there is still a need for more access to capital to develop PV projects. To solve this problem securitization has been proposed and used to accelerate development of solar photovoltaic projects.[92][93] For example, SolarCity offered, the first U.S. asset-backed security in the solar industry in 2013.[94]\n\nPhotovoltaic power is also generated during a time of day that is close to peak demand (precedes it) in electricity systems with high use of air conditioning. Since large-scale PV operation requires back-up in the form of spinning reserves, its marginal cost of generation in the middle of the day is typically lowest, but not zero, when PV is generating electricity. This can be seen in Figure 1 of this paper:.[95] More generally, it is now evident that, given a carbon price of $50/ton, which would raise the price of coal-fired power by 5c/kWh, solar PV will be cost-competitive in most locations. The declining price of PV has been reflected in rapidly growing installations, totaling about 23 GW in 2011. Although some consolidation is likely in 2012, due to support cuts in the large markets of Germany and Italy, strong growth seems likely to continue for the rest of the decade. Already, by one estimate, total investment in renewables for 2011 exceeded investment in carbon-based electricity generation.[89]\n\nIn the case of self consumption payback time is calculated based on how much electricity is not brought from the grid. Additionally, using PV solar power to charge DC batteries, as used in Plug-in Hybrid Electric Vehicles and Electric Vehicles, leads to greater efficiencies. Traditionally, DC generated electricity from solar PV must be converted to AC for buildings, at an average 10% loss during the conversion. An additional efficiency loss occurs in the transition back to DC for battery driven devices and vehicles, and using various interest rates and energy price changes were calculated to find present values that range from $2,057 to $8,213 (analysis from 2009).[96]\n\nFor example, in Germany with electricity prices of 0.25 euro/kWh and Insolation of 900 kWh/kW one kWp will save 225 euro per year and with installation cost of 1700 euro/kWp means that the system will pay back in less than 7 years.[97]\n\n\nManufacturing[edit]\n\nSee also: List of photovoltaics companies\n\nOverall the\nmanufacturing process of creating solar photovoltaics is simple in that it does\nnot require the culmination of many complex or moving parts. Because of the\nsolid state nature of PV systems they often have relatively long lifetimes,\nanywhere from 10 to 30 years. To increase electrical output of a PV\nsystem, the manufacturer must simply add more photovoltaic components and\nbecause of this economies of scale are important for manufacturers as costs\ndecrease with increasing output.[98]\n\nWhile there are many types of PV systems known to be effective, crystalline silicon PV accounted for around 90% of the worldwide production of PV in 2013. Manufacturing silicon PV systems has several steps. First, polysilicon is processed from mined quartz until it is very pure (semi-conductor grade). This is melted down when small amounts of boron, a group III element, are added to make a p-type semiconductor rich in electron holes. Typically using a seed crystal, an ingot of this solution is grown from the liquid polycrystalline. The ingot may also be cast in a mold. Wafers of this semiconductor material are cut from the bulk material with wire saws, and then go through surface etching before being cleaned. Next, the wafers are placed into a phosphorus vapor deposition furnace which lays a very thin layer of phosphorus, a group V element, which creates an n-type semiconducting surface. To reduce energy losses, an anti-reflective coating is added to the surface, along with electrical contacts. After finishing the cell, cells are connected via electrical circuit according to the specific application and prepared for shipping and installation.[99]\n\nCrystalline silicon photovoltaics are only one type of PV, and while they represent the majority of solar cells produced currently there are many new and promising technologies that have the potential to be scaled up to meet future energy needs. As of 2018, crystalline silicon cell technology serves as the basis for several PV module types, including monocrystalline, multicrystalline, mono PERC, and bifacial.[100]\n\nAnother newer technology, thin-film PV, are manufactured by depositing semiconducting layers on substrate in vacuum. The substrate is often glass or stainless-steel, and these semiconducting layers are made of many types of materials including cadmium telluride (CdTe), copper indium diselenide (CIS), copper indium gallium diselenide (CIGS), and amorphous silicon (a-Si). After being deposited onto the substrate the semiconducting layers are separated and connected by electrical circuit by laser-scribing. Thin-film photovoltaics now make up around 20% of the overall production of PV because of the reduced materials requirements and cost to manufacture modules consisting of thin-films as compared to silicon-based wafers.[101]\n\nOther emerging PV technologies include organic, dye-sensitized, quantum-dot, and Perovskite photovoltaics.[102] OPVs fall into the thin-film category of manufacturing, and typically operate around the 12% efficiency range which is lower than the 12–21% typically seen by silicon based PVs. Because organic photovoltaics require very high purity and are relatively reactive they must be encapsulated which vastly increases cost of manufacturing and meaning that they are not feasible for large scale up. Dye-sensitized PVs are similar in efficiency to OPVs but are significantly easier to manufacture. However these dye-sensitized photovoltaics present storage problems because the liquid electrolyte is toxic and can potentially permeate the plastics used in the cell. Quantum dot solar cells are quantum dot sensitized DSSCs and are solution processed meaning they are potentially scalable, but currently they peak at 12% efficiency. Perovskite solar cells are a very efficient solar energy converter and have excellent optoelectric properties for photovoltaic purposes, but they are expensive and difficult to manufacture.[103]\n\n\nApplications[edit]\n\nPhotovoltaic systems[edit]\n\nMain article: Photovoltaic system\n\nA photovoltaic system, or solar PV system is a power system designed to supply usable solar power by means of photovoltaics. It consists of an arrangement of several components, including solar panels to absorb and directly convert sunlight into electricity, a solar inverter to change the electric current from DC to AC, as well as mounting, cabling and other electrical accessories. PV systems range from small, roof-top mounted or building-integrated systems with capacities from a few to several tens of kilowatts, to large utility-scale power stations of hundreds of megawatts. Nowadays, most PV systems are grid-connected, while stand-alone systems only account for a small portion of the market.\n\n\n\t\tRooftop and building integrated systems\n\n\n\n\n  \nRooftop PV on half-timbered house\n\n\n\n\tPhotovoltaic arrays are often associated with buildings: either integrated into them, mounted on them or mounted nearby on the ground. Rooftop PV systems are most often retrofitted into existing buildings, usually mounted on top of the existing roof structure or on the existing walls. Alternatively, an array can be located separately from the building but connected by cable to supply power for the building. Building-integrated photovoltaics (BIPV) are increasingly incorporated into the roof or walls of new domestic and industrial buildings as a principal or ancillary source of electrical power.[104] Roof tiles with integrated PV cells are sometimes used as well. Provided there is an open gap in which air can circulate, rooftop mounted solar panels can provide a passive cooling effect on buildings during the day and also keep accumulated heat in at night.[105] Typically, residential rooftop systems have small capacities of around 5–10 kW, while commercial rooftop systems often amount to several hundreds of kilowatts. Although rooftop systems are much smaller than ground-mounted utility-scale power plants, they account for most of the worldwide installed capacity.[106]\n\n\n\t\tConcentrator photovoltaics\n\n\n\n\n\tConcentrator photovoltaics (CPV) is a photovoltaic technology that contrary to conventional flat-plate PV systems uses lenses and curved mirrors to focus sunlight onto small, but highly efficient, multi-junction (MJ) solar cells. In addition, CPV systems often use solar trackers and sometimes a cooling system to further increase their efficiency. Ongoing research and development is rapidly improving their competitiveness in the utility-scale segment and in areas of high solar insolation.\n\n\n\t\tPhotovoltaic thermal hybrid solar collector\n\n\n\n\n\tPhotovoltaic thermal hybrid solar collector (PVT) are systems that convert solar radiation into thermal and electrical energy. These systems combine a solar PV cell, which converts sunlight into electricity, with a solar thermal collector, which captures the remaining energy and removes waste heat from the PV module. The capture of both electricity and heat allow these devices to have higher exergy and thus be more overall energy efficient than solar PV or solar thermal alone.[107][108]\n\n\n\t\tPower stations\n\n\n\n\n  \nSatellite image of the Topaz Solar Farm\n\n\n\n\tMany utility-scale solar farms have been constructed all over the world. As of 2015, the 579-megawatt (MWAC) Solar Star is the world's largest photovoltaic power station, followed by the Desert Sunlight Solar Farm and the Topaz Solar Farm, both with a capacity of 550 MWAC, constructed by US-company First Solar, using CdTe modules, a thin-film PV technology.[109] All three power stations are located in the Californian desert. Many solar farms around the world are integrated with agriculture and some use innovative solar tracking systems that follow the sun's daily path across the sky to generate more electricity than conventional fixed-mounted systems. There are no fuel costs or emissions during operation of the power stations.\n\n\n\t\tRural electrification\n\n\n\n\n\tDeveloping countries where many villages are often more than five kilometers away from grid power are increasingly using photovoltaics. In remote locations in India a rural lighting program has been providing solar powered LED lighting to replace kerosene lamps. The solar powered lamps were sold at about the cost of a few months' supply of kerosene.[110][111] Cuba is working to provide solar power for areas that are off grid.[112] More complex applications of off-grid solar energy use include 3D printers.[113] RepRap 3D printers have been solar powered with photovoltaic technology,[114] which enables distributed manufacturing for sustainable development. These are areas where the social costs and benefits offer an excellent case for going solar, though the lack of profitability has relegated such endeavors to humanitarian efforts. However, in 1995 solar rural electrification projects had been found to be difficult to sustain due to unfavorable economics, lack of technical support, and a legacy of ulterior motives of north-to-south technology transfer.[115]\n\n\n\t\tStandalone systems\n\n\n\n\n\tUntil a decade or so ago, PV was used frequently to power calculators and novelty devices. Improvements in integrated circuits and low power liquid crystal displays make it possible to power such devices for several years between battery changes, making PV use less common. In contrast, solar powered remote fixed devices have seen increasing use recently in locations where significant connection cost makes grid power prohibitively expensive. Such applications include solar lamps, water pumps,[116] parking meters,[117][118] emergency telephones, trash compactors,[119] temporary traffic signs, charging stations,[120][121] and remote guard posts and signals.\n\n\n\t\tFloatovoltaics\n\n\n\n\n\tIn May 2008, the Far Niente Winery in Oakville, CA pioneered the world's first \"floatovoltaic\" system by installing 994 photovoltaic solar panels onto 130 pontoons and floating them on the winery's irrigation pond. The floating system generates about 477 kW of peak output and when combined with an array of cells located adjacent to the pond is able to fully offset the winery's electricity consumption.[122] The primary benefit of a floatovoltaic system is that it avoids the need to sacrifice valuable land area that could be used for another purpose. In the case of the Far Niente Winery, the floating system saved three-quarters of an acre that would have been required for a land-based system. That land area can instead be used for agriculture.[123] Another benefit of a floatovoltaic system is that the panels are kept at a lower temperature than they would be on land, leading to a higher efficiency of solar energy conversion. The floating panels also reduce the amount of water lost through evaporation and inhibit the growth of algae.[124]\n\n\n\t\tIn transport\n\n\n\n\n  \nSolar Impulse 2, a solar aircraft\n\n\n\n\tPV has traditionally been used for electric power in space. PV is rarely used to provide motive power in transport applications, but is being used increasingly to provide auxiliary power in boats and cars. Some automobiles are fitted with solar-powered air conditioning to limit interior temperatures on hot days.[125] A self-contained solar vehicle would have limited power and utility, but a solar-charged electric vehicle allows use of solar power for transportation. Solar-powered cars, boats[126] and airplanes[127] have been demonstrated, with the most practical and likely of these being solar cars.[128] The Swiss solar aircraft, Solar Impulse 2, achieved the longest non-stop solo flight in history and completed the first solar-powered aerial circumnavigation of the globe in 2016.\n\n\n\t\tTelecommunication and signaling\n\n\n\n\n\tSolar PV power is ideally suited for telecommunication applications such as local telephone exchange, radio and TV broadcasting, microwave and other forms of electronic communication links. This is because, in most telecommunication application, storage batteries are already in use and the electrical system is basically DC. In hilly and mountainous terrain, radio and TV signals may not reach as they get blocked or reflected back due to undulating terrain. At these locations, low power transmitters (LPT) are installed to receive and retransmit the signal for local population.[129]\n\n\n\t\tSpacecraft applications\n\n\n\n\n  \nPart of Juno's solar array\n\n\n\n\tSolar panels on spacecraft are usually the sole source of power to run the sensors, active heating and cooling, and communications.  A battery stores this energy for use when the solar panels are in shadow.  In some, the power is also used for spacecraft propulsion—electric propulsion.[130]  Spacecraft were one of the earliest applications of photovoltaics, starting with the silicon solar cells used on the Vanguard 1 satellite, launched by the US in 1958.[131] Since then, solar power has been used on missions ranging from the MESSENGER probe to Mercury, to as far out in the solar system as the Juno probe to Jupiter. The largest solar power system flown in space is the electrical system of the International Space Station. To increase the power generated per kilogram, typical spacecraft solar panels use high-cost, high-efficiency, and close-packed rectangular multi-junction solar cells made of gallium arsenide (GaAs) and other semiconductor materials.[130]\n\n\n\t\tSpecialty Power Systems\n\n\n\n\n\tPhotovoltaics may also be incorporated as energy conversion devices for objects at elevated temperatures and with preferable radiative emissivities such as heterogeneous combustors.[132]\n\n\nAdvantages[edit]\n\nThe 122 PW of sunlight reaching the Earth's surface is plentiful—almost 10,000 times more than the 13 TW equivalent of average power consumed in 2005 by humans.[133] This abundance leads to the suggestion that it will not be long before solar energy will become the world's primary energy source.[134] Additionally, solar electric generation has the highest power density (global mean of 170 W/m2) among renewable energies.[133]\n\nSolar power is pollution-free during use, which enables it to cut down on pollution when it is substituted for other energy sources. For example, MIT estimated that 52,000 people per year die prematurely in the U.S. from coal-fired power plant pollution[135] and all but one of these deaths could be prevented from using PV to replace coal.[136][137] Production end-wastes and emissions are manageable using existing pollution controls. End-of-use recycling technologies are under development[138] and policies are being produced that encourage recycling from producers.[139]\n\nPV installations can operate for 100 years or even more[140] with little maintenance or intervention after their initial set-up, so after the initial capital cost of building any solar power plant, operating costs are extremely low compared to existing power technologies.\n\nGrid-connected solar electricity can be used locally thus reducing transmission/distribution losses (transmission losses in the US were approximately 7.2% in 1995).[141]\n\nCompared to fossil and nuclear energy sources, very little research money has been invested in the development of solar cells, so there is considerable room for improvement. Nevertheless, experimental high efficiency solar cells already have efficiencies of over 40% in case of concentrating photovoltaic cells[142] and efficiencies are rapidly rising while mass-production costs are rapidly falling.[143]\n\nIn some states of the United States, much of the investment in a home-mounted system may be lost if the home-owner moves and the buyer puts less value on the system than the seller. The city of Berkeley developed an innovative financing method to remove this limitation, by adding a tax assessment that is transferred with the home to pay for the solar panels.[144] Now known as PACE, Property Assessed Clean Energy, 30 U.S. states have duplicated this solution.[145]\n\nThere is evidence, at least in California, that the presence of a home-mounted solar system can actually increase the value of a home. According to a paper published in April 2011 by the Ernest Orlando Lawrence Berkeley National Laboratory titled An Analysis of the Effects of Residential Photovoltaic Energy Systems on Home Sales Prices in California:\n\n\n\nThe research finds strong evidence that homes with PV systems in California have sold for a premium over comparable homes without PV systems. More specifically, estimates for average PV premiums range from approximately $3.9 to $6.4 per installed watt (DC) among a large number of different model specifications, with most models coalescing near $5.5/watt. That value corresponds to a premium of approximately $17,000 for a relatively new 3,100 watt PV system (the average size of PV systems in the study).[146]\n\n\n\nLimitations[edit]\n\n\t\tPollution and Energy in Production\n\n\n\n\nPV has been a well-known method of generating clean, emission-free electricity. PV systems are often made of PV modules and inverter (changing DC to AC). PV modules are mainly made of PV cells, which has no fundamental difference from the material used for making computer chips. The process of producing PV cells is energy-intensive and involves highly poisonous and environmentally toxic chemicals. There are a few PV manufacturing plants around the world producing PV modules with energy produced from PV. This counteractive measure considerably reduces the carbon footprint of the manufacturing process of PV cells. Management of the chemicals used and produced during the manufacturing process is subject to the factories' local laws and regulations.\n\n\n\t\tImpact on Electricity Network\n\n\n\n\nWith the increasing levels of rooftop photovoltaic systems, the energy flow becomes 2-way. When there is more local generation than consumption, electricity is exported to the grid. However, electricity networks traditionally are not designed to deal with 2-way energy transfer. Therefore, some technical issues may occur. For example, in Queensland Australia, more than 30% of households had rooftop PV by the end of 2017. The famous Californian 2020 duck curve appears very often for a lot of communities from 2015 onwards. An over-voltage issue may come out as the electricity flows from these PV households back to the network.[147] There are solutions to manage the over voltage issue, such as regulating PV inverter power factor, new voltage and energy control equipment at electricity distributor level, re-conductor the electricity wires, demand side management, etc. There are often limitations and costs related to these solutions.\n\n\n\t\tImplications for Electricity Bill Management and Energy Investment\n\n\n\n\nThere is no silver bullet in electricity or energy demand and bill management, because customers (sites) have different specific situations, e.g. different comfort/convenience needs, different electricity tariffs, or different usage patterns. Electricity tariff may have a few elements, such as daily access and metering charge, energy charge (based on kWh, MWh) or peak demand charge (e.g. a price for the highest 30min energy consumption in a month). PV is a promising option for reducing energy charges when electricity prices are reasonably high and continuously increasing, such as in Australia and Germany. However, for sites with peak demand charge in place, PV may be less attractive if peak demands mostly occur in the late afternoon to early evening, for example in residential communities. Overall, energy investment is largely an economic decision and it is better to make investment decisions based on systematical evaluation of options in operational improvement, energy efficiency, onsite generation and energy storage.[148][149]\n\n\nSee also[edit]\n\n\t\tWikimedia Commons has media related to Photovoltaics.\n\n\n\n\tActive solar\n\tAgrivoltaic\n\tAmerican Solar Energy Society\n\tAnomalous photovoltaic effect\n\tCopper in photovoltaic power generation\n\tCost of electricity by source\n\tEnergy demand management\n\tElectromotive force#Solar cell\n\tGraphene#Solar cells\n\tList of photovoltaics companies\n\tList of solar cell manufacturers\n\tPhotoelectrochemical cell\n\tQuantum efficiency#Quantum efficiency of solar cells\n\tRenewable energy commercialization\n\tSolar module quality assurance\n\tSolar photovoltaic monitoring\n\tSolar thermal energy\n\tTheory of solar cell\n\n\n\n\nReferences[edit]\n\n\n\t^ a b Lo Piano, Samuele; Mayumi, Kozo (2017). \"Toward an integrated assessment of the performance of photovoltaic systems for electricity generation\". Applied Energy. 186 (2): 167–74. doi:10.1016/j.apenergy.2016.05.102.\n\n\t^ a b c d Bazilian, M.; Onyeji, I.; Liebreich, M.; MacGill, I.; Chase, J.; Shah, J.; Gielen, D.; Arent, D.; Landfear, D.; Zhengrong, S. (2013). \"Re-considering the economics of photovoltaic power\" (PDF). Renewable Energy. 53: 329–338. CiteSeerX 10.1.1.692.1880. doi:10.1016/j.renene.2012.11.029.\n\n\n\t^ Palz, Wolfgang (2013). Solar Power for the World: What You Wanted to Know about Photovoltaics. CRC Press. pp. 131–. ISBN 978-981-4411-87-5.\n\n\n\t^ Shubbak, Mahmood H. (2019). \"The technological system of production and innovation: The case of photovoltaic technology in China\". Research Policy. 48 (4): 993–1015. doi:10.1016/j.respol.2018.10.003.\n\n\n\t^ Swanson, R. M. (2009). \"Photovoltaics Power Up\" (PDF). Science. 324 (5929): 891–2. doi:10.1126/science.1169616. PMID 19443773.\n\n\n\t^ Renewable Energy Policy Network for the 21st century (REN21), Renewables 2010 Global Status Report, Paris, 2010, pp. 1–80.\n\n\t^ a b \"Snapshot of Global Photovoltaic Markets 2017\" (PDF). report. International Energy Agency. 19 April 2017. Retrieved 11 July 2017.\n\n\n\t^ Tam Hunt (9 March 2015). \"The Solar Singularity Is Nigh\". Greentech Media. Retrieved 29 April 2015.\n\n\n\t^ a b c \"Snapshot of Global PV 1992–2014\" (PDF). International Energy Agency — Photovoltaic Power Systems Programme. 30 March 2015. Archived from the original on 7 April 2015.\n\n\n\t^ Photovoltaics Report. Fraunhofer Institute for Solar Energy Systems ISE. 7 November 2013.\n\n\t^ Smee, Alfred (1849). Elements of electro-biology,: or the voltaic mechanism of man; of electro-pathology, especially of the nervous system; and of electro-therapeutics. London: Longman, Brown, Green, and Longmans. p. 15.\n\n\n\t^ Photovoltaic Effect Archived 14 July 2011 at the Wayback Machine. Mrsolar.com. Retrieved 12 December 2010\n\n\t^ The photovoltaic effect Archived 12 October 2010 at the Wayback Machine. Encyclobeamia.solarbotics.net. Retrieved on 12 December 2010.\n\n\t^ Jacobson, Mark Z. (2009). \"Review of Solutions to Global Warming, Air Pollution, and Energy Security\". Energy & Environmental Science. 2 (2): 148–173. CiteSeerX 10.1.1.180.4676. doi:10.1039/B809990C.\n\n\n\t^ German PV market. Solarbuzz.com. Retrieved on 3 June 2012.\n\n\t^ BP Solar to Expand Its Solar Cell Plants in Spain and India Archived 26 September 2007 at the Wayback Machine. Renewableenergyaccess.com. 23 March 2007. Retrieved on 3 June 2012.\n\n\t^ Bullis, Kevin (23 June 2006). Large-Scale, Cheap Solar Electricity. Technologyreview.com. Retrieved on 3 June 2012.\n\n\t^ Luque, Antonio & Hegedus, Steven (2003). Handbook of Photovoltaic Science and Engineering. John Wiley and Sons. ISBN 978-0-471-49196-5.\n\n\n\t^ The PVWatts Solar Calculator Retrieved on 7 September 2012\n\n\t^ Massachusetts: a Good Solar Market Archived 12 September 2012 at the Wayback Machine. Remenergyco.com. Retrieved on 31 May 2013.\n\n\t^ Vick, B.D., Clark, R.N. (2005). Effect of module temperature on a Solar-PV AC water pumping system, pp. 159–164 in: Proceedings of the International Solar Energy Society (ISES) 2005 Solar Water Congress: Bringing water to the World, 8–12 August 2005, Orlando, Florida.\n\n\t^ GE Invests, Delivers One of World's Largest Solar Power Plants. Huliq.com (12 April 2007). Retrieved on 3 June 2012.\n\n\t^ Current Developments in Solar Technologies. cnn.com (17 December 2014). Retrieved on 1 April 2015.\n\n\t^ Measuring PV Efficiency. pvpower.com\n\n\t^ Frank, Dimroth. \"New world record for solar cell efficiency at 46% French-German cooperation confirms competitive advantage of European photovoltaic industry\". Fraunhofer-Gesellschaft. Retrieved 14 March 2016.\n\n\n\t^ Sharp Develops Solar Cell with World's Highest Conversion Efficiency of 35.8%. Physorg.com. 22 October 2009. Retrieved on 3 June 2012.\n\n\t^ \"SunPower TM X-Series Data Sheet\" (PDF). SunPower. April 2013. Retrieved 25 October 2015.\n\n\n\t^ Deb, Satyen K. (May 2000) Recent Developments in High Efficiency PV cells. nrel.gov\n\n\t^ Yu, J.; Zheng, Y.; Huang, J. (2014). \"Towards High Performance Organic Photovoltaic Cells: A Review of Recent Development in Organic Photovoltaics\". Polymers. 6 (9): 2473–2509. doi:10.3390/polym6092473.\n\n\n\t^ Sun, Y.; Welch, G. C.; Leong, W. L.; Takacs, C. J.; Bazan, G. C.; Heeger, A. J. (2011). \"Solution-processed small-molecule solar cells with 6.7% efficiency\". Nature Materials. 11 (1): 44–8. Bibcode:2012NatMa..11...44S. doi:10.1038/nmat3160. PMID 22057387.\n\n\n\t^ EPFL Achieves 21% Efficiency for Perovskites. dyesol.com (8 December 2015)\n\n\t^ St. John, Jeff (23 August 2012) Solar Electronics, Panel Integration and the Bankability Challenge. greentechmedia.com\n\n\t^ Self-cooling Solar Cells. CNN. 2014-09-18\n\n\t^ a b c Nancy M. Haegel (2017). \"Terawatt-scale photovoltaics: Trajectories and challenges\". Science. 356 (6334): 141–143. Bibcode:2017Sci...356..141H. doi:10.1126/science.aal1288. hdl:10945/57762. PMID 28408563.\n\n\n\t^ \"Renewables 2011: Global Status Report\". REN21. 2011. p. 22.\n\n\n\t^ \"Global Market Outlook for Photovoltaics until 2016\" (PDF). Epia.org. 2012. pp. 9, 11, 12, 64. Archived from the original (PDF) on 20 March 2013.\n\n\n\t^ \"Top Solar Power Industry Trends for 2015\". IHS Technology. 15 January 2015. Retrieved 1 February 2015.\n\n\n\t^ \"SOLAR PV – GLOBAL GROWTH TO BE 25–30% DURING 2015\". RenewableEnergyInvestments.com. 18 February 2015.\n\n\n\t^ a b \"Mercom Capital Group Forecasts Strong Year Ahead with Global Solar Installations of Approximately 54.5 GW\". MercomCapital. March 2015.\n\n\n\t^ Michael Liebreich (27 January 2015). \"Liebreich: 10 Predictions For Clean Energy In 2015\". Bloomberg New Energy Finance. Retrieved 1 February 2015. SOLAR SOLID WITH 55GW—Our prediction for solar in 2015 is that the world will add more than 55GW of capacity, and indeed, if the sector gathers steam during the year as we think it might, it could reach as much as 60GW, up from a record of just under 50GW last year.\n\n\n\t^ \"China's National Energy Administration: 17.8 GW Of New Solar PV In 2015 (~20% Increase)\". CleanTechnica. 19 March 2015.\n\n\n\t^ \"Market Report 2013 (02)\". EPIA-publications. European Photovoltaic Industry Association. March 2014. Archived from the original on 4 April 2014.\n\n\n\t^ European Photovoltaic Industry Association (2013). \"Global Market Outlook for Photovoltaics 2013–2017\" (PDF). Archived from the original on 21 September 2013.\n\n\n\t^ Solar Photovoltaic Electricity Empowering the World Archived 22 August 2012 at the Wayback Machine. Epia.org (22 September 2012). Retrieved on 31 May 2013.\n\n\t^ Liebreich, Michael (29 January 2014). \"A YEAR OF CRACKING ICE: 10 PREDICTIONS FOR 2014\". Bloomberg New Energy Finance. Retrieved 24 April 2014.\n\n\n\t^ \"2014 Outlook: Let the Second Gold Rush Begin\" (PDF). Deutsche Bank Markets Research. 6 January 2014. Archived (PDF) from the original on 29 November 2014. Retrieved 22 November 2014.\n\n\n\t^ Barclays stuft Anleihen von US-Stromversorgern herunter; Konkurrenz durch Photovoltaik und Energiespeicher Archived 15 July 2014 at the Wayback Machine. In: solarserver.de, 16. Juni 2014. Abgerufen am 16. Juni 2014.\n\n\t^ a b \"Snapshot of Global Photovoltaic Markets\" (PDF). report. International Energy Agency. 22 April 2016. Retrieved 24 May 2016.\n\n\n\t^ \"Are we headed for a solar waste crisis?\". Environmentalprogress.org. Retrieved 30 December 2017.\n\n\n\t^ a b c d e f Collier, J., Wu, S. & Apul, D. (2014). \"Life cycle environmental impacts from CZTS (copper zinc tin sulfide) and Zn3P2 (zinc phosphide) thin film PV (photovoltaic) cells\". Energy. 74: 314–321. doi:10.1016/j.energy.2014.06.076.CS1 maint: multiple names: authors list (link)\n\n\n\t^ a b Anctil, A., Babbitt, C. W., Raffaelle, R. P. & Landi, B. J. (2013). \"Cumulative energy demand for small molecule and polymer photovoltaics\". Progress in Photovoltaics: Research and Applications. 21 (7): 1541–1554. doi:10.1002/pip.2226.CS1 maint: multiple names: authors list (link)\n\n\n\t^ a b Bhandari, K. P., Collier, J. M., Ellingson, R. J. & Apul, D. S. (2015). \"Energy payback time (EPBT) and energy return on energy invested (EROI) of solar photovoltaic systems: A systematic review and meta-analysis\". Renewable and Sustainable Energy Reviews. 47: 133–141. doi:10.1016/j.rser.2015.02.057.CS1 maint: multiple names: authors list (link)\n\n\n\t^ a b c Fthenakis, V. M., Kim, H. C. & Alsema, E. (2008). \"Emissions from photovoltaic life cycles\". Environmental Science & Technology. 42 (6): 2168–2174. Bibcode:2008EnST...42.2168F. doi:10.1021/es071763q.CS1 maint: multiple names: authors list (link)\n\n\n\t^ a b Life Cycle Greenhouse Gas Emissions from Solar Photovoltaics, National Renewable Energy Laboratory, U.S. Department of Energy, 2012, 1–2.\n\n\t^ a b Krebs, F. C. (2009). \"Fabrication and processing of polymer solar cells: a review of printing and coating techniques\". Solar Energy Materials and Solar Cells. 93 (4): 394–412. doi:10.1016/j.solmat.2008.10.004.\n\n\n\t^ a b Yue, D., You, F. & Darling, S. B. (2014). \"Domestic and overseas manufacturing scenarios of silicon-based photovoltaics: Life cycle energy and environmental comparative analysis\". Solar Energy. 105: 669–678. Bibcode:2014SoEn..105..669Y. doi:10.1016/j.solener.2014.04.008.CS1 maint: multiple names: authors list (link)\n\n\n\t^ Gaidajis, G. & Angelakoglou, K. (2012). \"Environmental performance of renewable energy systems with the application of life-cycle assessment: a multi-Si photovoltaic module case study\". Civil Engineering and Environmental Systems. 29 (4): 231–238. doi:10.1080/10286608.2012.710608.\n\n\n\t^ Photovoltaics Report. (Fraunhofer Institute for Solar Energy Systems, ISE, 2015).\n\n\t^ a b Goe, M. & Gaustad, G. (2014). \"Strengthening the case for recycling photovoltaics: An energy payback analysis\". Applied Energy. 120: 41–48. doi:10.1016/j.apenergy.2014.01.036.\n\n\n\t^ Eisenberg, D. A., Yu, M., Lam, C. W., Ogunseitan, O. A. & Schoenung, J. M. (2013). \"Comparative alternative materials assessment to screen toxicity hazards in the life cycle of CIGS thin film photovoltaics\". Journal of Hazardous Materials. 260: 534–542. doi:10.1016/j.jhazmat.2013.06.007. PMID 23811631.CS1 maint: multiple names: authors list (link)\n\n\n\t^ Kim, H. C., Fthenakis, V., Choi, J. K. & Turney, D. E. (2012). \"Life cycle greenhouse gas emissions of thin-film photovoltaic electricity generation\". Journal of Industrial Ecology. 16: S110–S121. doi:10.1111/j.1530-9290.2011.00423.x.CS1 maint: multiple names: authors list (link)\n\n\n\t^ Werner, Jürgen H.; Zapf-Gottwick, R.; Koch, M.; Fischer, K. (2011). Toxic substances in photovoltaic modules. Proceedings of the 21st International Photovoltaic Science and Engineering Conference. 28. Fukuoka, Japan.\n\n\n\t^ Brown, G. F. & Wu, J. (2009). \"Third generation photovoltaics\". Laser & Photonics Reviews. 3 (4): 394–405. Bibcode:2009LPRv....3..394B. doi:10.1002/lpor.200810039.\n\n\n\t^ a b c Celik, Ilke; Song, Zhaoning; Cimaroli, Alexander J.; Yan, Yanfa; Heben, Michael J.; Apul, Defne (2016). \"Life Cycle Assessment (LCA) of perovskite PV cells projected from lab to fab\". Solar Energy Materials and Solar Cells. 156: 157–69. doi:10.1016/j.solmat.2016.04.037.\n\n\n\t^ a b Espinosa, N., Serrano-Luján, L., Urbina, A. & Krebs, F. C. (2015). \"Solution and vapour deposited lead perovskite solar cells: Ecotoxicity from a life cycle assessment perspective\". Solar Energy Materials and Solar Cells. 137: 303–310. doi:10.1016/j.solmat.2015.02.013.CS1 maint: multiple names: authors list (link)\n\n\n\t^ a b Gong, J., Darling, S. B. & You, F. (2015). \"Perovskite photovoltaics: life-cycle assessment of energy and environmental impacts\". Energy & Environmental Science. 8 (7): 1953–1968. doi:10.1039/C5EE00615E.CS1 maint: multiple names: authors list (link)\n\n\n\t^ a b Celik, I., Mason, B. E., Phillips, A. B., Heben, M. J., & Apul, D. S. (2017). Environmental Impacts from Photovoltaic Solar Cells Made with Single Walled Carbon Nanotubes. Environmental Science & Technology.\n\n\t^ Agboola, A. E. Development and model formulation of scalable carbon nanotube processes: HiPCO and CoMoCAT process models;Louisiana State University, 2005.\n\n\t^ Wadia, C., Alivisatos, A. P. & Kammen, D. M. (2009). \"Materials Availability Expands the Opportunity for Large-Scale Photovoltaics Deployment\". Environmental Science and Technology. 43 (6): 2072–2077. Bibcode:2009EnST...43.2072W. doi:10.1021/es8019534. PMID 19368216.CS1 maint: multiple names: authors list (link)\n\n\n\t^ Alharbi, Fahhad; Bass, John D.; Salhi, Abdelmajid; Alyamani, Ahmed; Kim, Ho-Cheol; Miller, Robert D. (2011). \"Abundant non-toxic materials for thin film solar cells: Alternative to conventional materials\". Renewable Energy. 36 (10): 2753–2758. doi:10.1016/j.renene.2011.03.010.\n\n\n\t^ Dos Reis Benatto, Gisele A.; Roth, Bérenger; Madsen, Morten V.; Hösel, Markus; Søndergaard, Roar R.; Jørgensen, Mikkel; Krebs, Frederik C. (2014). \"Carbon: The Ultimate Electrode Choice for Widely Distributed Polymer Solar Cells\". Advanced Energy Materials. 4 (15): n/a. doi:10.1002/aenm.201400732.\n\n\n\t^ Lattante, Sandro (2014). \"Electron and Hole Transport Layers: Their Use in Inverted Bulk Heterojunction Polymer Solar Cells\". Electronics. 3: 132–164. doi:10.3390/electronics3010132.\n\n\n\t^ a b Krebs, Frederik C.; Jørgensen, Mikkel (2013). \"Polymer and organic solar cells viewed as thin film technologies: What it will take for them to become a success outside academia\". Solar Energy Materials and Solar Cells. 119: 73–76. doi:10.1016/j.solmat.2013.05.032.\n\n\n\t^ Espinosa, Nieves; García-Valverde, Rafael; Urbina, Antonio; Krebs, Frederik C. (2011). \"A life cycle analysis of polymer solar cell modules prepared using roll-to-roll methods under ambient conditions\". Solar Energy Materials and Solar Cells. 95 (5): 1293–1302. doi:10.1016/j.solmat.2010.08.020.\n\n\n\t^ Espinosa, Nieves; Lenzmann, Frank O.; Ryley, Stephen; Angmo, Dechan; Hösel, Markus; Søndergaard, Roar R.; Huss, Dennis; Dafinger, Simone; Gritsch, Stefan; Kroon, Jan M.; Jørgensen, Mikkel; Krebs, Frederik C. (2013). \"OPV for mobile applications: An evaluation of roll-to-roll processed indium and silver free polymer solar cells through analysis of life cycle, cost and layer quality using inline optical and functional inspection tools\". Journal of Materials Chemistry A. 1 (24): 7037. doi:10.1039/C3TA01611K.\n\n\n\t^ García-Valverde, R.; Miguel, C.; Martínez-Béjar, R.; Urbina, A. (2009). \"Life cycle assessment study of a 4.2k Wp stand-alone photovoltaic system\". Solar Energy. 83 (9): 1434–1445. Bibcode:2009SoEn...83.1434G. doi:10.1016/j.solener.2009.03.012.\n\n\n\t^ \"Insolation Levels (Europe)\". Apricus Solar. Archived from the original on 17 April 2012. Retrieved 14 April 2012.\n\n\n\t^ \"UD-led team sets solar cell record, joins DuPont on $100 million project\". UDaily. University of Delaware. 24 July 2007. Retrieved 24 July 2007.\n\n\n\t^ Schultz, O.; Mette, A.; Preu, R.; Glunz, S.W. \"Silicon Solar Cells with Screen-Printed Front Side Metallization Exceeding 19% Efficiency\". The compiled state-of-the-art of PV solar technology and deployment. 22nd European Photovoltaic Solar Energy Conference, EU PVSEC 2007. Proceedings of the international conference. CD-ROM : Held in Milan, Italy, 3 – 7 September 2007. pp. 980–983. ISBN 978-3-936338-22-5.\n\n\n\t^ Shahan, Zachary. (20 June 2011) Sunpower Panels Awarded Guinness World Record. Reuters.com. Retrieved on 31 May 2013.\n\n\t^ a b \"Sunny Uplands: Alternative energy will no longer be alternative\". The Economist. 21 November 2012. Retrieved 28 December 2012.\n\n\n\t^ Wells, Ken (25 October 2012). \"Solar Energy Is Ready. The U.S. Isn't\". Bloomberg Businessweek. Retrieved 1 November 2012.\n\n\n\t^ Branker, K.; Pathak, M.J.M.; Pearce, J.M. (2011). \"A Review of Solar Photovoltaic Levelized Cost of Electricity\". Renewable and Sustainable Energy Reviews. 15 (9): 4470–4482. doi:10.1016/j.rser.2011.07.104. hdl:1974/6879.\n\n\n\t^ Utilities’ Honest Assessment of Solar in the Electricity Supply. Greentechmedia.com (7 May 2012). Retrieved on 31 May 2013.\n\n\t^ \"Renewables Investment Breaks Records\". Renewable Energy World. 29 August 2011.\n\n\n\t^ Renewable energy costs drop in '09 Reuters, 23 November 2009.\n\n\t^ Solar Power 50% Cheaper By Year End – Analysis. Reuters, 24 November 2009.\n\n\t^ Harris, Arno (31 August 2011). \"A Silver Lining in Declining Solar Prices\". Renewable Energy World.\n\n\n\t^ a b Quiggin, John (3 January 2012). \"The End of the Nuclear Renaissance\". National Interest.\n\n\n\t^ Chinese PV producer Phono Solar to supply German system integrator Sybac Solar with 500 MW of PV modules. Solarserver.com, April 30, 2012\n\n\t^ Solar PV Module Costs to Fall to 36 Cents per Watt by 2017. Greentechmedia.com (2013-06-18). Retrieved on 2015-04-15.\n\n\t^ Alafita, T.; Pearce, J. M. (2014). \"Securitization of residential solar photovoltaic assets: Costs, risks and uncertainty\". Energy Policy. 67: 488–498. doi:10.1016/j.enpol.2013.12.045.\n\n\n\t^ Lowder, T., & Mendelsohn, M. (2013). The Potential of Securitization in Solar PV Finance.[page needed]\n\n\t^ \"Done Deal: The First Securitization Of Rooftop Solar Assets\". Forbes. 21 November 2013\n\n\t^ Matar, Walid; Anwer, Murad (2017). \"Jointly reforming the prices of industrial fuels and residential electricity in Saudi Arabia\". Energy Policy. 109: 747–756. doi:10.1016/j.enpol.2017.07.060.\n\n\n\t^ Converting Solar Energy into the PHEV Battery Archived 22 February 2014 at the Wayback Machine. VerdeL3C.com (May 2009).\n\n\t^ Money saved by producing electricity from PV and Years for payback. Docs.google.com. Retrieved on 31 May 2013.[self-published source?]\n\n\t^ Platzer, Michael (27 January 2015). \"U.S. Solar Photovoltaic Manufacturing: Industry Trends, Global Competition, Federal Support\". Congressional Research Service.\n\n\n\t^ \"How PV Cells Are Made\". www.fsec.ucf.edu. Retrieved 5 November 2015.\n\n\n\t^ \"Solar PV Modules\". www.targray.com. Retrieved 3 October 2018.\n\n\n\t^ \"Thin Film Photovoltaics\". www.fsec.ucf.edu. Retrieved 5 November 2015.\n\n\n\t^ Nikolaidou, Katerina; Sarang, Som; Ghosh, Sayantani (2019). \"Nanostructured photovoltaics\". Nano Futures. 3 (1): 012002. doi:10.1088/2399-1984/ab02b5.\n\n\n\t^ Secor, Ethan. \"Emerging Photovoltaic Technologies.\" MSE 381 Lecture. Evanston. 3 Nov. 2015. Lecture.\n\n\t^ Building Integrated Photovoltaics, Wisconsin Public Service Corporation, accessed: 23 March 2007. Archived 2 February 2007 at the Wayback Machine\n\n\t^ \"Solar panels keep buildings cool\". University of California, San Diego. Retrieved 19 May 2015.\n\n\n\t^ \"Global Market Outlook for Photovoltaics 2014–2018\" (PDF). EPIA – European Photovoltaic Industry Association. p. 45. Archived from the original (PDF) on 25 June 2014. Retrieved 19 May 2015.\n\n\n\t^ Mojiri, A.; Taylor, R.; Thomsen, E.; Rosengarten, G. (2013). \"Spectral beam splitting for efficient conversion of solar energy—A review\". Renewable and Sustainable Energy Reviews. 28: 654–663. doi:10.1016/j.rser.2013.08.026.\n\n\n\t^ Pathak, M. J. M.; Sanders, P. G.; Pearce, J. M. (2014). \"Optimizing limited solar roof access by exergy analysis of solar thermal, photovoltaic, and hybrid photovoltaic thermal systems\". Applied Energy. 120: 115–124. CiteSeerX 10.1.1.1028.406. doi:10.1016/j.apenergy.2014.01.041.\n\n\n\t^ \"DOE Closes on Four Major Solar Projects\". Renewable Energy World. 30 September 2011.\n\n\n\t^ Solar loans light up rural India. BBC News (29 April 2007). Retrieved on 3 June 2012.\n\n\t^ Off grid solutions for remote poor. ebono.org. (26 February 2008).\n\n\t^ Barclay, Eliza (31 July 2003). Rural Cuba Basks in the Sun. islamonline.net.\n\n\t^ How 3D Printers Are Boosting Off-The-Grid, Underdeveloped Communities – MotherBoard, Nov. 2014\n\n\t^ King, Debbie L.; Babasola, Adegboyega; Rozario, Joseph; Pearce, Joshua M. (2014). \"Mobile Open-Source Solar-Powered 3-D Printers for Distributed Manufacturing in Off-Grid Communities\". Challenges in Sustainability. 2. doi:10.12924/cis2014.02010018.\n\n\n\t^ Erickson, Jon D.; Chapman, Duane (1995). \"Photovoltaic Technology: Markets, Economics, and Development\". World Development. 23 (7): 1129–1141. doi:10.1016/0305-750x(95)00033-9.\n\n\n\t^ \"Solar water pumping\". builditsolar.com. Retrieved 16 June 2010.\n\n\n\t^ Solar-Powered Parking Meters Installed. 10news.com (18 February 2009). Retrieved on 3 June 2012.\n\n\t^ \"Solar-powered parking meters make downtown debut\". Impactnews.com. 22 July 2009. Retrieved 19 September 2011.\n\n\n\t^ Philadelphia's Solar-Powered Trash Compactors. MSNBC (24 July 2009). Retrieved on 3 June 2012.\n\n\t^ AT&T installing solar-powered charging stations around New York Retrieved 28 June 2013\n\n\t^ Chevrolet Dealers Install Green Zone Stations Retrieved 28 June 2013\n\n\t^ Winery goes solar with 'Floatovoltaics'. SFGate (29 May 2008). Retrieved on 31 May 2013.\n\n\t^ NAPA VALLEY’S FAR NIENTE WINERY INTRODUCES FIRST-EVER \"FLOATOVOLTAIC\" SOLAR ARRAY Archived 16 March 2015 at the Wayback Machine. farniente.com\n\n\t^ Napa Winery Pioneers Solar Floatovoltaics. Forbes (18 April 2012). Retrieved on 31 May 2013.\n\n\t^ Miller, Ross (13 January 2009) Next-gen Prius now official, uses solar panels to keep car cool. engadget.com.\n\n\t^ \"World's largest solar-powered boat completes its trip around the world\". Gizmag.com. Retrieved 30 December 2017.\n\n\n\t^ Solar-powered plane lands outside Washington D.C. Nydailynews.com (2013-06-17). Retrieved on 2015-04-15.\n\n\t^ SolidWorks Plays Key Role in Cambridge Eco Race Effort. cambridgenetwork.co.uk (4 February 2009).\n\n\t^ Khan, B. H. (2006) Non-Conventional Energy Resources, TMH Publications\n\n\t^ a b NASA JPL Publication: Basics of Space Flight Archived 8 December 2006 at the Wayback Machine, Chapter 11. Typical Onboard Systems, Propulsion Subsystems\n\n\t^ \nPerlin, John (2005). \"Late 1950s – Saved by the Space Race\". SOLAR EVOLUTION – The History of Solar Energy. The Rahus Institute. Retrieved 25 February 2007.\n\n\n\t^ Takeno, Tadao; Sato, Kenji; Hase, Köji (1981). \"A theoretical study on an excess enthalpy flame\". Symposium (International) on Combustion. 18 (1): 465–72. doi:10.1016/S0082-0784(81)80052-5.\n\n\n\t^ a b Smil, Vaclav (2006) Energy at the Crossroads. oecd.org. Retrieved on 3 June 2012.\n\n\t^ Renewable Energy: Is the Future in Nuclear? Archived 16 January 2014 at the Wayback Machine Prof. Gordon Aubrecht (Ohio State at Marion) TEDxColumbus, The Innovators – 18 October 2012\n\n\t^ \"Study: Air pollution causes 200,000 early deaths each year in the U.S\". News.mit.edu. Retrieved 30 December 2017.\n\n\n\t^ \"The US could prevent a lot of deaths by switching from coal to solar\". USA TODAY. Retrieved 30 December 2017.\n\n\n\t^ Potential lives saved by replacing coal with solar photovoltaic electricity production in the U.S. Renewable and Sustainable Energy Reviews 80 (2017), pp. 710–715. open access\n\n\t^ Nieuwlaar, Evert and Alsema, Erik. Environmental Aspects of PV Power Systems. IEA PVPS Task 1 Workshop, 25–27 June 1997, Utrecht, The Netherlands\n\n\t^ McDonald, N.C.; Pearce, J.M. (2010). \"Producer Responsibility and Recycling Solar Photovoltaic Modules\" (PDF). Energy Policy. 38 (11): 7041–7047. doi:10.1016/j.enpol.2010.07.023.\n\n\n\t^ Advantages and disadvantages of solar energy Archived 26 December 2013 at the Wayback Machine. Retrieved on 25 December 2013.\n\n\t^ U.S. Climate Change Technology Program – Transmission and Distribution Technologies Archived 27 September 2007 at the Wayback Machine. (PDF) . Retrieved on 3 June 2012.\n\n\t^ Fraunhofer: 41.1% efficiency multi-junction solar cells. renewableenergyfocus.com (28 January 2009).\n\n\t^ Study Sees Solar Cost-Competitive In Europe By 2015. Solar Cells Info (16 October 2007). Retrieved on 3 June 2012.\n\n\t^ \"Berkeley FIRST Solar Financing – City of Berkeley, CA\". cityofberkeley.info.\n\n\n\t^ DSIRE Solar Portal. Dsireusa.org (4 April 2011). Retrieved on 3 June 2012.\n\n\t^ Hoen, Ben; Wiser, Ryan; Cappers, Peter & Thayer, Mark (April 2011). \"An Analysis of the Effects of Residential Photovoltaic Energy Systems on Home Sales Prices in California\" (PDF). Berkeley National Laboratory.\n\n\n\t^ Miller, Wendy; Liu, Aaron; Amin, Zakaria; Wagner, Andreas (2018). \"Power Quality and Rooftop-Photovoltaic Households: An Examination of Measured Data at Point of Customer Connection\". Sustainability. 10 (4): 1224. doi:10.3390/su10041224.\n\n\n\t^ L. Liu, W. Miller, and G. Ledwich. (2017) Solutions for reducing facilities electricity costs. Australian Ageing Agenda. 39-40. Available: https://www.australianageingagenda.com.au/2017/10/27/solutions-reducing-facility-electricity-costs/\n\n\t^ Miller, Wendy; Liu, Lei Aaron; Amin, Zakaria; Gray, Matthew (2018). \"Involving occupants in net-zero-energy solar housing retrofits: An Australian sub-tropical case study\". Solar Energy. 159: 390–404. Bibcode:2018SoEn..159..390M. doi:10.1016/j.solener.2017.10.008.\n\n\n\n\n\nFurther reading[edit]\n\n\tClean Tech Nation: How the U.S. Can Lead in the New Global Economy (2012) by Ron Pernick and Clint Wilder\n\tDeploying Renewables 2011 (2011) by the International Energy Agency\n\tReinventing Fire: Bold Business Solutions for the New Energy Era (2011) by Amory Lovins\n\tRenewable Energy Sources and Climate Change Mitigation (2011) by the IPCC\n\tSolar Energy Perspectives (2011) by the International Energy Agency\n\tHow practical is solar power for PH home owners? by Rappler\n\tSolarBankbility EU Project 09/2016. \"Minimizing Technical Risks in Photovoltaic Projects\"  Report\n\n\n\t\tv\n\tt\n\te\n\n\nPhotovoltaics\n\n\tConcepts\t\n\tTechnology\t\n\tPhotovoltaics\n\tPhotoelectric effect\n\tSolar insolation\n\tSolar constant\n\tSolar cell efficiency\n\tQuantum efficiency\n\n\n\tNominal power (Watt-peak)\n\tThin-film solar cell\n\tMulti-junction solar cell\n\tThird-generation photovoltaic cell\n\tSolar cell research\n\tThermophotovoltaic\n\tThermodynamic efficiency limit\n\tSun-free photovoltaics\n\tPolarizing organic photovoltaics\n\n\n\n\n\tMaterials\t\n\tList of semiconductor materials\n\tCrystalline silicon (c-Si)\n\tPolycrystalline silicon (multi-Si)\n\tMonocrystalline silicon (mono-Si)\n\tCadmium telluride\n\tCopper indium gallium selenide\n\tAmorphous silicon (a-Si)\n\n\n\n\n\tHistory\t\n\tGrowth of photovoltaics\n\tTimeline of solar cells\n\n\n\n\n\n\n\t\n\n\tPhotovoltaic system\t\n\tSolar cells\t\n\tNanocrystal solar cell\n\tOrganic solar cell\n\tQuantum dot solar cell\n\tHybrid solar cell\n\tPlasmonic solar cell\n\tCarbon nanotubes in photovoltaics\n\tDye-sensitized solar cell\n\tCadmium telluride photovoltaics\n\tCopper indium gallium selenide solar cells\n\tPrinted solar panel\n\tPerovskite solar cell\n\n\n\n\n\tSystem components\t\n\tSolar panel\n\tBalance of system\n\tSolar charge controller\n\tSolar inverter\n\tSolar micro-inverter\n\tSolar cable\n\tPhotovoltaic mounting system\n\tMaximum power point tracker\n\tSolar tracker\n\tSolar shingles\n\tSolar mirror\n\tSynchronverter\n\n\n\n\n\tSystem concepts\t\n\tPerturb and observe method\n\tIncremental conductance method\n\tConstant voltage method\n\tFill factor\n\tConcentrated photovoltaics\n\tPhotovoltaic thermal hybrid solar collector\n\tSpace-based solar power\n\n\n\n\n\n\n\n\tApplications\t\n\tAppliances\t\n\tSolar-powered refrigerator\n\tSolar air conditioning\n\tSolar lamp\n\tSolar charger\n\tSolar backpack\n\tSolar tree\n\tSolar-powered pump\n\tSolar-powered watch\n\tSolar Tuki\n\tPhotovoltaic keyboard\n\tSolar road stud\n\tSolar cell phone charger\n\tSolar notebook\n\tSolar-powered calculator\n\tSolar-powered fountain\n\tSolar-powered radio\n\tSolar-powered flashlight\n\tSolar-powered fan\n\tSolar street light\n\tSolar traffic light\n\n\n\n\n\tLand transport\t\n\tSolar vehicle\n\tSolar car\n\tSolar roadway\n\tSolar golf cart\n\tThe Quiet Achiever\n\tSunmobile\n\n\n\n\n\tAir transport\t\n\tElectric aircraft\n\tMauro Solar Riser\n\tSolar panels on spacecraft\n\tSolar-Powered Aircraft Developments Solar One\n\tGossamer Penguin\n\tQinetiq Zephyr\n\tSolar Challenger\n\n\n\n\n\tWater transport\t\n\tSolar boat\n\n\n\n\n\tSolar vehicle racing\t\n\tSolar car racing\n\tList of solar car teams\n\tSolar challenges\n\tWorld Solar Challenge\n\tAmerican Solar Challenge\n\tFormula Sun Grand Prix\n\tSolar Cup\n\tFrisian Solar Challenge\n\tSolar Splash\n\tSouth African Solar Challenge\n\tTour de Sol\n\tHunt-Winston School Solar Car Challenge\n\tVictorian Model Solar Vehicle Challenge\n\n\n\n\n\n\n\n\tGeneration systems\t\n\tPV power station\t\n\tGrid-connected photovoltaic power system\n\tList of photovoltaic power stations\n\n\n\n\n\tIndividual projects\t\n\tAlamosa photovoltaic power plant\n\tBeneixama photovoltaic power plant\n\tBlythe Photovoltaic Power Plant\n\tCopper Mountain Solar Facility\n\tDarro Solar Park\n\tErlasee Solar Park\n\tGolmud Solar Park\n\tGottelborn Solar Park\n\tGuadarranque solar power plant\n\tKöthen Solar Park\n\tMoura Photovoltaic Power Station\n\tOlmedilla Photovoltaic Park\n\tPocking Solar Park\n\tPuertollano Photovoltaic Park\n\tTopaz Solar Farm\n\tWyandot Solar Facility\n\n\n\n\n\tBuilding-mounted\t\n\tRooftop photovoltaic power station\n\tBuilding-integrated photovoltaics\n\tSolar Ark\n\tStrasskirchen Solar Park\n\n\n\n\n\tBy country\t\n\tAustralia\n\tBelgium\n\tBulgaria\n\tCanada\n\tChile\n\tChina\n\tCzech Republic\n\tFrance\n\tGermany\n\tGreece\n\tIndia\n\tItaly\n\tJapan\n\tNetherlands\n\tRomania\n\tSouth Africa\n\tSpain\n\tSwitzerland\n\tThailand\n\tUnited Kingdom\n\tUSA\n\n\n\n\n\n\n\n\tPV companies\t\n\tBy country\t\n\tList of countries by photovoltaics production\n\n\n\n\n\tIndividual producers\t\n\tFirst Solar\n\tHanwha Q CELLS\n\tJA Solar\n\tMotech Solar\n\tREC\n\tSharp\n\tSolar Frontier\n\tSolyndra\n\tSungen Solar\n\tSunpower\n\tSuntech\n\tTrina Solar\n\tYingli Solar\n\n\n\n\n\n\n\n\t\n\t Category\n\t Commons\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSolar energy\n\n\t\n\tOutline\n\tTimeline\n\tIndex\n\n\n\n\n\tConcepts\t\n\tThe Sun\n\tSolar irradiance\n\tActive and passive solar energy\n\n\n\n\n\tSolar power\t\n\tThermal\t\n\tPassive solar building design\n\tSolar water heating\n\tSolar chimney\n\tSolar air conditioning\n\tThermal mass\n\tSolar pond\n\n\n\n\n\tPhotovoltaics\nand related topics\t\n\tPhotovoltaic effect\n\tSolar cell\n\tPolymer solar cell\n\tNanocrystal solar cell\n\tPhotovoltaic module (solar panel)\n\tPhotovoltaic array (and systems)\n\tPhotovoltaic power station\n\tFloating solar\n\n\n\n\n\tConcentrated\t\n\tHeliostat\n\tSolar tracker\n\tParabolic trough\n\tSolar power tower\n\n\n\n\n\tExperimental\nand proposed\t\n\tSolar updraft tower\n\tSolar-pumped laser\n\tThermoelectric generator\n\tSolar chemical and artificial photosynthesis\n\tSpace-based solar power\n\tSolar sail\n\tMagnetic sail\n\tSolar thermal rocket\n\n\n\n\n\tBy country\t\n\tAustralia\n\tAustria\n\tAlbania\n\tBelgium\n\tBrazil\n\tCanada\n\tChina\n\tCzech\n\tDenmark\n\tGeorgia\n\tGermany\n\tGreece\n\tIndia\n\tIsrael\n\tItaly\n\tJapan\n\tLithuania\n\tMexico\n\tMorocco\n\tMyanmar\n\tNetherlands\n\tNew Zealand\n\tPakistan\n\tPortugal\n\tRomania\n\tSaudi Arabia\n\tSomalia\n\tSouth Africa\n\tSpain\n\tThailand\n\tTurkey\n\tUkraine\n\tUnited Kingdom\n\tUnited States\n\tYemen\n\n\n\n\n\n\n\n\tDistribution\nand uses\t\n\tStorage\t\n\tThermal mass\n\tThermal energy storage\n\tPhase change material\n\tGrid energy storage\n\n\n\n\n\tAdoption\t\n\tFeed-in tariff\n\tNet metering\n\tFinancial incentives for photovoltaics\n\tCosts\n\n\n\n\n\tApplications\t\n\tSolar water heating\n\tSolar vehicle\n\tElectric aircraft\n\tElectric boat\n\tSolar balloon\n\n\n\n\n\n\n\n\tOther applications\t\n\tAgriculture\nand horticulture\t\n\tGreenhouse\n\tPolytunnel\n\tRow cover\n\tSolar-powered pump\n\n\n\n\n\tBuilding\tPassive solar building design\n\tBuilding-integrated photovoltaics\n\tUrban heat island\n\n\n\n\tLighting\t\n\tHybrid solar lighting\n\tSolar lamp\n\tSolar Tuki\n\tLight tube\n\tDaylighting\n\n\n\n\tProcess heat\t\n\tSolar pond\n\tSolar furnace\n\tSalt evaporation pond\n\n\n\n\n\tCooking\t\n\tSolar cooker\n\n\n\n\n\tDisinfection\t\n\tSolar water disinfection\n\tSoil solarization\n\n\n\n\n\tDesalination\t\n\tSolar still\n\tDesalination\n\n\n\n\n\tWater heating\t\n\tSolar water heating\n\tSolar combisystem\n\tZero carbon solar controller\n\n\n\n\n\n\n\n\tSee also\t\n\tPhotovoltaics topics\n\tSolar power by country\n\tRenewable energy sources\n\n\n\n\n\t\n\tCategory\n\t Commons\n\n\n\n\n\n\n\n\tAuthority control \t\n\tBNE: XX533209\n\tBNF: cb12252211h (data)\n\tGND: 4121476-6\n\tLCCN: sh85101427\n\tNDL: 00882954\n\tSUDOC: 031275427\n\n\n\n\n\n\n\n\tEnergy portal\n\tRenewable energy portal\n\tEnvironment portal\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Photovoltaics&oldid=919048731\"\n\n\t\t\n\t\tCategories: \tPhotovoltaics\n\tQuantum chemistry\n\tElectrochemistry\n\n\nHidden categories: \tPages using Timeline\n\tWebarchive template wayback links\n\tCS1 maint: multiple names: authors list\n\tWikipedia articles needing page number citations from February 2017\n\tAll articles with self-published sources\n\tArticles with self-published sources from February 2017\n\tArticles with short description\n\tUse dmy dates from April 2015\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from March 2016\n\tCommons category link from Wikidata\n\tWikipedia articles with BNE identifiers\n\tWikipedia articles with BNF identifiers\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tWikipedia articles with NDL identifiers\n\tWikipedia articles with SUDOC identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tAsturianu\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tҚазақша\n\tKiswahili\n\tLatina\n\tLingála\n\tBahasa Melayu\n\tМонгол\n\tNederlands\n\t日本語\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSardu\n\tSimple English\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSvenska\n\tதமிழ்\n\tTürkçe\n\tУкраїнська\n\tWalon\n\t吴语\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 October 2019, at 15:25 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "13", "dc:title": "Photovoltaics - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/SoSie%2BSoSchiff_Ansicht.jpg/1200px-SoSie%2BSoSchiff_Ansicht.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-photovoltaic", "title": "Photovoltaics - Wikipedia"}}