{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrimary cell - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tPrimary cell\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Primary battery)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nA variety of standard sizes of primary cells. From left: 4.5V multicell battery, D, C, AA, AAA, AAAA, A23, 9V multicell battery, (top) LR44, (bottom) CR2032\n\n\n\nA primary cell is a battery (a galvanic cell) that is designed to be used once and discarded, and not recharged with electricity and reused like a secondary cell (rechargeable battery). In general, the electrochemical reaction occurring in the cell is not reversible, rendering the cell unrechargeable. As a primary cell is used, chemical reactions in the battery use up the chemicals that generate the power; when they are gone, the battery stops producing electricity and is useless. In contrast, in a secondary cell, the reaction can be reversed by running a current into the cell with a battery charger to recharge it, regenerating the chemical reactants. Primary cells are made in a range of standard sizes to power small household appliances such as flashlights and portable radios.\n\nPrimary batteries make up about 90% of the $50 billion battery market, but secondary batteries have been gaining market share. About 15 billion primary batteries are thrown away worldwide every year, virtually all ending up in landfills. Due to the toxic heavy metals and strong acids they contain, batteries are hazardous waste. Most municipalities classify them as such and require separate disposal. The energy needed to manufacture a battery is about 50 times greater than the energy it contains.[1][2][3][4] Due to their high pollutant content compared to their small energy content, the primary battery is considered a wasteful, environmentally unfriendly technology. Due mainly to increasing sales of wireless devices and cordless tools which cannot be economically powered by primary batteries and come with integral rechargeable batteries, the secondary battery industry has high growth and has slowly been replacing the primary battery in high end products.\n\n\nContents\n\n\n\t1 Usage trend\n\t2 Comparison between primary and secondary cells\n\t3 Recharging primary cells\n\t4 Polarization\n\t5 Terminology\n\t5.1 Anode and cathode\n\n\n\n\t6 See also\n\t7 References\n\t8 External links\n\n\n\n\n\nUsage trend[edit]\n\nIn the early twenty-first century, primary cells began losing market share to secondary cells, as relative costs declined for the latter. Flashlight power demands were reduced by the switch from incandescent bulbs to light-emitting diodes.[5]\n\nThe remaining market experienced increased competition from private- or no-label versions. The market share of the two leading US manufacturers, Energizer and Duracell, declined to 37% in 2012. Along with Rayovac, these three are trying to move consumers from zinc-carbon to more expensive, long-lasting and safer alkaline batteries.[5]\n\nWestern battery manufacturers shifted production offshore and no longer make zinc-carbon batteries in the United States.[5]\n\nChina became the largest battery market, with demand projected to climb faster than anywhere else, and has also shifted to alkaline cells. In other developing countries disposable batteries must compete with cheap wind-up, wind-powered and rechargeable devices that have proliferated.[5]\n\n\nComparison between primary and secondary cells[edit]\n\nSecondary cells (rechargeable batteries) are in general more economical to use than primary cells. Their initially higher cost and the purchase cost of a charging system can be spread out over many use cycles (between 100 and 1000 cycles); for example, in hand-held power tools, it would be very costly to replace a high-capacity primary battery pack every few hours of use.\n\nPrimary cells are not designed for recharging between manufacturing and use, thus have battery chemistry that has to have a much lower self-discharge rate than older types of secondary cells; but they have lost that advantage with the development of rechargeable secondary cells with very low self discharge rates like low self-discharge NiMH cells that hold enough charge for long enough to be sold as pre-charged.[6] [7]\n\nCommon types of secondary cells (namely NiMH and Li-ion) due to their much lower internal resistance do not suffer the large loss of capacity that alkaline, zinc–carbon and zinc chloride (\"heavy duty\" or \"super heavy duty\") do with high current draw.[8]\n\nReserve batteries achieve very long storage time (on the order of 10 years or more) without loss of capacity, by physically separating the components of the battery and only assembling them at the time of use. Such constructions are expensive but are found in applications like munitions, which may be stored for years before use.\n\n\nRecharging primary cells[edit]\n\nAttempts to extend the life of primary cells, for example by recharging alkaline batteries, meet with variable results. Third-party devices are manufactured and represented as being able to recharge primary cells. The internal chemical reactions of a primary cell are not easily reversed by externally applied currents, so reactants do not entirely return to their initial state and location. Recharged primary cells will not have the life or performance of secondary cells. Manufacturers of primary cells usually warn against recharging.\n\n\nPolarization[edit]\n\nA major factor reducing the lifetime of primary cells is that they become polarized during use.  This means that hydrogen accumulates at the cathode and reduces the effectiveness of the cell. To reduce the effects of polarization in commercial cells and to extend their lives, chemical depolarization is used; that is, an oxidizing agent is added to the cell, to oxidize the hydrogen to water. Manganese dioxide is used in the  Leclanché cell and zinc–carbon cell, and nitric acid is used in the Bunsen cell and Grove cell.\n\nAttempts have been made to make simple cells self-depolarizing by roughening the surface of the copper plate to facilitate the detachment of hydrogen bubbles with little success. Electrochemical depolarization exchanges the hydrogen for a metal, such as copper (e.g. Daniell cell), or silver (e.g. silver-oxide cell), so called.\n\n\nTerminology[edit]\n\nAnode and cathode[edit]\n\nThe battery terminal (electrode) that develops a positive voltage polarity (the carbon electrode in a dry cell) is called the cathode and the electrode with a negative polarity (zinc in a dry cell) is called the anode.[9][10]  This is the reverse of the terminology used in an electrolytic cell or thermionic vacuum tube. The reason is that the terms anode and cathode are defined by the direction of electric current, not by their voltage.  The anode is the terminal through which conventional current (positive charge) enters the cell from the external circuit, while the cathode is the terminal through which conventional current leaves the cell and flows into the external circuit.  Since a battery is a power source which provides the voltage which forces the current through the external circuit, the voltage on the cathode must be higher than the voltage on the anode, creating an electric field directed from cathode to anode, to force the positive charge out of the cathode through the resistance of the external circuit.     \n\nInside the cell the anode is the electrode where chemical oxidation occurs, as it donates electrons which flow out of the anode into the external circuit.  The cathode is the electrode where chemical reduction occurs, as it accepts electrons from the circuit through the cathode.\n\nOutside the cell, different terminology is used. As the anode donates positive charge to the electrolyte (thus remaining with an excess of electrons that it will donate to the circuit), it becomes negatively charged and is therefore connected to the terminal marked \"−\" on the outside of the cell. The cathode, meanwhile, donates negative charge to the electrolyte, so it becomes positively charged (which allows it to accept electrons from the circuit) and is therefore connected to the terminal marked \"+\" on the outside of the cell.[11]\n\nOld textbooks sometimes contain different terminology that can cause confusion to modern readers. For example, a 1911 textbook by Ayrton and Mather[12] describes the electrodes as the \"positive plate\" and \"negative plate\" .\n\n\nSee also[edit]\n\n\t\tWikimedia Commons has media related to Electric batteries.\n\n\n\tHistory of the battery\n\tFuel cell\n\tBattery recycling\n\tList of battery sizes\n\tList of battery types\n\tComparison of battery types\n\tBattery nomenclature\n\n\nReferences[edit]\n\n\n\t^ Hill, Marquita K. (2004). Understanding Environmental Pollution: A Primer. Cambridge University Press. p. 274. ISBN 0521527260.\n\n\t^ Watts, John (2006). Gcse Edexcel Science. Letts and Lonsdale. p. 63. ISBN 1905129637.\n\n\n\t^ Wastebusters (2013). The Green Office Manual: A Guide to Responsible Practice. Routledge. p. 96. ISBN 978-1134197989.\n\n\n\t^ Danaher, Kevin; Biggs, Shannon; Mark, Jason (2016). Building the Green Economy: Success Stories from the Grassroots. Routledge. p. 199. ISBN 978-1317262923.\n\n\n\t^ a b c d Stay informed today and every day (2014-01-18). \"Batteries: Out of juice\". The Economist. Retrieved 2014-02-10.\n\n\n\t^ \"Eneloop AA 4-Pack\".\n\n\n\t^ \"Eneloop Self Discharge study\".\n\n\n\t^ \"Discharge tests of Alkaline AA batteries\".\n\n\n\t^ Buchmann, Isidor (2018). \"BU-104b: Battery Building Blocks\". Battery University. Missing or empty |url= (help)\n\n\n\t^ Denker, John S. (2004). \"How to Define Anode and Cathode\". See How It Flies. Denker personal website. Retrieved 8 September 2018.\n\n\n\t^ John S. Newman, Karen E. Thomas-Alyea, Electrochemical systems, Wiley-IEEE, 3rd ed. 2004, \nISBN 0-471-47756-7\n\n\t^ W. E. Ayrton and T. Mather, Practical Electricity, Cassell and Company, London, 1911, page 170\n\n\n\n\n\nExternal links[edit]\n\n\tNonrechargeable batteries\n\n\n\t\tv\n\tt\n\te\n\n\nGalvanic cells\n\n\tTypes\t\n\tVoltaic pile\n\tBattery\n\tFlow battery\n\tTrough battery\n\n\n\tConcentration cell\n\tFuel cell\n\tThermogalvanic cell\n\n\n\n\t\n\n\tPrimary cell\n(non-rechargeable)\n\t\n\tAlkaline\n\tAluminium–air\n\tBunsen\n\tChromic acid\n\tClark\n\tDaniell\n\tDry\n\tEdison–Lalande\n\tGrove\n\tLeclanché\n\tLithium\n\tMercury\n\tNickel oxyhydroxide\n\tSilicon–air\n\tSilver oxide\n\tWeston\n\tZamboni\n\tZinc–air\n\tZinc–carbon\n\n\n\n\n\tSecondary cell\n\n(rechargeable)\n\t\n\tAutomotive\n\tLead–acid\n\tgel / VRLA\n\n\n\tLithium–air\n\tLithium ion\n\tLithium polymer\n\tLithium iron phosphate\n\tLithium titanate\n\tLithium–sulfur\n\tDual carbon\n\n\n\tMolten salt\n\tNanopore\n\tNanowire\n\tNickel–cadmium\n\tNickel–hydrogen\n\tNickel–iron\n\tNickel–lithium\n\tNickel–metal hydride\n\tNickel–zinc\n\tPolysulfide bromide\n\tPotassium ion\n\tRechargeable alkaline\n\tSilver zinc\n\tSodium ion\n\tSodium–sulfur\n\tVanadium redox\n\tZinc–bromine\n\tZinc–cerium\n\n\n\n\n\tOther Cell\n\t\n\tSolar cell\n\tFuel cell\n\tAtomic battery\n\n\n\n\n\tCell parts\t\n\tAnode\n\tBinder\n\tCatalyst\n\tCathode\n\tElectrode\n\tElectrolyte\n\tHalf-cell\n\tIons\n\tSalt bridge\n\tSemipermeable membrane\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Primary_cell&oldid=911033028\"\n\n\t\t\n\t\tCategories: \tBattery types\n\n\nHidden categories: \tPages using web citations with no URL\n\tCommons category link is locally defined\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tবাংলা\n\tCatalà\n\tČeština\n\tEesti\n\tEspañol\n\tفارسی\n\tFrançais\n\t한국어\n\tहिन्दी\n\tHrvatski\n\tItaliano\n\tNederlands\n\t日本語\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tPolski\n\tSimple English\n\tSvenska\n\tไทย\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 16 August 2019, at 03:51 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Primary cell - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-primary_battery", "title": "Primary cell - Wikipedia"}}