{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRadiation damage - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tRadiation damage\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tThis article deals with radiation damage due to the effects of ionizing radiation on physical objects. Radiobiology is the study of the action of ionizing radiation on living things, including health effects of radiation in humans. \n\n\nContents\n\n\n\t1 Causes\n\t2 Effects on materials and devices\n\t2.1 Effects on solids\n\t2.1.1 Radiation damage event\n\t2.1.2 Radiation cross section\n\t2.1.3 Microstructural evolution under irradiation\n\t2.1.4 Thermo-mechanical effects of irradiation\n\t2.1.4.1 Hardening\n\t2.1.4.2 Embrittlement\n\t2.1.4.3 Creep\n\t2.1.4.4 Growth\n\t2.1.4.5 Conductivity\n\n\n\n\n\n\n\t2.2 Effects on gases\n\t2.2.1 Gas-filled radiation detectors\n\n\n\n\t2.3 Effects on liquids\n\t2.3.1 Effects on water\n\n\n\n\n\n\n\t3 Countermeasures\n\t3.1 For solid radiation damage\n\n\n\n\t4 Effects on humans\n\t5 See also\n\t6 References\n\n\n\n\n\nCauses[edit]\n\nThis radiation may take several forms:\n\n\n\tCosmic rays and subsequent energetic particles caused by their collision with the atmosphere and other materials.\n\tRadioactive daughter products (radioisotopes) caused by the collision of cosmic rays with the atmosphere and other materials, including living tissues.\n\tEnergetic particle beams from a particle accelerator.\n\tEnergetic particles or electro-magnetic radiation (X-rays) released from collisions of such particles with a target, as in an X ray machine or incidentally in the use of a particle accelerator.\n\tParticles or various types of rays released by radioactive decay of elements, which may be naturally occurring, created by accelerator collisions, or created in a nuclear reactor. They may be manufactured for therapeutic or industrial use or be released accidentally by nuclear accident, or released sententially by a dirty bomb, or released into the atmosphere, ground, or ocean incidental to the explosion of a nuclear weapon for warfare or nuclear testing.\n\n\nEffects on materials and devices[edit]\n\nRadiation may affect materials and devices in deleterious ways:\n\n\n\tBy causing the materials to become radioactive (mainly by neutron activation, or in presence of high-energy gamma radiation by photodisintegration).\n\tBy nuclear transmutation of the elements within the material including, for example, the production of Hydrogen and Helium which can in turn alter the mechanical properties of the materials and cause swelling and embrittlement.\n\tBy radiolysis (breaking chemical bonds) within the material, which can weaken it, cause it to swell, polymerize, promote corrosion, cause belittlements, promote cracking or otherwise change its desirable mechanical, optical, or electronic properties.\n\tBy formation of reactive compounds, affecting other materials (e.g. ozone cracking by ozone formed by ionization of air).\n\tBy ionization, causing electrical breakdown, particularly in semiconductors employed in electronic equipment, with subsequent currents introducing operation errors or even permanently damaging the devices. Devices intended for high radiation environments such as the nuclear industry and extra atmospheric (space) applications may be made radiation hard to resist such effects through design, material selection, and fabrication methods.\n\n\nMany of the radiation effects on materials are produced by collision cascades and covered by radiation chemistry.\n\n\nEffects on solids[edit]\n\nRadiation can have harmful effects on solid materials as it can degrade their properties so that they are no longer mechanically sound. This is of special concern as it can greatly affect their ability to perform in nuclear reactors and is the emphasis of radiation material science, which seeks to mitigate this danger.\n\nAs a result of their usage and exposure to radiation, the effects on metals and concrete are particular areas of study. For metals, exposure to radiation can result in radiation hardening which strengthens the material while subsequently embrittling it (lowers toughness, allowing brittle fracture to occur. This occurs as a result of knocking atoms out of their lattice sites through both the initial interaction as well as a resulting cascade of damage, leading to the creation of defects, dislocations (similar to work hardening and precipitation hardening. Grain boundary engineering through thermomechanical processing has been shown to mitigate these effects by changing the fracture mode from intergranular (occurring along grain boundaries) to transgranular. This increases the strength of the material, mitigating the embrittling effect of radiation.[1] Radiation can also lead to segregation and diffusion of atoms within materials, leading to phase segregation and voids as well as enhancing the effects of stress corrosion cracking through changes in both the water chemistry and alloy microstructure.[2][3]\n\nAs concrete is used extensively in the construction of nuclear power plants, where it provides structure as well as containing radiation, the effect of radiation on it is also of major interest. During its lifetime, concrete will change properties naturally due to its normal aging process, however nuclear exposure will lead to a loss of mechanical properties due to swelling of the concrete aggregates, and thus damaging the bulk material. For instance, the biological shield of the reactor is frequently composed of Portland cement, where dense aggregates are added  in order to decrease the radiation flux through the shield. These aggregates can swell and make the shield mechanically unsound. Numerous studies have shown decreases in both compressive and tensile strength as well as elastic modulus of concrete at around a dosage of around 1019 neutrons per square centimeter.[4] These trends were also shown to exist in reinforced concrete, a composite of both concrete and steel.[5]\n\nThe knowledge gained from current analyses of materials in fission reactors in regards to the effects of temperature, irradiation dosage, materials compositions, and surface treatments will be helpful in the design of future fission reactors as well as the development of fusion reactors.[6]\n\nSolids subject to radiation are constantly being bombarded with high energy particles. The interaction between particles, and atoms in the lattice of the reactor materials causes displacement in the atoms.[7] Over the course of sustained bombardment, some of the atoms do not come to rest at lattice sites, which results in the creation of defects. These defects cause changes in the microstructure of the material, and ultimately result in a number of radiation effects.\n\n\nRadiation damage event[edit]\n\n\tInteraction of an energetic incident particle with a lattice atom\n\tTransfer of kinetic energy to the lattice atom, giving birth to a primary displacement atom\n\tDisplacement of the atom from its lattice site\n\tMovement of the atom through the lattice, creating additional displaced atoms\n\tProduction of displacement cascade (collection of point defects created by primary displacement atom)\n\tTermination of displacement atom as an interstitial\n\n\nRadiation cross section[edit]\n\nThe probability of an interaction between two atoms is dependent on the thermal neutron cross section (measured in barn). Given a macroscopic cross section of Σ = σρ, and a reaction rate of R = ΦΣ = Φσρ, the probability of interaction becomes Pdx = Njσ(Ei)dx = Σdx.\nListed below are the cross sections of common atoms or alloys.\n\nThermal Neutron Cross Sections (Barn)[8]\n\n\n\tMagnesium\t0.059\n\n\tLead\t0.17\n\n\tZirconium\t0.18\n\n\tZircaloy-4\t0.22\n\n\tAluminum\t0.23\n\n\tIron\t2.56\n\n\tAustenitic Stainless Steel\t3.1\n\n\tNickel\t4.5\n\n\tTitanium\t6.1\n\n\tHafnium\t104\n\n\tBoron\t750\n\n\tCadmium\t2520\n\n\tGadolinium\t48,890\n\n\n\nMicrostructural evolution under irradiation[edit]\n\nMicrostructural evolution is driven in the material by the accumulation of defects over a period of sustained radiation. This accumulation is limited by defect recombination, by clustering of defects, and by the annihilation of defects at sinks. Defects must thermally migrate to sinks, and in doing so often recombine, or arrive at sinks to recombine.  In most cases, Drad = DvCv + DiCi >> Dtherm, that is to say, the motion of interstitials and vacancies throughout the lattice structure of a material as a result of radiation often outweighs the thermal diffusion of the same material.\n\nOne consequence of a flux of vacancies towards sinks is a corresponding flux of atoms away from the sink. If vacancies are not annihilated or recombined before collecting at sinks, they will form voids. At sufficiently high temperature, dependent on the material, these voids can fill with gases from the decomposition of the alloy, leading to swelling in the material.[9] This is a tremendous issue for pressure sensitive or constrained materials that are under constant radiation bombardment, like pressurized water reactors. In many cases, the radiation flux is non-stoichiometric, which causes segregation within the alloy. This non-stoichiometric flux can result in significant change in local composition near grain boundaries,[10] where the movement of atoms and dislocations is impeded. When this flux continues, solute enrichment at sinks can result in the precipitation of new phases.\n\n\nThermo-mechanical effects of irradiation[edit]\n\nHardening[edit]\n\nRadiation hardening is the strengthening of the material in question by the introduction of defect clusters, impurity-defect cluster complexes, dislocation loops, dislocation lines, voids, bubbles and precipitates. For pressure vessels, the loss in ductility that occurs as a result of the increase in hardness is a particular concern.\n\n\nEmbrittlement[edit]\n\nRadiation embrittlement results in a reduction of the energy to fracture, due to a reduction in strain hardening (as hardening is already occurring during irradiation). This is motivated for very similar reasons to those that cause radiation hardening; development of defect clusters, dislocations, voids, and precipitates. Variations in these parameters make the exact amount of embrittlement difficult to predict,[11] but the generalized values for the measurement show predictable consistency.\n\n\nCreep[edit]\n\nThermal creep in irradiated materials is negligible, by comparison to the irradiation creep, which can exceed 10−6sec−1.[12] The mechanism is not enhanced diffusivities, as would be intuitive from the elevated temperature, but rather interaction between the stress and the developing microstructure. Stress induces the nucleation of loops, and causes preferential absorption of interstitials at dislocations, which results in swelling.[13] Swelling, in combination with the embrittlement and hardening, can have disastrous effects on any nuclear material under substantial pressure.\n\n\nGrowth[edit]\n\nGrowth in irradiated materials is caused by Diffusion Anisotropy Difference (DAD). This phenomenon frequently occurs in zirconium, graphite, and magnesium because of natural properties.\n\n\nConductivity[edit]\n\nThermal and electrical conductivity rely on the transport of energy through the electrons and the lattice of a material. Defects in the lattice and substitution of atoms via transmutation disturb these pathways, leading to a reduction in both types of conduction by radiation damage. The magnitude of reduction depends on the dominant type of conductivity (electronic or Wiedemann–Franz law, phononic) in the material and the details of the radiation damage and is therefore still hard to predict.\n\n\nEffects on gases[edit]\n\nExposure to radiation causes chemical changes in gases. The least susceptible to damage are noble gases, where the major concern is the nuclear transmutation with follow-up chemical reactions of the nuclear reaction products.\n\nHigh-intensity ionizing radiation in air can produce a visible ionized air glow of telltale bluish-purplish color. The glow can be observed e.g. during criticality accidents, around mushroom clouds shortly after a nuclear explosion, or inside of a damaged nuclear reactor like during the Chernobyl disaster.\n\nSignificant amounts of ozone can be produced. Even small amounts of ozone can cause ozone cracking in many polymers over time, in addition to the damage by the radiation itself.\n\n\nGas-filled radiation detectors[edit]\n\nIn some gaseous ionisation detectors,  radiation damage to gases plays an important role in the device's ageing, especially in devices exposed for long periods to high intensity radiation, e.g. detectors for the Large Hadron Collider or the Geiger–Müller tube\n\nIonization processes require energy above 10 eV, while splitting covalent bonds in molecules and generating free radicals requires only 3-4 eV. The electrical discharges initiated by the ionization events by the particles result in plasma populated by large amount of free radicals. The highly reactive free radicals can recombine back to original molecules, or initiate a chain of free-radical polymerization reactions with other molecules, yielding compounds with increasing molecular weight. These high molecular weight compounds then precipitate from gaseous phase, forming conductive or non-conductive deposits on the electrodes and insulating surfaces of the detector and distorting its response. Gases containing hydrocarbon quenchers, e.g. argon–methane, are typically sensitive to aging by polymerization; addition of oxygen tends to lower the aging rates. Trace amounts of silicone oils, present from outgassing of silicone elastomers and especially from traces of silicone lubricants, tend to decompose and form deposits of silicon crystals on the surfaces. Gaseous mixtures of argon (or xenon) with carbon dioxide and optionally also with 2-3% of oxygen are highly tolerant to high radiation fluxes. The oxygen is added as noble gas with carbon dioxide has too high transparency for high-energy photons; ozone formed from the oxygen is a strong absorber of ultraviolet photons. Carbon tetrafluoride can be used as a component of the gas for high-rate detectors; the fluorine radicals produced during the operation however limit the choice of materials for the chambers and electrodes (e.g. gold electrodes are required, as the fluorine radicals attack metals, forming fluorides). Addition of carbon tetrafluoride can however eliminate the silicon deposits. Presence of hydrocarbons with carbon tetrafluoride leads to polymerization. A mixture of argon, carbon tetrafluoride, and carbon dioxide shows low aging in high hadron flux.[14]\n\n\nEffects on liquids[edit]\n\nLike gases, liquids lack fixed internal structure; the effects of radiation is therefore mainly limited to radiolysis, altering the chemical composition of the liquids. As with gases, one of the primary mechanisms is formation of free radicals.\n\nAll liquids are subject to radiation damage, with few exotic exceptions; e.g. molten sodium, where there are no chemical bonds to be disrupted, and liquid hydrogen fluoride, which produces gaseous hydrogen and fluorine, which spontaneously react back to hydrogen fluoride.\n\n\nEffects on water[edit]\n\nWater subjected to ionizing radiation forms free radicals of hydrogen and hydroxyl, which can recombine to form gaseous hydrogen, oxygen, hydrogen peroxide, hydroxyl radicals, and peroxide radicals. In living organisms, which are composed mostly of water, majority of the damage is caused by the reactive oxygen species, free radicals produced from water. The free radicals attack the biomolecules forming structures within the cells, causing oxidative stress (a cumulative damage which may be significant enough to cause the cell death, or may cause DNA damage possibly leading to cancer).\n\nIn cooling systems of nuclear reactors, the formation of free oxygen would promote corrosion and is counteracted by addition of hydrogen to the cooling water.[15] The hydrogen is not consumed as for each molecule reacting with oxygen one molecule is liberated by radiolysis of water; the excess hydrogen just serves to shift the reaction equilibriums by providing the initial hydrogen radicals. The reducing environment in pressurized water reactors is less prone to buildup of oxidative species. The chemistry of boiling water reactor coolant is more complex, as the environment can be oxidizing. Most of the radiolytic activity occurs in the core of the reactor where the neutron flux is highest; the bulk of energy is deposited in water from fast neutrons and gamma radiation, the contribution of thermal neutrons is much lower. In air-free water, the concentration of hydrogen, oxygen, and hydrogen peroxide reaches steady state at about 200 Gy of radiation. In presence of dissolved oxygen, the reactions continue until the oxygen is consumed and the equilibrium is shifted. Neutron activation of water leads to buildup of low concentrations of nitrogen species; due to the oxidizing effects of the reactive oxygen species, these tend to be present in the form of nitrate anions. In reducing environments, ammonia may be formed. Ammonia ions may be however also subsequently oxidized to nitrates. Other species present in the coolant water are the oxidized corrosion products (e.g. chromates) and fission products (e.g. pertechnetate and periodate anions, uranyl and neptunyl cations).[16] Absorption of neutrons in hydrogen nuclei leads to buildup of deuterium and tritium in the water.\nBehavior of supercritical water, important for the supercritical water reactors, differs from the radiochemical behavior of liquid water and steam and is currently under investigation.[17]\n\nThe magnitude of the effects of radiation on water is dependent on the type and energy of the radiation, namely its linear energy transfer. A gas-free water subjected to low-LET gamma rays yields almost no radiolysis products and sustains an equilibrium with their low concentration. High-LET alpha radiation produces larger amounts of radiolysis products. In presence of dissolved oxygen, radiolysis always occurs. Dissolved hydrogen completely suppresses radiolysis by low-LET radiation while radiolysis still occurs with\n\nThe presence of reactive oxygen species has strongly disruptive effect on dissolved organic chemicals. This is exploited in groundwater remediation by electron beam treatment.[18]\n\n\nCountermeasures[edit]\n\nTwo main approaches to reduce radiation damage are reducing the amount of energy deposited in the sensitive material (e.g. by shielding, distance from the source, or spatial orientation), or modification of the material to be less sensitive to radiation damage (e.g. by adding antioxidants, stabilizers, or choosing a more suitable material).\nIn addition to the electronic device hardening mentioned above, some degree of protection may be obtained by shielding, usually with the interposition of high density materials (particularly lead, where space is critical, or concrete where space is available) between the radiation source and areas to be protected. For biological effects of substances such as radioactive iodine the ingestion of non-radioactive isotopes may substantially reduce the biological uptake of the radioactive form, and chelation therapy may be applied to accelerate the removal of radioactive materials formed from heavy metals from the body by natural processes.\n\n\nFor solid radiation damage[edit]\n\nSolid countermeasures to radiation damage consist of three approaches. Firstly, saturating the matrix with oversized solutes. This acts to trap the swelling that occurs as a result of the creep and dislocation motion. They also act to help prevent diffusion, which restricts the ability of the material to undergo radiation induced segregation.[19] Secondly, dispersing an oxide inside the matrix of the material. Dispersed oxide helps to prevent creep, and to mitigate swelling and reduce radiation induced segregation as well, by preventing dislocation motion and the formation and motion of interstitials.[20] Finally, by engineering grain boundaries to be as small as possible, dislocation motion can be impeded, which prevents the embrittlement and hardening that result in material failure.[21]\n\n\nEffects on humans[edit]\n\nMain article: Radiobiology\n\nIonizing radiation is generally harmful and potentially lethal to living things but can have health benefits in radiation therapy for the treatment of cancer and thyrotoxicosis. Its most common impact is the induction of cancer with a latent period of years or decades after exposure. High doses can cause visually dramatic radiation burns, and/or rapid fatality through acute radiation syndrome. Controlled doses are used for medical imaging and radiotherapy.\n\nMost adverse health effects of radiation exposure may be grouped in two general categories:\n\n\n\tDeterministic effects (harmful tissue reactions) due in large part to the killing/ malfunction of cells following high doses; and\n\tStochastic effects, i.e., cancer and heritable effects involving either cancer development in exposed individuals owing to mutation of somatic cells or heritable disease in their offspring owing to mutation of reproductive (germ) cells.[22]\n\n\nSee also[edit]\n\n\t\tWikimedia Commons has media related to Radiation health effects.\n\n\n\tRadiation material science\n\tStopping power (particle radiation)\n\tCollision cascade\n\tIon track\n\tRadiation hardening\n\tRadiation Damage in Metals and Alloys\n\n\nReferences[edit]\n\n\t^ Tan, L.; Allen, T.; Busby, J.journal=Journal of Nuclear Materials (2013). \"Grain boundary engineering for structure materials of nuclear reactors\". Journal of Nuclear Materials. 441 (1–3): 661–666. Bibcode:2013JNuM..441..661T. doi:10.1016/j.jnucmat.2013.03.050.\n\n\t^ Allen, Todd; Was, Gary (2007). \"RADIATION-ENHANCED DIFFUSION AND RADIATION-INDUCED SEGREGATION\".  In Sickafus, Kurt; Kotomin, Eugene; Uberuaga, Blas (eds.). Radiation Effects in Solids. 235. Springer Netherlands. pp. 123–151. doi:10.1007/978-1-4020-5295-8_6. ISBN 978-1-4020-5295-8. ISSN 1568-2609.\n\n\n\t^ Was, G.; Andresen, P. (2007). \"Stress Corrosion Cracking Behavior of Alloys in Aggressive Nuclear Reactor Core Environments\". Corrosion. 63: 19–45. doi:10.5006/1.3278331.\n\n\n\t^ Field, K.; Remec, I.; Le Pape, Y. (2015). \"Radiation effects in concrete for nuclear power plants – Part I: Quantification of radiation exposure and radiation effects\". Nuclear Engineering and Design. 282: 126–143. doi:10.1016/j.nucengdes.2014.10.003.\n\n\n\t^ Mirhosseini, Somayehsadat; Polak, Maria Anna; Pandey, Mahesh (2014). \"Nuclear radiation effect on the behavior of reinforced concrete elements\". Nuclear Engineering and Design. 269: 57–65. doi:10.1016/j.nucengdes.2013.08.007.\n\n\n\t^ Was, Gary (2007). \"Materials degradation in fission reactors: Lessons learned of relevance to fusion reactor systems\". Journal of Nuclear Materials. 367-370: 11–20. Bibcode:2007JNuM..367...11W. doi:10.1016/j.jnucmat.2007.03.008.\n\n\n\t^ Todreas, Niel E. (1992). Nuclear Systems: Elements Of Thermal Design, Volume 2 (2nd ed.). Hemisphere Publishing. p. 74. ISBN 9781560320883. Retrieved 5 November 2015.\n\n\n\t^ Munter, Alan. \"Neutron scattering lengths and cross sections\". NIST Center for Neutron Research. NIST. Retrieved 5 November 2015.\n\n\n\t^ Garner, F.A.; Packen, Nicholas H. (1987). Radiation Induced Changes in Microstructure: 13th International Symposium. ASTM. p. 161. ISBN 978-0803109629.\n\n\n\t^ English, Colin A.; Murphy, Susan M.; Perks, Johnathan M. (1990). \"Radiation-induced segregation in metals\". Chemical Society. 86 (8): 1263–1271. doi:10.1039/FT9908601263.\n\n\n\t^ Odette, G.R.; Lucas, G.E. (2001). \"Embrittlement of Nuclear Reactor Pressure Vessels\". Journal of Materials. 53 (7): 18–22. Bibcode:2001JOM....53g..18O. doi:10.1007/s11837-001-0081-0.\n\n\n\t^ Wolfer, W.G. (October 1979). \"Radiation-Induced Creep in Single Crystals of Face-Centered Cubic Materials\". Philosophy Magazine (A31): 61–70.\n\n\n\t^ Bullough, R.; Wood, M.H. (May 1980). \"Mechanisms of radiation induced creep growth\". Journal of Nuclear Materials. 90 (1–3): 1–21. Bibcode:1980JNuM...90....1B. doi:10.1016/0022-3115(80)90241-X.\n\n\n\t^ Nappi, E.; Seguinot, J. (2004). Proceedings of the Workshop of the INFN ELOISATRON Project: Innovative Detectors for Supercolliders, Erice, Italy, 28 Sept - 4 Oct 2003. World Scientific. p. 199. ISBN 9789812702951. Retrieved 2015-01-28.\n\n\n\t^ Integrated Publishing. \"Effects of Radiation on Water Chemistry (Synthesis) - h1015v2_23\". tpub.com. Retrieved 2015-01-28.\n\n\n\t^ Radiochemistry in Nuclear Power Reactors. nap.edu. 1996. doi:10.17226/9263. ISBN 978-0-309-30330-9. Retrieved 2015-01-28.\n\n\n\t^ Yosuke Katsumura; Kiyoshi Kiuchi; Masafumi Domae; Hidetoshi Karasawa; Norihisa Saito; Tadasu Yotsuyanagi (6 May 2005). \"Research Program on Water Chemistry of Supercritical Pressure Water under Radiation Field\" (PDF). 14th International Conference on the Properties of Water and Steam in Kyoto: 545–550. Retrieved 2015-01-28.\n\n\n\t^ Spotheim-Maurizot, M.; Mostafavi, M.; Douki, T. (2008). Radiation Chemistry: From Basics to Applications in Material and Life Sciences. EDP Sciences. ISBN 9782759800247. Retrieved 2015-01-28.\n\n\n\t^ Fournier, L.; Sencer, B.H.; Was, G.S.; Simonen, E.P.; Bruemmer, S.M. (15 September 2003). \"The influence of oversized solute additions on radiation-induced changes and post-irradiation intergranular stress corrosion cracking behavior in high-purity 316 stainless steels\". Journal of Nuclear Materials. 231 (2–3): 192–209. Bibcode:2003JNuM..321..192F. doi:10.1016/S0022-3115(03)00243-5.\n\n\n\t^ Brodrick, J.; Hepburn, D.J.; Ackland, G.J. (February 2014). \"Mechanism for radiation damage resistance in yttrium oxide dispersion strengthened steels\". Journal of Nuclear Materials. 445 (1–3): 291–297. arXiv:1310.2061. Bibcode:2014JNuM..445..291B. doi:10.1016/j.jnucmat.2013.10.045.\n\n\n\t^ Bai, Xian-Ming; Uberuaga, Blas P. (3 November 2013). \"The Influence of Grain Boundaries on Radiation-Induced Point Defect Production in Materials: A Review of Atomistic Studies\". Journal of Materials. 65 (3): 360–373. Bibcode:2013JOM....65c.360B. doi:10.1007/s11837-012-0544-5.\n\n\n\t^ Paragraph 55 in: IRCP 2007: \"The 2007 Recommendations of the International Commission on Radiological Protection\". International Commission on Radiological Protection.\n Ann. ICRP 37 (2-4)\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Radiation_damage&oldid=906652317\"\n\n\t\t\n\t\tCategories: \tRadiation effects\n\n\nHidden categories: \tCS1: long volume value\n\tCommons category link is on Wikidata\n\tCommons category link is on Wikidata using P373\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tDeutsch\n\tNederlands\n\tPortuguês\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 17 July 2019, at 08:49 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "6", "dc:title": "Radiation damage - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-radiation_damage", "title": "Radiation damage - Wikipedia"}}