{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReaction control system - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tReaction control system\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tSpacecraft thrusters used to provide attitude control and translation\n\n\t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Reaction control system\" – news · newspapers · books · scholar · JSTOR  (September 2014) (Learn how and when to remove this template message)\n\n\n\n  \nTwo of four Reaction Control System thruster quads on the Apollo Lunar Module\n\n\n\nA reaction control system (RCS) is a spacecraft system that uses thrusters to provide attitude control, and sometimes translation. Use of diverted engine thrust to provide stable attitude control of a short-or-vertical takeoff and landing aircraft below conventional winged flight speeds, such as with the Harrier \"jump jet\", may also be referred to as a reaction control system.\n\nAn RCS is capable of providing small amounts of thrust in any desired direction or combination of directions. An RCS is also capable of providing torque to allow control of rotation (roll, pitch, and yaw).\n\nReaction control systems often use combinations of large and small (vernier) thrusters, to allow different levels of response. Spacecraft reaction control systems are used for:\n\n\n\tattitude control during re-entry;\n\tstationkeeping in orbit;\n\tclose maneuvering during docking procedures;\n\tcontrol of orientation, or 'pointing the nose' of the craft;\n\ta backup means of deorbiting;\n\tullage motors to prime the fuel system for a main engine burn.\n\n\nBecause spacecraft only contain a finite amount of fuel and there is little chance to refill them, alternative reaction control systems have been developed so that fuel can be conserved. For stationkeeping, some spacecraft (particularly those in geosynchronous orbit) use high-specific impulse engines such as arcjets, ion thrusters, or Hall effect thrusters. To control orientation, a few spacecraft, including the ISS, use momentum wheels which spin to control rotational rates on the vehicle.\n\n\nContents\n\n\n\t1 Location of thrusters on spacecraft\n\t1.1 Location of thrusters on spaceplanes\n\n\n\n\t2 International Space Station systems\n\t3 References\n\t4 External links\n\n\n\n\n\nLocation of thrusters on spacecraft[edit]\n\n  \nGemini Orbit Attitude and Maneuvering System, and Reentry (mislabeled \"Reaction\") Control System\n\n\n\nThe Mercury space capsule and Gemini reentry module both used groupings of nozzles to provide attitude control. The thrusters were located off their center of gravity, thus providing a torque to rotate the capsule. The Gemini capsule was also capable of adjusting its reentry course by rolling, which directed its off-center lifting force. The Mercury thrusters used a hydrogen peroxide monopropellant which turned to steam when forced through a tungsten screen, and the Gemini thrusters used hypergolic mono-methyl hydrazine fuel oxidized with nitrogen tetroxide.\n\nThe Gemini spacecraft was also equipped with a hypergolic Orbit Attitude and Maneuvering System, which made it the first manned spacecraft with translation as well as rotation capability. In-orbit attitude control was achieved by firing pairs of eight 25-pound-force (110 N) thrusters located around the circumference of its adapter module at the extreme aft end. Lateral translation control was provided by four 100-pound-force (440 N) thrusters around the circumference at the forward end of the adaptor module (close to the spacecraft's center of mass). Two forward-pointing 85-pound-force (380 N) thrusters at the same location, provided aft translation, and two 100-pound-force (440 N) thrusters located in the aft end of the adapter module provided forward thrust, which could be used to change the craft's orbit. The Gemini reentry module also had a separate Reentry Control System of sixteen thrusters located at the base of its nose, to provide rotational control during reentry.\n\nThe Apollo Command Module had a set of twelve hypergolic thrusters for attitude control, and directional reentry control similar to Gemini.\n\nThe Apollo Service Module and Lunar Module each had a set of sixteen R-4D hypergolic thrusters, grouped into external clusters of four, to provide both translation and attitude control. The clusters were located near the craft's centers of gravity, and were fired in pairs in opposite directions for attitude control.\n\nA pair of translation thrusters are located at the rear of the Soyuz spacecraft; the counter-acting thrusters are similarly paired in the middle of the spacecraft (near the center of mass) pointing outwards and forward. These act in pairs to prevent the spacecraft from rotating. The thrusters for the lateral directions are mounted close to the center of mass of the spacecraft, in pairs as well.[citation needed]\n\n\nLocation of thrusters on spaceplanes[edit]\n\n  \nRCS thrusters on the nose of Discovery, a Space Shuttle orbiter.\n\n\n\nThe suborbital X-15 and a companion training aero-spacecraft, the NF-104 AST, both intended to travel to an altitude that rendered their aerodynamic control surfaces unusable, established a convention for locations for thrusters on winged vehicles not intended to dock in space; that is, those that only have attitude control thrusters. Those for pitch and yaw are located in the nose, forward of the cockpit, and replace a standard radar system. Those for roll are located at the wingtips. The X-20, which would have gone into orbit, continued this pattern.\n\nUnlike these, the Space Shuttle Orbiter had many more thrusters, as it was required to carry out docking maneuvers in orbit. Shuttle thrusters were grouped in the nose of the vehicle and on each of the two aft Orbital Maneuvering System pods. No nozzles interrupted the heat shield on the underside of the craft; instead, the nose RCS nozzles which control positive pitch were mounted on the side of the vehicle, and were canted downward. The downward-facing negative pitch thrusters were located in the OMS pods mounted in the tail/afterbody.\n\n\nInternational Space Station systems[edit]\n\nThe International Space Station uses electrically powered reaction control gyroscopes for primary attitude control, with RCS thruster systems as backup and augmentation systems.[1]\n\n\nReferences[edit]\n\n\n\t^ http://forum.nasaspaceflight.com/index.php?action=dlattach;topic=34777.0;attach=586775\n\n\n\n\n\nExternal links[edit]\n\n\tSpace Shuttle RCS\n\tJet Aerospace: Mono-fuel RCS thruster\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Reaction_control_system&oldid=909781735\"\n\n\t\t\n\t\tCategories: \tSpacecraft attitude control\n\tSpacecraft design\n\tSpacecraft propulsion\n\n\nHidden categories: \tArticles with short description\n\tArticles needing additional references from September 2014\n\tAll articles needing additional references\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from March 2013\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tDeutsch\n\tEspañol\n\tFrançais\n\t한국어\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\t日本語\n\tPolski\n\tPortuguês\n\tРусский\n\tУкраїнська\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 7 August 2019, at 15:38 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Reaction control system - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/2/2d/LM_RCS.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-reaction_control_system", "title": "Reaction control system - Wikipedia"}}