{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRechargeable battery - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tRechargeable battery\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Secondary battery)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t  \nA battery bank used for an uninterruptible power supply in a data center\n\n\n\n  \nA rechargeable lithium polymer mobile phone battery\n\n\n\n  \nA common consumer battery charger for rechargeable AA and AAA batteries\n\n\n\nA rechargeable battery, storage battery, secondary cell, or accumulator is a type of electrical battery which can be charged, discharged into a load, and recharged many times, as opposed to a disposable or primary battery, which is supplied fully charged and discarded after use. It is composed of one or more electrochemical cells. The term \"accumulator\" is used as it accumulates and stores energy through a reversible electrochemical reaction. Rechargeable batteries are produced in many different shapes and sizes, ranging from button cells to megawatt systems connected to stabilize an electrical distribution network. Several different combinations of electrode materials and electrolytes are used, including lead–acid, nickel–cadmium (NiCd), nickel–metal hydride (NiMH), lithium-ion (Li-ion), and lithium-ion polymer (Li-ion polymer).\n\nRechargeable batteries typically initially cost more than disposable batteries, but have a much lower total cost of ownership and environmental impact, as they can be recharged inexpensively many times before they need replacing. Some rechargeable battery types are available in the same sizes and voltages as disposable types, and can be used interchangeably with them.\n\n\nContents\n\n\n\t1 Applications\n\t2 Charging and discharging\n\t2.1 Rate of discharge\n\t2.2 Damage from cell reversal\n\t2.3 Damage during storage in fully discharged state\n\t2.4 Depth of discharge\n\t2.5 Lifespan and cycle stability\n\t2.6 Recharging time\n\n\n\n\t3 Active components\n\t4 Types\n\t4.1 Other experimental types\n\n\n\n\t5 Alternatives\n\t6 Research\n\t7 See also\n\t8 References\n\t9 Further reading\n\t10 External links\n\n\n\n\n\nApplications[edit]\n\n  \nCylindrical cell (18650) prior to assembly. Several thousand of them (lithium ion) form the Tesla Model S battery (see Gigafactory).\n\n\n\n  \nLithium ion battery monitoring electronics (over- and discharge protection)\n\n\n\nDevices which use rechargeable batteries include automobile starters, portable consumer devices, light vehicles (such as motorized wheelchairs, golf carts, electric bicycles, and electric forklifts), tools, uninterruptible power supplies, and battery storage power stations. Emerging applications in hybrid internal combustion-battery and electric vehicles drive the technology to reduce cost, weight, and size, and increase lifetime.[1]\n\nOlder rechargeable batteries self-discharge relatively rapidly, and require charging before first use; some newer low self-discharge NiMH batteries hold their charge for many months, and are typically sold factory-charged to about 70% of their rated capacity.\n\nBattery storage power stations use rechargeable batteries for load-leveling (storing electric energy at times of low demand for use during peak periods) and for renewable energy uses (such as storing power generated from photovoltaic arrays during the day to be used at night). Load-leveling reduces the maximum power which a plant must be able to generate, reducing capital cost and the need for peaking power plants.\n\nAccording to a report from Research and Markets, the analysts forecast the global rechargeable battery market to grow at a CAGR of 8.32% during the period 2018-2022.[2]\n\nSmall rechargeable batteries can power portable electronic devices, power tools, appliances, and so on. Heavy-duty batteries power electric vehicles, ranging from scooters to locomotives and ships. They are used in distributed electricity generation and in stand-alone power systems.\n\n\nCharging and discharging[edit]\n\n  \nA solar-powered charger for rechargeable AA batteries\n\n\n\nFurther information: Battery charger\n\nDuring charging, the positive active material is oxidized, producing electrons, and the negative material is reduced, consuming electrons. These electrons constitute the current flow in the external circuit. The electrolyte may serve as a simple buffer for internal ion flow between the electrodes, as in lithium-ion and nickel-cadmium cells, or it may be an active participant in the electrochemical reaction, as in lead–acid cells.\n\nThe energy used to charge rechargeable batteries usually comes from a battery charger using AC mains electricity, although some are equipped to use a vehicle's 12-volt DC power outlet.  The voltage of the source must be higher than that of the battery to force current to flow into it, but not too much higher or the battery may be damaged.\n\nChargers take from a few minutes to several hours to charge a battery. Slow \"dumb\" chargers without voltage or temperature-sensing capabilities will charge at a low rate, typically taking 14 hours or more to reach a full charge.  Rapid chargers can typically charge cells in two to five hours, depending on the model, with the fastest taking as little as fifteen minutes.  Fast chargers must have multiple ways of detecting when a cell reaches full charge (change in terminal voltage, temperature, etc.) to stop charging before harmful overcharging or overheating occurs.  The fastest chargers often incorporate cooling fans to keep the cells from overheating. Battery packs intended for rapid charging may include a temperature sensor that the charger uses to protect the pack; the sensor will have one or more additional electrical contacts.\n\nDifferent battery chemistries require different charging schemes.  For example, some battery types can be safely recharged from a constant voltage source.  Other types need to be charged with a regulated current source that tapers as the battery reaches fully charged voltage. Charging a battery incorrectly can damage a battery; in extreme cases, batteries can overheat, catch fire, or explosively vent their contents.\n\n\n  Diagram of the charging of a secondary cell or battery.\n\n\n\n  \nPositive and negative electrode vs. anode and cathode for a secondary battery\n\n\n\n\n\n\n\nRate of discharge[edit]\n\nMain article: Battery (electricity) § C rate\n\nBattery charging and discharging rates are often discussed by referencing a \"C\" rate of current. The C rate is that which would theoretically fully charge or discharge the battery in one hour.  For example, trickle charging might be performed at C/20 (or a  \"20 hour\" rate), while typical charging and discharging may occur at C/2 (two hours for full capacity). The available capacity of electrochemical cells varies depending on the discharge rate. Some energy is lost in the internal resistance of cell components (plates, electrolyte, interconnections), and the rate of discharge is limited by the speed at which chemicals in the cell can move about. For lead-acid cells, the relationship between time and discharge rate is described by Peukert's law; a lead-acid cell that can no longer sustain a usable terminal voltage at a high current may still have usable capacity, if discharged at a much lower rate. Data sheets for rechargeable cells often list the discharge capacity on 8-hour or 20-hour or other stated time; cells for uninterruptible power supply systems may be rated at 15 minute discharge.\n\nThe terminal voltage of the battery is not constant during charging and discharging. Some types have relatively constant voltage during discharge over much of their capacity. Non-rechargeable alkaline and zinc–carbon cells output 1.5V when new, but this voltage drops with use. Most NiMH AA and AAA cells are rated at 1.2 V, but have a flatter discharge curve than alkalines and can usually be used in equipment designed to use alkaline batteries.\n\nBattery manufacturers' technical notes often refer to voltage per cell (VPC) for the individual cells that make up the battery.  For example, to charge a 12 V lead-acid battery (containing 6 cells of 2 V each) at 2.3 VPC requires a voltage of 13.8 V across the battery's terminals.\n\n\nDamage from cell reversal[edit]\n\nSubjecting a discharged cell to a current in the direction which tends to discharge it further to the point the positive and negative terminals switch polarity causes a condition called cell reversal. Generally, pushing current through a discharged cell in this way causes undesirable and irreversible chemical reactions to occur, resulting in permanent damage to the cell.\nCell reversal can occur under a number of circumstances, the two most common being:\n\n\n\tWhen a battery or cell is connected to a charging circuit the wrong way around.\n\tWhen a battery made of several cells connected in series is deeply discharged.\n\n\nIn the latter case, the problem occurs due to the different cells in a battery having slightly different capacities. When one cell reaches discharge level ahead of the rest, the remaining cells will force the current through the discharged cell.\n\nMany battery-operated devices have a low-voltage cutoff that prevents deep discharges from occurring that might cause cell reversal. A smart battery has voltage monitoring circuitry built inside.\n\nCell reversal can occur to a weakly charged cell even before it is fully discharged. If the battery drain current is high enough, the cell's internal resistance can create a resistive voltage drop that is greater than the cell's forward emf. This results in the reversal of the cell's polarity while the current is flowing.[3][4] The higher the required discharge rate of a battery, the better matched the cells should be, both in the type of cell and state of charge, in order to reduce the chances of cell reversal.\n\nIn some situations, such as when correcting NiCd batteries that have been previously overcharged,[5] it may be desirable to fully discharge a battery. To avoid damage from the cell reversal effect, it is necessary to access each cell separately: each cell is individually discharged by connecting a load clip across the terminals of each cell, thereby avoiding cell reversal.\n\n\nDamage during storage in fully discharged state[edit]\n\n\t\n\tThis section's factual accuracy is disputed. Relevant discussion may be found on Talk:Rechargeable battery. Please help to ensure that disputed statements are reliably sourced.  (January 2019) (Learn how and when to remove this template message)\n\n\n\nIf a multi-cell battery is fully discharged, it will often be damaged due to the cell reversal effect mentioned above.\nIt is possible however to fully discharge a battery without causing cell reversal—either by discharging each cell separately, or by allowing each cell's internal leakage to dissipate its charge over time.\n\nEven if a cell is brought to a fully discharged state without reversal, however, damage may occur over time simply due to remaining in the discharged state. An example of this is the sulfation that occurs in lead-acid batteries that are left sitting on a shelf for long periods.\nFor this reason it is often recommended to charge a battery that is intended to remain in storage, and to maintain its charge level by periodically recharging it.\nSince damage may also occur if the battery is overcharged, the optimal level of charge during storage is typically around 30% to 70%.\n\n\nDepth of discharge[edit]\n\nMain article: Depth of discharge\n\nDepth of discharge (DOD) is normally stated as a percentage of the nominal ampere-hour capacity; 0% DOD means no discharge. As the usable capacity of a battery system depends on the rate of discharge and the allowable voltage at the end of discharge, the depth of discharge must be qualified to show the way it is to be measured. Due to variations during manufacture and aging, the DOD for complete discharge can change over time or number of charge cycles. Generally a rechargeable battery system will tolerate more charge/discharge cycles if the DOD is lower on each cycle.[6]\n\n\nLifespan and cycle stability[edit]\n\nIf batteries are used repeatedly even without mistreatment, they lose capacity as the number of charge cycles increases, until they are eventually considered to have reached the end of their useful life. Different battery systems have differing mechanisms for wearing out. For example, in lead-acid batteries, not all the active material is restored to the plates on each charge/discharge cycle; eventually enough material is lost that the battery capacity is reduced.  In lithium-ion types, especially on deep discharge, some reactive lithium metal can be formed on charging, which is no longer available to participate in the next discharge cycle. Sealed batteries may lose moisture from their liquid electrolyte, especially if overcharged or operated at high temperature.  This reduces the cycling life.\n\n\nRecharging time[edit]\n\nMain article: Battery charger § C-rate\n\n\t\n\tThis section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Rechargeable battery\" – news · newspapers · books · scholar · JSTOR  (September 2017) (Learn how and when to remove this template message)\n\n\n\n  \nBYD e6 taxi. Recharging in 15 Minutes to 80 percent\n\n\n\nRecharging time is an important parameter to the user of a product powered by rechargeable batteries.  Even if the charging power supply provides enough power to operate the device as well as recharge the battery, the device is attached to an external power supply during the charging time. For electric vehicles used industrially, charging during off-shifts may be acceptable. For highway electric vehicles, rapid charging is necessary for charging in a reasonable time.\n\nA rechargeable battery cannot be recharged at an arbitrarily high rate.  The internal resistance of the battery will produce heat, and excessive temperature rise will damage or destroy a battery. For some types, the maximum charging rate will be limited by the speed at which active material can diffuse through a liquid electrolyte. High charging rates may produce excess gas in a battery, or may result in damaging side reactions that permanently lower the battery capacity. Very roughly, and with many exceptions and details, restoring  a battery's full capacity in one hour or less is considered fast charging.  A battery charger system will include more complex control-circuit- and charging strategies for fast charging, than for a charger designed for slower recharging.\n\n\nActive components[edit]\n\nThe active components in a secondary cell are the chemicals that make up the positive and negative active materials, and the electrolyte. The positive and negative are made up of different materials, with the positive exhibiting a reduction potential and the negative having an oxidation potential. The sum of these potentials is the standard cell potential or voltage.\n\nIn primary cells the positive and negative electrodes are known as the cathode and anode, respectively. Although this convention is sometimes carried through to rechargeable systems—especially with lithium-ion cells, because of their origins in primary lithium cells—this practice can lead to confusion. In rechargeable cells the positive electrode is the cathode on discharge and the anode on charge, and vice versa for the negative electrode.\n\n\nTypes[edit]\n\nSee also: List of battery types and Comparison of commercial battery types\n\nThe lead–acid battery, invented in 1859 by French physicist Gaston Planté, is the oldest type of rechargeable battery. Despite having a very low energy-to-weight ratio and a low energy-to-volume ratio, its ability to supply high surge currents means that the cells have a relatively large power-to-weight ratio. These features, along with the low cost, makes it attractive for use in motor vehicles to provide the high current required by automobile starter motors.\n\nThe nickel–cadmium battery (NiCd) was invented by Waldemar Jungner of Sweden in 1899. It uses nickel oxide hydroxide and metallic cadmium as electrodes. Cadmium is a toxic element, and was banned for most uses by the European Union in 2004. Nickel–cadmium batteries have been almost completely superseded by nickel–metal hydride (NiMH) batteries.\n\nThe nickel–metal hydride battery (NiMH) became available in 1989.[7] These are now a common consumer and industrial type. The battery has a hydrogen-absorbing alloy for the negative electrode instead of cadmium.\n\nThe lithium-ion battery was introduced in the market in 1991, is the choice in most consumer electronics, having the best energy density and a very slow loss of charge when not in use. It does have drawbacks too, particularly the risk of unexpected ignition from the heat generated by the battery.[8] Such incidents are rare and according to experts, they can be minimized \"via appropriate design, installation, procedures and layers of safeguards\" so the risk is acceptable.[9]\n\nLithium-ion polymer batteries (LiPo) are light in weight, offer slightly higher energy density than Li-ion at slightly higher cost, and can be made in any shape. They are available[10] but have not displaced Li-ion in the market.[11] A primary use is for LiPo batteries is in powering remote-controlled cars, boats and airplanes. LiPo packs are readily available on the consumer market, in various configurations, up to 44.4v, for powering certain R/C vehicles and helicopters or drones.[12][13] Some test reports warn of the risk of fire when the batteries are not used in accordance with the instructions.[14] Independent reviews of the technology discuss the risk of fire and explosion from Lithium-ion batteries under certain conditions because they use liquid electrolytes.[15]\n\n\nOther experimental types[edit]\n\n\tType\n\tVoltagea\n\tEnergy densityb\n\tPowerc\n\tE/$e\n\tSelf-disch.f\n\tCharge Efficiency\n\tCyclesg\n\tLifeh\n\n\t(V)\n\t(MJ/kg)\n\t(Wh/kg)\n\t(Wh/L)\n\t(W/kg)\n\t(Wh/$)\n\t(%/month)\n\t(%)\n\t(#)\n\t(years)\n\n\tLithium sulfur[16]\n\t2.0\n\t0.94-1.44[17]\n\t400[18]\n\t350\n\t\n\t\n\t\n\t\n\t~1400[19]\n\t\n\n\tSodium-ion[20]\n\t3.6\n\t\n\t\n\t30\n\t\n\t3.3\n\t\n\t\n\t5000+\n\tTesting\n\n\tThin film lithium\n\t?\n\t\n\t300[21]\n\t959[21]\n\t6000[21]\n\t?p[21]\n\t\n\t\n\t40000[21]\n\t\n\n\tZinc-bromide\n\t1.8\n\t0.27-0.31\n\t75-85\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\tZinc-cerium\n\t2.5[22]\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\tUnder testing\n\n\tVanadium redox\n\t1.15-1.55\n\t0.09-0.13\n\t25-35[23]\n\t\n\t\n\t\n\t20%[24]\n\t\n\t20,000[25][26]\n\t25 years[26]\n\n\tSodium-sulfur\n\t\n\t0.54\n\t150\n\t\n\t\n\t\n\t\n\t89–92%\n\t2500—4500\n\t\n\n\tMolten salt\n\t2.58\n\t0.25-1.04\n\t70-290[27]\n\t160[28]\n\t150-220\n\t4.54[29]\n\t\n\t\n\t3000+\n\t<=20\n\n\tSilver-zinc\n\t1.86\n\t0.47\n\t130\n\t240\n\t\n\t\n\t\n\t\n\t\n\t\n\n\tQuantum Battery (oxide semiconductor)[30][31]\n\t1.5-3\n\t\n\t\n\t500\n\t8000(W/L)\n\t\n\t\n\t\n\t100,000\n\t\n\n\n\n‡ citations are needed for these parameters\n\n\n\tNotes\n\n\n\ta Nominal cell voltage in V.\n\tb Energy density = energy/weight or energy/size, given in three different units\n\tc Specific power = power/weight in W/kg\n\te Energy/consumer price in W·h/US$ (approximately)\n\tf Self-discharge rate in %/month\n\tg Cycle durability in number of cycles\n\th Time durability in years\n\ti VRLA or recombinant includes gel batteries and absorbed glass mats\n\tp Pilot production\n\n\nThe lithium–sulfur battery was developed by Sion Power in 1994.[32] The company claims superior energy density to other lithium technologies.[33]\n\nThe thin film battery (TFB) is a refinement of lithium ion technology by Excellatron.[34] The developers claim a large increase in recharge cycles to around 40,000 and higher charge and discharge rates, at least 5 C charge rate. Sustained 60 C discharge and 1000C peak discharge rate and a significant increase in specific energy, and energy density.[35]\n\nUltraBattery, a hybrid lead-acid battery and ultracapacitor invented by Australia’s national science organisation CSIRO, exhibits tens of thousands of partial state of charge cycles and has outperformed traditional lead-acid, lithium and NiMH-based cells when compared in testing in this mode against variability management power profiles.[36] UltraBattery has kW and MW-scale installations in place in Australia, Japan and the U.S.A. It has also been subjected to extensive testing in hybrid electric vehicles and has been shown to last more than 100,000 vehicle miles in on-road commercial testing in a courier vehicle. The technology is claimed to have a lifetime of 7 to 10 times that of conventional lead-acid batteries in high rate partial state-of-charge use, with safety and environmental benefits claimed over competitors like lithium-ion.  Its manufacturer suggests an almost 100% recycling rate is already in place for the product.\n\nThe potassium-ion battery delivers around a million cycles, due to the extraordinary electrochemical stability of potassium insertion/extraction materials such as Prussian blue.[37]\n\nThe sodium-ion battery is meant for stationary storage and competes with lead–acid batteries. It aims at a low total cost of ownership per kWh of storage. This is achieved by a long and stable lifetime. The effective number of cycles is above 5000 and the battery is not damaged by deep discharge. The energy density is rather low, somewhat lower than lead–acid.[citation needed]\n\n\nAlternatives[edit]\n\nA rechargeable battery is only one of several types of rechargeable energy storage systems.[38]  Several alternatives to rechargeable batteries exist or are under development. For uses such as portable radios, rechargeable batteries may be replaced by clockwork mechanisms which are wound up by hand, driving dynamos, although this system may be used to charge a battery rather than to operate the radio directly. Flashlights may be driven by a dynamo directly. For transportation, uninterruptible power supply systems and laboratories, flywheel energy storage systems store energy in a spinning rotor for conversion to electric power when needed; such systems may be used to provide large pulses of power that would otherwise be objectionable on a common electrical grid.\n\nUltracapacitors—capacitors of extremely high value— are also used; an electric screwdriver which charges in 90 seconds and will drive about half as many screws as a device using a rechargeable battery was introduced in 2007,[39] and similar flashlights have been produced.  In keeping with the concept of ultracapacitors, betavoltaic batteries may be utilized as a method of providing a trickle-charge to a secondary battery, greatly extending the life and energy capacity of the battery system being employed; this type of arrangement is often referred to as a \"hybrid betavoltaic power source\" by those in the industry.[40]\n\nUltracapacitors are being developed for transportation, using a large capacitor to store energy instead of the rechargeable battery banks used in hybrid vehicles. One drawback of capacitors compared to batteries is that the terminal voltage drops rapidly; a capacitor that has 25% of its initial energy left in it will have one-half of its initial voltage. By contrast, battery systems tend to have a terminal voltage that does not decline rapidly until nearly exhausted. The undesirable characteristic complicates the design of power electronics for use with ultracapacitors. However, there are potential benefits in cycle efficiency, lifetime, and weight compared with rechargeable systems. China started using ultracapacitors on two commercial bus routes in 2006; one of them is route 11 in Shanghai.[41]\n\nFlow batteries, used for specialized applications, are recharged by replacing the electrolyte liquid. A flow battery can be considered to be a type of rechargeable fuel cell.\n\n\nResearch[edit]\n\nRechargeable battery research includes development of new electrochemical systems as well as improving the life span and capacity of current types.\n\n\nSee also[edit]\n\n\n\tenergy portal\n\n\n\n\n\tBattery pack\n\tComparison of battery types\n\tEnergy storage\n\tList of battery types\n\tList of energy densities\n\tMetal–air electrochemical cell\n\tSearch for the Super Battery (2017 PBS film)\n\n\n\n\nReferences[edit]\n\n\n\t^ David Linden, Thomas B. Reddy (ed). Handbook Of Batteries 3rd Edition. McGraw-Hill, New York, 2002 ISBN 0-07-135978-8 chapter 22.\n\n\t^ \n\"Global Rechargeable Battery Market 2018-2022\". researchandmarkets.com. April 2018.\n\n\n\t^ Sequeira, C.A.C. Solid state batteries Archived 17 September 2014 at the Wayback Machine, North Atlantic Treaty Organization, Scientific Affairs Division, pp. 242-247, 254-259\n\n\t^ AEROSPACE CORP EL SEGUNDO CA CHEMISTRY AND PHYSICS LAB. Nickel-Cadmium Battery Cell Reversal from Resistive Network Effects: Computer simulations of short-down on a variety of battery configurations Archived 3 March 2016 at the Wayback Machine, DTIC Online website.\n\n\t^ Zaun, James A. NiCd Batteries do NOT have \"memory\" Archived 30 December 2015 at the Wayback Machine, RepairFAQ.org website, 24 September 1996.\n\n\t^ Reddy, Handbook of Batteries page 22-20\n\n\t^ Katerina E. Aifantis et al, High Energy Density Lithium Batteries: Materials, Engineering, Applications Wiley-VCH, 2010 \nISBN 3-527-32407-0 page 66\n\n\t^ Fowler, Suzanne (21 September 2016). \"Samsung's Recall - The Problem with Lithium Ion Batteries\". The New York Times. New York. Archived from the original on 5 September 2016. Retrieved 15 March 2016.\n\n\n\t^ Schweber, Bill (4 August 2015). \"Lithium Batteries: The Pros and Cons\". GlobalSpec. GlobalSpec. Archived from the original on 16 March 2017. Retrieved 15 March 2017.\n\n\n\t^ all-battery.com: Lithium Polymer Batteries Archived 7 February 2015 at the Wayback Machine\n\n\t^ \"Tattu R-Line 4S 1300mah 95~190C Lipo Pack\". Genstattu.com. Archived from the original on 30 August 2016. Retrieved 6 September 2016.\n\n\n\t^ \"Lithium Polymer Charging/Discharging & Safety Information\". Maxamps. MaxAmps. 2017. Archived from the original on 16 March 2017. Retrieved 15 March 2017. Keep a dry fire extinguisher nearby or a large bucket of dry sand, which is a cheap and effective extinguisher.\n\n\n\t^ \"Batteries - LiPo\". TrakPower. Hobbico, Inc. Archived from the original on 16 March 2017. Retrieved 15 March 2017. Voltages, cell counts and capacities just right for your kind of racing ... Discharge rates from 50C up to 100C ...Balanced for longer life and achieving the maximum 4.2V/cell\n\n\n\t^ Dunn, Terry (5 March 2015). \"Battery Guide: The Basics of Lithium-Polymer Batteries\". Tested. Whalerock Industries. Archived from the original on 16 March 2017. Retrieved 15 March 2017. I’ve not yet heard of a LiPo that burst into flames during storage. All of the fire incidents that I’m aware of occurred during charge or discharge of the battery. Of those cases, the majority of problems happened during charge. Of those cases, the fault usually rested with either the charger or the person who was operating the charger…but not always.\n\n\n\t^ Braga, M.H.; Grundish, N.S.; Murchison, A.J.; Goodenough, J.B. (9 December 2016). \"Alternative strategy for a safe rechargeable battery\". Energy & Environmental Science. Energy and Environmental Science. 10: 331–336. doi:10.1039/C6EE02888H. Archived from the original on 2 September 2017. Retrieved 15 March 2017.\n\n\n\t^ Lithium_Sulfur Archived 14 December 2007 at the Wayback Machine\n\n\t^ \"Solar plane makes record flight\". BBC News. 24 August 2008. Archived from the original on 25 July 2010. Retrieved 10 April 2010.\n\n\n\t^ Patent 6358643, PolyPlus.com website. Archived 18 March 2009 at the Wayback Machine\n\n\t^ Research News: A longer life for lithium-sulfur batteries Archived 19 January 2016 at the Wayback Machine, Fraunhofer.de website, April 2013.\n\n\t^ Bullis, Kevin (18 February 2014). \"How to Make a Cheap Battery for Storing Solar Power | MIT Technology Review\". Technologyreview.com. Retrieved 27 April 2014.\n\n\n\t^ a b c d e \"the Company\". Excellatron. Archived from the original on 8 August 2012. Retrieved 14 August 2012.\n\n\n\t^ Xie, Z.; Liu, Q.; Chang, Z.; Zhang, X. (2013). \"The developments and challenges of cerium half-cell in zinc–cerium redox flow battery for energy storage\". Electrochimica Acta. 90: 695–704. doi:10.1016/j.electacta.2012.12.066.\n\n\n\t^ \"Vanadium Redox Battery\". Vrb.unsw.edu.au. Archived from the original on 26 May 2012. Retrieved 14 August 2012.\n\n\n\t^ broken link\n\n\t^ The Vanadium Advantage: Flow Batteries Put Wind Energy in the Bank Archived 7 September 2008 at the Wayback Machine\n\n\t^ a b https://www.avalonbattery.com/product/ Avalon Battery Vanadium Flow Battery\n\n\t^ \"Sumitomo considering marketing new lower-temperature molten-salt electrolyte battery to automakers for EVs and hybrids\". Green Car Congress. 11 November 2011. Archived from the original on 18 May 2012. Retrieved 24 April 2012.\n\n\n\t^ \"mpoweruk.com: Accumulator and battery comparisons (pdf)\" (PDF). Retrieved 14 August 2012.\n\n\n\t^ \"EVWORLD FEATURE: Fuel Cell Disruptor - Part 2:BROOKS FUEL CELL | CARB | ARB | HYDROGEN | ZEBRA | EV | ELECTRIC\". Evworld.com. Archived from the original on 25 May 2012. Retrieved 2012-08-14.\n\n\n\t^ \"Study of secondary battery semiconductor\" (PDF). Hiroshima University. 25 November 2011. Archived from the original (PDF) on 21 January 2014. Retrieved 18 January 2014.\n\n\n\t^ \"Notice of the development of mass production technology of Secondary battery \"battenice\" based on quantum technology\" (PDF). MICRONICS JAPAN. 19 November 2013. Archived from the original (PDF) on 16 January 2014. Retrieved 18 January 2014.\n\n\n\t^ \"Sion Power Corporation - Advanced Energy Storage : Welcome\". Sionpower.com. Archived from the original on 15 June 2012. Retrieved 14 August 2012.\n\n\n\t^ \"Sion Power Corporation - Advanced Energy Storage : Technology Overview\". Sionpower.com. Archived from the original on 10 November 2012. Retrieved 14 August 2012.\n\n\n\t^ \"Excellatron\". Excellatron. 2 June 2010. Archived from the original on 6 August 2012. Retrieved 14 August 2012.\n\n\n\t^ \"the Company\". Excellatron. Archived from the original on 12 September 2012. Retrieved 14 August 2012.\n\n\n\t^ \"Life Cycle Testing and Evaluation of Energy Storage Devices\" (PDF). 2 January 2011. Archived (PDF) from the original on 26 December 2014. Retrieved 26 December 2014. Cite journal requires |journal= (help)\n\n\n\t^ Eftekhari, A.; Jian, Z.; Ji, X. (2017). \"Potassium Secondary Batteries\". ACS Applied Materials & Interfaces. 9 (5): 4404–4419. doi:10.1021/acsami.6b07989.\n\n\n\t^ Miller, Charles.  Illustrated Guide to the National Electrical Code Archived 2 February 2017 at the Wayback Machine, p. 445 (Cengage Learning 2011).\n\n\t^ \"Capacitor-powered electric screwdriver, 2007\". Ohgizmo.com. 24 July 2005. Archived from the original on 7 March 2012. Retrieved 14 August 2012.\n\n\n\t^ Welcome to City Labs Archived 15 February 2016 at the Wayback Machine, CityLabs.net website.\n\n\t^ 超级电容公交车专题 (Super capacitor buses topics), 52Bus.com website, August 2006 (in Chinese, archived page).\n\n\n\n\n\nFurther reading[edit]\n\n\tBelli, Brita. ‘Battery University’ Aims to Train a Work Force for Next-Generation Energy Storage, The New York Times, 8 April 2013.  Discusses a professional development program at San Jose State University.\n\tVlasic, Bill. Chinese Firm Wins Bid for Auto Battery Maker, The New York Times, published online 9 December 2012, p. B1.\n\tCardwell, Diane. Battery Seen as Way to Cut Heat-Related Power Losses, 16 July 2013 online and 17 July 2013 in print on 17 July 2013, on page B1 in the New York City edition of The New York Times, p. B1. Discusses Eos Energy Systems' Zinc–air batteries.\n\tCardwell, Diane. SolarCity to Use Batteries From Tesla for Energy Storage,  4 December 2013 on line, and 5 December 2013 in the New York City edition of The New York Times, p. B-2. Discusses SolarCity, DemandLogic and Tesla Motors.\n\tGalbraith, Kate. In Presidio, a Grasp at the Holy Grail of Energy Storage, The New York Times,  6 November 2010.\n\tGalbraith, Kate. Filling the Gaps in the Flow of Renewable Energy, The New York Times,  22 October 2013.\n\tWitkin, Jim. Building Better Batteries for Electric Cars,  The New York Times, 31 March 2011, p. F4. Published online 30 March 2011. Discusses rechargeable batteries and the new-technology lithium ion battery.\n\tWald, Matthew L. Hold That Megawatt!,  The New York Times, 7 January 2011. Discusses AES Energy Storage.\n\tWald, Matthew L. Green Blog: Is That Onions You Smell? Or Battery Juice?, The New York Times, 9 May 2012. Discusses vanadium redox battery technology.\n\tWald, Matthew L. Green Blog: Cutting the Electric Bill with a Giant Battery, The New York Times, 27 June 2012. Discusses Saft Groupe S.A.\n\tWald, Matthew L. Seeking to Start a Silicon Valley for Battery Science, The New York Times,  30 November 2012.\n\tWald, Matthew L. From Harvard, a Cheaper Storage Battery, The New York Times,  8 January 2014. Discusses research into flow-batteries utilizing carbon-based molecules called quinones.\n\tWitkin, Jim. Building Better Batteries for Electric Cars,   The New York Times, 31 March 2011, p. F4. Published online 30 March 2011. Discusses rechargeable batteries and lithium ion batteries.\n\tWitkin, Jim. Green Blog: A Second Life for the Electric Car Battery, The New York Times, 27 April 2011. Describes: ABB; Community Energy Storage for the use of electric vehicle batteries for grid energy storage.\n\tWoody, Todd. Green Blog: When It Comes to Car Batteries, Moore’s Law Does Not Compute,  The New York Times, 6 September 2010.  Discusses lithium-air batteries.\n\tJang Wook Choi. Promise and reality of post-lithium-ion batteries with high energy densities.\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Rechargeable batteries.\n\n\n\tHigh-performance lithium battery anodes using silicon nanowires Candace K. Chan, Hailin Peng, Gao Liu, Kevin McIlwrath, Xiao Feng Zhang, Robert A. Huggins & Yi C Nature Nanotechnology volume 3, pages 31–35 (2008) 16 December 2007 doi:10.1038/nnano.2007.411\n\tHow do rechargeable (that is, zinc-alkaline or nickel-cadmium) batteries work and what makes the reactions reversible in some batteries, but not in others?\n\tElectropaedia, Energy Sources and Storage and History of Technology\n\n\n\tAuthority control \t\n\tGND: 4068497-0\n\tLCCN: sh85128358\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nGalvanic cells\n\n\tTypes\t\n\tVoltaic pile\n\tBattery\n\tFlow battery\n\tTrough battery\n\n\n\tConcentration cell\n\tFuel cell\n\tThermogalvanic cell\n\n\n\n\t\n\n\tPrimary cell\n(non-rechargeable)\n\t\n\tAlkaline\n\tAluminium–air\n\tBunsen\n\tChromic acid\n\tClark\n\tDaniell\n\tDry\n\tEdison–Lalande\n\tGrove\n\tLeclanché\n\tLithium\n\tMercury\n\tNickel oxyhydroxide\n\tSilicon–air\n\tSilver oxide\n\tWeston\n\tZamboni\n\tZinc–air\n\tZinc–carbon\n\n\n\n\n\tSecondary cell\n\n(rechargeable)\n\t\n\tAutomotive\n\tLead–acid\n\tgel / VRLA\n\n\n\tLithium–air\n\tLithium ion\n\tLithium polymer\n\tLithium iron phosphate\n\tLithium titanate\n\tLithium–sulfur\n\tDual carbon\n\n\n\tMolten salt\n\tNanopore\n\tNanowire\n\tNickel–cadmium\n\tNickel–hydrogen\n\tNickel–iron\n\tNickel–lithium\n\tNickel–metal hydride\n\tNickel–zinc\n\tPolysulfide bromide\n\tPotassium ion\n\tRechargeable alkaline\n\tSilver zinc\n\tSodium ion\n\tSodium–sulfur\n\tVanadium redox\n\tZinc–bromine\n\tZinc–cerium\n\n\n\n\n\tOther Cell\n\t\n\tSolar cell\n\tFuel cell\n\tAtomic battery\n\n\n\n\n\tCell parts\t\n\tAnode\n\tBinder\n\tCatalyst\n\tCathode\n\tElectrode\n\tElectrolyte\n\tHalf-cell\n\tIons\n\tSalt bridge\n\tSemipermeable membrane\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Rechargeable_battery&oldid=918130263\"\n\n\t\t\n\t\tCategories: \tRechargeable batteries\n\tFlexible electronics\n\n\nHidden categories: \tWebarchive template wayback links\n\tCS1 errors: missing periodical\n\tAccuracy disputes from January 2019\n\tAll accuracy disputes\n\tArticles needing additional references from September 2017\n\tAll articles needing additional references\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from November 2011\n\tCommons category link is on Wikidata\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with LCCN identifiers\n\tUse dmy dates from January 2011\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tবাংলা\n\tBân-lâm-gú\n\tБеларуская\n\tБългарски\n\tBosanski\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\t客家語/Hak-kâ-ngî\n\t한국어\n\tहिन्दी\n\tHrvatski\n\tItaliano\n\tҚазақша\n\tLatina\n\tLatviešu\n\tMagyar\n\tМакедонски\n\tNederlands\n\t日本語\n\tOʻzbekcha/ўзбекча\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tShqip\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tతెలుగు\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\tWinaray\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 27 September 2019, at 05:16 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "7", "dc:title": "Rechargeable battery - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Datacenter_Backup_Batteries.jpg/1200px-Datacenter_Backup_Batteries.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-secondary_battery", "title": "Rechargeable battery - Wikipedia"}}