{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSix degrees of freedom - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tSix degrees of freedom\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tTypes of movement possible for a rigid body in three-dimensional space\n\n\"Six axis\" redirects here.  It is not to be confused with Six degrees of separation. For the PlayStation 3 video game console controller, see Sixaxis.\n\nFor the 2019 Twilight Zone episode, see The Twilight Zone (2019 TV series) § Episodes.\n\n  \nThe six degrees of freedom: forward/back, up/down, left/right, yaw, pitch, roll\n\n\n\nSix degrees of freedom (6DoF) refers to the freedom of movement of a rigid body in three-dimensional space.   Specifically, the body is free to change position as forward/backward (surge), up/down (heave), left/right (sway) translation in three perpendicular axes, combined with changes in orientation through rotation about three perpendicular axes, often termed yaw (normal axis), pitch (transverse axis), and roll (longitudinal axis).  \n\n\nContents\n\n\n\t1 Robotics\n\t2 Engineering\n\t3 Operational envelope types\n\t4 Game controllers\n\t5 See also\n\t6 References\n\n\n\n\n\nRobotics[edit]\n\nSerial and parallel manipulator systems are generally designed to position an end-effector with six degrees of freedom, consisting of three in translation and three in orientation.  This provides a direct relationship between actuator positions and the configuration of the manipulator defined by its forward and inverse kinematics.\n\nRobot arms are described by their degrees of freedom. This number typically refers to the number of single-axis rotational joints in the arm, where higher number indicates an increased flexibility in positioning a tool. This is a practical metric, in contrast to the abstract definition of degrees of freedom which measures the aggregate positioning capability of a system.[1]\n\nIn 2007, Dean Kamen, inventor of the Segway, unveiled a prototype robotic arm[2] with 14 degrees of freedom for DARPA. Humanoid robots typically have 30 or more degrees of freedom, with six degrees of freedom per arm, five or six in each leg, and several more in torso and neck.[3]\n\n\nEngineering[edit]\n\nThe term is important in mechanical systems, especially biomechanical systems for analyzing and measuring properties of these types of systems that need to account for all six degrees of freedom. Measurement of the six degrees of freedom is accomplished today through both AC and DC magnetic or electromagnetic fields in sensors that transmit positional and angular data to a processing unit. The data is made relevant through software that integrates the data based on the needs and programming of the users.\n\n\n  \nMnemonics to remember angle names\n\n\n\nAn example of six degree of freedom movement is the motion of a ship at sea. It is described as:[4]\n\nTranslational envelopes :\n\n\n\tMoving forward and backward on the X-axis. (Surge)\n\tMoving left and right on the Y-axis. (Sway)\n\tMoving up and down on the Z-axis. (Heave)\n\n\nRotational envelopes :\n\n\n\tTilting side to side on the X-axis. (Roll)\n\tTilting forward and backward on the Y-axis. (Pitch)\n\tTurning left and right on the Z-axis. (Yaw)\n\n\nSee also: Euler angles\n\nOperational envelope types[edit]\n\nThere are three types of operational envelope in the Six degrees of freedom. These types are Direct, Semi-direct (conditional) and Non-direct, all regardless of the time remaining for the execution of the maneuver, the energy remaining to execute the maneuver and finally, if the motion is commanded via a biological entity (e.g. human), a robotical entity (e.g. computer) or both.\n\n1- Direct type : Involved a degree can be commanded directly without particularly conditions and described as a normal operation. (An aileron on a basic airplane)\n\n2- Semi-direct type : Involved a degree can be commanded when some specific conditions are met. (Reverse thrust on an aircraft)\n\n3- Non-direct type : Involved a degree when is achieved via the interaction with its environment and cannot be commanded. (Pitching motion of a vessel at sea)\n\nTransitional type also exists in some vehicles. For example, when the Space Shuttle operates in space, the craft is described as fully-direct-six because its six degrees can be commanded. However, when the Space Shuttle is in the earth's atmosphere for its return, the fully-direct-six degrees are no longer applicable for many technical reasons.\n\n\nGame controllers[edit]\n\nSix degrees of freedom also refers to movement in video game-play.\n\nFirst-person shooter (FPS) games generally provide five degrees of freedom: forwards/backwards, slide left/right, up/down (jump/crouch/lie), yaw (turn left/right), and pitch (look up/down).  If the game allows leaning control, then some consider it a sixth DoF; however, this may not be completely accurate, as a lean is a limited partial rotation.\n\nThe term 6DoF has sometimes been used to describe games which allow freedom of movement, but do not necessarily meet the full 6DoF criteria.  For example, Dead Space 2, and to a lesser extent, Homeworld and Zone Of The Enders allow freedom of movement.\n\nSome examples of true 6DoF games, which allow independent control of all three movement axes and all three rotational axes, include Elite Dangerous, Shattered Horizon, the Descent franchise, Retrovirus, Miner Wars, Space Engineers, Forsaken and Overload (from the same creators of Descent).  The space MMO Vendetta Online also features 6 degrees of freedom.\n\nMotion tracking devices such as TrackIR are used for 6DoF head tracking. This device often finds its places in flight simulators and other vehicle simulators that require looking around the cockpit to locate enemies or simply avoiding accidents in-game.\n\nThe acronym 3DoF, meaning movement in the three dimensions but not rotation, is sometimes encountered.\n\nThe Razer Hydra, a motion controller for PC, tracks position and rotation of two wired nunchucks, providing six degrees of freedom on each hand.\n\nThe SpaceOrb 360 is a 6DOF computer input device released in 1996 originally manufactured and sold by the SpaceTec IMC company (first bought by Labtec, which itself was later bought by Logitech).\n\nThe controllers sold with HTC VIVE provide 6DOF information by the lighthouse, which adopts Time of Flight (TOF) technology to determine the position of controllers.\n\n\nSee also[edit]\n\n\tDegrees of freedom (mechanics)\n\tDegrees of freedom problem\n\tGeometric terms of location\n\tShip motions, an example in a vehicle\n\tAircraft principal axes\n\n\nReferences[edit]\n\n\n\t^ Paul, Richard P., Robot Manipulators: Mathematics, Programming, and Control, MIT Press, 1981.\n\n\t^ \"Luke, a new prosthetic arm for soldiers\". ted.com. 2007-03-01. Retrieved 2017-02-26.\n\n\t^ Craig, John J., Introduction to Robotics: Mechanics and Control, Addison-Wesley, 1986.\n\n\t^ Summary of ship movement Archived November 25, 2011, at the Wayback Machine\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Six_degrees_of_freedom&oldid=919207833\"\n\n\t\t\n\t\tCategories: \tMechanics\n\tBiomedical engineering\n\tVideo game gameplay\n\tRobot kinematics\n\n\nHidden categories: \tWebarchive template wayback links\n\tArticles with short description\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tDeutsch\n\tEspañol\n\t한국어\n\tItaliano\n\tעברית\n\t日本語\n\tРусский\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 2 October 2019, at 12:13 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "2", "dc:title": "Six degrees of freedom - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/f/fa/6DOF_en.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-six_degrees_of_freedom", "title": "Six degrees of freedom - Wikipedia"}}