{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSolar energy - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\n\n\n\n\tSolar energy\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tFor the academic journal, see Solar Energy (journal). For the generation of electricity using solar energy, see Solar power.\n\n\n\n\nRadiant light and heat from the Sun that is harnessed using a range of technologies\n\n  \nThe source of Earth's solar power: the Sun\n\n\n\n\tPart of a series on\n\tRenewable energy\n\t\n\tBiofuel\n\tBiomass\n\tBiogas\n\tGeothermal\n\tHydropower\n\tSolar energy\n\tTidal power\n\tWave power\n\tWind power\n\n\n\t\n\tTopics by country\n\t100% renewable energy\n\tMarketing and policy trends\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\n\tPart of a series about\n\tSustainable energy\n\t\n\t\nOverview\n\t\n\tSustainable energy\n\tCarbon-neutral fuel\n\tFossil fuel phase-out\n\n\n\t\nEnergy conservation\n\t\n\tCogeneration\n\tEfficient energy use\n\tEnergy storage\n\tGreen building\n\tHeat pump\n\tLow-carbon power\n\tMicrogeneration\n\tPassive solar building design\n\n\n\t\nRenewable energy\n\t\n\tBiofuel\n\tGeothermal\n\tHydroelectricity\n\tSolar\n\tTidal\n\tWave\n\tWind\n\n\n\t\nSustainable transport\n\t\n\tElectric vehicle\n\tGreen vehicle\n\tPlug-in hybrid\n\n\n\t\n\n\t Renewable energy portal\n\t Environment portal\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nSolar energy is radiant light and heat from the Sun that is harnessed using a range of ever-evolving technologies such as solar heating, photovoltaics, solar thermal energy, solar architecture, molten salt power plants and artificial photosynthesis.[1][2]\n\nIt is an important source of renewable energy and its technologies are broadly characterized as either passive solar or active solar depending on how they capture and distribute solar energy or convert it into solar power. Active solar techniques include the use of photovoltaic systems, concentrated solar power and solar water heating to harness the energy. Passive solar techniques include orienting a building to the Sun, selecting materials with favorable thermal mass or light-dispersing properties, and designing spaces that naturally circulate air.\n\nThe large magnitude of solar energy available makes it a highly appealing source of electricity. The United Nations Development Programme in its 2000 World Energy Assessment found that the annual potential of solar energy was 1,575–49,837 exajoules (EJ). This is several times larger than the total world energy consumption, which was 559.8 EJ in 2012.[3][4]\n\nIn 2011, the International Energy Agency said that \"the development of affordable, inexhaustible and clean solar energy technologies will have huge longer-term benefits. It will increase countries’ energy security through reliance on an indigenous, inexhaustible and mostly import-independent resource, enhance sustainability, reduce pollution, lower the costs of mitigating global warming, and keep fossil fuel prices lower than otherwise. These advantages are global. Hence the additional costs of the incentives for early deployment should be considered learning investments; they must be wisely spent and need to be widely shared\".[1]\n\n\nContents\n\n\n\t1 Potential\n\t2 Thermal energy\n\t2.1 Early commercial adaptation\n\t2.2 Water heating\n\t2.3 Heating, cooling and ventilation\n\t2.4 Cooking\n\t2.5 Process heat\n\t2.6 Water treatment\n\t2.7 Molten salt technology\n\n\n\n\t3 Electricity production\n\t3.1 Photovoltaics\n\t3.2 Concentrated solar power\n\n\n\n\t4 Architecture and urban planning\n\t5 Agriculture and horticulture\n\t6 Transport\n\t7 Fuel production\n\t8 Energy storage methods\n\t9 Development, deployment and economics\n\t10 ISO standards\n\t11 See also\n\t12 References\n\t13 Further reading\n\t14 External links\n\n\n\n\n\nPotential\n\nFurther information: Solar radiation\n\n\nAbout half the incoming solar energy reaches the Earth's surface.\n\n\n\nAverage insolation. The theoretical area of the small black dots is sufficient to supply the world's total energy needs of 18 TW with solar power.\n\n\n\n\n\nThe Earth receives 174 petawatts (PW) of incoming solar radiation (insolation) at the upper atmosphere.[5] Approximately 30% is reflected back to space while the rest is absorbed by clouds, oceans and land masses. The spectrum of solar light at the Earth's surface is mostly spread across the visible and near-infrared ranges with a small part in the near-ultraviolet.[6] Most of the world's population live in areas with insolation levels of 150–300 watts/m², or 3.5–7.0 kWh/m² per day.[citation needed]\n\nSolar radiation is absorbed by the Earth's land surface, oceans – which cover about 71% of the globe – and atmosphere. Warm air containing evaporated water from the oceans rises, causing atmospheric circulation or convection. When the air reaches a high altitude, where the temperature is low, water vapor condenses into clouds, which rain onto the Earth's surface, completing the water cycle. The latent heat of water condensation amplifies convection, producing atmospheric phenomena such as wind, cyclones and anti-cyclones.[7] Sunlight absorbed by the oceans and land masses keeps the surface at an average temperature of 14 °C.[8] By photosynthesis, green plants convert solar energy into chemically stored energy, which produces food, wood and the biomass from which fossil fuels are derived.[9]\n\nThe total solar energy absorbed by Earth's atmosphere, oceans and land masses is approximately 3,850,000 exajoules (EJ) per year.[10] In 2002, this was more energy in one hour than the world used in one year.[11][12] Photosynthesis captures approximately 3,000 EJ per year in biomass.[13] The amount of solar energy reaching the surface of the planet is so vast that in one year it is about twice as much as will ever be obtained from all of the Earth's non-renewable resources of coal, oil, natural gas, and mined uranium combined,[14]\n\n\n\tYearly solar fluxes & human consumption1\n\n\tSolar\n\t3,850,000\n\t[10]\n\n\tWind\n\t2,250\n\t[15]\n\n\tBiomass potential\n\t~200\n\t[16]\n\n\tPrimary energy use2\n\t539\n\t[17]\n\n\tElectricity2\n\t~67\n\t[18]\n\n\t1 Energy given in Exajoule (EJ) = 1018 J = 278 TWh \n2 Consumption as of year 2010\n\n\n\nThe potential solar energy that could be used by humans differs from the amount of solar energy present near the surface of the planet because factors such as geography, time variation, cloud cover, and the land available to humans limit the amount of solar energy that we can acquire.\n\nGeography affects solar energy potential because areas that are closer to the equator have a greater amount of solar radiation. However, the use of photovoltaics that can follow the position of the Sun can significantly increase the solar energy potential in areas that are farther from the equator.[4] Time variation effects the potential of solar energy because during the nighttime there is little solar radiation on the surface of the Earth for solar panels to absorb. This limits the amount of energy that solar panels can absorb in one day. Cloud cover can affect the potential of solar panels because clouds block incoming light from the Sun and reduce the light available for solar cells.\n\nIn addition, land availability has a large effect on the available solar energy because solar panels can only be set up on land that is otherwise unused and suitable for solar panels. Roofs have been found to be a suitable place for solar cells, as many people have discovered that they can collect energy directly from their homes this way. Other areas that are suitable for solar cells are lands that are not being used for businesses where solar plants can be established.[4]\n\nSolar technologies are characterized as either passive or active depending on the way they capture, convert and distribute sunlight and enable solar energy to be harnessed at different levels around the world, mostly depending on distance from the equator. Although solar energy refers primarily to the use of solar radiation for practical ends, all renewable energies, other than Geothermal power and Tidal power, derive their energy either directly or indirectly from the Sun.\n\nActive solar techniques use photovoltaics, concentrated solar power, solar thermal collectors, pumps, and fans to convert sunlight into useful outputs. Passive solar techniques include selecting materials with favorable thermal properties, designing spaces that naturally circulate air, and referencing the position of a building to the Sun. Active solar technologies increase the supply of energy and are considered supply side technologies, while passive solar technologies reduce the need for alternate resources and are generally considered demand side technologies.[19]\n\nIn 2000, the United Nations Development Programme, UN Department of Economic and Social Affairs, and World Energy Council published an estimate of the potential solar energy that could be used by humans each year that took into account factors such as insolation, cloud cover, and the land that is usable by humans. The estimate found that solar energy has a global potential of 1,575–49,837 EJ per year (see table below).[4]\n\n\nAnnual solar energy potential by region (Exajoules) [4]\n\tRegion\tNorth America\tLatin America and Caribbean\tWestern Europe\tCentral and Eastern Europe\tFormer Soviet Union\tMiddle East and North Africa\tSub-Saharan Africa\tPacific Asia\tSouth Asia\tCentrally planned Asia\tPacific OECD\n\n\tMinimum\t181.1\t112.6\t25.1\t4.5\t199.3\t412.4\t371.9\t41.0\t38.8\t115.5\t72.6\n\n\tMaximum\t7,410\t3,385\t914\t154\t8,655\t11,060\t9,528\t994\t1,339\t4,135\t2,263\n\n\tNote:\n\tTotal global annual solar energy potential amounts to 1,575 EJ (minimum) to 49,837 EJ (maximum)\n\tData reflects assumptions of annual clear sky irradiance, annual average sky clearance, and available land area. All figures given in Exajoules.\n\n\nQuantitative relation of global solar potential vs. the world's primary energy consumption:\n\n\n\tRatio of potential vs. current consumption (402 EJ) as of year: 3.9 (minimum) to 124 (maximum)\n\tRatio of potential vs. projected consumption by 2050 (590–1,050 EJ): 1.5–2.7 (minimum) to 47–84 (maximum)\n\tRatio of potential vs. projected consumption by 2100 (880–1,900 EJ): 0.8–1.8 (minimum) to 26–57 (maximum)\n\n\nSource: United Nations Development Programme – World Energy Assessment (2000)[4]\n\n\n\n\n\nThermal energy\n\nMain article: Solar thermal energy\n\nSolar thermal technologies can be used for water heating, space heating, space cooling and process heat generation.[20]\n\n\nEarly commercial adaptation\n\nIn 1878, at the Universal Exposition in Paris, Augustin Mouchot successfully demonstrated a solar steam engine, but couldn't continue development because of cheap coal and other factors.\n\n\n  \n1917 Patent drawing of Shuman's solar collector\n\n\n\nIn 1897, Frank Shuman, a U.S. inventor, engineer and solar energy pioneer, built a small demonstration solar engine that worked by reflecting solar energy onto square boxes filled with ether, which has a lower boiling point than water, and were fitted internally with black pipes which in turn powered a steam engine. In 1908 Shuman formed the Sun Power Company with the intent of building larger solar power plants. He, along with his technical advisor A.S.E. Ackermann and British physicist Sir Charles Vernon Boys,[citation needed] developed an improved system using mirrors to reflect solar energy upon collector boxes, increasing heating capacity to the extent that water could now be used instead of ether. Shuman then constructed a full-scale steam engine powered by low-pressure water, enabling him to patent the entire solar engine system by 1912.\n\nShuman built the world's first solar thermal power station in Maadi, Egypt, between 1912 and 1913. His plant used parabolic troughs to power a 45–52 kilowatts (60–70 hp) engine that pumped more than 22,000 litres (4,800 imp gal; 5,800 US gal) of water per minute from the Nile River to adjacent cotton fields. Although the outbreak of World War I and the discovery of cheap oil in the 1930s discouraged the advancement of solar energy, Shuman's vision and basic design were resurrected in the 1970s with a new wave of interest in solar thermal energy.[21] In 1916 Shuman was quoted in the media advocating solar energy's utilization, saying:\n\n\nWe have proved the commercial profit of sun power in the tropics and have more particularly proved that after our stores of oil and coal are exhausted the human race can receive unlimited power from the rays of the sun.\n— Frank Shuman, New York Times, 2 July 1916[22]\n\n\n\nWater heating\n\nMain articles: Solar hot water and Solar combisystem\n\n  \nSolar water heaters facing the Sun to maximize gain\n\n\n\nSolar hot water systems use sunlight to heat water. In low geographical latitudes (below 40 degrees) from 60 to 70% of the domestic hot water use with temperatures up to 60 °C can be provided by solar heating systems.[23] The most common types of solar water heaters are evacuated tube collectors (44%) and glazed flat plate collectors (34%) generally used for domestic hot water; and unglazed plastic collectors (21%) used mainly to heat swimming pools.[24]\n\nAs of 2007, the total installed capacity of solar hot water systems was approximately 154 thermal gigawatt (GWth).[25] China is the world leader in their deployment with 70 GWth installed as of 2006 and a long-term goal of 210 GWth by 2020.[26] Israel and Cyprus are the per capita leaders in the use of solar hot water systems with over 90% of homes using them.[27] In the United States, Canada, and Australia, heating swimming pools is the dominant application of solar hot water with an installed capacity of 18 GWth as of 2005.[19]\n\n\nHeating, cooling and ventilation\n\nMain articles: Solar heating, Thermal mass, Solar chimney, and Solar air conditioning\n\nIn the United States, heating, ventilation and air conditioning (HVAC) systems account for 30% (4.65 EJ/yr) of the energy used in commercial buildings and nearly 50% (10.1 EJ/yr) of the energy used in residential buildings.[28][29] Solar heating, cooling and ventilation technologies can be used to offset a portion of this energy.\n\n\n  \nMIT's Solar House #1, built in 1939 in the U.S., used seasonal thermal energy storage for year-round heating.\n\n\n\nThermal mass is any material that can be used to store heat—heat from the Sun in the case of solar energy. Common thermal mass materials include stone, cement and water. Historically they have been used in arid climates or warm temperate regions to keep buildings cool by absorbing solar energy during the day and radiating stored heat to the cooler atmosphere at night. However, they can be used in cold temperate areas to maintain warmth as well. The size and placement of thermal mass depend on several factors such as climate, daylighting and shading conditions. When properly incorporated, thermal mass maintains space temperatures in a comfortable range and reduces the need for auxiliary heating and cooling equipment.[30]\n\nA solar chimney (or thermal chimney, in this context) is a passive solar ventilation system composed of a vertical shaft connecting the interior and exterior of a building. As the chimney warms, the air inside is heated causing an updraft that pulls air through the building. Performance can be improved by using glazing and thermal mass materials[31] in a way that mimics greenhouses.\n\nDeciduous trees and plants have been promoted as a means of controlling solar heating and cooling. When planted on the southern side of a building in the northern hemisphere or the northern side in the southern hemisphere, their leaves provide shade during the summer, while the bare limbs allow light to pass during the winter.[32] Since bare, leafless trees shade 1/3 to 1/2 of incident solar radiation, there is a balance between the benefits of summer shading and the corresponding loss of winter heating.[33] In climates with significant heating loads, deciduous trees should not be planted on the Equator-facing side of a building because they will interfere with winter solar availability. They can, however, be used on the east and west sides to provide a degree of summer shading without appreciably affecting winter solar gain.[34]\n\n\nCooking\n\nMain article: Solar cooker\n\n  \nParabolic dish produces steam for cooking, in Auroville, India\n\n\n\nSolar cookers use sunlight for cooking, drying and pasteurization. They can be grouped into three broad categories: box cookers, panel cookers and reflector cookers.[35] The simplest solar cooker is the box cooker first built by Horace de Saussure in 1767.[36] A basic box cooker consists of an insulated container with a transparent lid. It can be used effectively with partially overcast skies and will typically reach temperatures of 90–150 °C (194–302 °F).[37] Panel cookers use a reflective panel to direct sunlight onto an insulated container and reach temperatures comparable to box cookers. Reflector cookers use various concentrating geometries (dish, trough, Fresnel mirrors) to focus light on a cooking container. These cookers reach temperatures of 315 °C (599 °F) and above but require direct light to function properly and must be repositioned to track the Sun.[38]\n\n\nProcess heat\n\nMain articles: Solar pond, Salt evaporation pond, and Solar furnace\n\nSolar concentrating technologies such as parabolic dish, trough and Scheffler reflectors can provide process heat for commercial and industrial applications. The first commercial system was the Solar Total Energy Project (STEP) in Shenandoah, Georgia, US where a field of 114 parabolic dishes provided 50% of the process heating, air conditioning and electrical requirements for a clothing factory. This grid-connected cogeneration system provided 400 kW of electricity plus thermal energy in the form of 401 kW steam and 468 kW chilled water, and had a one-hour peak load thermal storage.[39] Evaporation ponds are shallow pools that concentrate dissolved solids through evaporation. The use of evaporation ponds to obtain salt from seawater is one of the oldest applications of solar energy. Modern uses include concentrating brine solutions used in leach mining and removing dissolved solids from waste streams.[40] Clothes lines, clotheshorses, and clothes racks dry clothes through evaporation by wind and sunlight without consuming electricity or gas. In some states of the United States legislation protects the \"right to dry\" clothes.[41] Unglazed transpired collectors (UTC) are perforated sun-facing walls used for preheating ventilation air. UTCs can raise the incoming air temperature up to 22 °C (40 °F) and deliver outlet temperatures of 45–60 °C (113–140 °F).[42] The short payback period of transpired collectors (3 to 12 years) makes them a more cost-effective alternative than glazed collection systems.[42] As of 2003, over 80 systems with a combined collector area of 35,000 square metres (380,000 sq ft) had been installed worldwide, including an 860 m2 (9,300 sq ft) collector in Costa Rica used for drying coffee beans and a 1,300 m2 (14,000 sq ft) collector in Coimbatore, India, used for drying marigolds.[43]\n\n\nWater treatment\n\nMain articles: Solar still, Solar water disinfection, Solar desalination, and Solar Powered Desalination Unit\n\n  \nSolar water disinfection in Indonesia\n\n\n\nSolar distillation can be used to make saline or brackish water potable. The first recorded instance of this was by 16th-century Arab alchemists.[44] A large-scale solar distillation project was first constructed in 1872 in the Chilean mining town of Las Salinas.[45] The plant, which had solar collection area of 4,700 m2 (51,000 sq ft), could produce up to 22,700 L (5,000 imp gal; 6,000 US gal) per day and operate for 40 years.[45] Individual still designs include single-slope, double-slope (or greenhouse type), vertical, conical, inverted absorber, multi-wick, and multiple effect. These stills can operate in passive, active, or hybrid modes. Double-slope stills are the most economical for decentralized domestic purposes, while active multiple effect units are more suitable for large-scale applications.[44]\n\nSolar water disinfection (SODIS) involves exposing water-filled plastic polyethylene terephthalate (PET) bottles to sunlight for several hours.[46] Exposure times vary depending on weather and climate from a minimum of six hours to two days during fully overcast conditions.[47] It is recommended by the World Health Organization as a viable method for household water treatment and safe storage.[48] Over two million people in developing countries use this method for their daily drinking water.[47]\n\nSolar energy may be used in a water stabilization pond to treat waste water without chemicals or electricity. A further environmental advantage is that algae grow in such ponds and consume carbon dioxide in photosynthesis, although algae may produce toxic chemicals that make the water unusable.[49][50]\n\n\nMolten salt technology\n\nMolten salt can be employed as a thermal energy storage method to retain thermal energy collected by a solar tower or solar trough of a concentrated solar power plant, so that it can be used to generate electricity in bad weather or at night. It was demonstrated in the Solar Two project from 1995–1999. The system is predicted to have an annual efficiency of 99%, a reference to the energy retained by storing heat before turning it into electricity, versus converting heat directly into electricity.[51][52][53] The molten salt mixtures vary. The most extended mixture contains sodium nitrate, potassium nitrate and calcium nitrate. It is non-flammable and nontoxic, and has already been used in the chemical and metals industries as a heat-transport fluid, so experience with such systems exists in non-solar applications.\n\nThe salt melts at 131 °C (268 °F). It is kept liquid at 288 °C (550 °F) in an insulated \"cold\" storage tank. The liquid salt is pumped through panels in a solar collector where the focused irradiance heats it to 566 °C (1,051 °F). It is then sent to a hot storage tank. This is so well insulated that the thermal energy can be usefully stored for up to a week.[54]\n\nWhen electricity is needed, the hot salt is pumped to a conventional steam-generator to produce superheated steam for a turbine/generator as used in any conventional coal, oil, or nuclear power plant. A 100-megawatt turbine would need a tank about 9.1 metres (30 ft) tall and 24 metres (79 ft) in diameter to drive it for four hours by this design.\n\nSeveral parabolic trough power plants in Spain[55] and solar power tower developer SolarReserve use this thermal energy storage concept. The Solana Generating Station in the U.S. has six hours of storage by molten salt. The María Elena plant[56]  is a 400 MW thermo-solar complex in the northern Chilean region of Antofagasta employing molten salt technology.\n\n\nElectricity production\n\nMain article: Solar power\n\n\n\n\n\n\n\nSome of the world's largest solar power stations: Ivanpah (CSP) and Topaz (PV)\n\n\n\n\nSolar power is the conversion of sunlight into electricity, either directly using photovoltaics (PV), or indirectly using concentrated solar power (CSP). CSP systems use lenses or mirrors and tracking systems to focus a large area of sunlight into a small beam. PV converts light into electric current using the photoelectric effect.\n\nSolar power is anticipated to become the world's largest source of electricity by 2050, with solar photovoltaics and concentrated solar power contributing 16 and 11 percent to the global overall consumption, respectively.[57] In 2016, after another year of rapid growth, solar generated 1.3% of global power.[58]\n\nCommercial concentrated solar power plants were first developed in the 1980s. The 392 MW Ivanpah Solar Power Facility, in the Mojave Desert of California, is the largest solar power plant in the world. Other large concentrated solar power plants include the 150 MW Solnova Solar Power Station and the 100 MW Andasol solar power station, both in Spain. The 250 MW Agua Caliente Solar Project, in the United States, and the 221 MW Charanka Solar Park in India, are the world's largest photovoltaic plants. Solar projects exceeding 1 GW are being developed, but most of the deployed photovoltaics are in small rooftop arrays of less than 5 kW, which are connected to the grid using net metering and/or a feed-in tariff.[59]\n\n\nPhotovoltaics\n\nMain article: Photovoltaics\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n50,000\n\n\n\n100,000\n\n\n\n150,000\n\n\n\n200,000\n\n\n\n\n\n\n2006\n\n\n\n2010\n\n\n\n2014\n\n\n\n\n\n\n\n\n\n\n\n\n      Europe\n\n      Asia-Pacific\n\n      Americas\n\n      China\n\n      Middle East and Africa\n\nWorldwide growth of PV capacity grouped by region in MW (2006–2014)\n\n\n\n\n\n\n\nIn the last two decades, photovoltaics (PV), also known as solar PV, has evolved from a pure niche market of small scale applications towards becoming a mainstream electricity source. A solar cell is a device that converts light directly into electricity using the photoelectric effect. The first solar cell was constructed by Charles Fritts in the 1880s.[60] In 1931 a German engineer, Dr Bruno Lange, developed a photo cell using silver selenide in place of copper oxide.[61] Although the prototype selenium cells converted less than 1% of incident light into electricity, both Ernst Werner von Siemens and James Clerk Maxwell recognized the importance of this discovery.[62] Following the work of Russell Ohl in the 1940s, researchers Gerald Pearson, Calvin Fuller and Daryl Chapin created the crystalline silicon solar cell in 1954.[63] These early solar cells cost 286 USD/watt and reached efficiencies of 4.5–6%.[64] By 2012 available efficiencies exceeded 20%, and the maximum efficiency of research photovoltaics was in excess of 40%.[65]\n\n\nConcentrated solar power\n\nSee also: Concentrated solar power\n\nConcentrating Solar Power (CSP) systems use lenses or mirrors and tracking systems to focus a large area of sunlight into a small beam. The concentrated heat is then used as a heat source for a conventional power plant. A wide range of concentrating technologies exists; the most developed are the parabolic trough, the concentrating linear fresnel reflector, the Stirling dish and the solar power tower. Various techniques are used to track the Sun and focus light. In all of these systems a working fluid is heated by the concentrated sunlight, and is then used for power generation or energy storage.[66]\n\n\nArchitecture and urban planning\n\nMain articles: Passive solar building design and Urban heat island\n\n  \nDarmstadt University of Technology, Germany, won the 2007 Solar Decathlon in Washington, DC with this passive house designed for humid and hot subtropical climate.[67]\n\n\n\nSunlight has influenced building design since the beginning of architectural history.[68] Advanced solar architecture and urban planning methods were first employed by the Greeks and Chinese, who oriented their buildings toward the south to provide light and warmth.[69]\n\nThe common features of passive solar architecture are orientation relative to the Sun, compact proportion (a low surface area to volume ratio), selective shading (overhangs) and thermal mass.[68] When these features are tailored to the local climate and environment they can produce well-lit spaces that stay in a comfortable temperature range. Socrates' Megaron House is a classic example of passive solar design.[68] The most recent approaches to solar design use computer modeling tying together solar lighting, heating and ventilation systems in an integrated solar design package.[70] Active solar equipment such as pumps, fans and switchable windows can complement passive design and improve system performance.\n\nUrban heat islands (UHI) are metropolitan areas with higher temperatures than that of the surrounding environment. The higher temperatures result from increased absorption of solar energy by urban materials such as asphalt and concrete, which have lower albedos and higher heat capacities than those in the natural environment. A straightforward method of counteracting the UHI effect is to paint buildings and roads white, and to plant trees in the area. Using these methods, a hypothetical \"cool communities\" program in Los Angeles has projected that urban temperatures could be reduced by approximately 3 °C at an estimated cost of US$1 billion, giving estimated total annual benefits of US$530 million from reduced air-conditioning costs and healthcare savings.[71]\n\n\nAgriculture and horticulture\n\n  \nGreenhouses like these in the Westland municipality of the Netherlands grow vegetables, fruits and flowers.\n\n\n\nAgriculture and horticulture seek to optimize the capture of solar energy in order to optimize the productivity of plants. Techniques such as timed planting cycles, tailored row orientation, staggered heights between rows and the mixing of plant varieties can improve crop yields.[72][73] While sunlight is generally considered a plentiful resource, the exceptions highlight the importance of solar energy to agriculture. During the short growing seasons of the Little Ice Age, French and English farmers employed fruit walls to maximize the collection of solar energy. These walls acted as thermal masses and accelerated ripening by keeping plants warm. Early fruit walls were built perpendicular to the ground and facing south, but over time, sloping walls were developed to make better use of sunlight. In 1699, Nicolas Fatio de Duillier even suggested using a tracking mechanism which could pivot to follow the Sun.[74] Applications of solar energy in agriculture aside from growing crops include pumping water, drying crops, brooding chicks and drying chicken manure.[43][75] More recently the technology has been embraced by vintners, who use the energy generated by solar panels to power grape presses.[76]\n\nGreenhouses convert solar light to heat, enabling year-round production and the growth (in enclosed environments) of specialty crops and other plants not naturally suited to the local climate. Primitive greenhouses were first used during Roman times to produce cucumbers year-round for the Roman emperor Tiberius.[77] The first modern greenhouses were built in Europe in the 16th century to keep exotic plants brought back from explorations abroad.[78] Greenhouses remain an important part of horticulture today, and plastic transparent materials have also been used to similar effect in polytunnels and row covers.\n\n\nTransport\n\nMain articles: Solar vehicle, Solar-charged vehicle, Electric boat, and Solar balloon\n\n\n\nWinner of the 2013 World Solar Challenge in Australia\n\n\n\nSolar electric aircraft circumnavigating the globe in 2015\n\n\n\n\n\nDevelopment of a solar-powered car has been an engineering goal since the 1980s. The World Solar Challenge is a biannual solar-powered car race, where teams from universities and enterprises compete over 3,021 kilometres (1,877 mi) across central Australia from Darwin to Adelaide. In 1987, when it was founded, the winner's average speed was 67 kilometres per hour (42 mph) and by 2007 the winner's average speed had improved to 90.87 kilometres per hour (56.46 mph).[79]\nThe North American Solar Challenge and the planned South African Solar Challenge are comparable competitions that reflect an international interest in the engineering and development of solar powered vehicles.[80][81]\n\nSome vehicles use solar panels for auxiliary power, such as for air conditioning, to keep the interior cool, thus reducing fuel consumption.[82][83]\n\nIn 1975, the first practical solar boat was constructed in England.[84] By 1995, passenger boats incorporating PV panels began appearing and are now used extensively.[85] In 1996, Kenichi Horie made the first solar-powered crossing of the Pacific Ocean, and the Sun21 catamaran made the first solar-powered crossing of the Atlantic Ocean in the winter of 2006–2007.[86] There were plans to circumnavigate the globe in 2010.[87]\n\nIn 1974, the unmanned AstroFlight Sunrise airplane made the first solar flight. On 29 April 1979, the Solar Riser made the first flight in a solar-powered, fully controlled, man-carrying flying machine, reaching an altitude of 40 ft (12 m). In 1980, the Gossamer Penguin made the first piloted flights powered solely by photovoltaics. This was quickly followed by the Solar Challenger which crossed the English Channel in July 1981. In 1990 Eric Scott Raymond in 21 hops flew from California to North Carolina using solar power.[88] Developments then turned back to unmanned aerial vehicles (UAV) with the Pathfinder (1997) and subsequent designs, culminating in the Helios which set the altitude record for a non-rocket-propelled aircraft at 29,524 metres (96,864 ft) in 2001.[89] The Zephyr, developed by BAE Systems, is the latest in a line of record-breaking solar aircraft, making a 54-hour flight in 2007, and month-long flights were envisioned by 2010.[90] As of 2016, Solar Impulse, an electric aircraft, is currently circumnavigating the globe. It is a single-seat plane powered by solar cells and capable of taking off under its own power. The design allows the aircraft to remain airborne for several days.[91]\n\nA solar balloon is a black balloon that is filled with ordinary air. As sunlight shines on the balloon, the air inside is heated and expands causing an upward buoyancy force, much like an artificially heated hot air balloon. Some solar balloons are large enough for human flight, but usage is generally limited to the toy market as the surface-area to payload-weight ratio is relatively high.[92]\n\n\nFuel production\n\n  \nConcentrated solar panels are getting a power boost. Pacific Northwest National Laboratory (PNNL) will be testing a new concentrated solar power system – one that can help natural gas power plants reduce their fuel usage by up to 20 percent.\n\n\n\nMain articles: Solar chemical, Solar fuel, and Artificial photosynthesis\n\nSolar chemical processes use solar energy to drive chemical reactions. These processes offset energy that would otherwise come from a fossil fuel source and can also convert solar energy into storable and transportable fuels. Solar induced chemical reactions can be divided into thermochemical or photochemical.[93] A variety of fuels can be produced by artificial photosynthesis.[94] The multielectron catalytic chemistry involved in making carbon-based fuels (such as methanol) from reduction of carbon dioxide is challenging; a feasible alternative is hydrogen production from protons, though use of water as the source of electrons (as plants do) requires mastering the multielectron oxidation of two water molecules to molecular oxygen.[95] Some have envisaged working solar fuel plants in coastal metropolitan areas by 2050 –  the splitting of sea water providing hydrogen to be run through adjacent fuel-cell electric power plants and the pure water by-product going directly into the municipal water system.[96] Another vision involves all human structures covering the earth's surface (i.e., roads, vehicles and buildings) doing photosynthesis more efficiently than plants.[97]\n\nHydrogen production technologies have been a significant area of solar chemical research since the 1970s. Aside from electrolysis driven by photovoltaic or photochemical cells, several thermochemical processes have also been explored. One such route uses concentrators to split water into oxygen and hydrogen at high temperatures (2,300–2,600 °C or 4,200–4,700 °F).[98] Another approach uses the heat from solar concentrators to drive the steam reformation of natural gas thereby increasing the overall hydrogen yield compared to conventional reforming methods.[99] Thermochemical cycles characterized by the decomposition and regeneration of reactants present another avenue for hydrogen production. The Solzinc process under development at the Weizmann Institute of Science uses a 1 MW solar furnace to decompose zinc oxide (ZnO) at temperatures above 1,200 °C (2,200 °F). This initial reaction produces pure zinc, which can subsequently be reacted with water to produce hydrogen.[100]\n\n\nEnergy storage methods\n\nMain articles: Energy storage, Seasonal thermal energy storage, Phase change material, Grid energy storage, and V2G\n\n  \nThermal energy storage. The Andasol CSP plant uses tanks of molten salt to store solar energy.\n\n\n\nThermal mass systems can store solar energy in the form of heat at domestically useful temperatures for daily or interseasonal durations. Thermal storage systems generally use readily available materials with high specific heat capacities such as water, earth and stone. Well-designed systems can lower peak demand, shift time-of-use to off-peak hours and reduce overall heating and cooling requirements.[101][102]\n\nPhase change materials such as paraffin wax and Glauber's salt are another thermal storage medium. These materials are inexpensive, readily available, and can deliver domestically useful temperatures (approximately 64 °C or 147 °F). The \"Dover House\" (in Dover, Massachusetts) was the first to use a Glauber's salt heating system, in 1948.[103] Solar energy can also be stored at high temperatures using molten salts. Salts are an effective storage medium because they are low-cost, have a high specific heat capacity and can deliver heat at temperatures compatible with conventional power systems. The Solar Two project used this method of energy storage, allowing it to store 1.44 terajoules (400,000 kWh) in its 68 m³ storage tank with an annual storage efficiency of about 99%.[104]\n\nOff-grid PV systems have traditionally used rechargeable batteries to store excess electricity. With grid-tied systems, excess electricity can be sent to the transmission grid, while standard grid electricity can be used to meet shortfalls. Net metering programs give household systems a credit for any electricity they deliver to the grid. This is handled by 'rolling back' the meter whenever the home produces more electricity than it consumes. If the net electricity use is below zero, the utility then rolls over the kilowatt hour credit to the next month.[105] Other approaches involve the use of two meters, to measure electricity consumed vs. electricity produced. This is less common due to the increased installation cost of the second meter. Most standard meters accurately measure in both directions, making a second meter unnecessary.\n\nPumped-storage hydroelectricity stores energy in the form of water pumped when energy is available from a lower elevation reservoir to a higher elevation one. The energy is recovered when demand is high by releasing the water, with the pump becoming a hydroelectric power generator.[106]\n\n\nDevelopment, deployment and economics\n\n  \nParticipants in a workshop on sustainable development inspect solar panels at Monterrey Institute of Technology and Higher Education, Mexico City on top of a building on campus.\n\n\n\nFurther information: Deployment of solar power to energy grids\nSee also: Cost of electricity by source and Renewable energy by country\n\nBeginning with the surge in coal use which accompanied the Industrial Revolution, energy consumption has steadily transitioned from wood and biomass to fossil fuels. The early development of solar technologies starting in the 1860s was driven by an expectation that coal would soon become scarce. However, development of solar technologies stagnated in the early 20th century in the face of the increasing availability, economy, and utility of coal and petroleum.[107]\n\nThe 1973 oil embargo and 1979 energy crisis caused a reorganization of energy policies around the world and brought renewed attention to developing solar technologies.[108][109] Deployment strategies focused on incentive programs such as the Federal Photovoltaic Utilization Program in the U.S. and the Sunshine Program in Japan. Other efforts included the formation of research facilities in the U.S. (SERI, now NREL), Japan (NEDO), and Germany (Fraunhofer Institute for Solar Energy Systems ISE).[110]\n\nCommercial solar water heaters began appearing in the United States in the 1890s.[111] These systems saw increasing use until the 1920s but were gradually replaced by cheaper and more reliable heating fuels.[112] As with photovoltaics, solar water heating attracted renewed attention as a result of the oil crises in the 1970s but interest subsided in the 1980s due to falling petroleum prices. Development in the solar water heating sector progressed steadily throughout the 1990s and annual growth rates have averaged 20% since 1999.[25] Although generally underestimated, solar water heating and cooling is by far the most widely deployed solar technology with an estimated capacity of 154 GW as of 2007.[25]\n\nThe International Energy Agency has said that solar energy can make considerable contributions to solving some of the most urgent problems the world now faces:[1]\n\n\n\nThe development of affordable, inexhaustible and clean solar energy technologies will have huge longer-term benefits. It will increase countries’ energy security through reliance on an indigenous, inexhaustible and mostly import-independent resource, enhance sustainability, reduce pollution, lower the costs of mitigating climate change, and keep fossil fuel prices lower than otherwise. These advantages are global. Hence the additional costs of the incentives for early deployment should be considered learning investments; they must be wisely spent and need to be widely shared.[1]\n\n\n\n\nIn 2011, a report by the International Energy Agency found that solar energy technologies such as photovoltaics, solar hot water and concentrated solar power could provide a third of the world's energy by 2060 if politicians commit to limiting climate change. The energy from the Sun could play a key role in de-carbonizing the global economy alongside improvements in energy efficiency and imposing costs on greenhouse gas emitters. \"The strength of solar is the incredible variety and flexibility of applications, from small scale to big scale\".[113]\n\n\n\nWe have proved ... that after our stores of oil and coal are exhausted the human race can receive unlimited power from the rays of the sun.\n— Frank Shuman, New York Times, 2 July 1916[22]\n\n\n\nISO standards\n\nThe International Organization for Standardization has established several standards relating to solar energy equipment. For example, ISO 9050 relates to glass in building while ISO 10217 relates to the materials used in solar water heaters.\n\n\nSee also\n\n\n\tRenewable energy portal\n\tEnergy portal\n\tTechnology portal\n\n\n\n\n\tAirmass\n\tArtificial photosynthesis\n\tCommunity solar farm\n\tCopper in renewable energy\n\tDesertec\n\tGlobal dimming\n\tGreasestock\n\tGreen electricity\n\tHeliostat\n\tList of conservation topics\n\tList of renewable energy organizations\n\tList of solar energy topics\n\tPhotovoltaic system\n\tRenewable heat\n\tRenewable energy by country\n\tSoil solarization\n\tSolar Decathlon\n\tSolar easement\n\tSolar energy use in rural Africa\n\tSolar updraft tower\n\tSolar power satellite\n\tSolar tracker\n\tSolarEdge\n\tTimeline of solar cells\n\n\n\n\nReferences\n\n\n\t^ a b c d \"Solar Energy Perspectives: Executive Summary\" (PDF). International Energy Agency. 2011. Archived from the original (PDF) on 13 January 2012.\n\n\t^ \"Energy\". rsc.org. 2014-04-02.\n\n\n\t^ \"2014 Key World Energy Statistics\" (PDF). iea.org. IEA. 2014. pp. 6, 24, 28. Archived (PDF) from the original on 5 April 2015.\n\n\n\t^ a b c d e f \"Energy and the challenge of sustainability\" (PDF). United Nations Development Programme and World Energy Council. September 2000. Retrieved 17 January 2017.\n\n\n\t^ Smil (1991), p. 240\n\n\t^ \"Natural Forcing of the Climate System\". Intergovernmental Panel on Climate Change. Archived from the original on 29 September 2007. Retrieved 29 September 2007.\n\n\n\t^ \"Radiation Budget\". NASA Langley Research Center. 17 October 2006. Retrieved 29 September 2007.\n\n\n\t^ Somerville, Richard. \"Historical Overview of Climate Change Science\" (PDF). Intergovernmental Panel on Climate Change. Retrieved 29 September 2007.\n\n\n\t^ Vermass, Wim. \"An Introduction to Photosynthesis and Its Applications\". Arizona State University. Archived from the original on 3 December 1998. Retrieved 29 September 2007.\n\n\n\t^ a b Smil (2006), p. 12\n\n\t^ Morton, Oliver (6 September 2006). \"Solar energy: A new day dawning?: Silicon Valley sunrise\". Nature. 443 (7107): 19–22. Bibcode:2006Natur.443...19M. doi:10.1038/443019a. PMID 16957705.\n\n\n\t^ Lewis, N. S.; Nocera, D. G. (2006). \"Powering the Planet: Chemical challenges in solar energy utilization\" (PDF). Proceedings of the National Academy of Sciences. 103 (43): 15729. Bibcode:2006PNAS..10315729L. doi:10.1073/pnas.0603395103. PMID 17043226. Retrieved 7 August 2008.\n\n\n\t^ \"Energy conversion by photosynthetic organisms\". Food and Agriculture Organization of the United Nations. Retrieved 25 May 2008.\n\n\n\t^ \"Exergy Flow Charts – GCEP\". stanford.edu.\n\n\n\t^ Archer, Cristina; Jacobson, Mark. \"Evaluation of Global Wind Power\". Stanford. Retrieved 3 June 2008.\n\n\n\t^ \"Renewable Energy Sources\" (PDF). Renewable and Appropriate Energy Laboratory. p. 12. Archived from the original (PDF) on 19 November 2012. Retrieved 6 December 2012.\n\n\n\t^ \"Total Primary Energy Consumption\". Energy Information Administration. Retrieved 30 June 2013.\n\n\n\t^ \"Total Electricity Net Consumption\". Energy Information Administration. Retrieved 30 June 2013.\n\n\n\t^ a b Philibert, Cédric (2005). \"The Present and Future use of Solar Thermal Energy as a Primary Source of Energy\" (PDF). IEA. Archived (PDF) from the original on 26 April 2012.\n\n\n\t^ \"Solar Energy Technologies and Applications\". Canadian Renewable Energy Network. Archived from the original on 25 June 2002. Retrieved 22 October 2007.\n\n\n\t^ Smith, Zachary Alden; Taylor, Katrina D. (2008). Renewable And Alternative Energy Resources: A Reference Handbook. ABC-CLIO. p. 174. ISBN 978-1-59884-089-6.\n\n\n\t^ a b \"American Inventor Uses Egypt's Sun for Power – Appliance Concentrates the Heat Rays and Produces Steam, Which Can Be Used to Drive Irrigation Pumps in Hot Climates\" (PDF). nytimes.com. 2 July 1916.\n\n\n\t^ \"Renewables for Heating and Cooling\" (PDF). International Energy Agency. Retrieved 13 August 2015.\n\n\n\t^ Weiss, Werner; Bergmann, Irene; Faninger, Gerhard. \"Solar Heat Worldwide (Markets and Contributions to the Energy Supply 2005)\" (PDF). International Energy Agency. Retrieved 30 May 2008.\n\n\n\t^ a b c Weiss, Werner; Bergmann, Irene; Faninger, Gerhard. \"Solar Heat Worldwide – Markets and Contribution to the Energy Supply 2006\" (PDF). International Energy Agency. Retrieved 9 June 2008.\n\n\n\t^ \"Renewables 2007 Global Status Report\" (PDF). Worldwatch Institute. Archived from the original (PDF) on 29 May 2008. Retrieved 30 April 2008.\n\n\n\t^ Del Chiaro, Bernadette; Telleen-Lawton, Timothy. \"Solar Water Heating (How California Can Reduce Its Dependence on Natural Gas)\" (PDF). Environment California Research and Policy Center. Archived from the original (PDF) on 27 September 2007. Retrieved 29 September 2007.\n\n\n\t^ Apte, J.;  et al. \"Future Advanced Windows for Zero-Energy Homes\" (PDF). American Society of Heating, Refrigerating and Air-Conditioning Engineers. Archived from the original (PDF) on 10 April 2008. Retrieved 9 April 2008.\n\n\n\t^ \"Energy Consumption Characteristics of Commercial Building HVAC Systems Volume III: Energy Savings Potential\" (PDF). United States Department of Energy. Retrieved 24 June 2008.\n\n\n\t^ Mazria (1979), pp. 29–35\n\n\t^ Bright, David (18 February 1977). \"Passive solar heating simpler for the average owner\". Bangor Daily News. Retrieved 3 July 2011.\n\n\n\t^ Mazria (1979), p. 255\n\n\t^ Balcomb (1992), p. 56\n\n\t^ Balcomb (1992), p. 57\n\n\t^ Anderson and Palkovic (1994), p. xi\n\n\t^ Butti and Perlin (1981), pp. 54–59\n\n\t^ Anderson and Palkovic (1994), p. xii\n\n\t^ Anderson and Palkovic (1994), p. xiii\n\n\t^ Stine, W.B. & Harrigan, R.W. (1982). \"Shenandoah Solar Total Energy Project\". NASA Sti/Recon Technical Report N. John Wiley. 83: 25168. Bibcode:1982STIN...8325168L. Retrieved 20 July 2008.\n\n\n\t^ Bartlett (1998), pp. 393–94\n\n\t^ Thomson-Philbrook, Julia. \"Right to Dry Legislation in New England and Other States\". Connecticut General Assembly. Retrieved 27 May 2008.\n\n\n\t^ a b \"Solar Buildings (Transpired Air Collectors – Ventilation Preheating)\" (PDF). National Renewable Energy Laboratory. Retrieved 29 September 2007.\n\n\n\t^ a b Leon (2006), p. 62\n\n\t^ a b Tiwari (2003), pp. 368–71\n\n\t^ a b Daniels (1964), p. 6\n\n\t^ \"SODIS solar water disinfection\". EAWAG (The Swiss Federal Institute for Environmental Science and Technology). Retrieved 2 May 2008.\n\n\n\t^ a b \"Household Water Treatment Options in Developing Countries: Solar Disinfection (SODIS)\" (PDF). Centers for Disease Control and Prevention. Archived from the original (PDF) on 29 May 2008. Retrieved 13 May 2008.\n\n\n\t^ \"Household Water Treatment and Safe Storage\". World Health Organization. Retrieved 2 May 2008.\n\n\n\t^ Shilton A.N.; Powell N.; Mara D.D.; Craggs R. (2008). \"Solar-powered aeration and disinfection, anaerobic co-digestion, biological CO(2) scrubbing and biofuel production: the energy and carbon management opportunities of waste stabilization ponds\". Water Sci. Technol. 58 (1): 253–58. doi:10.2166/wst.2008.666. PMID 18653962.\n\n\n\t^ Tadesse I.; Isoaho S.A.; Green F.B.; Puhakka J.A. (2003). \"Removal of organics and nutrients from tannery effluent by advanced integrated Wastewater Pond Systems technology\". Water Sci. Technol. 48 (2): 307–14. doi:10.2166/wst.2003.0135. PMID 14510225.\n\n\n\t^ Mancini, Tom (10 January 2006). \"Advantages of Using Molten Salt\". Sandia National Laboratories. Archived from the original on 5 June 2011. Retrieved 2011-07-14.\n\n\n\t^ Molten salt energy storage system – A feasibility study Jones, B.G.; Roy, R.P.; Bohl, R.W. (1977) – Smithsonian/NASA ADS Physics Abstract Service. Abstract accessed December 2007\n\n\t^ Biello, David. \"How to Use Solar Energy at Night\". Scientific American. Scientific American, a Division of Nature America, Inc. Retrieved 19 June 2011.\n\n\n\t^ Ehrlich, Robert, 2013, Renewable Energy: A First Course, CRC Press, Chap. 13.1.22 Thermal storage p. 375 \nISBN 978-1-4398-6115-8\n\n\t^ Parabolic Trough Thermal Energy Storage Technology Archived 2013-09-01 at the Wayback Machine  Parabolic Trough Solar Power Network. April 04, 2007. Accessed December 2007\n\n\t^ Here comes the sun Chile greenlights enormous 400-megawatt solar project www.thisischile.cl Friday, August 23, 2013 retrieved August 30, 2013\n\n\t^ International Energy Agency (2014). \"Technology Roadmap: Solar Photovoltaic Energy\" (PDF). iea.org. IEA. Archived (PDF) from the original on 1 October 2014. Retrieved 7 October 2014.\n\n\n\t^ http://www.bp.com/en/global/corporate/energy-economics/statistical-review-of-world-energy/renewable-energy/solar-energy.html\n\n\t^ \"Grid Connected Renewable Energy: Solar Electric Technologies\" (PDF). energytoolbox.org.\n\n\n\t^ Perlin (1999), p. 147\n\n\t^ \"Magic Plates, Tap Sun For Power\", June 1931, Popular Science. Bonnier Corporation. June 1931. Retrieved 19 April 2011.\n\n\n\t^ Perlin (1999), pp. 18–20\n\n\t^ Perlin (1999), p. 29\n\n\t^ Perlin (1999), pp. 29–30, 38\n\n\t^ Antonio Luque. \"Will we exceed 50% efficiency in photovoltaics?\". aip.org. Archived from the original on 2016-05-15.\n\n\n\t^ Martin and Goswami (2005), p. 45\n\n\t^ \"Darmstadt University of Technology solar decathlon home design\". Darmstadt University of Technology. Archived from the original on 18 October 2007. Retrieved 25 April 2008.\n\n\n\t^ a b c Schittich (2003), p. 14\n\n\t^ Butti and Perlin (1981), pp. 4, 159\n\n\t^ Balcomb (1992)\n\n\t^ Rosenfeld, Arthur;  et al. \"Painting the Town White – and Green\". Heat Island Group. Archived from the original on 14 July 2007. Retrieved 29 September 2007.\n\n\n\t^ Jeffrey C. Silvertooth. \"Row Spacing, Plant Population, and Yield Relationships\". University of Arizona. Retrieved 24 June 2008.\n\n\n\t^ Kaul (2005), pp. 169–74\n\n\t^ Butti and Perlin (1981), pp. 42–46\n\n\t^ Bénard (1981), p. 347\n\n\t^ \"A Powerhouse Winery\". News Update. Novus Vinum. 27 October 2008. Retrieved 5 November 2008.\n\n\n\t^ Butti and Perlin (1981), p. 19\n\n\t^ Butti and Perlin (1981), p. 41\n\n\t^ \"The World Solar Challenge – The Background\" (PDF). Australian and New Zealand Solar Energy Society. Archived from the original (PDF) on 19 July 2008. Retrieved 5 August 2008.\n\n\n\t^ \"North American Solar Challenge\". New Resources Group. Retrieved 3 July 2008.\n\n\n\t^ \"South African Solar Challenge\". Advanced Energy Foundation. Archived from the original on 12 June 2008. Retrieved 3 July 2008.\n\n\n\t^ \"Vehicle auxiliary power applications for solar cells\" (PDF). 1991. Retrieved 11 October 2008.\n\n\n\t^ \"Archived copy\". Archived from the original on 2009-05-05. Retrieved 2011-03-29.CS1 maint: archived copy as title (link)\n\n\n\t^ Electrical Review Vol. 201, No. 7, 12 August 1977\n\n\t^ Schmidt, Theodor. \"Solar Ships for the new Millennium\". TO Engineering. Archived from the original on 9 October 2007. Retrieved 30 September 2007.\n\n\n\t^ \"The sun21 completes the first transatlantic crossing with a solar powered boat\". Transatlantic 21. Retrieved 30 September 2007.\n\n\n\t^ \"PlanetSolar, the first solar-powered round-the-world voyage\". PlanetSolar. Retrieved 20 November 2016.\n\n\n\t^ \"Archived copy\". Archived from the original on 2008-02-08. Retrieved 2008-02-08.CS1 maint: archived copy as title (link)\n\n\n\t^ \"Solar-Power Research and Dryden\". NASA. Retrieved 30 April 2008.\n\n\n\t^ \"The NASA ERAST HALE UAV Program\". Greg Goebel. Archived from the original on 10 February 2008. Retrieved 30 April 2008.\n\n\n\t^ Solar Impulse Project. \"HB-SIA Mission\". Archived from the original on 26 July 2011. Retrieved 5 December 2009.\n\n\n\t^ \"Phenomena which affect a solar balloon\". pagesperso-orange.fr. Retrieved 19 August 2008.\n\n\n\t^ Bolton (1977), p. 1\n\n\t^ Wasielewski M.R. Photoinduced electron transfer in supramolecular systems for artificial photosynthesis. Chem. Rev. 1992; 92: 435–61.\n\n\t^ Hammarstrom L. and Hammes-Schiffer S. Artificial Photosynthesis and Solar Fuels. Accounts of Chemical Research 2009; 42 (12): 1859–60.\n\n\t^ Gray H.B. Powering the planet with solar fuel. Nature Chemistry 2009; 1: 7.\n\n\t^ \"Artificial photosynthesis as a frontier technology for energy sustainability – Energy & Environmental Science (RSC Publishing)\". rsc.org.\n\n\n\t^ Agrafiotis (2005), p. 409\n\n\t^ Zedtwitz (2006), p. 1333\n\n\t^ \"Solar Energy Project at the Weizmann Institute Promises to Advance the use of Hydrogen Fuel\". Weizmann Institute of Science. Archived from the original on 6 April 2008. Retrieved 25 June 2008.\n\n\n\t^ Balcomb(1992), p. 6\n\n\t^ \"Request for Participation Summer 2005 Demand Shifting with Thermal Mass\" (PDF). Demand Response Research Center. Archived from the original (PDF) on 7 September 2008. Retrieved 26 November 2007.\n\n\n\t^ Butti and Perlin (1981), pp. 212–14\n\n\t^ \"Advantages of Using Molten Salt\". Sandia National Laboratory. Retrieved 29 September 2007.\n\n\n\t^ \"PV Systems and Net Metering\". Department of Energy. Archived from the original on 4 July 2008. Retrieved 31 July 2008.\n\n\n\t^ \"Pumped Hydro Storage\". Electricity Storage Association. Archived from the original on 21 June 2008. Retrieved 31 July 2008.\n\n\n\t^ Butti and Perlin (1981), pp. 63, 77, 101\n\n\t^ Butti and Perlin (1981), p. 249\n\n\t^ Yergin (1991), pp. 634, 653–73\n\n\t^ \"Chronicle of Fraunhofer-Gesellschaft\". Fraunhofer-Gesellschaft. Retrieved 4 November 2007.\n\n\n\t^ Butti and Perlin (1981), p. 117\n\n\t^ Butti and Perlin (1981), p. 139\n\n\t^ \"IEA Says Solar May Provide a Third of Global Energy by 2060\". Bloomberg Businessweek. 1 December 2011.\n\n\n\n\n\n\nFurther reading\n\n\n\tAgrafiotis, C.;  et al. (2005). \"Solar water splitting for hydrogen production with monolithic reactors\". Solar Energy. 79 (4): 409–21. Bibcode:2005SoEn...79..409A. doi:10.1016/j.solener.2005.02.026.\n\n\tAnderson, Lorraine; Palkovic, Rick (1994). Cooking with Sunshine (The Complete Guide to Solar Cuisine with 150 Easy Sun-Cooked Recipes). Marlowe & Company. ISBN 978-1-56924-300-8.\n\n\tBalcomb, J. Douglas (1992). Passive Solar Buildings. Massachusetts Institute of Technology. ISBN 978-0-262-02341-2.\n\n\tBénard, C.; Gobin, D.; Gutierrez, M. (1981). \"Experimental Results of a Latent-Heat Solar-Roof, Used for Breeding Chickens\". Solar Energy. 26 (4): 347–59. Bibcode:1981SoEn...26..347B. doi:10.1016/0038-092X(81)90181-X.\n\n\tBolton, James (1977). Solar Power and Fuels. Academic Press, Inc. ISBN 978-0-12-112350-5.\n\n\tBradford, Travis (2006). Solar Revolution: The Economic Transformation of the Global Energy Industry. MIT Press. ISBN 978-0-262-02604-8.\n\n\tButti, Ken; Perlin, John (1981). A Golden Thread (2500 Years of Solar Architecture and Technology). Van Nostrand Reinhold. ISBN 978-0-442-24005-9.\n\n\tCarr, Donald E. (1976). Energy & the Earth Machine. W.W. Norton & Co. ISBN 978-0-393-06407-0.\n\n\tDaniels, Farrington (1964). Direct Use of the Sun's Energy. Ballantine Books. ISBN 978-0-345-25938-7.\n\n\tDenzer, Anthony (2013). The Solar House: Pioneering Sustainable Design. Rizzoli. ISBN 978-0-8478-4005-2. Archived from the original on 2013-07-26.\n\n\tHalacy, Daniel (1973). The Coming Age of Solar Energy. Harper and Row. ISBN 978-0-380-00233-7.\n\n\tHunt, V. Daniel (1979). Energy Dictionary. Van Nostrand Reinhold Co. ISBN 978-0-442-27395-8.\n\n\tKaran, Kaul;  et al. (2001). \"Row Orientation Affects Fruit Yield in Field-Grown Okra\". Journal of Sustainable Agriculture. 17 (2/3): 169–74. doi:10.1300/J064v17n02_14.\n\n\tLeon, M.; Kumar, S. (2007). \"Mathematical modeling and thermal performance analysis of unglazed transpired solar collectors\". Solar Energy. 81 (1): 62–75. Bibcode:2007SoEn...81...62L. doi:10.1016/j.solener.2006.06.017.\n\n\tLieth, Helmut; Whittaker, Robert (1975). Primary Productivity of the Biosphere. Springer-Verlag1. ISBN 978-0-387-07083-4.\n\n\tMartin, Christopher L.; Goswami, D. Yogi (2005). Solar Energy Pocket Reference. International Solar Energy Society. ISBN 978-0-9771282-0-4.\n\n\tMazria, Edward (1979). The Passive Solar Energy Book. Rondale Press. ISBN 978-0-87857-238-0.\n\n\tMeier, Anton;  et al. (2005). \"Solar chemical reactor technology for industrial production of lime\". Solar Energy. 80 (10): 1355–62. Bibcode:2006SoEn...80.1355M. doi:10.1016/j.solener.2005.05.017.\n\n\tMills, David (2004). \"Advances in solar thermal electricity technology\". Solar Energy. 76 (1–3): 19–31. Bibcode:2004SoEn...76...19M. doi:10.1016/S0038-092X(03)00102-6.\n\n\tMüller, Reto; Steinfeld, A. (2007). \"Band-approximated radiative heat transfer analysis of a solar chemical reactor for the thermal dissociation of zinc oxide\". Solar Energy. 81 (10): 1285–94. Bibcode:2007SoEn...81.1285M. doi:10.1016/j.solener.2006.12.006.\n\n\tPerlin, John (1999). From Space to Earth (The Story of Solar Electricity). Harvard University Press. ISBN 978-0-674-01013-0.\n\n\tBartlett, Robert (1998). Solution Mining: Leaching and Fluid Recovery of Materials. Routledge. ISBN 978-90-5699-633-8.\n\n\tScheer, Hermann (2002). The Solar Economy (Renewable Energy for a Sustainable Global Future). Earthscan Publications Ltd. ISBN 978-1-84407-075-6.\n\n\tSchittich, Christian (2003). Solar Architecture (Strategies Visions Concepts). Architektur-Dokumentation GmbH & Co. KG. ISBN 978-3-7643-0747-9.\n\n\tSmil, Vaclav (1991). General Energetics: Energy in the Biosphere and Civilization. Wiley. p. 369. ISBN 978-0-471-62905-4.\n\n\tSmil, Vaclav (2003). Energy at the Crossroads: Global Perspectives and Uncertainties. MIT Press. p. 443. ISBN 978-0-262-19492-1.\n\n\tSmil, Vaclav (2006). Energy at the Crossroads. Organisation for Economic Co-operation and Development. ISBN 978-0-262-19492-1. Retrieved 29 September 2007.\n\n\tTabor, H.Z.; Doron, B. (1990). \"The Beith Ha'Arava 5 MW(e) Solar Pond Power Plant (SPPP) – Progress Report\". Solar Energy. 45 (4): 247–53. Bibcode:1990SoEn...45..247T. doi:10.1016/0038-092X(90)90093-R.\n\n\tTiwari, G.N.; Singh, H.N.; Tripathi, R. (2003). \"Present status of solar distillation\" (PDF). Solar Energy. 75 (5): 367–73. Bibcode:2003SoEn...75..367T. doi:10.1016/j.solener.2003.07.005.\n\n\tTritt, T.; Böttner, H.; Chen, L. (2008). \"Thermoelectrics: Direct Solar Thermal Energy Conversion\". MRS Bulletin. 33 (4): 355–72. doi:10.1557/mrs2008.73.\n\n\tTzempelikos, Athanassios; Athienitis, Andreas K. (2007). \"The impact of shading design and control on building cooling and lighting demand\". Solar Energy. 81 (3): 369–82. Bibcode:2007SoEn...81..369T. doi:10.1016/j.solener.2006.06.015.\n\n\tVecchia, A.;  et al. (1981). \"Possibilities for the Application of Solar Energy in the European Community Agriculture\". Solar Energy. 26 (6): 479–89. Bibcode:1981SoEn...26..479D. doi:10.1016/0038-092X(81)90158-4.\n\n\tYergin, Daniel (1991). The Prize: The Epic Quest for Oil, Money, and Power. Simon & Schuster. p. 885. ISBN 978-0-671-79932-8.\n\n\tZedtwitz, P.V.;  et al. (2006). \"Hydrogen production via the solar thermal decarbonization of fossil fuels\". Solar Energy. 80 (10): 1333–37. Bibcode:2006SoEn...80.1333Z. doi:10.1016/j.solener.2005.06.007.\n\n\n\n\n\nExternal links\n\n\t\tWikimedia Commons has media related to Solar energy.\n\n\n\t\"How do Photovoltaics Work?\". NASA.\n\n\tRenewable Energy: Solar at Curlie\n\tSolar Energy Back in the Day – slideshow by Life magazine\n\tU.S. Solar Farm Map (1 MW or Higher)\n\tOnline Resources Database on Solar in Developing Countries\n\tOnline resources and news from the nonprofit American Solar Energy Society\n\t\"Journal article traces dramatic advances in solar efficiency\". SPIE Newsroom. Retrieved 4 November 2015.\n\n\n\n\t\tv\n\tt\n\te\n\n\nSolar energy\n\n\t\n\tOutline\n\tTimeline\n\tIndex\n\n\n\n\n\tConcepts\t\n\tThe Sun\n\tSolar irradiance\n\tActive and passive solar energy\n\n\n\n\n\tSolar power\t\n\tThermal\t\n\tPassive solar building design\n\tSolar water heating\n\tSolar chimney\n\tSolar air conditioning\n\tThermal mass\n\tSolar pond\n\n\n\n\n\tPhotovoltaics\nand related topics\t\n\tPhotovoltaic effect\n\tSolar cell\n\tPolymer solar cell\n\tNanocrystal solar cell\n\tPhotovoltaic module (solar panel)\n\tPhotovoltaic array (and systems)\n\tPhotovoltaic power station\n\tFloating solar\n\n\n\n\n\tConcentrated\t\n\tHeliostat\n\tSolar tracker\n\tParabolic trough\n\tSolar power tower\n\n\n\n\n\tExperimental\nand proposed\t\n\tSolar updraft tower\n\tSolar-pumped laser\n\tThermoelectric generator\n\tSolar chemical and artificial photosynthesis\n\tSpace-based solar power\n\tSolar sail\n\tMagnetic sail\n\tSolar thermal rocket\n\n\n\n\n\tBy country\t\n\tAustralia\n\tAustria\n\tAlbania\n\tBelgium\n\tBrazil\n\tCanada\n\tChina\n\tCzech\n\tDenmark\n\tGeorgia\n\tGermany\n\tGreece\n\tIndia\n\tIsrael\n\tItaly\n\tJapan\n\tLithuania\n\tMexico\n\tMorocco\n\tMyanmar\n\tNetherlands\n\tNew Zealand\n\tPakistan\n\tPortugal\n\tRomania\n\tSaudi Arabia\n\tSomalia\n\tSouth Africa\n\tSpain\n\tThailand\n\tTurkey\n\tUkraine\n\tUnited Kingdom\n\tUnited States\n\tYemen\n\n\n\n\n\n\n\n\tDistribution\nand uses\t\n\tStorage\t\n\tThermal mass\n\tThermal energy storage\n\tPhase change material\n\tGrid energy storage\n\n\n\n\n\tAdoption\t\n\tFeed-in tariff\n\tNet metering\n\tFinancial incentives for photovoltaics\n\tCosts\n\n\n\n\n\tApplications\t\n\tSolar water heating\n\tSolar vehicle\n\tElectric aircraft\n\tElectric boat\n\tSolar balloon\n\n\n\n\n\n\n\n\tOther applications\t\n\tAgriculture\nand horticulture\t\n\tGreenhouse\n\tPolytunnel\n\tRow cover\n\tSolar-powered pump\n\n\n\n\n\tBuilding\tPassive solar building design\n\tBuilding-integrated photovoltaics\n\tUrban heat island\n\n\n\n\tLighting\t\n\tHybrid solar lighting\n\tSolar lamp\n\tSolar Tuki\n\tLight tube\n\tDaylighting\n\n\n\n\tProcess heat\t\n\tSolar pond\n\tSolar furnace\n\tSalt evaporation pond\n\n\n\n\n\tCooking\t\n\tSolar cooker\n\n\n\n\n\tDisinfection\t\n\tSolar water disinfection\n\tSoil solarization\n\n\n\n\n\tDesalination\t\n\tSolar still\n\tDesalination\n\n\n\n\n\tWater heating\t\n\tSolar water heating\n\tSolar combisystem\n\tZero carbon solar controller\n\n\n\n\n\n\n\n\tSee also\t\n\tPhotovoltaics topics\n\tSolar power by country\n\tRenewable energy sources\n\n\n\n\n\t\n\tCategory\n\t Commons\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSolar power by country\n\n\tOverview\t\n\tGrowth of photovoltaics\n\tList of photovoltaics companies\n\tList of countries by photovoltaics production\n\n\n\n\n\tAfrica\t\n\tAlgeria\n\tMorocco\n\tSomalia\n\tSouth Africa\n\n\n\n\n\tAsia\t\n\tChina\n\tGeorgia\n\tIndia\n\tIsrael\n\tJapan\n\tMyanmar\n\tPakistan\n\tSaudi Arabia\n\tSouth Korea\n\tTaiwan\n\tThailand\n\tUAE\n\tYemen\n\n\n\n\n\tEurope\t\n\tAlbania\n\tAustria\n\tBelgium\n\tBelarus\n\tBulgaria\n\tCyprus\n\tCzech\n\tDenmark\n\tFinland\n\tFrance\n\tGermany\n\tGreece\n\tItaly\n\tLithuania\n\tNetherlands\n\tPoland\n\tPortugal\n\tRomania\n\tSpain\n\tSwitzerland\n\tTurkey\n\tUkraine\n\tUnited Kingdom\n\n\n\n\n\tNorth America\t\n\tCanada\n\tJamaica\n\tMexico\n\tUnited States\n\n\n\n\n\tOceania\t\n\tAustralia\n\tNew Zealand\n\n\n\n\n\tSouth America\t\n\tBrazil\n\tChile\n\n\n\n\n\t\n\tPortals: Energy\n\tRenewable energy\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nPhotovoltaics\n\n\tConcepts\t\n\tTechnology\t\n\tPhotovoltaics\n\tPhotoelectric effect\n\tSolar insolation\n\tSolar constant\n\tSolar cell efficiency\n\tQuantum efficiency\n\n\n\tNominal power (Watt-peak)\n\tThin-film solar cell\n\tMulti-junction solar cell\n\tThird-generation photovoltaic cell\n\tSolar cell research\n\tThermophotovoltaic\n\tThermodynamic efficiency limit\n\tSun-free photovoltaics\n\tPolarizing organic photovoltaics\n\n\n\n\n\tMaterials\t\n\tList of semiconductor materials\n\tCrystalline silicon (c-Si)\n\tPolycrystalline silicon (multi-Si)\n\tMonocrystalline silicon (mono-Si)\n\tCadmium telluride\n\tCopper indium gallium selenide\n\tAmorphous silicon (a-Si)\n\n\n\n\n\tHistory\t\n\tGrowth of photovoltaics\n\tTimeline of solar cells\n\n\n\n\n\n\n\t\n\n\tPhotovoltaic system\t\n\tSolar cells\t\n\tNanocrystal solar cell\n\tOrganic solar cell\n\tQuantum dot solar cell\n\tHybrid solar cell\n\tPlasmonic solar cell\n\tCarbon nanotubes in photovoltaics\n\tDye-sensitized solar cell\n\tCadmium telluride photovoltaics\n\tCopper indium gallium selenide solar cells\n\tPrinted solar panel\n\tPerovskite solar cell\n\n\n\n\n\tSystem components\t\n\tSolar panel\n\tBalance of system\n\tSolar charge controller\n\tSolar inverter\n\tSolar micro-inverter\n\tSolar cable\n\tPhotovoltaic mounting system\n\tMaximum power point tracker\n\tSolar tracker\n\tSolar shingles\n\tSolar mirror\n\tSynchronverter\n\n\n\n\n\tSystem concepts\t\n\tPerturb and observe method\n\tIncremental conductance method\n\tConstant voltage method\n\tFill factor\n\tConcentrated photovoltaics\n\tPhotovoltaic thermal hybrid solar collector\n\tSpace-based solar power\n\n\n\n\n\n\n\n\tApplications\t\n\tAppliances\t\n\tSolar-powered refrigerator\n\tSolar air conditioning\n\tSolar lamp\n\tSolar charger\n\tSolar backpack\n\tSolar tree\n\tSolar-powered pump\n\tSolar-powered watch\n\tSolar Tuki\n\tPhotovoltaic keyboard\n\tSolar road stud\n\tSolar cell phone charger\n\tSolar notebook\n\tSolar-powered calculator\n\tSolar-powered fountain\n\tSolar-powered radio\n\tSolar-powered flashlight\n\tSolar-powered fan\n\tSolar street light\n\tSolar traffic light\n\n\n\n\n\tLand transport\t\n\tSolar vehicle\n\tSolar car\n\tSolar roadway\n\tSolar golf cart\n\tThe Quiet Achiever\n\tSunmobile\n\n\n\n\n\tAir transport\t\n\tElectric aircraft\n\tMauro Solar Riser\n\tSolar panels on spacecraft\n\tSolar-Powered Aircraft Developments Solar One\n\tGossamer Penguin\n\tQinetiq Zephyr\n\tSolar Challenger\n\n\n\n\n\tWater transport\t\n\tSolar boat\n\n\n\n\n\tSolar vehicle racing\t\n\tSolar car racing\n\tList of solar car teams\n\tSolar challenges\n\tWorld Solar Challenge\n\tAmerican Solar Challenge\n\tFormula Sun Grand Prix\n\tSolar Cup\n\tFrisian Solar Challenge\n\tSolar Splash\n\tSouth African Solar Challenge\n\tTour de Sol\n\tHunt-Winston School Solar Car Challenge\n\tVictorian Model Solar Vehicle Challenge\n\n\n\n\n\n\n\n\tGeneration systems\t\n\tPV power station\t\n\tGrid-connected photovoltaic power system\n\tList of photovoltaic power stations\n\n\n\n\n\tIndividual projects\t\n\tAlamosa photovoltaic power plant\n\tBeneixama photovoltaic power plant\n\tBlythe Photovoltaic Power Plant\n\tCopper Mountain Solar Facility\n\tDarro Solar Park\n\tErlasee Solar Park\n\tGolmud Solar Park\n\tGottelborn Solar Park\n\tGuadarranque solar power plant\n\tKöthen Solar Park\n\tMoura Photovoltaic Power Station\n\tOlmedilla Photovoltaic Park\n\tPocking Solar Park\n\tPuertollano Photovoltaic Park\n\tTopaz Solar Farm\n\tWyandot Solar Facility\n\n\n\n\n\tBuilding-mounted\t\n\tRooftop photovoltaic power station\n\tBuilding-integrated photovoltaics\n\tSolar Ark\n\tStrasskirchen Solar Park\n\n\n\n\n\tBy country\t\n\tAustralia\n\tBelgium\n\tBulgaria\n\tCanada\n\tChile\n\tChina\n\tCzech Republic\n\tFrance\n\tGermany\n\tGreece\n\tIndia\n\tItaly\n\tJapan\n\tNetherlands\n\tRomania\n\tSouth Africa\n\tSpain\n\tSwitzerland\n\tThailand\n\tUnited Kingdom\n\tUSA\n\n\n\n\n\n\n\n\tPV companies\t\n\tBy country\t\n\tList of countries by photovoltaics production\n\n\n\n\n\tIndividual producers\t\n\tFirst Solar\n\tHanwha Q CELLS\n\tJA Solar\n\tMotech Solar\n\tREC\n\tSharp\n\tSolar Frontier\n\tSolyndra\n\tSungen Solar\n\tSunpower\n\tSuntech\n\tTrina Solar\n\tYingli Solar\n\n\n\n\n\n\n\n\t\n\t Category\n\t Commons\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nThe Sun\n\n\tInternal structure\t\n\tCore\n\tRadiation zone\n\tTachocline\n\tConvection zone\n\n\n\n\t\n\n\n\tAtmosphere\t\n\tPhotosphere\t\n\tSupergranulation\n\tGranule\n\tFaculae\n\tSunspot\n\n\n\n\n\tChromosphere\t\n\tPlage\n\tSpicule\n\tMoreton wave\n\n\n\n\n\tCorona\t\n\tTransition region\n\tCoronal hole\n\tCoronal loop\n\tCoronal mass ejection\n\tProminence\n\tHelmet streamer\n\tSupra-arcade downflows\n\n\n\n\n\n\n\n\tVariation\t\n\tSolar cycle\n\tList of solar cycles\n\n\n\tSolar maximum\n\tSolar minimum\n\tWolf number\n\tSolar wind\n\tFlare\n\tHelioseismology\n\n\n\n\n\tHeliosphere\t\n\tCurrent sheet\n\tTermination shock\n\tHeliosheath\n\tHeliopause\n\tBow shock\n\n\n\n\n\tRelated\t\n\tHeliophysics\n\tSolar activity\n\tSolar astronomy\n\tSolar dynamo\n\tEclipse\n\tSolar energy\n\tSolar neutrino\n\tSolar observation\n\tSolar phenomena\n\tSolar physics\n\tSolar System\n\tSolar telescope\n\tSolar time\n\tSpace climate\n\tSpace weather\n\tStandard solar model\n\tStar\n\tSunlight radiation\n\n\n\n\n\t\n\tSpectral class: G-type main-sequence star\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNatural resources\n\n\tAir\t\n\tPollution / quality\t\n\tAmbient standards (USA)\n\tIndex\n\tIndoor\n\tdeveloping nations\n\n\n\tLaw\n\tClean Air Act (USA)\n\n\n\tOzone depletion\n\n\n\n\n\tEmissions\t\n\tAirshed\n\tTrading\n\tDeforestation (REDD)\n\n\n\n\n\n\n\t\n\n\tEnergy\t\n\tLaw\n\tResources\n\tFossil fuels (peak oil)\n\tGeothermal\n\tHydro\n\ttidal\n\twave\n\n\n\tNuclear\n\tSolar\n\tsunlight\n\tshade\n\n\n\tWind\n\n\n\n\n\tLand\t\n\tArable\n\tpeak farmland\n\n\n\tDegradation\n\tLaw\n\tproperty\n\n\n\tManagement\n\thabitat conservation\n\n\n\tMinerals\n\tmining\n\tlaw\n\tsand\n\n\n\tpeak\n\trights\n\n\n\tSoil\n\tconservation\n\tfertility\n\thealth\n\tresilience\n\n\n\tUse\n\tplanning\n\treserve\n\n\n\n\n\n\n\tLife\t\n\tBiodiversity\n\tBioprospecting\n\tBiosphere\n\tBushfood\n\tBushmeat\n\tFisheries\n\tlaw\n\tmanagement\n\n\n\tFood\n\tForests\n\tgenetic resources\n\tlaw\n\tmanagement\n\n\n\tGame\n\tlaw\n\n\n\tGene bank\n\tHerbalist plants\n\tMarine conservation\n\tNon-timber forest products\n\tRangeland\n\tSeed bank\n\tWildlife\n\tconservation\n\tmanagement\n\n\n\tWood\n\n\n\n\n\tWater\t\n\tTypes / location\t\n\tAquifer\n\tstorage and recovery\n\n\n\tDrinking\n\tFresh\n\tGroundwater\n\tpollution\n\trecharge\n\tremediation\n\n\n\tHydrosphere\n\tIce\n\tbergs\n\tglacial\n\tpolar\n\n\n\tIrrigation\n\thuerta\n\n\n\tRain\n\tharvesting\n\n\n\tStormwater\n\tSurface water\n\tWastewater\n\treclaimed\n\n\n\n\n\n\n\tAspects\t\n\tDesalination\n\tFloods\n\tLaw\n\tLeaching\n\tSanitation\n\tConflict\n\tConservation\n\tPeak water\n\tPollution\n\tPrivatization\n\tQuality\n\tRight\n\tResources\n\tmanagement\n\tpolicy\n\n\n\n\n\n\n\n\n\n\tRelated\t\n\t\n\tCommons\n\tenclosure\n\tglobal\n\tland\n\ttragedy of\n\n\n\tEconomics\n\tecological\n\tland\n\n\n\tEcosystem services\n\tExploitation\n\toverexploitation\n\tEarth Overshoot Day\n\n\n\tManagement\n\tadaptive\n\n\n\tNatural capital\n\taccounting\n\n\n\tNature reserve\n\tSystems ecology\n\tUrban ecology\n\tWilderness\n\n\n\n\n\tResource\t\n\tCommon-pool\n\tConflict (perpetuation)\n\tCurse\n\tDepletion\n\tExtraction\n\tNationalism\n\tRenewable / Non-renewable\n\n\n\n\n\n\n\n\t\n\t Category\n\n\n\n\n\n\n\n\n\n\n\tAuthority control \t\n\tGND: 4055572-0\n\tHDS: 27601\n\tNARA: 10642565\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Solar_energy&oldid=916123553\"\n\n\t\t\n\t\tCategories: \tSolar energy\n\tEnergy conversion\n\tAlternative energy\n\n\nHidden categories: \tCS1: Julian–Gregorian uncertainty\n\tWebarchive template wayback links\n\tCS1 maint: archived copy as title\n\tWikipedia indefinitely semi-protected pages\n\tArticles with short description\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from December 2016\n\tCommons category link from Wikidata\n\tArticles with Curlie links\n\tGood articles\n\tWikipedia articles with GND identifiers\n\tWikipedia articles with HDS identifiers\n\tWikipedia articles with NARA identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tView source\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tالعربية\n\tAragonés\n\tAsturianu\n\tAzərbaycanca\n\tBân-lâm-gú\n\tБашҡортса\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tभोजपुरी\n\tБългарски\n\tBosanski\n\tBrezhoneg\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFøroyskt\n\tFrançais\n\tFrysk\n\tGaeilge\n\tGalego\n\t贛語\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tKiswahili\n\tКыргызча\n\tLadino\n\tລາວ\n\tلۊری شومالی\n\tLatina\n\tLatviešu\n\tLietuvių\n\tLimburgs\n\tLingála\n\tMagyar\n\tमैथिली\n\tМакедонски\n\tMalagasy\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tမြန်မာဘာသာ\n\tNederlands\n\tनेपाल भाषा\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tਪੰਜਾਬੀ\n\tPatois\n\tPolski\n\tPortuguês\n\tRomână\n\tRuna Simi\n\tРусский\n\tScots\n\tShqip\n\tSicilianu\n\tSimple English\n\tسنڌي\n\tSlovenčina\n\tSlovenščina\n\tSoomaaliga\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tతెలుగు\n\tไทย\n\tತುಳು\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\tWalon\n\t文言\n\tWinaray\n\t吴语\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 17 September 2019, at 04:34 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "14", "dc:title": "Solar energy - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.23", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Neapolitan_Sunset.jpg/1200px-Neapolitan_Sunset.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-solar_energy", "title": "Solar energy - Wikipedia"}}