{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSpace debris - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tSpace debris\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\"Space junk\" redirects here. For other uses, see Space Junk (disambiguation).\n\n\n\n\n  \nA computer-generated image representing space debris as could be seen from high Earth orbit. The two main debris fields are the ring of objects in geosynchronous Earth orbit (GEO) and the cloud of objects in low Earth orbit (LEO).\n\n\n\nInitially, the term space debris referred to the natural debris found in the Solar System: asteroids, comets, and meteoroids. However, with the 1979 beginning of the NASA Orbital Debris Program,[1] the term also refers to the debris (alt. space waste or space garbage) from the mass of defunct, artificially created objects in space, especially Earth orbit. These include old satellites and spent rocket stages, as well as the fragments from their disintegration and collisions.\n\nAs of December 2016, five satellite collisions have generated space debris.[citation needed]  Space debris is also known as orbital debris, space junk, space waste, space trash, space litter or space garbage.[2]\n\nAs of 5 July 2016[update], the United States Strategic Command tracked a total of 17,852 artificial objects in orbit above the Earth,[3] including 1,419 operational satellites.[4] However, these are just objects large enough to be tracked. As of January 2019[update], more than 128 million bits of debris smaller than 1 cm (0.4 in), about 900,000 pieces of debris 1–10 cm, and around 34,000 of pieces larger than 10 cm were estimated to be in orbit around the Earth.[5] Collisions with debris have become a hazard to spacecraft; they cause damage akin to sandblasting, especially to solar panels and optics like telescopes or star trackers that cannot be covered with a ballistic Whipple shield (unless it is transparent).[6]\n\nBelow 2,000 km (1,200 mi) Earth-altitude, pieces of debris are denser than meteoroids; most are dust from solid rocket motors, surface erosion debris like paint flakes, and frozen coolant from RORSAT (nuclear-powered satellites). \nFor comparison, the International Space Station orbits in the 300–400 kilometres (190–250 mi) range, and the 2009 satellite collision and 2007 antisat test occurred at 800 to 900 kilometres (500 to 560 mi) altitude.[7] The ISS has Whipple shielding; however, known debris with a collision chance over 1/10,000 are avoided by maneuvering the station.\n\nThe Kessler syndrome, a runaway chain reaction of collisions exponentially increasing the amount of debris, has been hypothesized to ensue beyond a critical density. This could affect useful polar-orbiting bands, increases the cost of protection for spacecraft missions and could destroy live satellites. Whether Kessler syndrome is already underway has been debated.[8][9] The measurement, mitigation, and potential removal of debris are conducted by some participants in the space industry.\n\n\nContents\n\n\n\t1 Characterization\n\t1.1 Size\n\t1.2 Low Earth orbit (LEO)\n\t1.3 Higher altitudes\n\n\n\n\t2 Sources\n\t2.1 Dead spacecraft\n\t2.2 Lost equipment\n\t2.3 Boosters\n\t2.4 Weapons\n\n\n\n\t3 Threats\n\t3.1 To spacecraft\n\t3.1.1 Uncrewed spacecraft\n\t3.1.2 Crewed spacecraft\n\t3.1.2.1 Space Shuttle missions\n\t3.1.2.2 Mir\n\t3.1.2.3 International Space Station\n\n\n\n\t3.1.3 Kessler syndrome\n\n\n\n\t3.2 To Earth\n\n\n\n\t4 Tracking and measurement\n\t4.1 Tracking from the ground\n\t4.2 Measurement in space\n\t4.3 Gabbard diagrams\n\n\n\n\t5 Dealing with debris\n\t5.1 Growth mitigation\n\t5.2 Self-removal\n\t5.3 External removal\n\t5.3.1 Remotely controlled vehicles\n\t5.3.2 Laser methods\n\t5.3.3 Nets\n\t5.3.4 Harpoon\n\n\n\n\t5.4 International regulation\n\n\n\n\t6 History and shielding technologies\n\t6.1 Micrometeoroids\n\t6.2 Micrometeoroid shielding\n\t6.3 NORAD, Gabbard and Kessler\n\t6.4 Follow-up studies\n\t6.5 A new Kessler syndrome\n\t6.6 Debris growth\n\n\n\n\t7 In popular culture\n\t8 See also\n\t9 References\n\t9.1 Notes\n\t9.2 Bibliography\n\n\n\n\t10 Further reading\n\t11 External links\n\n\n\n\n\nCharacterization[edit]\n\nSize[edit]\n\nThere are estimated to be over 128 million pieces of debris smaller than 1 cm (0.39 in) as of January 2019. There are approximately 900,000 pieces from one to ten cm. The current count of large debris (defined as 10 cm across or larger[10]) is 34,000.[5] The technical measurement cutoff is c. 3 mm (0.12 in).[11] Over 98 percent of the 1,900 tons of debris in low Earth orbit (as of 2002) was accounted for by about 1,500 objects, each over 100 kg (220 lb).[12]  Total mass is mostly constant despite addition of many smaller objects, since they reenter the atmosphere sooner. Using a 2008 figure of 8,500 known items, it is estimated at 5,500 t (12,100,000 lb).[13]\n\n\nLow Earth orbit (LEO)[edit]\n\n  \nSpace debris in LEO, with sizes exaggerated\n\n\n\nIn LEO there are few \"universal orbits\" which keep spacecraft in particular rings (in contrast to GEO, a single widely used orbit). The closest are sun-synchronous orbits that keep a constant angle between the Sun and the orbital plane; they are polar, meaning they cross over the polar regions. LEO satellites orbit in many planes, up to 15 times a day, causing frequent approaches between objects (the density of objects is much higher in LEO).[14]\n\nOrbits are further changed by perturbations (which in LEO include unevenness of the Earth's gravitational field), and collisions can occur from any direction. For these reasons, the Kessler syndrome applies mostly to the LEO region; impacts occur at up to 16 km/s (twice the orbital speed) if head-on – the 2009 satellite collision occurred at 11.7 km/s,[15] creating much spall in the critical size range. These can cross other orbits and lead to a cascade effect. A large-enough collision (e.g. between a space station and a defunct satellite) could make low Earth orbit impassable.[8]\n\nManned missions are mostly at 400 km (250 mi) and below, where air drag helps clear zones of fragments. Atmospheric expansion as a result of space weather raises the critical altitude by increasing drag; in the 90s, it was a factor in reduced debris density.[16] Another was fewer launches by Russia; the USSR made most of their launches in the 1970s and 1980s.[17]\n\n\nHigher altitudes[edit]\n\nAt higher altitudes, where air drag is less significant, orbital decay takes longer. Slight atmospheric drag, lunar perturbations, Earth's gravity perturbations, solar wind and solar radiation pressure can gradually bring debris down to lower altitudes (where it decays), but at very high altitudes this may take millennia.[18] Although high-altitude orbits are less commonly used than LEO and the onset of the problem is slower, the numbers progress toward the critical threshold more quickly.[contradictory][page needed][19]\n\nMany communications satellites are in geostationary orbits (GEO), clustering over specific targets and sharing the same orbital path. Although velocities are low between GEO objects, when a satellite becomes derelict (such as Telstar 401) it assumes a geosynchronous orbit; its orbital inclination increases about .8° and its speed increases about 100 miles per hour (160 km/h) per year. Impact velocity peaks at about 1.5 km/s (0.93 mi/s). Orbital perturbations cause longitude drift of the inoperable spacecraft and precession of the orbital plane. Close approaches (within 50 meters) are estimated at one per year.[20] The collision debris pose less short-term risk than from an LEO collision, but the satellite would likely become inoperable. Large objects, such as solar-power satellites, are especially vulnerable to collisions.[21]\n\nAlthough the ITU now requires proof a satellite can be moved out of its orbital slot at the end of its lifespan, studies suggest this is insufficient.[22] Since GEO orbit is too distant to accurately measure objects under 1 m (3 ft 3 in), the nature of the problem is not well known.[23] Satellites could be moved to empty spots in GEO, requiring less maneuvring and making it easier to predict future motion.[24] Satellites or boosters in other orbits, especially stranded in geostationary transfer orbit, are an additional concern due to their typically high crossing velocity.\n\nDespite efforts to reduce risk, spacecraft collisions have occurred. The European Space Agency telecom satellite Olympus-1 was struck by a meteoroid on 11 August 1993 and eventually moved to a graveyard orbit.[25]  On 29 March 2006, the Russian Express-AM11 communications satellite was struck by an unknown object and rendered inoperable;[26] its engineers had enough contact time with the satellite to send it into a graveyard orbit.\n\n\nSources[edit]\n\nDead spacecraft[edit]\n\nSee also: Kosmos 954, Kosmos 1402, and Derelict satellites orbiting Earth\n\n  \nVanguard 1 is expected to remain in orbit for 240 years.[27]\n\n\n\nIn 1958, the United States launched Vanguard I into a medium Earth orbit (MEO). As of October 2009[update], it, and the upper stage of its launch rocket, are the oldest surviving man-made space objects still in orbit.[28][29] In a catalog of known launches until July 2009, the Union of Concerned Scientists listed 902 operational satellites[30] from a known population of 19,000 large objects and about 30,000 objects launched.\n\nAn example of additional derelict satellite debris are the remains of the 1970s/80s Soviet RORSAT naval surveillance satellite program. The satellite's BES-5 nuclear reactor were cooled with a coolant loop of sodium-potassium alloy, creating a potential problem when the satellite reached end of life. While many satellites were nominally boosted into medium-altitude graveyard orbits, not all were. Even satellites which had been properly moved to a higher orbit had an eight-percent probability of puncture and coolant release over a 50-year period. The coolant freezes into droplets of solid sodium-potassium alloy,[31] forming additional debris.[32][32]\n\nThese events continue to occur.  For example, in February 2015, the USAF Defense Meteorological Satellite Program Flight 13 (DMSP-F13) exploded on orbit, creating at least 149 debris objects, which were expected to remain in orbit for decades.[33]\n\nThe deliberate destruction of satellites in orbit. United States and USSR/Russia have conducted over 30 and 27 ASAT tests respectively followed by 10 from PRC and one from India. The most recent ASATs were Chinese interception of FY-1C, trials of Russian PL-19 Nudol, American interception of USA-193 and Indian interception of unstated live satellite.\n\n\nLost equipment[edit]\n\n  \nA drifting thermal blanket photographed in 1998 during STS-88.\n\n\n\nAccording to Edward Tufte's book Envisioning Information, space debris includes a glove lost by astronaut Ed White on the first American space-walk (EVA); a camera lost by Michael Collins near Gemini 10; a thermal blanket lost during STS-88; garbage bags jettisoned by Soviet cosmonauts during Mir's 15-year life,[28] a wrench and a toothbrush. Sunita Williams of STS-116 lost a camera during an EVA. During an STS-120 EVA to reinforce a torn solar panel, a pair of pliers was lost, and in an STS-126 EVA, Heidemarie Stefanyshyn-Piper lost a briefcase-sized tool bag.[34]\n\n\nBoosters[edit]\n\n  \nSpent upper stage of a Delta II rocket, photographed by the XSS 10 satellite\n\n\n\nIn characterizing the problem of space debris, it was learned that much debris was due to rocket upper stages (e.g. the Inertial Upper Stage) which end up in orbit, and break up due to decomposition of unvented unburned fuel.[35] However, a major known impact event involved an (intact) Ariane booster.[36] Although NASA and the United States Air Force now require upper-stage passivation, other launchers[vague] do not.\nLower stages, like the Space Shuttle's solid rocket boosters or Apollo program's Saturn IB launch vehicles, do not reach orbit.[37]\n\nOn 11 March 2000 a Chinese Long March 4 CBERS-1 upper stage exploded in orbit, creating a debris cloud.[38][39]\nA Russian Briz-M booster stage exploded in orbit over South Australia on 19 February 2007. Launched on 28 February 2006 carrying an Arabsat-4A communications satellite, it malfunctioned before it could use up its propellant. Although the explosion was captured on film by astronomers, due to the orbit path the debris cloud has been difficult to measure with radar. By 21 February 2007, over 1,000 fragments were identified.[40][41] A 14 February 2007 breakup was recorded by Celestrak.[42] Eight breakups occurred in 2006, the most since 1993.[43] Another Briz-M broke up on 16 October 2012 after a failed 6 August Proton-M launch. The amount and size of the debris was unknown.[44] A Long March 7 rocket booster created a fireball visible from portions of Utah, Nevada, Colorado, Idaho and California on the evening of 27 July 2016; its disintegration was widely reported on social media.[45]  In 2018-2019, three different Atlas V Centaur second stages have broken up.[46][47][48]\n\n\nWeapons[edit]\n\nA past debris source was the testing of anti-satellite weapons (ASATs) by the U.S. and Soviet Union during the 1960s and 1970s. North American Aerospace Defense Command (NORAD) files only contained data for Soviet tests, and debris from U.S. tests were only identified later.[49] By the time the debris problem was understood, widespread ASAT testing had ended; the U.S. Program 437 was shut down in 1975.[50]\n\nThe U.S. restarted their ASAT programs in the 1980s with the Vought ASM-135 ASAT. A 1985 test destroyed a 1-tonne (2,200 lb) satellite orbiting at 525 km (326 mi), creating thousands of debris larger than 1 cm (0.39 in). Due to the altitude, atmospheric drag decayed the orbit of most debris within a decade. A de facto moratorium followed the test.[51]\n\n\n  \nKnown orbit planes of Fengyun-1C debris one month after the weather satellite's disintegration by the Chinese ASAT\n\n\n\nChina's government was condemned for the military implications and the amount of debris from the 2007 anti-satellite missile test,[52] the largest single space debris incident in history (creating over 2,300 pieces golf-ball size or larger, over 35,000 1 cm (0.4 in) or larger, and one million pieces 1 mm (0.04 in) or larger). The target satellite orbited between 850 km (530 mi) and 882 km (548 mi), the portion of near-Earth space most densely populated with satellites.[53] Since atmospheric drag is low at that altitude the debris is slow to return to Earth, and in June 2007 NASA's Terra environmental spacecraft maneuvered to avoid impact from the debris.[54]\n\nOn 20 February 2008, the U.S. launched an SM-3 missile from the USS Lake Erie to destroy a defective U.S. spy satellite thought to be carrying 450 kg (1,000 lb) of toxic hydrazine propellant. The event occurred at about 250 km (155 mi), and the resulting debris has a perigee of 250 km (155 mi) or lower.[55] The missile was aimed to minimize the amount of debris, which (according to Pentagon Strategic Command chief Kevin Chilton) had decayed by early 2009.[56]\n\nOn 27 March 2019, Indian Prime Minister Narendra Modi announced that India shot down one of its own LEO satellites with a ground-based missile. He stated that the operation, part of Mission Shakti, would defend the country's interests in space.\nAfterwards, US Air Force Space Command announced they were tracking 270 new pieces of debris but expected the number to grow as data collection continues.[57]\n\nThe vulnerability of satellites to debris and the possibility of attacking LEO satellites to create debris clouds, has triggered speculation that it is possible for countries unable to make a precision attack.[clarification needed] An attack on a satellite of 10 tonnes or more would heavily damage the LEO environment.[51]\n\n\nThreats[edit]\n\n  \nA micrometeoroid left this crater on the surface of Space Shuttle Challenger's front window on STS-7.\n\n\n\nTo spacecraft[edit]\n\nSpace junk is a threat to active satellites and spaceships. The Earth's orbit may even become impassable as the risk of collision grows too high.[58]\n\n\nUncrewed spacecraft[edit]\n\nAlthough spacecraft are protected by Whipple shields, solar panels, which are exposed to the Sun, wear from low-mass impacts. These produce a cloud of plasma which is an electrical risk to the panels.[59]\n\nSatellites are believed to have been destroyed by micrometeorites and orbital debris (MMOD). The earliest suspected loss was of Kosmos 1275, which disappeared on 24 July 1981 (a month after launch). Kosmos contained no volatile propellant, therefore, there appeared to be nothing internal to the satellite which could have caused the destructive explosion which took place. However the case has not been proven and another hypothesis forwarded is that the battery exploded. Tracking showed it broke up, into 300 new objects.\n\nMany impacts have been confirmed since. Olympus-1 was struck by a meteoroid on 11 August 1993, and left adrift.[25] On 24 July 1996, the French microsatellite Cerise was hit by fragments of an Ariane-1 H-10 upper-stage booster which exploded in November 1986.[36] On 29 March 2006, the Russian Ekspress AM11 communications satellite was struck by an unknown object and rendered inoperable;[26] its engineers had sufficient time in contact with the spacecraft to send it to a parking orbit out of GEO.[citation needed] On October 13, 2009, Terra suffered a single battery cell failure anomaly and a battery heater control anomaly which were likely the result of an MMOD strike.[60] On March 12, 2010, Aura lost power from one-half of one of its 11 solar panels and this was also attributed to an MMOD strike.[61] On May 22, 2013 GOES-13 was hit by an MMOD which caused it to lose track of the stars that it uses to maintain attitude. It took nearly a month for the spacecraft to return to operation.[62]\n\nThe first major satellite collision occurred on 10 February 2009 at 16:56 UTC. The deactivated 950 kg (2,090 lb) Kosmos 2251 and the operational 560 kg (1,230 lb) Iridium 33 collided, 500 mi (800 km)[63] over northern Siberia. The relative speed of impact was about 11.7 km/s (7.3 mi/s), or about 42,120 km/h (26,170 mph).[64] Both satellites were destroyed, with accurate estimates of the number of debris unavailable.[65][66] On 22 January 2013 BLITS (a Russian laser-ranging satellite) was struck by debris suspected to be from the 2007 Chinese anti-satellite missile test, changing its orbit and spin rate.[67]\n\nSatellites frequently have to perform Collision Avoidance Maneuvers and managers have to monitor debris as part of maneuver planning. For example, in January 2017, the European Space Agency planned to alter orbit of one of its $319 million[68] Swarm mission spacecrafts, based on data from the US Joint Space Operations Center, to end the risk of collision from Cosmos-375, an old Russian satellite.[69] Cosmos-375, which was destroyed by Soviet operators when its mission was complete, had previously threatened to impact the International Space Station in 2011.\n\n\nCrewed spacecraft[edit]\n\nSpace Shuttle missions[edit]\n\n  \nSpace Shuttle Discovery's lower starboard wing and Thermal Protection System tiles, photographed on STS-114 during an R-Bar Pitch Manoeuvre where astronauts examine the TPS for any damage during ascent\n\n\n\nFrom the early Space Shuttle missions, NASA used NORAD to monitor the Shuttle's orbital path for debris. In the 1980s, this used much of its capacity.[70] The first collision-avoidance maneuver occurred during STS-48 in September 1991,[71] a seven-second thruster burn to avoid debris from Kosmos 955.[72] Similar maneuvers followed on missions 53, 72 and 82.[71]\n\nOne of the first events to publicize the debris problem occurred on Space Shuttle Challenger's second flight, STS-7. A fleck of paint struck its front window, creating a pit over 1 mm (0.04 in) wide. On STS-59 in 1994, Endeavour's front window was pitted about half its depth. Minor debris impacts increased from 1998.[73]\n\nWindow chipping and minor damage to thermal protection system tiles (TPS) was already common by the 1990s. The Shuttle was later flown tail-first to take the debris load mostly on the engines and rear cargo bay (not used in orbit or during descent, and less critical for post-launch operation). When flying to the ISS, the two connected spacecraft were flipped around so the better-armored station shielded the orbiter.[74]\n\n\n  \nSpace Shuttle Endeavour had a major impact on its radiator during STS-118. The entry hole is about 1⁄4 in (6.4 mm), and the exit hole is twice as large.\n\n\n\nNASA's study concluded that debris accounted for half of the overall risk to the Shuttle.[74][75] Executive-level decision to proceed was required if catastrophic impact was likelier than 1 in 200. On a normal (low-orbit) mission to the ISS the risk was c. 1 in 300, but STS-125 (the Hubble repair mission) at 350 mi (560 km) was initially calculated at a 1-in-185 risk (due to the 2009 satellite collision). A re-analysis with better debris numbers reduced the estimated risk to 1 in 221, and the mission went ahead.[76]\n\nDebris incidents continued on later Shuttle missions. During STS-115 in 2006 a fragment of circuit board bored a small hole through the radiator panels in Space Shuttle Columbia' cargo bay.[77] On STS-118 in 2007 debris blew a bullet-like hole through Endeavour's radiator panel.[78]\n\n\nMir[edit]\n\nImpact wear was notable on Mir, the Soviet space station, since it remained in space for long periods with its original module panels.[79][80]\n\n\n  \nDebris impacts on Mir's solar panels degraded their performance. The damage is most noticeable on the panel on the right, which is facing the camera with a high degree of contrast. Extensive damage to the smaller panel below is due to impact with a Progress spacecraft.\n\n\n\nInternational Space Station[edit]\n\nAlthough the ISS uses Whipple shielding to protect itself from minor debris,[81] portions (notably its solar panels) cannot be protected easily. In 1989, the ISS panels were predicted to degrade c. 0.23% in four years, and they were overdesigned by 1%.[82] A maneuver is performed if \"there is a greater than one-in-10,000 chance of a debris strike\".[83] As of January 2014[update], there have been sixteen maneuvers in the fifteen years the ISS had been in orbit.[83]\n\nThe crew sheltered in the Soyuz on three occasions due to late debris-proximity warnings. In addition to the sixteen firings and three Soyuz-capsule shelter orders, one attempted maneuver failed (due to not having the several days' warning necessary to upload the manoeuvre timeline to the station's computer).[83][84][85] A March 2009 close call involved debris believed to be a 10 cm (3.9 in) piece of the Kosmos 1275 satellite.[86] In 2013, the ISS did not maneuver to avoid debris, after a record four debris maneuvers the previous year.[83]\n\n\nKessler syndrome[edit]\n\nMain article: Kessler syndrome\n\nThe Kessler syndrome [87][88], proposed by the NASA scientist Donald J. Kessler in 1978,  is a scenario in which the density of objects in low Earth orbit (LEO) is high enough that collisions between objects could cause a cascade where each collision generates space debris that increases the likelihood of further collisions.[89] One implication is that the distribution of debris in orbit could render space activities and the use of satellites in specific orbital ranges impractical for many generations.[89]\n\nAlthough most manned space activity takes place at altitudes below 800 to 1,500 km (500 to 930 mi), a Kessler syndrome cascade in that region would rain down into lower altitudes and the decay time scale is such that \"the resulting [low Earth orbit] debris environment is likely to be too hostile for future space use\".[90][91]\n\nIn a Kessler syndrome, satellite lifetimes would be measured in years or months. New satellites could be launched through the debris field into higher orbits or placed in lower orbits (where decay removes the debris), but the utility of the region between 800 and 1,500 km (500 and 930 mi) is the reason for its amount of debris.[92]\n\n\nTo Earth[edit]\n\n  \nSaudi officials inspect a crashed PAM-D module in January 2001.\n\n\n\nAlthough most debris burns up in the atmosphere, larger objects can reach the ground intact. According to NASA, an average of one cataloged piece of debris has fallen back to Earth each day for the past 50 years. Despite their size, there has been no significant property damage from the debris.[93]\n\nIn 1969 five sailors on a Japanese ship were injured by space debris.[94] In 1997 an Oklahoma woman, Lottie Williams, was injured when she was hit in the shoulder by a 10 cm × 13 cm (3.9 in × 5.1 in) piece of blackened, woven metallic material confirmed as part of the propellant tank of a Delta II rocket which launched a U.S. Air Force satellite the year before.[95][96]\n\nThe original re-entry plan for Skylab called for the station to remain in space for eight to ten years after its final mission in February 1974. High solar activity expanded the upper atmosphere, resulting in higher-than-expected drag and bringing its orbit closer to Earth than planned. On 11 July 1979 Skylab re-entered the Earth's atmosphere and disintegrated, raining debris along a path over the southern Indian Ocean and Western Australia.[97][98]\n\nOn 12 January 2001, a Star 48 Payload Assist Module (PAM-D) rocket upper stage re-entered the atmosphere after a \"catastrophic orbital decay\",[99] crashing in the Saudi Arabian desert. It was identified as the upper-stage rocket for NAVSTAR 32, a GPS satellite launched in 1993.\n\nIn the 2003 Columbia disaster, large parts of the spacecraft reached the ground and entire equipment systems remained intact.[100] More than 83,000 pieces, along with the remains of the six astronauts, were recovered in an area from three to 10 miles around Hemphill in Sabine County, TX.[101] More pieces were found in a line from west Texas to east Louisiana, with the westernmost piece found in Littlefield, TX and the easternmost found southwest of Mora, LA.[102] Although there is significant evidence that debris fell in Nevada, Utah, and New Mexico, debris was only found in Texas, Arkansas and Louisiana. In a rare case of property damage, a foot-long metal bracket smashed through the roof of a dentist office.[103] NASA warned the public to avoid contact with the debris because of the possible presence of hazardous chemicals.[104] 15 years after the failure, people were still sending in pieces with the last, as of February 1, 2018, found in the spring of 2017.[105]\n\nOn 27 March 2007, airborne debris from a Russian spy satellite was seen by the pilot of a LAN Airlines Airbus A340 carrying 270 passengers whilst flying over the Pacific Ocean between Santiago and Auckland. The debris was within 5 nautical miles (9.3 km; 5.8 mi) of the aircraft.[106]\n\n\nTracking and measurement[edit]\n\nTracking from the ground[edit]\n\nRadar and optical detectors such as lidar are the main tools for tracking space debris. Although objects under 10 cm (4 in) have reduced orbital stability, debris as small as 1 cm can be tracked,[107][108] however determining orbits to allow re-acquisition is difficult. Most debris remain unobserved. The NASA Orbital Debris Observatory tracked space debris with a 3 m (10 ft) liquid mirror transit telescope.[109] FM Radio waves can detect debris, after reflecting off them onto a receiver.[110] Optical tracking may be a useful early-warning system on spacecraft.[111]\n\nThe U.S. Strategic Command keeps a catalog of known orbital objects, using ground-based radar and telescopes, and a space-based telescope (originally to distinguish from hostile missiles). The 2009 edition listed about 19,000 objects.[112] Other data come from the ESA Space Debris Telescope, TIRA,[113] the Goldstone, Haystack,[114] and EISCAT radars and the Cobra Dane phased array radar,[115] to be used in debris-environment models like the ESA Meteoroid and Space Debris Terrestrial Environment Reference (MASTER).\n\n\nMeasurement in space[edit]\n\n  \nThe Long Duration Exposure Facility (LDEF) is an important source of information on small-particle space debris.\n\n\n\nReturned space hardware is a valuable source of information on the directional distribution and composition of the (sub-millimetre) debris flux. The LDEF satellite deployed by mission STS-41-C Challenger and retrieved by STS-32 Columbia spent 68 months in orbit to gather debris data. The EURECA satellite, deployed by STS-46 Atlantis in 1992 and retrieved by STS-57 Endeavour in 1993, was also used for debris study.[116]\n\nThe solar arrays of Hubble were returned by missions STS-61 Endeavour and STS-109 Columbia, and the impact craters studied by the ESA to validate its models. Materials returned from Mir were also studied, notably the Mir Environmental Effects Payload (which also tested materials intended for the ISS[117]).[118][119]\n\n\nGabbard diagrams[edit]\n\nA debris cloud resulting from a single event is studied with scatter plots known as Gabbard diagrams, where the perigee and apogee of fragments are plotted with respect to their orbital period. Gabbard diagrams of the early debris cloud prior to the effects of perturbations, if the data were available, are reconstructed. They often include data on newly observed, as yet uncatalogued fragments. Gabbard diagrams can provide important insights into the features of the fragmentation, the direction and point of impact.[120][121]\n\n\nDealing with debris[edit]\n\nAn average of about one tracked object per day has been dropping out of orbit for the past 50 years,[122] averaging almost three objects per day at solar maximum (due to the heating and expansion of the Earth's atmosphere), but one about every three days at solar minimum, usually five and a half years later.[122] In addition to natural atmospheric effects, corporations, academics and government agencies have proposed plans and technology to deal with space debris, but as of November 2014[update], most of these are theoretical, and there is no extant business plan for debris reduction.[123]\n\nA number of scholars have also observed that institutional factors—political, legal, economic and cultural \"rules of the game\"—are the greatest impediment to the cleanup of near-Earth space.  There is no commercial incentive, since costs aren't assigned to polluters, but a number of suggestions have been made.[123] However, effects to date are limited. In the US, governmental bodies have been accused of backsliding on previous commitments to limit debris growth, \"let alone tackling the more complex issues of removing orbital debris.\"[124] The different methods for removal of space debris has been evalauted by the Space Generation Advisory Council, including French astrophysicist Fatoumata Kébé.[125]\n\n\nGrowth mitigation[edit]\n\n  \nSpatial density of LEO space debris by altitude, according to 2011 a NASA report to the United Nations Office for Outer Space Affairs[126]\n\n\n\n  \nSpatial density of space debris by altitude according to ESA MASTER-2001, without debris from the Chinese ASAT and 2009 collision events\n\n\n\nUpper stage passivation (e.g. of Delta boosters[70]) by releasing residual propellants reduces debris from orbital explosions; however not all boosters implement this.[127] Although there is no international treaty minimizing space debris, the United Nations Committee on the Peaceful Uses of Outer Space (COPUOS) published voluntary guidelines in 2007.[128] As of 2008, the committee is discussing international \"rules of the road\" to prevent collisions between satellites.[129]\nBy 2013, various legal regimes existed, typically instantiated in the launch licenses that are required for a launch in all spacefaring nations.[130]\n\nThe U.S. has a set of standard practices for civilian (NASA) and military (DoD and USAF) orbital-debris mitigation,[131][132] as has the European Space Agency.[133] In 2007, the ISO began preparing an international standard for space-debris mitigation.[134] Germany and France have posted bonds to safeguard property from debris damage.[135]\n\nWhen originally proposed in 2015, the OneWeb constellation, initially planned to have ~700 satellites anticipated on orbit after 2018, would only state that they would re-enter the atmosphere within 25 years of retirement.[136]\nBy October 2017, both OneWeb—and also SpaceX, with their large Starlink constellation—had filed documents with the US FCC with more aggressive space debris mitigation plans.  Both companies committed to a deorbit plan for post-mission satellites which will explicitly move the satellites into orbits where they will reenter the Earth's atmosphere within approximately one year following end-of-life.[137]\n\nWith a \"one-up, one-down\" launch-license policy for Earth orbits, launchers would rendezvous with, capture and de-orbit a derelict satellite from approximately the same orbital plane.[138] Another possibility is the robotic refueling of satellites. Experiments have been flown by NASA,[139] and SpaceX is developing large-scale on-orbit propellant transfer technology and tanker spacecraft.[140]\n\nAnother approach to debris mitigation is to explicitly design the mission architecture to always leave the rocket second-stage in an elliptical geocentric orbit with a low-perigee, thus ensuring rapid orbital decay and avoiding long-term orbital debris from spent rocket bodies.  Such missions require the use of a small kick stage to circularize the orbit, but the kick stage itself may be designed with the excess-propellant capability to be able to self-deorbit.[141]\n\n\nSelf-removal[edit]\n\nAlthough the ITU requires geostationary satellites to move to a graveyard orbit at the end of their lives, the selected orbital areas do not sufficiently protect GEO lanes from debris.[22] Rocket stages (or satellites) with enough propellant may make a direct, controlled de-orbit, or if this would require too much propellant, a satellite may be brought to an orbit where atmospheric drag would cause it to eventually de-orbit. This was done with the French Spot-1 satellite, reducing its atmospheric re-entry time from a projected 200 years to about 15 by lowering its altitude from 830 km (516 mi) to about 550 km (342 mi).[142][143]\n\nPassive methods of increasing the orbital decay rate of spacecraft debris have been proposed. Instead of rockets, an electrodynamic tether could be attached to a spacecraft at launch; at the end of its lifetime, the tether would be rolled out to slow the spacecraft.[144] Other proposals include a booster stage with a sail-like attachment[145]  and a large, thin, inflatable balloon envelope.[146]\n\n\nExternal removal[edit]\n\nA consensus of speakers at a meeting in Brussels on 30 October 2012 organized by the Secure World Foundation (a U.S. think tank) and the French International Relations Institute[147] reported that removal of the largest debris would be required to prevent the risk to spacecraft becoming unacceptable in the foreseeable future (without any addition to the inventory of dead spacecraft in LEO). Removal costs and legal questions about ownership and the authority to remove defunct satellites have stymied national or international action. Current space law retains ownership of all satellites with their original operators, even debris or spacecraft which are defunct or threaten active missions.\n\nAs of 2006[update] the cost of any of these solutions is about the same as launching a spacecraft[failed verification] and, according to NASA's Nicholas Johnson, not cost-effective.[148][needs update] Since then Space Sweeper with Sling-Sat (4S), a grappling satellite which captures and ejects debris, has been studied.[149]\n\n\nRemotely controlled vehicles[edit]\n\nA well-studied solution uses a remotely controlled vehicle to rendezvous with, capture and return debris to a central station.[150]\nOne such system is Space Infrastructure Servicing, a commercially developed refueling depot and service spacecraft for communications satellites in geosynchronous orbit originally scheduled for a 2015 launch.[151] The SIS would be able to \"push dead satellites into graveyard orbits.\"[152] The Advanced Common Evolved Stage family of upper stages is being designed with a high leftover-propellant margin (for derelict capture and de-orbit) and in-space refueling capability for the high delta-v required to de-orbit heavy objects from geosynchronous orbit.[138] A tug-like satellite to drag debris to a safe altitude for it to burn up in the atmosphere has been researched.[153] When debris is identified the satellite creates a difference in potential between the debris and itself, then using its thrusters to move itself and the debris to a safer orbit.\n\nA variation of this approach is for the remotely controlled vehicle to rendezvous with debris, capture it temporarily to attach a smaller de-orbit satellite and drag the debris with a tether to the desired location.  The \"mothership\" would then tow the debris-smallsat combination for atmospheric entry or move it to a graveyard orbit. One such system is the proposed Busek ORbital DEbris Remover (ORDER), which would carry over 40 SUL (satellite on umbilical line) de-orbit satellites and propellant sufficient for their removal.[123]\n\n\n  \nCleanspace One\n\n\n\nOn 7 January 2010 Star, Inc. reported that it received a contract from the Space and Naval Warfare Systems Command for a feasibility study of the ElectroDynamic Debris Eliminator (EDDE) propellantless spacecraft for space-debris removal.[154]\nIn February 2012 the Swiss Space Center at École Polytechnique Fédérale de Lausanne announced the Clean Space One project, a nanosatellite demonstration project for matching orbit with a defunct Swiss nanosatellite, capturing it and de-orbiting together.[155] The mission has seen several evolutions to reach a pac-man inspired capture model.[156]\n\n\nLaser methods[edit]\n\nThe laser broom uses a ground-based laser to ablate the front of the debris, producing a rocket-like thrust which slows the object. With continued application, the debris would fall enough to be influenced by atmospheric drag.[157][158] During the late 1990s, the U.S. Air Force's Project Orion was a laser-broom design.[159] Although a test-bed device was scheduled to launch on a Space Shuttle in 2003, international agreements banning powerful laser testing in orbit limited its use to measurements.[160] The Space Shuttle Columbia disaster postponed the project and according to Nicholas Johnson, chief scientist and program manager for NASA's Orbital Debris Program Office, \"There are lots of little gotchas in the Orion final report. There's a reason why it's been sitting on the shelf for more than a decade.\"[161]\n\nThe momentum of the laser-beam photons could directly impart a thrust on the debris sufficient to move small debris into new orbits out of the way of working satellites. NASA research in 2011 indicates that firing a laser beam at a piece of space junk could impart an impulse of 1 mm (0.039 in) per second, and keeping the laser on the debris for a few hours per day could alter its course by 200 m (660 ft) per day.[162] One drawback is the potential for material degradation; the energy may break up the debris, adding to the problem.[citation needed] A similar proposal places the laser on a satellite in Sun-synchronous orbit, using a pulsed beam to push satellites into lower orbits to accelerate their reentry.[123] A proposal to replace the laser with an Ion Beam Shepherd has been made,[163] and other proposals use a foamy ball of aerogel or a spray of water,[164]\ninflatable balloons,[165]\nelectrodynamic tethers,[166]\nboom electroadhesion,[167]\nand dedicated anti-satellite weapons.[168]\n\n\nNets[edit]\n\nOn 28 February 2014, Japan's Japan Aerospace Exploration Agency (JAXA) launched a test \"space net\" satellite. The launch was an operational test only.[169] In December 2016 the country sent a space junk collector via Kounotori 6 to the ISS by which JAXA scientists experiment to pull junk out of orbit using a tether.[170][171] The system failed to extend a 700-meter tether from a space station resupply vehicle that was returning to Earth.[172][173] On 6 February the mission was declared a failure and leading researcher Koichi Inoue told reporters that they \"believe the tether did not get released\".[174]\n\nSince 2012, the European Space Agency has designed a mission to remove large space debris from orbit. The mission, e.Deorbit, is scheduled for launch during 2023 with an objective to remove debris heavier than 4,000 kilograms (8,800 lb) from LEO.[175] Several capture techniques are being studied, including a net, a harpoon and a combination robot arm and clamping mechanism.[176]\n\n\nHarpoon[edit]\n\nThe RemoveDEBRIS mission plan is to test the efficacy of several ADR technologies on mock targets in low Earth orbit. In order to complete its planned experiments the platform is equipped with a net, a harpoon, a laser ranging instrument, a dragsail, and two CubeSats (miniature research satellites).[177] The mission was launched on 2 April 2018.\n\n\nInternational regulation[edit]\n\nHolger Krag of the European Space Agency states that as of 2017 there is no binding international regulatory framework with no progress occurring at the respective UN body in Vienna.[58]\n\n\nHistory and shielding technologies[edit]\n\nMicrometeoroids[edit]\n\n\t\n\tThis section may stray from the topic of the article into the topic of another article, Micrometeoroid. Please help improve this section or discuss this issue on the talk page.  (October 2014)\n\n\n\nMain article: Micrometeoroid\n\nIn 1946 during the Giacobinid meteor shower, Helmut Landsberg collected several small magnetic particles that were apparently associated with the shower.[178] Fred Whipple was intrigued by this and wrote a paper that demonstrated that particles of this size were too small to maintain their velocity when they encountered the upper atmosphere. Instead, they quickly decelerated and then fell to Earth unmelted. In order to classify these sorts of objects, he coined the term \"micro-meteorite\".[179]\n\nWhipple, in collaboration with Fletcher Watson of the Harvard Observatory, led an effort to build an observatory to directly measure the velocity of the meteors that could be seen. At the time the source of the micro-meteorites was not known. Direct measurements at the new observatory were used to locate the source of the meteors, demonstrating that the bulk of material was left over from comet tails, and that none of it could be shown to have an extra-solar origin.[180] Today it is understood that meteoroids of all sorts are leftover material from the formation of the Solar System, consisting of particles from the interplanetary dust cloud or other objects made up from this material, like comets.[181]\n\nThe early studies were based on optical measurements only. In 1957, Hans Pettersson conducted one of the first direct measurements of the fall of space dust on the Earth, estimating it to be 14,300,000 tons per year.[182] This suggested that the meteoroid flux in space was much higher than the number based on telescope observations. Such a high flux presented a very serious risk to missions deeper in space, specifically the high-orbiting Apollo capsules. To determine whether the direct measurement was accurate, a number of additional studies followed, including the Pegasus satellite program. These showed that the rate of meteors passing into the atmosphere, or flux, was in line with the optical measurements, at around 10,000 to 20,000 tons per year.[183]\n\n\nMicrometeoroid shielding[edit]\n\n\t\n\tThis section may stray from the topic of the article into the topic of another article, Micrometeoroid. Please help improve this section or discuss this issue on the talk page.  (October 2014)\n\n\n\n  \nThe \"energy flash\" of a hypervelocity impact during a simulation of what happens when a piece of orbital debris hits a spacecraft in orbit.\n\n\n\nWhipple's work pre-dated the space race and it proved useful when space exploration started only a few years later. His studies had demonstrated that the chance of being hit by a meteoroid large enough to destroy a spacecraft was extremely remote. However, a spacecraft would be almost constantly struck by micrometeorites, about the size of dust grains.[180]\n\nWhipple had already developed a solution to this problem in 1946. Originally known as a \"meteor bumper\" and now termed the Whipple shield, this consists of a thin foil film held a short distance away from the spacecraft's body. When a micrometeoroid strikes the foil, it vaporizes into a plasma that quickly spreads. By the time this plasma crosses the gap between the shield and the spacecraft, it is so diffused that it is unable to penetrate the structural material below.[184] The shield allows a spacecraft body to be built to just the thickness needed for structural integrity, while the foil adds little additional weight. Such a spacecraft is lighter than one with panels designed to stop the meteoroids directly.\n\nFor spacecraft that spend the majority of their time in orbit, some variety of the Whipple shield has been almost universal for decades.[185][186] Later research showed that ceramic fibre woven shields offer better protection to hypervelocity (~7 km/s) particles than aluminium shields of equal weight.[187] Another modern design uses multi-layer flexible fabric, as in NASA's design for its never-flown TransHab expandable space habitation module,[188]\nand the Bigelow Expandable Activity Module, which was launched in April 2016 and attached to the ISS for two years of orbital testing.[189][190]\n\n\nNORAD, Gabbard and Kessler[edit]\n\nTo avoid artificial space debris, many—but not all—research satellites are launched on elliptical orbits with perigees inside Earth's atmosphere so they will destroy themselves. Willy Ley predicted in 1960 that \"In time, a number of such accidentally too-lucky shots will accumulate in space and will have to be removed when the era of manned space flight arrives\".[191] After the launch of Sputnik 1 in 1957, the North American Aerospace Defense Command (NORAD) began compiling a database (the Space Object Catalog) of all known rocket launches and objects reaching orbit: satellites, protective shields and upper- and lower-stage booster rockets. NASA published modified versions of the database in two-line element set,[192] and during the early 1980s the CelesTrak bulletin board system re-published them.[193]\n\n\n  \nGabbard diagram of almost 300 pieces of debris from the disintegration of the five-month-old third stage of the Chinese Long March 4 booster on 11 March 2000\n\n\n\nThe trackers who fed the database were aware of other objects in orbit, many of which were the result of in-orbit explosions.[194] Some were deliberately caused during 1960s anti-satellite weapon (ASAT) testing, and others were the result of rocket stages blowing up in orbit as leftover propellant expanded and ruptured their tanks. To improve tracking, NORAD employee John Gabbard kept a separate database. Studying the explosions, Gabbard developed a technique for predicting the orbital paths of their products, and Gabbard diagrams (or plots) are now widely used. These studies were used to improve the modelling of orbital evolution and decay.[120]\n\nWhen the NORAD database became publicly available during the 1970s, NASA scientist Donald J. Kessler applied the technique developed for the asteroid-belt study to the database of known objects. In 1978 Kessler and Burton Cour-Palais co-authored \"Collision Frequency of Artificial Satellites: The Creation of a Debris Belt\",[195] demonstrating that the process controlling asteroid evolution would cause a similar collision process in LEO in decades rather than billions of years. They concluded that by about 2000, space debris would outpace micrometeoroids as the primary ablative risk to orbiting spacecraft.[8]\n\nAt the time, it was widely thought that drag from the upper atmosphere would de-orbit debris faster than it was created. However, Gabbard was aware that the number and type of objects in space were under-represented in the NORAD data and was familiar with its behaviour. In an interview shortly after the publication of Kessler's paper, Gabbard coined the term \"Kessler syndrome\" to refer to the accumulation of debris;[8] it became widely used after its appearance in a 1982 Popular Science article,[196] which won the Aviation-Space Writers Association 1982 National Journalism Award.[8]\n\n\nFollow-up studies[edit]\n\n  \nBaker-Nunn cameras were widely used to study space debris.\n\n\n\nThe lack of hard data about space debris prompted a series of studies to better characterize the LEO environment. In October 1979, NASA provided Kessler with funding for further studies.[8] Several approaches were used by these studies.\n\nOptical telescopes or short-wavelength radar was used to measure the number and size of space objects, and these measurements demonstrated that the published population count was at least 50% too low.[16] Before this, it was believed that the NORAD database accounted for the majority of large objects in orbit. Some objects (typically, U.S. military spacecraft) were found to be omitted from the NORAD list, and others were not included because they were considered unimportant. The list could not easily account for objects under 20 cm (7.9 in) in size—in particular, debris from exploding rocket stages and several 1960s anti-satellite tests.[8]\n\nReturned spacecraft were microscopically examined for small impacts, and sections of Skylab and the Apollo Command/Service Module which were recovered were found to be pitted. Each study indicated that the debris flux was higher than expected and debris was the primary source of collisions in space. LEO already demonstrated the Kessler syndrome.[8]\n\nIn 1978 Kessler found that 42 percent of cataloged debris was the result of 19 events, primarily explosions of spent rocket stages (especially U.S. Delta rockets).[197] He discovered this by first identifying those launches that were described having a large number of objects associated with a payload, then researching the literature to determine the rockets used in the launch.  In 1979, this finding resulted in establishment of the NASA Orbital Debris Program after a briefing to NASA senior management, overturning the previously held belief that most unknown debris was from old ASAT tests, but from US upper stage rocket explosions and could be easily managed by depleting the unused fuel following the payload injection the upper stage Delta rocket.  Beginning in 1986, when it was discovered that other international agencies were possibly experiencing the same type of problem, NASA expanded its program to include international agencies, the first being the European Space Agency.[36] A number of other Delta components in orbit (Delta was a workhorse of the U.S. space program) had not yet exploded.[citation needed]\n\n\nA new Kessler syndrome[edit]\n\nDuring the 1980s, the U.S. Air Force conducted an experimental program to determine what would happen if debris collided with satellites or other debris. The study demonstrated that the process differed from micrometeoroid collisions, with large chunks of debris created which would become collision threats.[8]\n\nIn 1991, Kessler published \"Collisional cascading: The limits of population growth in low Earth orbit\"[198] with the best data then available. Citing the USAF conclusions about creation of debris, he wrote that although almost all debris objects (such as paint flecks) were lightweight, most of its mass was in debris about 1 kg (2.2 lb) or heavier. This mass could destroy a spacecraft on impact, creating more debris in the critical-mass area.[90] According to the National Academy of Sciences:\n\n\nA 1-kg object impacting at 10 km/s, for example, is probably capable of catastrophically breaking up a 1,000-kg spacecraft if it strikes a high-density element in the spacecraft. In such a breakup, numerous fragments larger than 1 kg would be created.[199][full citation needed]\n\n\nKessler's analysis divided the problem into three parts. With a low-enough density, the addition of debris by impacts is slower than their decay rate and the problem is not significant. Beyond that is a critical density, where additional debris leads to additional collisions. At densities beyond this critical mass production exceeds decay, leading to a cascading chain reaction reducing the orbiting population to small objects (several cm in size) and increasing the hazard of space activity.[90] This chain reaction is known as the Kessler syndrome.[8]\n\nIn an early 2009 historical overview, Kessler summed up the situation:\n\n\nAggressive space activities without adequate safeguards could significantly shorten the time between collisions and produce an intolerable hazard to future spacecraft. Some of the most environmentally dangerous activities in space include large constellations such as those initially proposed by the Strategic Defense Initiative in the mid-1980s, large structures such as those considered in the late-1970s for building solar power stations in Earth orbit, and anti-satellite warfare using systems tested by the USSR, the U.S., and China over the past 30 years. Such aggressive activities could set up a situation where a single satellite failure could lead to cascading failures of many satellites in a period much shorter than years.[8]\n\n\nDebris growth[edit]\n\nDuring the 1980s, NASA and other U.S. groups attempted to limit the growth of debris. One effective solution was implemented by McDonnell Douglas on the Delta booster,[when?] by having the booster move away from its payload and vent any propellant remaining in its tanks. This eliminated the pressure buildup in the tanks which caused them to explode in the past.[70] Other countries were slower to adopt this measure and, due especially to a number of launches by the Soviet Union, the problem grew throughout the decade.[200]\n\nA new battery of studies followed[when?] as NASA, NORAD and others attempted to better understand the orbital environment, with each adjusting the number of pieces of debris in the critical-mass zone upward. Although in 1981 (when Schefter's article was published) the number of objects was estimated at 5,000,[194] new detectors in the Ground-based Electro-Optical Deep Space Surveillance system found new objects. By the late 1990s, it was thought that most of the 28,000 launched objects had already decayed and about 8,500 remained in orbit.[201] By 2005 this was adjusted upward to 13,000 objects,[202] and a 2006 study increased the number to 19,000 as a result of an ASAT test and a satellite collision.[203] In 2011, NASA said that 22,000 objects were being tracked.[204]\n\nThe growth in the number of objects as a result of the late-1990s studies sparked debate in the space community on the nature of the problem and the earlier dire warnings. According to Kessler's 1991 derivation and 2001 updates,[205] the LEO environment in the 1,000 km (620 mi) altitude range should be cascading. However, only one major incident has occurred: the 2009 satellite collision between Iridium 33 and Cosmos 2251. The lack of obvious short-term cascading has led to speculation that the original estimates overstated the problem.[206][full citation needed] According to Kessler a cascade would not be obvious until it was well advanced, which might take years.[92]\n\nA 2006 NASA model suggested that if no new launches took place the environment would retain the then-known population until about 2055, when it would increase on its own.[148][207] Richard Crowther of Britain's Defence Evaluation and Research Agency said in 2002 that he believed the cascade would begin about 2015.[208] The National Academy of Sciences, summarizing the professional view, noted widespread agreement that two bands of LEO space—900 to 1,000 km (620 mi) and 1,500 km (930 mi)—were already past  critical density.[209]\n\nIn the 2009 European Air and Space Conference, University of Southampton researcher Hugh Lewis predicted that the threat from space debris would rise 50 percent in the next decade and quadruple in the next 50 years. As of 2009[update], more than 13,000 close calls were tracked weekly.[210]\n\nA 2011 report by the U.S. National Research Council warned NASA that the amount of orbiting space debris was at a critical level. According to some computer models, the amount of space debris \"has reached a tipping point, with enough currently in orbit to continually collide and create even more debris, raising the risk of spacecraft failures\". The report called for international regulations limiting debris and research of disposal methods.[211]\n\nBy the late 2010s, plans by multiple providers to deploy large megaconstellations of broadband internet satellites had been licensed by regulatory authorities, with operational satellites entering production by both OneWeb and SpaceX.  The first deployments occurred in 2019 with six from OneWeb, followed by 60 227 kg (500 lb)  satellites from SpaceX in May, the first satellites for the project Starlink[212]. While the increased satellite density causes concerns, both licensing authorities and the manufacturers are well aware of debris problems.  The vendors must have debris-reduction plans, and are taking measures to actively de-orbit unneeded satellites and/or ensure their orbits will decay naturally.[213]\n\n\nIn popular culture[edit]\n\nThe plot of episode 4 (\"Conflict\") of Gerry Anderson's 1970 TV series UFO includes routine missions for the disposal of spent satellites by bombing.\n\nSalvage 1 (1979 TV series) deals humorously with a scrap dealer who establish a space junk salvage company.\n\nPlanetes is a manga (1999-2004) and anime series (2003-2004) that gives focus on a team which is responsible for the collection and disposal of space debris. The DVDs for the TV series include interviews with NASA's Orbital Debris Program Office.\n\nIn 2009, Rhett & Link wrote a song called \"Space Junk\" and made an accompanying music video for the TV series Brink.  The lyrics refer to two men tasked to clean up debris such as satellites and expended rockets.[214]\n\nGravity is a 2013 survival film, directed by Alfonso Cuaron, about a disaster on a space mission caused by Kessler syndrome.\n\nAntariksham 9000 KMPH  is a 2018 Indian Telugu-language science fiction adventure film about a lost Indian satellite that may trigger a Kessler syndrome.\n\n\nSee also[edit]\n\n\n\tSpace portal\n\n\n\n\tCategory:Derelict satellites\n\tInterplanetary contamination\n\tLiability Convention\n\tList of large reentering space debris\n\tList of space debris producing events\n\tLong Duration Exposure Facility\n\tNear-Earth object\n\tOneWeb satellite constellation\n\tOrbital Debris Co-ordination Working Group\n\tProject West Ford\n\tSatellite warfare\n\tSolar Maximum Mission\n\tSpacecraft cemetery\n\n\nReferences[edit]\n\nNotes[edit]\n\n\n\t^ NASA Orbital Debris Program\n\n\t^ GUIDE TO SPACE DEBRIS from the spaceacademy.net.au\n\n\t^ \"Orbital Debris Quarterly News\" (PDF). Vol. 20 no. 3. NASA. July 2016. p. 8. Retrieved 10 October 2016. Cite magazine requires |magazine= (help)\n\n\t^ \"UCS Satellite Database\". Nuclear Weapons & Global Security. Union of Concerned Scientists. 11 August 2016. Retrieved 10 October 2016.\n\n\n\t^ a b \"Space debris by the numbers\" ESA, January 2019. Retrieved 5 March 2019\n\n\t^ \n\"The Threat of Orbital Debris and Protecting NASA Space Assets from Satellite Collisions\" (PDF). Space Reference. 2009.\n\n\n\t^ \nThe Threat of Orbital Debris and Protecting NASA Space Assets from Satellite Collisions (PDF), Space Reference, 2009\n\n\n\t^ a b c d e f g h i j k Donald J. Kessler (8 March 2009). \"The Kessler Syndrome\". Archived from the original on 27 May 2010. Retrieved 22 September 2009.\n\n\n\t^ Lisa Grossman, \"NASA Considers Shooting Space Junk with Lasers\", wired, 15 March 2011.\n\n\t^ \"Technical report on space debris\", p. 15, United Nations, New York, 1999.\n\n\t^ \"Orbital Debris FAQ: How much orbital debris is currently in Earth orbit?\" NASA, March 2012. Retrieved 31 January 2016\n\n\t^ Joseph Carroll, \"Space Transport Development Using Orbital Debris\", NASA Institute for Advanced Concepts, 2 December 2002, p. 3.\n\n\t^ Robin McKie and Michael Day, \"Warning of catastrophe from mass of 'space junk'\" The Observer, 24 February 2008.\n\n\t^ Matt Ford, \"Orbiting space junk heightens risk of satellite catastrophes.\" Ars Technica, 27 February 2009.\n\n\t^ \"What are hypervelocity impacts?\" ESA, 19 February 2009.\n\n\t^ a b Kessler 1991, p. 65.\n\n\t^ Klinkrad, p. 7.\n\n\t^ Kessler 1991, p. 268.\n\n\t^ Schildknecht, T.; Musci, R.; Flury, W.; Kuusela, J.; De Leon, J.; Dominguez Palmero, L. De Fatima (2005). \"Optical observation of space debris in high-altitude orbits\". Proceedings of the 4th European Conference on Space Debris (ESA SP-587). 18–20 April 2005. 587: 113. Bibcode:2005ESASP.587..113S.\n\n\n\t^ \"Colocation Strategy and Collision Avoidance for the Geostationary Satellites at 19 Degrees West.\" CNES Symposium on Space Dynamics, 6–10 November 1989.\n\n\t^ van der Ha, J. C.; Hechler, M. (1981). \"The Collision Probability of Geostationary Satellites\". 32nd International Astronautical Congress. 1981: 23. Bibcode:1981rome.iafcR....V.\n\n\n\t^ a b Anselmo, L.; Pardini, C. (2000). \"Collision Risk Mitigation in Geostationary Orbit\". Space Debris. 2 (2): 67–82. doi:10.1023/A:1021255523174.\n\n\n\t^ Orbital Debris, p. 86.\n\n\t^ Orbital Debris, p. 152.\n\n\t^ a b \"The Olympus failure\" ESA press release, 26 August 1993.  Archived 11 September 2007 at the Wayback Machine\n\n\t^ a b \"Notification for Express-AM11 satellite users in connection with the spacecraft failure\" Russian Satellite Communications Company, 19 April 2006.\n\n\t^ \"Vanguard I celebrates 50 years in space\". Eurekalert.org. Retrieved 4 October 2013.\n\n\n\t^ a b Julian Smith, \"Space Junk\"[dead link] USA Weekend, 26 August 2007.\n\n\t^ Vanguard 50 years\n\n\t^ \"UCS Satellite Database\" Union of Concerned Scientists, 16 July 2009.\n\n\t^ C. Wiedemann et al, \"Size distribution of NaK droplets for MASTER-2009\", Proceedings of the 5th European Conference on Space Debris, 30 March-2 April 2009, (ESA SP-672, July 2009).\n\n\t^ a b A. Rossi et al, \"Effects of the RORSAT NaK Drops on the Long Term Evolution of the Space Debris Population\"[dead link], University of Pisa, 1997.\n\n\t^ Gruss, Mike (6 May 2015). \"DMSP-F13 Debris To Stay On Orbit for Decades\". Space News. Retrieved 7 May 2015.\n\n\n\t^ See image here.\n\n\t^ Loftus, Joseph P. (1989). Orbital Debris from Upper-stage Breakup. AIAA. p. 227. ISBN 978-1-60086-376-9.\n\n\n\t^ a b c Klinkrad, p. 2.\n\n\t^ Some return to Earth intact, see this list Archived 28 October 2009 at the Wayback Machine for examples.\n\n\t^ Phillip Anz-Meador and Mark Matney, \"An assessment of the NASA explosion fragmentation model to 1 mm characteristic sizes\" Advances in Space Research, Volume 34 Issue 5 (2004), pp. 987–992.\n\n\t^ \"Debris from explosion of Chinese rocket detected by University of Chicago satellite instrument\", University of Chicago press release, 10 August 2000.\n\n\t^ \"Rocket Explosion\", Spaceweather.com, 22 February 2007. Retrieved 21 February 2007.\n\n\t^ Ker Than, \"Rocket Explodes Over Australia, Showers Space with Debris\" Space.com, 21 February 2007. Retrieved 21 February 2007.\n\n\t^ \"Recent Debris Events\" celestrak.com, 16 March 2007. Retrieved 14 July 2001.\n\n\t^ Jeff Hecht, \"Spate of rocket breakups creates new space junk\", NewScientist, 17 January 2007. Retrieved 16 March 2007.\n\n\t^ \"Proton Launch Failure 2012 Aug 6\". Zarya. 21 October 2012. Archived from the original on 10 October 2012. Retrieved 21 October 2012.\n\n\n\t^ Mike, Wall (28 July 2016). \"Amazing Fireball Over Western US Caused by Chinese Space Junk\". space.com. Retrieved 28 July 2016.\n\n\n\t^ \"Major fragmentation of Atlas 5 Centaur upper stage 2014‐055B (SSN #40209)\" (PDF).\n\n\n\t^ \"Rocket break up provides rare chance to test debris formation\".\n\n\n\t^ \"Confirmed breakup of ATLAS 5 CENTAUR R/B (2018-079B, #43652) on April 6, 2019\".\n\n\n\t^ Note that the list Schefter was presented only identified USSR ASAT tests.\n\n\t^ Clayton Chun, \"Shooting Down a Star: America's Thor Program 437, Nuclear ASAT, and Copycat Killers\", Maxwell AFB Base, AL: Air University Press, 1999. \nISBN 1-58566-071-X.\n\n\t^ a b David Wright, \"Debris in Brief: Space Debris from Anti-Satellite Weapons\" Union of Concerned Scientists, December 2007.\n\n\t^ Leonard David, \"China's Anti-Satellite Test: Worrisome Debris Cloud Circles Earth\" space.com, 2 February 2007.\n\n\t^ \"Fengyun 1C – Orbit Data\" Heavens Above.\n\n\t^ Brian Burger, \"NASA's Terra Satellite Moved to Avoid Chinese ASAT Debris\", space.com. Retrieved 6 July 2007.\n\n\t^ \"Pentagon: Missile Scored Direct Hit on Satellite.\", npr.org, 21 February 2008.\n\n\t^ Jim Wolf, \"US satellite shootdown debris said gone from space\", Reuters, 27 February 2009.\n\n\t^ Chavez, Nicole; Pokharel, Sugam (28 March 2019). \"India conducts successful anti-satellite missile operation, Prime Minister says\". CNN.\n\n\n\t^ a b \"Problem Weltraumschrott: Die kosmische Müllkippe - SPIEGEL ONLINE - Wissenschaft\". SPIEGEL ONLINE. Retrieved 22 April 2017.\n\n\n\t^ Akahoshi, Y.;  et al. (2008). \"Influence of space debris impact on solar array under power generation\". International Journal of Impact Engineering. 35 (12): 1678–1682. doi:10.1016/j.ijimpeng.2008.07.048.\n\n\n\t^ Kelley, Angelita. \"Terra mission operations: Launch to the present (and beyond)\" (PDF). Retrieved 5 April 2018.\n\n\n\t^ Fisher, Dominic (13 June 2017). \"Mission Status at Aura Science Team MOWG Meeting\" (PDF). Retrieved 13 December 2017. Cite journal requires |journal= (help)\n\n\n\t^ https://web.archive.org/web/20130607192921/http://www.ssd.noaa.gov/PS/SATS/MESS/MSG1422048.01.txt\n\n\t^ Becky Iannotta and\nTariq Malik, \"U.S. Satellite Destroyed in Space Collision\", space.com, 11 February 2009\n\n\t^ Paul Marks, \"Satellite collision 'more powerful than China's ASAT test\", New Scientist, 13 February 2009.\n\n\t^ \"2 big satellites collide 500 miles over Siberia.\" yahoo.com, 11 February 2009. Retrieved 11 February 2009.\n\n\t^ Becky Iannotta, \"U.S. Satellite Destroyed in Space Collision\", space.com, 11 February 2009. Retrieved 11 February 2009.\n\n\t^ Leonard David. \"Russian Satellite Hit by Debris from Chinese Anti-Satellite Test\". space.com.\n\n\n\t^ \"Swarm Satellite Trio Launched To Study Earth's Magnetic Field - SpaceNews.com\". SpaceNews.com. 22 November 2013. Retrieved 25 January 2017.\n\n\n\t^ \"Space junk could take out a European satellite this week\". CNET. Retrieved 25 January 2017.\n\n\n\t^ a b c Schefter, p. 50.\n\n\t^ a b Rob Matson, \"Satellite Encounters\" Visual Satellite Observer's Home Page.\n\n\t^ \"STS-48 Space Shuttle Mission Report\", NASA, NASA-CR-193060, October 1991.\n\n\t^ Christiansen, E. L.; Hyden, J. L.; Bernhard, R. P. (2004). \"Space Shuttle debris and meteoroid impacts\". Advances in Space Research. 34 (5): 1097–1103. Bibcode:2004AdSpR..34.1097C. doi:10.1016/j.asr.2003.12.008.\n\n\n\t^ a b Kelly, John. \"Debris is Shuttle's Biggest Threat\", space.com, 5 March 2005.\n\n\t^ \"Debris Danger\". Aviation Week & Space Technology, Volume 169 Number 10 (15 September 2008), p. 18.\n\n\t^ William Harwood, \"Improved odds ease NASA's concerns about space debris\", CBS News, 16 April 2009.\n\n\t^ D. Lear et al, \"Investigation of Shuttle Radiator Micro-Meteoroid & Orbital Debris Damage\" Archived 9 March 2012 at the Wayback Machine, Proceedings of the 50th Structures, Structural Dynamics, and Materials Conference, 4–7 May 2009, AIAA 2009–2361.\n\n\t^ D. Lear, et al, \"STS-118 Radiator Impact Damage\", NASA\n\n\t^ Smirnov, V.M.;  et al. (2000). \"Study of Micrometeoroid and Orbital Debris Effects on the Solar Panelson 'MIR'\". Space Debris. 2 (1): 1–7. doi:10.1023/A:1015607813420.\n\n\n\t^ \"Orbital Debris FAQ: How did the Mir space station fare during its 15-year stay in Earth orbit?\", NASA, July 2009.\n\n\t^ K Thoma et al, \"New Protection Concepts for Meteoroid / Debris Shields\", Proceedings of the 4th European Conference on Space Debris (ESA SP-587), 18–20 April 2005, p. 445.\n\n\t^ Henry Nahra, \"Effect of Micrometeoroid and Space Debris Impacts on the Space Station Freedom Solar Array Surfaces\". Presented at the 1989 Spring Meeting of the Materials Research Society, 24–29 April 1989, NASA TR-102287.\n\n\t^ a b c d de Selding, Peter B. (16 January 2014). \"Space Station Required No Evasive Maneuvers in 2013 Despite Growing Debris Threat\". Space News. Retrieved 17 January 2014.\n\n\n\t^ \"Junk alert for space station crew\", BBC News, 12 March 2009.\n\n\t^ \"International Space Station in debris scare\", BBC News, 28 June 2011.\n\n\t^ Haines, Lester. \"ISS spared space junk avoidance manoeuvre\", The Register, 17 March 2009.\n\n\t^ \"Scientist: Space weapons pose debris threat – CNN\". Articles.CNN.com. 3 May 2002. Archived from the original on 30 September 2012. Retrieved 17 March 2011.\n\n\n\t^ \"The Danger of Space Junk – 98.07\". TheAtlantic.com. Retrieved 17 March 2011.\n\n\n\t^ a b Donald J. Kessler and Burton G. Cour-Palais (1978). \"Collision Frequency of Artificial Satellites: The Creation of a Debris Belt\". Journal of Geophysical Research. 83 (A6): 2637–2646. Bibcode:1978JGR....83.2637K. doi:10.1029/JA083iA06p02637.\n\n\n\t^ a b c Kessler 1991, p. 63.\n\n\t^ Bechara J. Saab, \"Planet Earth, Space Debris\", Hypothesis Volume 7 Issue 1 (September 2009).\n\n\t^ a b Jan Stupl et al, \"Debris-debris collision avoidance using medium power ground-based lasers\", 2010 Beijing Orbital Debris Mitigation Workshop, 18–19 October 2010, see graph p. 4  Archived 9 March 2012 at the Wayback Machine\n\n\t^ Brown, M. (2012). Orbital Debris Frequently Asked Questions. Retrieved from https://orbitaldebris.jsc.nasa.gov/faq.html.\n\n\t^ U.S. Congress, Office of Technology Assessment, \"Orbiting Debris: A Space Environmental Problem\" Archived 4 March 2016 at the Wayback Machine, Background Paper, OTA-BP-ISC-72, U.S. Government Printing Office, September 1990, p. 3\n\n\t^ \"Today in Science History\" todayinsci.com. Retrieved 8 March 2006.\n\n\t^ Tony Long, \"Jan. 22, 1997: Heads Up, Lottie! It's Space Junk!\", wired, 22 January 2009. Retrieved 27 March 2016\n\n\t^ \"NASA – Part I – The History of Skylab.\" NASA's Marshall Space Flight Center and Kennedy Space Center, 16 March 2009.\n\n\t^ \"NASA – John F. Kennedy Space Center Story.\" NASA Kennedy Space Center, 16 March 2009.\n\n\t^ \"PAM-D Debris Falls in Saudi Arabia\", The Orbital Debris Quarterly News, Volume 6 Issue 2 (April 2001).\n\n\t^ \"Debris Photos\" NASA.\n\n\t^ Wallach, Dan (1 February 2016). \"Columbia shuttle tragedy marks Sabine County town\". Retrieved 8 May 2018.\n\n\n\t^ \"Columbia Accident Investigation Report, Volume II Appendix D.10\" (PDF). Archived from the original on 17 October 2011. Retrieved 10 May 2018.CS1 maint: BOT: original-url status unknown (link)\n\n\n\t^ \"Shuttle Debris Falls on East Texas, Louisiana\". 1 February 2003. Retrieved 8 May 2018.\n\n\n\t^ \"Debris Warning\" NASA.\n\n\t^ \"Debris from fallen space shuttle Columbia has new mission 15 years after tragedy\". 1 February 2018. Retrieved 8 May 2018.\n\n\n\t^ Jano Gibson, \"Jet's flaming space junk scare\", The Sydney Morning Herald, 28 March 2007.\n\n\t^ D. Mehrholz et al;\"Detecting, Tracking and Imaging Space Debris\", ESA bulletin 109, February 2002.\n\n\t^ Ben Greene, \"Laser Tracking of Space Debris\", Electro Optic Systems Pty\n\n\t^ \"Orbital debris: Optical Measurements\", NASA Orbital Debris Program Office\n\n\t^ Pantaleo, Rick. \"Australian Scientists Track Space Junk by Listening to FM Radio\". web. Retrieved 3 December 2013.\n\n\n\t^ Englert, Christoph R.; Bays, J. Timothy; Marr, Kenneth D.; Brown, Charles M.; Nicholas, Andrew C.; Finne, Theodore T. (2014). \"Optical orbital debris spotter\". Acta Astronautica. 104 (1): 99–105. Bibcode:2014AcAau.104...99E. doi:10.1016/j.actaastro.2014.07.031.\n\n\n\t^ Grant Stokes et al, \"The Space-Based Visible Program\", MIT Lincoln Laboratory. Retrieved 8 March 2006.\n\n\t^ H. Klinkrad, \"Monitoring Space – Efforts Made by European Countries\", fas.org. Retrieved 8 March 2006.\n\n\t^ \"MIT Haystack Observatory\" haystack.mit.edu. Retrieved 8 March 2006.\n\n\t^ \"AN/FPS-108 COBRA DANE.\" fas.org. Retrieved 8 March 2006.\n\n\t^ Darius Nikanpour, \"Space Debris Mitigation Technologies\" Archived 19 October 2012 at the Wayback Machine, Proceedings of the Space Debris Congress, 7–9 May 2009.\n\n\t^ \"STS-76 Mir Environmental Effects Payload (MEEP)\". NASA. March 1996. Retrieved 8 March 2011.\n\n\n\t^ MEEP, NASA, 4 April 2002. Retrieved 8 July 2011\n\n\t^ \"STS-76 Mir Environmental Effects Payload (MEEP)\", NASA, March 1996. Retrieved 8 March 2011.\n\n\t^ a b David Portree and Joseph Loftus. \"Orbital Debris: A Chronology\" Archived 1 September 2000 at the Wayback Machine, NASA, 1999, p. 13.\n\n\t^ David Whitlock, \"History of On-Orbit Satellite Fragmentations\", NASA JSC, 2004\n\n\t^ a b Johnson, Nicholas (5 December 2011). \"Space debris issues\". audio file, @0:05:50-0:07:40. The Space Show. Archived from the original on 27 January 2012. Retrieved 8 December 2011.\n\n\n\t^ a b c d Foust, Jeff (25 November 2014). \"Companies Have Technologies, but Not Business Plans, for Orbital Debris Cleanup\". Space News. Retrieved 6 December 2014.\n\n\n\t^ Foust, Jeff (24 November 2014). \"Industry Worries Government 'Backsliding' on Orbital Debris\". Space News. Archived from the original on 8 December 2014. Retrieved 8 December 2014. Despite growing concern about the threat posed by orbital debris, and language in U.S. national space policy directing government agencies to study debris cleanup technologies, many in the space community worry that the government is not doing enough to implement that policy.\n\n\n\t^ Northfield, Rebecca (20 June 2018). \"Women of Nasa: past, present and future\". eandt.theiet.org. Retrieved 20 January 2019.\n\n\n\t^ \"USA Space Debris Envinronment, Operations, and Policy Updates\" (PDF). NASA. UNOOSA. Retrieved 1 October 2011.\n[permanent dead link]\n\n\t^ Johnson, Nicholas (5 December 2011). \"Space debris issues\". audio file, @1:03:05-1:06:20. The Space Show. Archived from the original on 27 January 2012. Retrieved 8 December 2011.\n\n\n\t^ \"UN Space Debris Mitigation Guidelines\", UN Office for Outer Space Affairs, 2010.\n\n\t^ Theresa Hitchens, \"COPUOS Wades into the Next Great Space Debate\" Archived 26 December 2008 at the Wayback Machine, The Bulletin of the Atomic Scientists, 26 June 2008.\n\n\t^ \n\"Compliance of Rocket Upper Stages in GTO with Space Debris Mitigation Guidelines\". Space Safety Magazine. 18 July 2013. Retrieved 16 February 2016.\n\n\n\t^ \"U.S. Government Orbital Debris Mitigation Standard Practices\" (PDF). United States Federal Government. Retrieved 28 November 2013.\n\n\n\t^ \"Orbital Debris – Important Reference Documents.\", NASA Orbital Debris Program Office.\n\n\t^ \"Mitigating space debris generation\". European Space Agency. 19 April 2013. Retrieved 27 July 2014.\n\n\n\t^ E A Taylor and J R Davey, \"Implementation of debris mitigation using International Organization for Standardization (ISO) standards\", Proceedings of the Institution of Mechanical Engineers: G, Volume 221 Number 8 (1 June 2007), pp. 987 – 996.\n\n\t^ Howell, E. (2013). Experts Urge Removal of Space Debris From Orbit. Universe Today. Retrieved from http://www.universetoday.com/101790/experts-urge-removal-of-space-debris-from-orbit/\n\n\t^ \"OneWeb Taps Airbus To Build 900 Internet Smallsats\". SpaceNews. 15 June 2015. Retrieved 19 June 2015.\n\n\n\t^ \nBrodkin, Jon (4 October 2017). \"SpaceX and OneWeb broadband satellites raise fears about space debris\". Ars Technica. Retrieved 7 October 2017.\n\n\n\t^ a b Frank Zegler and Bernard Kutter, \"Evolving to a Depot-Based Space Transportation Architecture\", AIAA SPACE 2010 Conference & Exposition, 30 August-2 September 2010, AIAA 2010–8638. Archived 10 May 2013 at the Wayback Machine\n\n\t^ Robotic refueling Mission\n\n\t^ \nBergin, Chris (27 September 2016). \"SpaceX reveals ITS Mars game changer via colonization plan\". NASASpaceFlight.com. Retrieved 21 October 2016.\n\n\n\t^ https://www.nasaspaceflight.com/2018/03/rocket-lab-capitalize-test-flight-success-first-operational-mission/\n\n\t^ Luc Moliner, \"Spot-1 Earth Observation Satellite Deorbitation\" Archived 16 January 2011 at the Wayback Machine, AIAA, 2002.\n\n\t^ \"Spacecraft: Spot 3\" Archived 30 September 2011 at the Wayback Machine, agi, 2003\n\n\t^ Bill Christensen, \"The Terminator Tether Aims to Clean Up Low Earth Orbit\", space.com. Retrieved 8 March 2006.\n\n\t^ Jonathan Amos, \"How satellites could 'sail' home\", BBC News, 3 May 2009.\n\n\t^ \"Safe And Efficient De-Orbit Of Space Junk Without Making The Problem Worse\". Space Daily. 3 August 2010. Retrieved 16 September 2013.\n\n\n\t^ \"Experts: Active Removal Key To Countering Space Junk Threat\" Peter B. de Selding, Space.com 31 October 2012.\n\n\t^ a b Stefan Lovgren, \"Space Junk Cleanup Needed, NASA Experts Warn.\" National Geographic News, 19 January 2006.\n\n\t^ Jan, McHarg (10 August 2012). \"Project aims to remove space debris\". Phys.org. Retrieved 3 April 2013.\n\n\n\t^ Erika Carlson et al, \"Final design of a space debris removal system\", NASA/CR-189976, 1990.\n\n\t^ \"Intelsat Picks MacDonald, Dettwiler and Associates Ltd. for Satellite Servicing\" Archived 12 May 2011 at the Wayback Machine, CNW Newswire, 15 March 2011. Retrieved 15 July 2011.\n\n\t^ Peter de Selding, \"MDA Designing In-orbit Servicing Spacecraft\", Space News, 3 March 2010. Retrieved 15 July 2011.\n\n\t^ Schaub, H.; Sternovsky, Z. (2013). \"Active Space Debris Charging for Contactless Electrostatic Disposal\". Advances in Space Research. 53 (1): 110–118. Bibcode:2014AdSpR..53..110S. doi:10.1016/j.asr.2013.10.003.\n\n\n\t^ \"News\", Star Inc. Retrieved 18 July 2011.\n\n\t^ \"Cleaning up Earth's orbit: A Swiss satellite tackles space junk\". EPFL. 15 February 2012. Retrieved 3 April 2013.\n\n\n\t^ \"Space Debris Removal | Cleanspace One\". Space Debris Removal | Cleanspace One. Retrieved 1 December 2017.\n\n\n\t^ Jonathan Campbell, \"Using Lasers in Space: Laser Orbital Debris Removal and Asteroid Deflection\", Occasional Paper No. 20, Air University, Maxwell Air Force Base, December 2000.\n\n\t^ Mann, Adam (26 October 2011). \"Space Junk Crisis: Time to Bring in the Lasers\". Wired Science. Retrieved 1 November 2011.\n\n\n\t^ Ivan Bekey, \"Project Orion: Orbital Debris Removal Using Ground-Based Sensors and Lasers.\", Second European Conference on Space Debris, 1997, ESA-SP 393, p. 699.\n\n\t^ Justin Mullins \"A clean sweep: NASA plans to carry out a spot of housework.\", New Scientist, 16 August 2000.\n\n\t^ Tony Reichhardt, \"Satellite Smashers\" Archived 29 July 2012 at Archive.today, Air & Space Magazine, 1 March 2008.\n\n\t^ James Mason et al, \"Orbital Debris-Debris Collision Avoidance\", arXiv:1103.1690v2, 9 March 2011.\n\n\t^ C. Bombardelli and J. Peláez, \"Ion Beam Shepherd for Contactless Space Debris Removal\". Journal of Guidance, Control, and Dynamics, Vol. 34, No. 3, May–June 2011, pp 916–920. http://sdg.aero.upm.es/PUBLICATIONS/PDF/2011/AIAA-51832-628.pdf\n\n\t^ Daniel Michaels, \"A Cosmic Question: How to Get Rid Of All That Orbiting Space Junk?\", Wall Street Journal, 11 March 2009.\n\n\t^ \"Company floats giant balloon concept as solution to space mess\", Global Aerospace Corp press release, 4 August 2010.\n\n\t^ \"Space Debris Removal\", Star-tech-inc.com. Retrieved 18 July 2011.\n\n\t^ Foust, Jeff (5 October 2011). \"A Sticky Solution for Grabbing Objects in Space\". MIT Technology Review. Retrieved 7 October 2011.\n\n\n\t^ Jason Palmer, \"Space junk could be tackled by housekeeping spacecraft \", BBC News, 8 August 2011\n\n\t^ Roppolo, Michael. \"Japan Launches Net Into Space to Help With Orbital Debris\". CBS News. 28 February 2014\n\n\t^ \"Japan launching 'space junk' collector (Update)\". Retrieved 24 January 2017.\n\n\n\t^ \"Japan launches 'space junk' collector – Times of India\". The Times of India. Retrieved 24 January 2017.\n\n\n\t^ \"Space cargo ship experiment to clean up debris hits snag\". The Japan Times Online. 31 January 2017. Retrieved 2 February 2017.\n\n\n\t^ \"A Japanese Space Junk Removal Experiment Has Failed in Orbit\". Space.com. Retrieved 2 February 2017.\n\n\n\t^ \"Japan's troubled 'space junk' mission fails\". Retrieved 12 February 2017.\n\n\n\t^ \"E.DEORBIT Mission\". ESA. 12 April 2017. Retrieved 6 October 2018.\n[permanent dead link]\n\n\t^ Biesbroek, 2012 \"Introduction to e.Deorbit\" Archived 17 September 2014 at the Wayback Machine. e.deorbit symposium. 6 May 2014\n\n\t^ Clark, Stephen (1 April 2018). \"Eliminating space junk could take step toward reality with station cargo launch\". Spaceflight Now. Retrieved 6 April 2018.\n\n\n\t^ Fred Whipple, \"The Theory of Micro-Meteorites, Part I: In an Isothermal Atmosphere\", Proceedings of the National Academy of Sciences, Volume 36 Number 12 (15 December 1950), pp. 667 – 695.\n\n\t^ Fred Whipple, \"The Theory of Micrometeorites.\", Popular Astronomy, Volume 57, 1949, p. 517.\n\n\t^ a b Whipple, Fred (1951). \"A Comet Model. II. Physical Relations for Comets and Meteors\". Astrophysical Journal. 113: 464–474. Bibcode:1951ApJ...113..464W. doi:10.1086/145416.\n\n\n\t^ Brownlee, D. E.; Tomandl, D. A.; Olszewski, E. (1977). \"1977LPI.....8..145B Interplanetary dust: A new source of extraterrestrial material for laboratory studies\". Proceedings of the 8th Lunar Scientific Conference. 1977: 149–160. Bibcode:1977LPI.....8..145B.\n\n\n\t^ Hans Pettersson, \"Cosmic Spherules and Meteoritic Dust.\" Scientific American, Volume 202 Issue 2 (February 1960), pp. 123–132.\n\n\t^ Andrew Snelling and David Rush, \"Moon Dust and the Age of the Solar System\" Archived 12 May 2011 at the Wayback Machine Creation Ex-Nihilo Technical Journal, Volume 7 Number 1 (1993), p. 2–42.\n\n\t^ Brian Marsden, \"Professor Fred Whipple: Astronomer who developed the idea that comets are 'dirty snowballs'.\" The Independent, 13 November 2004.\n\n\t^ Fred Whipple, \"Of Comets and Meteors\" Science, Volume 289 Number 5480 (4 August 2000), p. 728.\n\n\t^ Judith Reustle (curator), \"Shield Development: Basic Concepts\" Archived 27 September 2011 at the Wayback Machine, NASA HVIT. Retrieved 20 July 2011.\n\n\t^ Ceramic Fabric Offers Space Age Protection, 1994 Hypervelocity Impact Symposium\n\n\t^ Kim Dismukes (curator), \"TransHab Concept\", NASA, 27 June 2003. Retrieved 10 June 2007.\n\n\t^ Howell, Elizabeth (6 October 2014). \"Private Inflatable Room Launching to Space Station Next Year\". Space.com. Retrieved 6 December 2014.\n\n\n\t^ https://www.nasaspaceflight.com/2016/04/iss-crs-8-dragon-arrival-flawless-launch/\n\n\t^ Ley, Willy (August 1960). \"How to Slay Dragons\". For Your Information. Galaxy Science Fiction. pp. 57–72.\n\n\n\t^ Felix Hoots, Paul Schumacher Jr.; Glover, Robert (2004). \"History of Analytical Orbit Modeling in the U.S. Space Surveillance System\". Journal of Guidance Control and Dynamics. 27 (2): 174–185. Bibcode:2004JGCD...27..174H. doi:10.2514/1.9161.\n\n\n\t^ T.S. Kelso, CelesTrak BBS: Historical Archives, 2-line elements dating to 1980\n\n\t^ a b Schefter, p. 48.\n\n\t^ Kessler 1978\n\n\t^ Schefter\n\n\t^ Kessler 1981\n\n\t^ pdf of article\n\n\t^ Technical, p. 4\n\n\t^ See charts, Hoffman p. 7.\n\n\t^ See chart, Hoffman p. 4.\n\n\t^ In the time between writing Chapter 1 (earlier) and the Prolog (later) of Space Debris, Klinkrad changed the number from 8,500 to 13,000 – compare p. 6 and ix.\n\n\t^ Michael Hoffman, \"It's getting crowded up there.\" Space News, 3 April 2009.\n\n\t^ \"Space Junk Threat Will Grow for Astronauts and Satellites\", Fox News, 6 April 2011.\n\n\t^ Kessler 2001\n\n\t^ Technical\n\n\t^ J.-C Liou and N. L. Johnson, \"Risks in Space from Orbiting Debris\", Science, Volume 311 Number 5759 (20 January 2006), pp. 340 – 341\n\n\t^ Antony Milne, Sky Static: The Space Debris Crisis, Greenwood Publishing Group, 2002, \nISBN 0-275-97749-8, p. 86.\n\n\t^ Technical, p. 7.\n\n\t^ Paul Marks, \"Space debris threat to future launches\", 27 October 2009.\n\n\t^ Space junk at tipping point, says report, BBC News, 2 September 2011\n\n\t^ \n\"Starlink Press Kit\" (PDF). SpaceX. 15 May 2019. Retrieved 23 May 2019.\n\n\n\t^ Foust, Jeff (1 July 2019). \"Starlink failures highlight space sustainability concerns\". SpaceNews. Retrieved 3 July 2019.\n\n\n\t^ Rhett & Link (6 July 2009). \"Space Junk Song\". YouTube (video). Retrieved 18 August 2018.\n\n\n\n\n\nBibliography[edit]\n\n\n\tDonald Kessler (Kessler 1991), \"Collisional Cascading: The Limits of Population Growth in Low Earth Orbit\", Advances in Space Research, Volume 11 Number 12 (December 1991), pp. 63 – 66.\n\tDonald Kessler (Kessler 1971), \"Estimate of Particle Densities and Collision Danger for Spacecraft Moving Through the Asteroid Belt\", Physical Studies of Minor Planets, NASA SP-267, 1971, pp. 595 – 605. Bibcode 1971NASSP.267..595K.\n\tDonald Kessler (Kessler 2009), webpages.charter.net, 8 March 2009.\n\tDonald Kessler (Kessler 1981), \"Sources of Orbital Debris and the Projected Environment for Future Spacecraft\", Journal of Spacecraft, Volume 16 Number 4 (July–August 1981), pp. 357 – 360.\n\tDonald Kessler and Burton Cour-Palais (Kessler 1978), \"Collision Frequency of Artificial Satellites: The Creation of a Debris Belt\" Journal of Geophysical Research, Volume 81, Number A6 (1 June 1978), pp. 2637–2646.\n\tDonald Kessler and Phillip Anz-Meador, \"Critical Number of Spacecraft in Low Earth Orbit: Using Fragmentation Data to Evaluate the Stability of the Orbital Debris Environment\", Presented and the Third European Conference on Space Debris, March 2001.\n\tHeiner Klinkrad, \"Space Debris: Models and Risk Analysis\", Springer-Praxis, 2006, \nISBN 3-540-25448-X.\n\t(Technical), \"Orbital Debris: A Technical Assessment\" National Academy of Sciences, 1995. \nISBN 0-309-05125-8.\n\tJim Schefter, \"The Growing Peril of Space Debris\" Popular Science, July 1982, pp. 48 – 51.\n\n\n\n\nFurther reading[edit]\n\n\n\n\t\"What is Orbital Debris?\", Center for Orbital and Reentry Debris Studies, Aerospace Corporation\n\tCommittee for the Assessment of NASA's Orbital Debris Programs (2011). Limiting Future Collision Risk to Spacecraft: An Assessment of NASA's Meteoroid and Orbital Debris Programs. Washington, D.C.: National Research Council. ISBN 978-0-309-21974-7.\n\n\tKlotz, Irene (1 September 2011). \"Space junk reaching 'tipping point,' report warns\". Reuters. Retrieved 2 September 2011.\n News item summarizing the above report\n\n\n\tSteven A. Hildreth and Allison Arnold. Threats to U.S. National Security Interests in Space: Orbital Debris Mitigation and Removal. Washington, D.C.: Congressional Research Service, 8 January 2014.\n\tDavid Leonard, \"The Clutter Above\", Bulletin of the Atomic Scientists, July/August 2005.\n\tPatrick McDaniel, \"A Methodology for Estimating the Uncertainty in the Predicted Annual Risk to Orbiting Spacecraft from Current or Predicted Space Debris Population\". National Defense University, 1997.\n\t\"Interagency Report on Orbital Debris, 1995\", National Science and Technology Council, November 1995.\n\tNickolay Smirnov, Space Debris: Hazard Evaluation and Mitigation. Boca Raton, FL: CRC Press, 2002, \nISBN 0-415-27907-0.\n\tRichard Talcott, \"How We Junked Up Outer Space\", Astronomy, Volume 36, Issue 6 (June 2008), pp. 40–43.\n\t\"Technical report on space debris, 1999\", United Nations, 2006. \nISBN 92-1-100813-1.\n\tRobin Biesbroek (2015). Active Debris Removal in Space: How to Clean the Earth's Environment from Space Debris. CreateSpace. ISBN 978-1-5085-2918-7.\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Space debris.\n\n\n\t\tWikinews has related news:\n Out of space in outer space: Special report on NASA's 'space junk' plans\n\n\n\n\tSativew – Tracking Space Junk in real time\n\tNASA Orbital Debris Program Office\n\tESA Space Debris Office\n\t\"Space: the final junkyard\", documentary film\n\tWould a Saturn-like ring system around planet Earth remain stable? Abdul Ahad\n\tEISACT Space Debris during the international polar year\n\tIntro to mathematical modeling of space debris flux\n\tSOCRATES: A free daily service predicting close encounters on orbit between satellites and debris orbiting Earth\n\tA summary of current space debris by type and orbit\n\tSpace Junk Astronomy Cast episode No. 82, includes full transcript\n\tPaul Maley's Satellite Page – Space debris (with photos)\n\tSpace Debris Illustrated: The Problem in Pictures\n\tPACA: Space Debris\n\tIEEE – The Growing Threat of Space Debris\n\tThe Threat of Orbital Debris and Protecting NASA Space Assets from Satellite Collisions\n\t[1] [2]\n\tSpace Age Wasteland: Debris in Orbit Is Here to Stay; Scientific American; 2012\n\tUnited States Space Surveillance Network\n\tPATENDER: GMV’S Trailblazing low-gravity space-debris capture system\n\tSpace Junk Infographic\n\tProject West Ford an intentional placement of a large number of small copper metallic objects in medium Earth orbit (long lifetime) in the 1960s by the US government, resulting in a large amount of space debris, which created international relations adverse effects.\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n... in space\n\n\tBiology\t\n\tAnimals (Cats · Dogs · Mice · Non-human primates · Tortoises)\n\tExtraterrestrial\n\tThe human body (in spacecraft · exposed)\n\tHygiene\n\tLocomotion\n\tMedicine\n\tMicroorganisms\n\tNeuroscience\n\tPlants\n\tAstrobotany\n\n\n\tSex\n\tSleep\n\n\n\n\t\n\n\tEnvironment\t\n\tClimate\n\tCorrosion\n\tDebris\n\tDust\n\tWeather\n\tWeathering\n\n\n\n\n\n\n\tSociety\t\n\tAdvertising\n\tAlcohol\n\tArchaeology (of Earth · of items in space)\n\tBurial\n\tChristmas\n\tColonization\n\tEconomy\n\tExploration\n\tLaw\n\tMilitary\n\tUnited States\n\n\n\tMusic\n\tReligion\n\tTourism\n\tWar\n\tWomen\n\n\n\n\n\tTechnology\t\n\tAccidents\n\tArchitecture\n\tFood\n\tHuman spaceflight\n\tPower (Batteries · Nuclear power · Solar power for Earth · Solar panels on spacecraft)\n\tRadar\n\tTelescopes\n\tToilets\n\tWeapons\n\tWriting\n\n\n\n\n\tSee also\t\n\tNear space\n\tOuter space\n\n\n\n\n\n\n\n\tAuthority control \t\n\tNDL: 01236260\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Space_debris&oldid=917699755\"\n\n\t\t\n\t\tCategories: \tSpace debris\n\tGlobal issues\n\tSpace hazards\n\tSpaceflight\n\tLitter\n\tNear-Earth objects\n\tFuture problems\n\tTechnology hazards\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tWebarchive template wayback links\n\tAll articles with dead external links\n\tArticles with dead external links from July 2011\n\tArticles with dead external links from July 2018\n\tCS1 maint: BOT: original-url status unknown\n\tArticles with dead external links from November 2017\n\tArticles with permanently dead external links\n\tWebarchive template archiveis links\n\tArticles with dead external links from January 2019\n\tUse dmy dates from January 2013\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from August 2018\n\tArticles containing potentially dated statements from July 2016\n\tAll articles containing potentially dated statements\n\tArticles containing potentially dated statements from January 2019\n\tAll self-contradictory articles\n\tWikipedia articles needing page number citations from December 2015\n\tArticles containing potentially dated statements from October 2009\n\tAll Wikipedia articles needing clarification\n\tWikipedia articles needing clarification from January 2016\n\tWikipedia articles needing clarification from August 2017\n\tArticles with unsourced statements from February 2015\n\tArticles containing potentially dated statements from January 2014\n\tArticles containing potentially dated statements from November 2014\n\tArticles containing potentially dated statements from 2006\n\tAll articles with failed verification\n\tArticles with failed verification from December 2015\n\tWikipedia articles in need of updating from December 2015\n\tAll Wikipedia articles in need of updating\n\tArticles with unsourced statements from December 2014\n\tWikipedia articles that may have off-topic sections from October 2014\n\tAll articles that may have off-topic sections\n\tArticles with unsourced statements from July 2011\n\tArticles with incomplete citations from February 2015\n\tAll articles with vague or ambiguous time\n\tVague or ambiguous time from December 2014\n\tArticles containing potentially dated statements from 2009\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tالعربية\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tCatalà\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGaeilge\n\t한국어\n\tՀայերեն\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tҚазақша\n\tLëtzebuergesch\n\tLietuvių\n\tLimburgs\n\tMagyar\n\tമലയാളം\n\tBahasa Melayu\n\tМонгол\n\tNederlands\n\t日本語\n\tNorsk\n\tPolski\n\tPortuguês\n\tРусский\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tతెలుగు\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 25 September 2019, at 01:31 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "12", "dc:title": "Space debris - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Debris-GEO1280.jpg/1200px-Debris-GEO1280.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-space_debris", "title": "Space debris - Wikipedia"}}