{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStatic random-access memory - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tStatic random-access memory\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t  (Redirected from Static Random Access Memory)\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tSemiconductor memory\n\nNot to be confused with Synchronous dynamic random-access memory (SDRAM).\n\n\t\n\tThis article has multiple issues. Please help improve it or discuss these issues on the talk page. (Learn how and when to remove these template messages)\n\n      \t\n\tThis article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.\nFind sources: \"Static random-access memory\" – news · newspapers · books · scholar · JSTOR  (July 2010) (Learn how and when to remove this template message)\n\n\n\n\t\n\tThis article is in list format, but may read better as prose. You can help by converting this article, if appropriate. Editing help is available.  (June 2019)\n\n\n\n    \n\n\n (Learn how and when to remove this template message)\n\n\n\n  \nA static RAM chip from a Nintendo Entertainment System clone (2K × 8 bits)\n\n\n\n\tComputer memory types\n\t\nVolatile\n\t\nRAM\n\t\n\tDRAM\n\tSDRAM\n\n\n\tSRAM\n\n\n\t\nHistorical\n\t\n\tWilliams–Kilburn tube (1946–47)\n\tDelay line memory (1947)\n\tMellon optical memory (1951)\n\tSelectron tube (1952)\n\tDekatron\n\tT-RAM (2009)\n\tZ-RAM (2002–2010)\n\n\n\t\nNon-volatile\n\t\nROM\n\t\n\tMask ROM\n\tPROM\n\tEPROM\n\tEEPROM\n\tFlash memory\n\n\n\t\nNVRAM\n\t\n\tReRAM\n\n\n\t\nEarly stage NVRAM\n\t\n\tFeRAM\n\tMRAM\n\tPCM\n\tFeFET memory\n\n\n\t\nMagnetic\n\t\n\tMagnetic tape\n\tHard disk drive\n\n\n\t\nOptical\n\t\n\tOptical disc\n\n\n\t\nIn development\n\t\n\tCBRAM\n\tRacetrack memory\n\tNRAM\n\tMillipede memory\n\tFJG RAM\n\n\n\t\nHistorical\n\t\n\tPaper data storage (1725)\n\tDrum memory (1932)\n\tMagnetic-core memory (1949)\n\tPlated wire memory (1957)\n\tCore rope memory (1960s)\n\tThin-film memory (1962)\n\tDisk pack (1962)\n\tTwistor memory (~1968)\n\tBubble memory (~1970)\n\tFloppy disk (1971)\n\n\n\t\tv\n\tt\n\te\n\n\n\n\n\nStatic random-access memory (static RAM or SRAM)  is a type of semiconductor random-access memory (RAM) that uses bistable latching circuitry (flip-flop) to store each bit.  SRAM exhibits data remanence,[1] but it is still volatile in the conventional sense that data is eventually lost when the memory is not powered.\n\nThe term static differentiates SRAM from DRAM (dynamic random-access memory) which must be periodically refreshed.  SRAM is faster and more expensive than DRAM; it is typically used for CPU cache while DRAM is used for a computer's main memory.\n\n\nContents\n\n\n\t1 Applications and uses\n\t1.1 Characteristics\n\t1.1.1 Clock rate and power\n\t1.1.2 Contemporary SRAM devices\n\t1.1.3 Embedded use\n\t1.1.4 In computers\n\t1.1.5 Hobbyists\n\n\n\n\n\n\n\t2 Types of SRAM\n\t2.1 Non-volatile SRAM (NV-SRAM)\n\t2.2 Pseudo SRAM (PSRAM)\n\t2.3 By transistor type\n\t2.4 By function\n\t2.5 By feature\n\t2.6 By flip-flop type\n\n\n\n\t3 Design\n\t4 SRAM operation\n\t4.1 Standby\n\t4.2 Reading\n\t4.3 Writing\n\t4.4 Bus behavior\n\n\n\n\t5 See also\n\t6 References\n\n\n\n\n\nApplications and uses[edit]\n\n  \nSRAM cells on the die of a STM32F103VGT6 microcontroller as seen by a scanning electron microscope. Manufactured by STMicroelectronics using a 180 nanometre process.\n\n\n\n  \nComparison image of 180 nanometre SRAM cells on a STM32F103VGT6 microcontroller as seen by an optical microscope\n\n\n\nCharacteristics[edit]\n\nAdvantages:\n\n\n\tSimplicity – a refresh circuit is not needed\n\tPerformance\n\tReliability\n\tLow idle power consumption\n\n\nDisadvantages:\n\n\n\tPrice\n\tDensity\n\tHigh operational power consumption\n\n\nClock rate and power[edit]\n\nThe power consumption of SRAM varies widely depending on how frequently it is accessed; in some instances, it can use as much power as dynamic RAM, when used at high frequencies, and some ICs can consume many watts at full bandwidth. On the other hand, static RAM used at a somewhat slower pace, such as in applications with moderately clocked microprocessors, draws very little power and can have a nearly negligible power consumption when sitting idle –  in the region of a few micro-watts. Several techniques have been proposed to manage power consumption of SRAM-based memory structures.[2]\n\n\nContemporary SRAM devices[edit]\n\n\tgeneral purpose products\n\twith asynchronous interface, such as the ubiquitous 28-pin 8K × 8 and 32K × 8 chips (often but not always named something along the lines of 6264 and 62C256 respectively), as well as similar products up to 16 Mbit per chip\n\twith synchronous interface, usually used for caches and other applications requiring burst transfers, up to 18 Mbit (256K × 72) per chip\n\n\n\tintegrated on chip\n\tas RAM or cache memory in micro-controllers (usually from around 32 bytes up to 128 kilobytes)\n\tas the primary caches in powerful microprocessors, such as the x86 family, and many others (from 8 KB, up to many megabytes)\n\tto store the registers and parts of the state-machines used in some microprocessors (see register file)\n\ton application specific ICs, or ASICs (usually in the order of kilobytes)\n\tin Field Programmable Gate Array and Complex Programmable Logic Device\n\n\n\n\nEmbedded use[edit]\n\nMany categories of industrial and scientific subsystems, automotive electronics, and similar, contain static RAM. Some amount (kilobytes or less) is also embedded in practically all modern appliances, toys, etc. that implement an electronic user interface. Several megabytes may be used in complex products such as digital cameras, cell phones, synthesizers, etc.\n\nSRAM in its dual-ported form is sometimes used for real-time digital signal processing circuits.[3]\n\n\nIn computers[edit]\n\nSRAM is also used in personal computers, workstations, routers and peripheral equipment: CPU register files, internal CPU caches and external burst mode SRAM caches, hard disk buffers, router buffers, etc. LCD screens and printers also normally employ static RAM to hold the image displayed (or to be printed). Static RAM was used for the main memory of some early personal computers such as the ZX80, TRS-80 Model 100 and Commodore VIC-20.\n\n\nHobbyists[edit]\n\nHobbyists, specifically home-built processor enthusiasts,[4] often prefer SRAM due to the ease of interfacing. It is much easier to work with than DRAM as there are no refresh cycles and the address and data buses are directly accessible rather than multiplexed. In addition to buses and power connections, SRAM usually requires only three controls: Chip Enable (CE), Write Enable (WE) and Output Enable (OE). In synchronous SRAM, Clock (CLK) is also included.[citation needed]\n\n\nTypes of SRAM[edit]\n\nNon-volatile SRAM (NV-SRAM)[edit]\n\nNon-volatile SRAMs, or nvSRAMs, have standard SRAM functionality, but they save the data when the power supply is lost, ensuring preservation of critical information. nvSRAMs are used in a wide range of situations – networking, aerospace, and medical, among many others[5] – where the preservation of data is critical and where batteries are impractical.\n\n\nPseudo SRAM (PSRAM)[edit]\n\nPSRAMs have a DRAM storage core, combined with a self refresh circuit.[6] They appear externally as a slower SRAM. They have a density/cost advantage over true SRAM, without the access complexity of DRAM.\n\n\nBy transistor type[edit]\n\n\tBipolar junction transistor (used in TTL and ECL) –  very fast but consumes a lot of power\n\tMOSFET (used in CMOS) –  low power and very common today\n\n\nBy function[edit]\n\n\tAsynchronous –  independent of clock frequency; data in and data out are controlled by address transition.\n\tSynchronous –  all timings are initiated by the clock edge(s). Address, data in and other control signals are associated with the clock signals.\n\n\nIn 1990s, asynchronous SRAM used to be employed for fast access time. Asynchronous SRAM was used as main memory for small cache-less embedded processors used in everything from industrial electronics and measurement systems to hard disks and networking equipment, among many other applications. Nowadays, synchronous SRAM (e.g. DDR SRAM) is rather employed similarly like Synchronous DRAM – DDR SDRAM memory is rather used than asynchronous DRAM. Synchronous memory interface is much faster as access time can be significantly reduced by employing pipeline architecture. Furthermore, as DRAM is much cheaper than SRAM, SRAM is often replaced by DRAM, especially in the case when large volume of data is required. SRAM memory is however much faster for random (not block / burst) access. Therefore, SRAM memory is mainly used for CPU cache, small on-chip memory, FIFOs or other small buffers.\n\n\nBy feature[edit]\n\n\tZero bus turnaround (ZBT) –  the turnaround is the number of clock cycles it takes to change access to the SRAM from write to read and vice versa. The turnaround for ZBT SRAMs or the latency between read and write cycle is zero.\n\tsyncBurst (syncBurst SRAM or synchronous-burst SRAM) –  features synchronous burst write access to the SRAM to increase write operation to the SRAM\n\tDDR SRAM –  Synchronous, single read/write port, double data rate I/O\n\tQuad Data Rate SRAM – Synchronous, separate read and write ports, quadruple data rate I/O\n\n\nBy flip-flop type[edit]\n\n\tBinary SRAM\n\tTernary SRAM\n\n\nDesign[edit]\n\n  \nA six-transistor CMOS SRAM cell\n\n\n\nA typical SRAM cell is made up of six MOSFETs. Each bit in an SRAM is stored on four transistors (M1, M2, M3, M4) that form two cross-coupled inverters. This storage cell has two stable states which are used to denote 0 and 1. Two additional access transistors serve to control the access to a storage cell during read and write operations. In addition to such six-transistor (6T) SRAM, other kinds of SRAM chips use 4, 8, 10 (4T, 8T, 10T SRAM), or more transistors per bit.[7][8][9] Four-transistor SRAM is quite common in stand-alone SRAM devices (as opposed to SRAM used for CPU caches), implemented in special processes with an extra layer of polysilicon, allowing for very high-resistance pull-up resistors.[10] The principal drawback of using 4T SRAM is increased static power due to the constant current flow through one of the pull-down transistors.\n\n\n  \nFour transistor SRAM provides advantages in density at the cost of manufacturing complexity. The resistors must have small dimensions and large values.\n\n\n\nThis is sometimes used to implement more than one (read and/or write) port, which may be useful in certain types of video memory and register files implemented with multi-ported SRAM circuitry.\n\nGenerally, the fewer transistors needed per cell, the smaller each cell can be. Since the cost of processing a silicon wafer is relatively fixed, using smaller cells and so packing more bits on one wafer reduces the cost per bit of memory.\n\nMemory cells that use fewer than four transistors are possible –  but, such 3T[11][12] or 1T cells are DRAM, not SRAM (even the so-called 1T-SRAM).\n\nAccess to the cell is enabled by the word line (WL in figure) which controls the two access transistors M5 and M6 which, in turn, control whether the cell should be connected to the bit lines: BL and BL. They are used to transfer data for both read and write operations. Although it is not strictly necessary to have two bit lines, both the signal and its inverse are typically provided in order to improve noise margins.\n\nDuring read accesses, the bit lines are actively driven high and low by the inverters in the SRAM cell. This improves SRAM bandwidth compared to DRAMs –  in a DRAM, the bit line is connected to storage capacitors and charge sharing causes the bit line to swing upwards or downwards. The symmetric structure of SRAMs also allows for differential signaling, which makes small voltage swings more easily detectable. Another difference with DRAM that contributes to making SRAM faster is that commercial chips accept all address bits at a time. By comparison, commodity DRAMs have the address multiplexed in two halves, i.e. higher bits followed by lower bits, over the same package pins in order to keep their size and cost down.\n\nThe size of an SRAM with m address lines and n data lines is 2m words, or 2m × n bits.  The most common word size is 8 bits, meaning that a single byte can be read or written to each of 2m different words within the SRAM chip.  Several common SRAM chips have 11 address lines (thus a capacity of 2m = 2,048 = 3d words) and an 8-bit word, so they are referred to as \"2k × 8 SRAM\".\n\n\n\n\nSRAM operation[edit]\n\nAn SRAM cell has three different states: standby (the circuit is idle), reading (the data has been requested) or writing (updating the contents). SRAM operating in read mode and write modes should  have \"readability\"  and \"write stability\", respectively. The three different states work as follows:\n\n\nStandby[edit]\n\nIf the word line is not asserted, the access transistors M5 and M6 disconnect the cell from the bit lines. The two cross-coupled inverters formed by M1 – M4 will continue to reinforce each other as long as they are connected to the supply.\n\n\nReading[edit]\n\nIn theory, reading only requires asserting the word line WL and reading the SRAM cell state by a single access transistor and bit line, e.g. M6, BL. However, bit lines are relatively long and have large parasitic capacitance. To speed up reading, a more complex process is used in practice: The read cycle is started by precharging both bit lines BL and BL, to high (logic 1) voltage. Then asserting the word line WL enables both the access transistors M5 and M6, which causes one bit line BL voltage to slightly drop. Then the BL and BL lines will have a small voltage difference between them. A sense amplifier will sense which line has the higher voltage and thus determine whether there was 1 or 0 stored. The higher the sensitivity of the sense amplifier, the faster the read operation. As the NMOS is more powerful, the pull-down is easier. Therefore, bit lines are traditionally precharged to high voltage. Many researchers are also trying to precharge at a slightly low voltage to reduce the power consumption.[13][14]\n\n\nWriting[edit]\n\nThe write cycle begins by applying the value to be written to the bit lines. If we wish to write a 0, we would apply a 0 to the bit lines, i.e. setting BL to 1 and BL to 0. This is similar to applying a reset pulse to an SR-latch, which causes the flip flop to change state. A 1 is written by inverting the values of the bit lines. WL is then asserted and the value that is to be stored is latched in. This works because the bit line input-drivers are designed to be much stronger than the relatively weak transistors in the cell itself so they can easily override the previous state of the cross-coupled inverters. In practice, access NMOS transistors M5 and M6 have to be stronger than either bottom NMOS (M1, M3) or top PMOS (M2, M4) transistors. This is easily obtained as PMOS transistors are much weaker than NMOS when same sized. Consequently, when one transistor pair (e.g.  M3 and M4) is only slightly overridden by the write process, the opposite transistors pair (M1 and M2) gate voltage is also changed. This means that the M1 and M2 transistors can be easier overridden, and so on. Thus, cross-coupled inverters magnify the writing process.\n\n\nBus behavior[edit]\n\nRAM with an access time of 70 ns will output valid data within 70 ns from the time that the address lines are valid. But the data will remain for a hold time as well (5–10 ns). Rise and fall times also influence valid timeslots with approximately 5 ns. By reading the lower part of an address range, bits in sequence (page cycle) one can read with significantly shorter access time (30 ns).[15]\n\n\nSee also[edit]\n\n\tFlash memory\n\tMiniature Card, a discontinued SRAM memory card standard\n\n\nReferences[edit]\n\n\n\t^ Sergei Skorobogatov (June 2002). \"Low temperature data remanence in static RAM\". University of Cambridge, Computer Laboratory. Retrieved 2008-02-27. Cite journal requires |journal= (help)\n\n\t^ \"A Survey of Architectural Techniques For Improving Cache Power Efficiency\", S. Mittal, SUSCOM, 4(1), 33–43, 2014\n\n\t^ Shared Memory Interface with the TMS320C54x DSP (PDF), retrieved 2019-05-04\n\n\n\t^ \"Homemade CPU\".\n\n\n\t^ Computer organization (4th ed.). [S.l.]: McGraw-Hill. 1996-07-01. ISBN 978-0-07-114323-3.\n\n\n\t^ \"3.0V Core Async/Page PSRAM Memory\" (PDF). Micron. Retrieved 2019-05-04.\n\n\n\t^ A 160 mV Robust Schmitt Trigger Based Subthreshold SRAM\n\n\t^ United States Patent 6975532: Quasi-static random access memory\n\n\t^ \"Area Optimization in 6T and 8T SRAM Cells Considering Vth Variation in Future Processes -- MORITA et al. E90-C (10): 1949 -- IEICE Transactions on Electronics\".\n\n\n\t^ Preston, Ronald P. (2001). \"14: Register Files and Caches\" (PDF). The Design of High Performance Microprocessor Circuits. IEEE Press. p. 290.\n\n\n\t^ United States Patent 6975531: 6F2 3-transistor DRAM gain cell\n\n\t^ 3T-iRAM(r) Technology\n\n\t^ SRAM precharge system for reducing write power\n\n\t^ High Speed, Low Power Design Rules for SRAM Precharge and Self-timing under Technology Variations\n\n\t^ \"Tentative Toshiba mos digital integrated circuit silicon gate cmos 4,194,304-word by 16-bit cmos pseudo static RAM\" (PDF).\n 070731 toshiba.com\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Static_random-access_memory&oldid=915821286\"\n\n\t\t\n\t\tCategories: \tComputer memory\n\tTypes of RAM\n\n\nHidden categories: \tCS1 errors: missing periodical\n\tArticles with short description\n\tArticles needing additional references from July 2010\n\tAll articles needing additional references\n\tArticles needing cleanup from June 2019\n\tAll pages needing cleanup\n\tArticles with sections that need to be turned into prose from June 2019\n\tArticles with multiple maintenance issues\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from November 2010\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tBosanski\n\tCatalà\n\tČeština\n\tDeutsch\n\tEesti\n\tEspañol\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tLatina\n\tമലയാളം\n\tNederlands\n\t日本語\n\tNorsk\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tShqip\n\tSimple English\n\tSlovenčina\n\tСрпски / srpski\n\tSuomi\n\tSvenska\n\tTürkçe\n\tУкраїнська\n\tTiếng Việt\n\t吴语\n\t粵語\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 15 September 2019, at 14:04 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "Static random-access memory - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/1/15/Hyundai_RAM_HY6116AP-10.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-static_random_access_memory", "title": "Static random-access memory - Wikipedia"}}