{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSunshield (JWST) - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tSunshield (JWST)\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\t\n\tThis article may be too technical for most readers to understand. Please help improve it to make it understandable to non-experts, without removing the technical details.  (January 2017) (Learn how and when to remove this template message)\n\n\n\n  \nSunshield full-size test unit, 2014\n\n\n\n  \nThe \"hot\" side of JWST with the sunshield protecting the main optics from sunlight\n\n\n\n  \nDiagram of roll limits and how they impact pointing\n\n\n\n  \nThe JWST Sunshield can be compared to a beach umbrella. It keeps the shaded area cooler and allows a person to avoid squinting in the bright sunlight. Like a folding umbrella, the JWST sunshield will be expanded after it is in space, but is folded up during launch.\n\n\n\nSunshield is a component of the James Webb Space Telescope, designed to shield the main optics from the Sun's heat and light. This is part of a space telescope and it extends out unfolding a large metal-coated sheet of material post-launch. This material blocks the Sun's light and heat, so the telescope can see the faint light coming from stars and galaxies. The sunshield segment includes the layers and its deployment mechanisms, which also includes the trim flap.[1][2]\n\nThe layers of the sunshield provide an insulating layer for the optics and help dissipate heat. The shield has five layers and, each layer is roughly the size of a tennis court. Each layer is as thin as a human hair and is coated with aluminum for reflectivity. The purple color of some layers comes from the material silicon, the same material in most computer chips, which toughens the shield and which helps it reflect heat. The telescope uses the sunshield to stop itself from being warmed by infrared radiation from the Sun and other nearby planetary objects, which would otherwise inhibit normal operations of onboard instruments.\n\nThe purple-magenta hue of the sun-facing side of Sunshield, originates from silicon doped aluminum coating on the outermost kapton membrane.[3]\n\n\nContents\n\n\n\t1 Overview\n\t2 Deployment\n\t3 Trim flap/momentum trim tab\n\t4 Layers\n\t5 Events\n\t6 See also\n\t7 References\n\t8 External links\n\n\n\n\n\nOverview[edit]\n\nThe sunshield acts as large parasol allowing the main mirror, optics, and instruments to passively cool to 50 kelvins (−220 °C; −370 °F) or lower.[2] It consists of layers of Kapton and is big enough to shade the main mirror and secondary mirror, leaving only one instrument, the MIRI (Mid-Infrared Instrument), in need of extra cooling.[2] The sunshield has five layers to mitigate the conduction of heat, and the layers also have a special coating to radiate and reflect heat into space.[2] The first layer is 0.002 inches (51 μm) thick, and the other layers are 0.001 inches (25 μm) thick.[4] The kite-shaped sunshield about is 22 meters by 10 meters in size.[5] In operation it will receive about 300 kilowatts of solar radiation, but only pass 23 milliwatts to the other side.[5] It is a V-groove radiator and causes a temperature drop of 300 kelvins (300 °C, 572 °F)[6] from front to back.[5] The telescope needs to be colder than the objects it is attempting to observe.[7] It needs to be that cold enough that its internal infrared emissions are significantly less than the observed objects at the relevant wavelengths. The sunshield is a critical part of the telescope to achieve temperatures low enough for the sensitive infrared observations it is planning to make.[7] The sunshield membrane is one of the enabling technologies that will allow the JWST to operate.[8]\n\nTo make observations in the near and mid infrared spectrum, the JWST must be kept very cold (under 50 K (−220 °C; −370 °F)), otherwise infrared radiation from the telescope itself would overwhelm its instruments. Therefore, it uses a large sunshield to block light and heat from the Sun, Earth, and Moon, and its position near the Earth–Sun L2 point keeps all three bodies on the same side of the spacecraft at all times.[9] Its halo orbit around L2 avoids the shadow of the Earth and Moon, maintaining a constant environment for the sunshield and solar arrays.[10]  The sunshield is made of the polyimide film Kapton, which is stable at very low temperatures.[2]\n\nThe core material of the sunshield is the material Kapton coated with aluminum, and the two closest layers to the Sun are also doped with silicon.[2] This helps the material survive in space, radiate excess heat, and they are also designed to conduct electricity so a charge does not build up on the layers.[2] The silicon-doped aluminum layer is 50 nanometers (nm) thick.[4] A 100 nm thick aluminum coating is applied to the front and back of all five layers.[4] The core Kapton layer on the first layer is an extra 0.001 inches (25 μm) thick, and the rest are 0.001 inches (25 μm) in thickness.[4]\n\nKapton is noted for being stable from -269 to 400 Celsius (-452 to plus 752 degrees Fahrenheit).[3]\n\nThe layers are designed with Thermal Spot Bond (TSB), which helps stop a rip or hole from increasing in size should one occur.[2] There is a grid pattern bonded to each layer at intervals.[2]\n\nEach layer has a slightly different shape and size.[2] The layer (level 5) is the closest to the primary mirror and is the smallest. The layer closest to the Sun is called Layer 1 and is bigger and more curved.[2] The first layer blocks 90% of the heat, and each successive layer blocks more heat, which is vented out the sides.[2][7] The sunshield allows the optics to stay in shadow for pitch angles of +5° to −45° and roll angles of +5° to −5°.[8]\n\nThe sunshield is designed to be folded twelve times so it will fit within the Ariane 5 rocket's 4.57 m × 16.19 m shroud. Once deployed at the L2 point, it will unfold to 21.197 m × 14.162 m. The sunshield was hand-assembled at ManTech (NeXolve) in Huntsville, Alabama before it was delivered to Northrop Grumman in Redondo Beach, California for testing.[11] During launch it is wrapped around the Optical Telescope Element and then later is unfolded.[5] The sunshield is planned to be unfolded two days after launch.[12]\n\n\nInfrared is heat radiation. In order to see the faint glow of infrared heat from distant stars and galaxies, the telescope has to be very cold. If the telescope were heated by sunlight or the warm glow of the Earth, the infrared light emitted by the telescope would outshine its targets, and it wouldn’t be able to see anything.\n— NASA Deputy Senior Project Scientist for the Webb Telescope at Goddard, 2008[13]\n\n\n\nDeployment[edit]\n\nThe sunshield component attaches to the main spacecraft, and its booms expand outward spreading out the head shield and separating the layers.[14] During launch the whole thing is folded up, then later when its in space is carefully unfurled.[14] \nSunshield deployment structure/devices[15] \n\n\n\ttelescoping booms\n\tstem deployers\n\n\n\tspreader bars\n\tcable drives\n\n\nThere are two stem deployers inside the telescoping booms.[15] These are special electrical motors that, when operated, extended the telescopic boom, pulling out the folded sunshield.[16] The telescopic booms are called the MBA, or mid-boom assemblies.[17] At the end of each MBA is a spreader bar.\n\nComponents:[17]\n\n\n\tCore\n\tFront and Aft four-bar linkage\n\tAft structure assembly\n\tMomentum Trim Tab (the tab is attached to the aft structure assembly)\n\tAft spreader bars (spreads layers in the rear)\n\n\n\tForward structure assembly\n\tForward spreader bars\n\n\n\tMid-Booms (one on each side)\n\tMid-spreader bars (spreads the 5 layers apart)\n\n\n\tTwo forward and Two aft Bipod launch lock assemblies\n\n\nThe Bipod launch lock assemblies are where the Sunshield segment connects to the OTE while it is folded up during launch.[17]\n\nThere are six spreader bars that expand to separate the layers of the sunshield, which has roughly six sides.[17]\n\nWhen the sunshield is fully spread open, it is 14.6 meters wide and 21.1 meters long.[17] When the layers are fully open, they are opened wider at the edges which helps reflect heat out.[17]\n\n\nTrim flap/momentum trim tab[edit]\n\nThe sunshield segment also includes that trim flap at the end of a sunshield deployment boom.[1] This is also called the momentum trim tab.[17] The trim tab helps balance out solar pressure.[1] The trim tab also manages the effects of the reaction wheels.[1] The reaction wheels are located in the Spacecraft Bus (JWST)\n\nThe trim flap reduces the amount of fuel needed, because the spacecraft does not have to balance out the force from solar pressure.[17]\n\n\nLayers[edit]\n\n  \nThe five layers of the JWST Sunshield being tested in 2013\n\n\n\n  \nCoupons of Sunshield test fabric being tested to see how they perform, 2012\n\n\n\n  \nIn this artists view, a stylized portrayal of the orientation of the telescope, shows how the Sunshield blocks sunlight from heating the main mirror (not to scale)\n\n\n\nThe layer nearest to Primary mirror, L5 is the only one with a line of sight to it, while the l5 layer closest to the Sun, is the only one that receives direct sunlight.[2] The separation between layers, in the vacuum of space, prevents heat transfer by conduction and aids in radiating heat out of the way.[16]\n\nThe silicon-doping is what causes the purple hue of the areas covered with that material.[16]\n\nThe layers are designed so the Sun, Earth, and Moon shine on layer 1 almost exclusively, sometimes a tiny portion of layer 2, and on the other side that the telescope elements only see Layer 5 and sometimes a tiny amount of Layer 4.[17]\n\nLayers:[2]\n\n\n\tLayer 1\n\t0.05 millimeters (0.002 inches)\n\t100 nm (3.93 microinches) alumnium coating (Both sides)\n\t50 nanometers (nm) (1.9 microinches) silicon-doped aluminum\n\tBiggest area layer[2]\n\n\n\tLayer 2\n\t0.025 mm (0.001 inches)\n\t100 nm (3.93 microinches) aluminum coating (Both sides)\n\t50 nanometers (nm) (1.9 microinches) silicon-doped aluminum\n\n\n\tLayer 3\n\t0.025 mm (0.001 inches)\n\t100 nm (3.93 microinches) aluminum coating (Both sides)\n\n\n\tLayer 4\n\t0.025 mm (0.001 inches)\n\t100 nm (3.93 microinches) aluminum coating (Both sides)\n\n\n\tLayer 5\n\t0.025 mm (0.001 inches)\n\t100 nm (3.93 microinches) aluminum coating (Both sides)\n\tSmallest area layer[2]\n\n\n\n\nDuring development the Sunshield layer material was tested with heat, cold, radiation, and high-velocity micro impacts.[13]\n\n\nEvents[edit]\n\n\t2007 or before, TRL6 achieved for the Sunshield membrane[8]\n\tSeptember 11, 2016, first layer of Sunshield completed.[6]\n\tNovember 2, 2016, the final layer is completed.[18]\n\tMarch 27, 2018, NASA announced the presence of tears in the sunshield, contributing to launch delays.[19]\n\n\nSee also[edit]\n\n\tJames Webb Space Telescope timeline\n\tSkylab (also used deployed expanding fabric/layer sun-shield in the 1970s)\n\tSpacecraft thermal control\n\tNew Worlds Mission (also blocks sunlight, but for observing exoplanets obscured by their bright parent star)\n\tInsulation\n\tHeat shield\n\n\nReferences[edit]\n\n\n\t^ a b c d The Webb Update #5 - September 2008.\n\n\t^ a b c d e f g h i j k l m n o p \"The James Webb Space Telescope\".\n\n\t^ a b \"Sunshield Coatings Webb/NASA\". jwst.nasa.gov. Retrieved 2019-09-16.\n\n\n\t^ a b c d \"The James Webb Space Telescope\".\n\n\n\t^ a b c d \"Sunshield\".\n\n\n\t^ a b \"JWST sunshield\".\n\n\n\t^ a b c \"This Sunshield Will Keep the World's Most Powerful Space Telescope from Frying\".\n\n\n\t^ a b c [1]\n\n\t^ \"The James Webb Space Telescope\". nasa.gov. Retrieved 28 August 2016.\n\n\n\t^ \"L2 Orbit\". Space Telescope Science Institute. Retrieved 28 August 2016.\n\n\n\t^ Morring, Jr., Frank, Sunshield, Aviation Week and Space Technology, December 16, 2013, pp. 48–49.\n\n\t^ \"Deployment\".\n\n\n\t^ a b [2]\n\n\t^ a b \"NASA - Super-Tough Sunshield to Fly on the James Webb Space Telescope\". www.nasa.gov. Retrieved 2017-01-20.\n\n\n\t^ a b \"NASA - Testing the Fold: The James Webb Space Telescope's Sunshield\". www.nasa.gov. Retrieved 2017-01-20.\n\n\n\t^ a b c [3].\n\n\t^ a b c d e f g h i Arenberg, J.; Flynn, J.; Cohen, A.; Lynch, R.; Cooper, J. (9 August 2016). \"Status of the JWST sunshield and spacecraft\" (PDF). Society of Photo-Optical Instrumentation Engineers (SPIE). 9904. doi:10.1117/12.2234481. Retrieved 28 March 2018.\n\n\n\t^ \"Final layer of sunshield completed for NASA's James Webb Space Telescope - SpaceFlight Insider\".\n\n\n\t^ Lewin, Sarah. \"NASA Delays Launch of James Webb Space Telescope Until 2020\". Space.com. Purch. Retrieved 28 March 2018.\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Sunshield (JWST).\n\n\n\tEngineering the James Webb Space Telescope Section The JWST Sunshield\n\n\n\t\tv\n\tt\n\te\n\n\nJames Webb Space Telescope\n\n\t\n\tJames Webb Space Telescope timeline\n\n\n\n\n\tInstruments/sensors\t\n\tFGS/NIRISS (Fine Guidance Sensor and Near Infrared Imager and Slitless Spectrograph)\n\tMIRI (Mid-Infrared Instrument)\n\tNIRCam (Near-Infrared Camera)\n\tNIRSpec (Near-Infrared Spectrograph)\n\n\n\n\t\n\n\tElements\t\n\tIntegrated Science Instrument Module\n\tOptical Telescope Element\n\tSpacecraft Bus\n\tSunshield\n\n\n\n\n\tRelated\t\n\tAriane 5 (planned launcher)\n\tSpaceWire\n\tOTE Pathfinder\n\tJames E. Webb (namesake)\n\n\n\n\n\t\n\tNASA\n\tESA\n\tCSA\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Sunshield_(JWST)&oldid=916020581\"\n\n\t\t\n\t\tCategories: \tJames Webb Space Telescope\n\n\nHidden categories: \tWikipedia articles that are too technical from January 2017\n\tAll articles that are too technical\n\tArticles needing expert attention from January 2017\n\tAll articles needing expert attention\n\tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\n\n\t\t\t\tAdd links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 16 September 2019, at 15:13 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "4", "dc:title": "Sunshield (JWST) - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/James_Webb_telescope_sunshield.jpg/1200px-James_Webb_telescope_sunshield.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-sunshield_-jwst", "title": "Sunshield (JWST) - Wikipedia"}}