{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSyncom - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tSyncom\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\t\n\tThis article includes a list of references, but its sources remain unclear because it has insufficient inline citations. Please help to improve this article by introducing more precise citations.  (July 2011) (Learn how and when to remove this template message)\n\n\n\nSyncom (for \"synchronous communication satellite\") started as a 1961 NASA program for active geosynchronous communication satellites, all of which were developed and manufactured by Hughes Space and Communications. Syncom 2, launched in 1963, was the world's first geosynchronous communications satellite.  Syncom 3, launched in 1964, was the world's first geostationary satellite.[1]\n\nIn the 1980s, the series was continued as Syncom IV with some much larger satellites, also manufactured by Hughes. They were leased to the United States military under the Leasat program.\n\n\nContents\n\n\n\t1 Syncom 1, 2 and 3\n\t1.1 Common features\n\t1.2 Syncom 1\n\t1.3 Syncom 2\n\t1.4 Syncom 3\n\n\n\n\t2 Syncom IV (Leasat)\n\t3 See also\n\t4 Notes\n\t5 References\n\t6 Further reading\n\t7 External links\n\n\n\n\n\nSyncom 1, 2 and 3[edit]\n\n  \nFirst generation Syncom satellite.\n\n\n\nCommon features[edit]\n\nThe three early Syncom satellites were experimental spacecraft built by Hughes Aircraft Company's facility in Culver City, California, by a team led by Harold Rosen, Don Williams, and Thomas Hudspeth.[2] All three satellites were cylindrical in shape, with a diameter of about 71 centimeters (28 in) and a height of about 39 centimeters (15 in).  Pre-launch fueled masses were 68 kilograms (150 lb), and orbital masses were 39 kilograms (86 lb) with a 25-kilogram (55 lb) payload. They were capable of emitting signals on two transponders at just 2 W. Thus, Syncom satellites were only capable of carrying a single two-way telephone conversation, or 16 Teletype connections. As of 25 June 2009[update], all three satellites are still in orbit, although no longer functioning.[3]\n\n\nSyncom 1[edit]\n\nSyncom 1 was intended to be the first geosynchronous communications satellite.  It was launched on February 14, 1963 with the Delta B #16 launch vehicle from Cape Canaveral, but was lost on the way to geosynchronous orbit due to an electronics failure.[4]  Seconds after the apogee kick motor for circularizing the orbit was fired, the spacecraft fell silent. Later telescopic observations verified the satellite was in an orbit with a period of almost 24 hours at a 33° inclination.\n\n\nSyncom 2[edit]\n\nSyncom 2 was launched by NASA on July 26, 1963[5] with the Delta B #20 launch vehicle from Cape Canaveral. The satellite successfully kept station at the altitude calculated by Herman Potočnik Noordung in the 1920s.\n\nDuring the first year of Syncom 2 operations, NASA conducted voice, teletype, and facsimile tests,[5] as well as 110 public demonstrations to show the capabilities of this satellite and invite feedback. In August 1963, President John F. Kennedy in Washington, D.C., telephoned Nigerian Prime Minister Abubakar Tafawa Balewa aboard USNS Kingsport docked in Lagos Harbor—the first live two-way call between heads of government by satellite. The Kingsport acted as a control station and uplink station.\n\nSyncom 2 also relayed a number of test television transmissions from Fort Dix, New Jersey to a ground station in Andover, Maine, beginning on September 29, 1963.  Although it was low-quality video with no audio, it was the first successful television transmission through a geosynchronous satellite.[5]\n\n\nSyncom 3[edit]\n\nSyncom 3 was the first geostationary communication satellite, launched on August 19, 1964 with the Delta D #25 launch vehicle from Cape Canaveral.  The satellite, in orbit near the International Date Line, had the addition of a wideband channel for television and was used to telecast the 1964 Summer Olympics in Tokyo to the United States.[6] Although Syncom 3 is sometimes credited with the first television program to cross the Pacific Ocean, the Relay 1 satellite first broadcast television from the United States to Japan on November 22, 1963.[7]\n\nTurned off in 1969, Syncom 3 remains in geosynchronous orbit as of December 2012.[8]  In 40 years it has drifted 8 degrees to the west, to longitude 172.[9]\n\n\nSyncom IV (Leasat)[edit]\n\n  \nSyncom IV, Hughes owned US Military Leasat\n\n\n\nThe five satellites of the 1980s Leasat (Leased Satellite) program (Leasat F1 through Leasat F5) were alternatively named Syncom IV-1 to Syncom IV-5 and called HS 381 by the manufacturer.[10] These satellites were considerably larger than Syncoms 1 to 3, weighing 1.3 tonnes each (over 7 tonnes with launch fuel). At 4.26 meters (14.0 ft), the satellites were the first to be designed for launch from the Space Shuttle payload bay,[11] and were deployed like a Frisbee.[12] The satellites are 30 rpm spin-stabilized with a despun communications and antenna section. They were made with a solid rocket motor for initial perigee burn and hydrazine propellant for station keeping and spin stabilization. The communications systems offers a wideband UHF channel (500 kHz bandwidth), six relay 25 kHz channels, and five narrowband 5 kHz channels.[13][14] This is in addition to the fleet broadcast frequency, which is in the military's X-band. The system was used by military customers in the US and later in Australia. Most of the satellites were retired in the 1990s, but one would remain operational until 2015. During the First Gulf War, Leasat would be used for personal communications between Secretary of State James Baker and President George H. W. Bush,[15] but was more typically used by \"mobile air, surface, subsurface, and fixed earth stations of the Navy, Marine Corps, Air Force, and Army.\"[13]\n\nHughes was contracted to provide a worldwide communications system based on four satellites, one over the continental United States (CONUS), and one each over the Atlantic, Pacific, and Indian oceans, spaced about 90 degrees apart.[11] Five satellites were ordered, with one as a replacement. Also part of the contract were the associated control systems and ground stations. The lease contracts were typically for 5-year terms, with the lessee having the opportunity to extend the lease or to purchase the equipment outright. The US Navy was the original lessee.\n\nLeasat F1's launch was cancelled just prior to lift-off, and F2 became the first into orbit on August 30, 1984 aboard Discovery on shuttle mission STS-41-D. F2 was largely successful, but its wideband receiver was out of commission after only 4 months.[15] F1 was launched successfully on November 8, 1984 aboard STS-51-A. This was followed on April 12, 1985 by Leasat F3 on STS-51-D. F3's launch was declared a failure when the satellite failed to start its maneuver to geostationary orbit once released from Discovery. Attempts by Shuttle astronauts to activate F3 with a makeshift \"flyswatter\" were unsuccessful.[15] The satellite was left in low earth orbit, and the Space Shuttle returned to Earth. This failure made front-page news in the New York Times.[16] Hughes had an insurance policy on the satellite, and so claimed a total loss for the spacecraft of about $200 million, an amount underwritten by numerous parties.\n\nHowever, with another satellite planned to be launched, it was determined that a space walk by a subsequent Shuttle crew might be able to \"wake\" the craft. The best guess was that a switch had failed to turn on the satellite. A \"bypass box\" was hastily constructed, NASA was excited to offer assistance, the customer was supportive, and the insurance underwriters agreed to fund the attempt at space salvage – a first.[16]\n\nOn August 27, 1985 Discovery was again used to launch Leasat F4, and during the same mission (STS-51-I) captured the 15,000 lb stricken F3. Astronaut James van Hoften grappled and then manually spun down the F3 satellite. After the bypass box was installed by van Hoften and Bill Fisher,[17] van Hoften manually spun the satellite up. Once released, the F3 successfully powered up, fired its perigee motor and obtained a geostationary orbit. (This scenario would play out again in 1992 with Intelsat 603 and Endeavour.) While F3 was now operational, Leasat F4 soon failed and was itself declared a loss after only 40 hours of RF communications.[15][17]\n\nThe stricken F4 did not remain a complete failure. Data from F4's failure permitted the saving of F1 from a premature failure. Since all of the Leasats are spin-stabilized, they have a bearing point that connects the non-rotating and rotating parts of the spacecraft. After F4's communication failure, it suffered a spin lock while attempting to jostle the communications payload: the spun and despun sections locked together.[15] Remembering this second failure of F4, and with F1 beginning to wear out at the spin bearing, it was decided to \"flip\" F1 every six months to keep the payload in the sun.[15] Thus F1 went on to operate smoothly for its remaining life and never encountered a locked despun section.\n\nLeasat F4 was subsequently powered down and moved to a graveyard orbit with a large amount of station keeping fuel in reserve. This was fortuitous; when another satellite suffered a loss of its fuel ten years later, Hughes engineers pioneered the use of alternative propellants with Leasat F4. Long after its primary mission had failed, F4 was powered back on to test whether a satellite could be kept on station using nonvolatile propellants.[15] F4 was used to perform numerous tests, including maneuvers with oxidizer for propulsion once the hydrazine ran out.\n\nThe fifth and last Leasat (F5), which was built as a spare, was successfully launched by Columbia mission STS-32 on January 9, 1990. The last active Leasat, it was officially decommissioned on September 24, 2015, at 18:25:13 UTC.[18] F5 was one of the longest-serving and most successful commercial satellites. Towards the end of its 25-year life, F5 had been leased by the Australian Defence Force for UHF service.\n\n\n\tDate\n\tName\n\tID\n\tLaunch vehicle\n\n\t1963-02-14\n\tSyncom 1\n\t1963-004A\n\tThor Delta B\n\n\t1963-07-26\n\tSyncom 2\n\t1963-031A\n\tThor Delta B\n\n\t1964-08-19\n\tSyncom 3\n\t1964-047A\n\tThor Delta D\n\n\t1984-11-10\n\tLeasat F1\n\t1984-113C\n\tDiscovery, STS-51-A\n\n\t1984-08-31\n\tLeasat F2\n\t1984-093C\n\tDiscovery, STS-41-D\n\n\t1985-04-12\n\tLeasat F3\n\t1985-028C\n\tDiscovery, STS-51-D\n\n\t1985-08-29\n\tLeasat F4\n\t1985-076D\n\tDiscovery, STS-51-I\n\n\t1990-01-09\n\tLeasat F5\n\t1990-002B\n\tColumbia, STS-32\n\n\n\nSee also[edit]\n\n\tList of communications satellite firsts\n\tJohn H. Rubel\n\n\nNotes[edit]\n\n\n\t^ \n\"Syncom 1, 2, 3\". 2013-03-06. Retrieved 2013-03-10. Syncom 3 was the first geostationary satellite...It was...placed over the equator at 180 degrees longitude in the Pacific Ocean. The satellite provided live television coverage of the 1964 Olympic games in Tokyo, Japan...\n\n\t^ https://www.nytimes.com/2017/02/02/business/harold-rosen-dead-engineer-satellite.html\n\n\t^ \"U.S. Space Objects Registry\". Archived from the original on 2013-10-06. Retrieved 2009-06-25.\n (extremely slow site)\n\n\t^ \"The Room-Size World (cover story)\". TIME magazine. May 14, 1965. Italic or bold markup not allowed in: |publisher= (help)\n\n\n\t^ a b c Henry, Varice F.; McDonald, Michael E. (July 1965). \"Television Tests with the Syncom II Synchronous Communications Satellite (NASA technical note D-2911)\" (PDF). ntrs.nasa.gov. NASA. Retrieved 2014-12-07.\n\n\n\t^ \n\"For Gold, Silver & Bronze\". TIME magazine. October 16, 1964. Italic or bold markup not allowed in: |publisher= (help)\n\n\n\t^ \"Significant Achievements in Space Communications and Navigation, 1958-1964\" (PDF). NASA-SP-93. NASA. 1966. pp. 30–32. Retrieved 2009-10-31.\n\n\n\t^ \n\"Syncom 3. Satellite details and informations about 1964-047A, TLE data for Norad 858\". Infosatellites.com. Retrieved 2013-03-11. The spacecraft next carried out a series of attitude and velocity maneuvers to align itself with the equator at an inclination of 0.1 degrees and to slow its speed so it drifted west to the planned location at 180 degrees longitude where its speed at altitude was synchronized with the Earth.\n\n\n\t^ \"Real time tracking and positioning of Syncom 3 satellite 1964-047A identified by Norad 858\".\n Requires Javascript.\n\n\t^ https://web.archive.org/web/19990505230020/http://www.spaceway.com/uplink/archive/up942/leasat942.html\n\n\t^ a b http://fas.org/spp/military/program/com/leasat.htm\n\n\t^ http://www.hughesscgheritage.com/leasat-beginnings-and-significance-dr-boris-t-subbotin/\n\n\t^ a b https://web.archive.org/web/20091230151101/http://boeing.com/defense-space/space/bss/factsheets/government/leasat/leasat.html\n\n\t^ http://space.skyrocket.de/doc_sdat/leasat.htm\n\n\t^ a b c d e f g http://www.hughesscgheritage.com/leasat-f5-the-final-chapter-andy-ott/\n\n\t^ a b http://www.hughesscgheritage.com/the-leasat-rescue-mission-steve-dorfman/\n\n\t^ a b https://web.archive.org/web/19990507015718/http://www.spaceway.com/uplink/archive/up964/leasat964.html\n\n\t^ Nerenberg, Sharyn (January 24, 2015). \"Another Intelsat Satellite Serves Customers for More Than 25 Years\". Intelsat. Archived from the original on September 26, 2015. Retrieved September 25, 2015.\n\n\n\n\n\nReferences[edit]\n\n\t\"Satellite to open new Asia-U.S. link\". The New York Times. December 4, 1963.\n\n\t\"Syncom 3 to be lofted today\". The New York Times. August 19, 1964.\n\n\t\"Syncom 3 is launched into a preliminary orbit\". The New York Times. August 20, 1964.\n\n\t\"Syncom is pushed into second orbit\". The New York Times. August 21, 1964.\n\n\t\"Test of Syncom 3 called successful\". The New York Times. August 23, 1964.\n\n\t\"Syncom 3 now hovering on station over Pacific\". The New York Times. September 13, 1964.\n\n\t\"Syncom 3 relaying TV over the Pacific\". The New York Times. September 24, 1964.\n\n\n\nFurther reading[edit]\n\n\t\"Boeing.  Satellite Development Center.  Syncom.  The world's first geosynchronous communications satellite\". Archived from the original on 2010-11-11. Retrieved 2013-03-11. For example, no transistor amplifiers existed, and transistors then didn't work well at frequencies above 70 MHz. We had to get up to 10 GHz. So we used a chain of diode frequency multipliers, or doublers.\n\n\n\nExternal links[edit]\n\n\t\"The Stay-Putnik\", a March 1963 Popular Science article on Syncom 1\n\tBoeing: Detailed Leasat information\n\tBoeing: Detailed Syncom information\n\tBoeing: High resolution Syncom image\n\n\n\tSyncom 2 satellite description\n\tDaniel R. Glover's page about NASA Experimental Communications Satellites\n\tNASA Goddard Space Flight centre descriptions:\n\tSyncom 1\n\tSyncom 2\n\tSyncom 3\n\n\n\tGunter's Space Page:\n\tSyncom 1, 2, 3\n\tLeasat 1-5 (Syncom-IV 1 to 5)\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Syncom&oldid=917584508\"\n\n\t\t\n\t\tCategories: \t1961 establishments in the United States\n\t1963 in spaceflight\n\tNASA programs\n\tHistory of telecommunications\n\tCommunications satellites\n\n\nHidden categories: \tCS1 errors: markup\n\tArticles lacking in-text citations from July 2011\n\tAll articles lacking in-text citations\n\tArticles containing potentially dated statements from June 2009\n\tAll articles containing potentially dated statements\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tDeutsch\n\tEspañol\n\tFrançais\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tLatviešu\n\tNederlands\n\tPortuguês\n\tSuomi\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 24 September 2019, at 14:15 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "3", "dc:title": "Syncom - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-syncom", "title": "Syncom - Wikipedia"}}