{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTelescope - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tTelescope\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tFor other uses, see Telescope (disambiguation).\n\nOptical instrument that makes distant objects appear magnified\n\n  \nThe 100 inch (2.54 m) Hooker reflecting telescope at Mount Wilson Observatory near Los Angeles, USA\n\n\n\nA telescope is an optical instrument that makes distant objects appear magnified by using an arrangement of lenses or curved mirrors and lenses, or various devices used to observe distant objects by their emission, absorption, or reflection of electromagnetic radiation.[1] The first known practical telescopes were refracting telescopes invented in the Netherlands at the beginning of the 17th century, by using glass lenses. They were used for both terrestrial applications and astronomy.\n\nThe reflecting telescope, which uses mirrors to collect and focus light, was invented within a few decades of the first refracting telescope. In the 20th century, many new types of telescopes were invented, including radio telescopes in the 1930s and infrared telescopes in the 1960s. The word telescope now refers to a wide range of instruments capable of detecting different regions of the electromagnetic spectrum, and in some cases other types of detectors.\n\n\nContents\n\n\n\t1 Etymology\n\t2 History\n\t3 Types\n\t3.1 Optical telescopes\n\t3.2 Radio telescopes\n\t3.3 X-ray telescopes\n\t3.4 Gamma-ray telescopes\n\t3.5 Other types of telescopes\n\n\n\n\t4 Types of mount\n\t5 Atmospheric electromagnetic opacity\n\t6 Telescopic image from different telescope types\n\t7 By spectrum\n\t8 Lists of telescopes\n\t9 See also\n\t10 References\n\t11 Further reading\n\t12 External links\n\n\n\n\n\nEtymology[edit]\n\nThe word telescope (from the Ancient Greek τῆλε, tele \"far\" and σκοπεῖν, skopein \"to look or see\"; τηλεσκόπος, teleskopos \"far-seeing\") was coined in 1611 by the Greek mathematician Giovanni Demisiani for one of Galileo Galilei's instruments presented at a banquet at the Accademia dei Lincei.[2][3] In the Starry Messenger, Galileo had used the term perspicillum.\n\n\nHistory[edit]\n\nMain article: History of the telescope\n\n  \nThe \"onion\" dome at the Royal Observatory, Greenwich housing a 28-inch refracting telescope with a remaining segment of William Herschel's 120-centimetre (47 in) diameter reflecting telescope (called the \"40-foot telescope\" due to its focal length) in the foreground.\n\n\n\nThe earliest existing record of a telescope was a 1608 patent submitted to the government in the Netherlands by Middelburg spectacle maker Hans Lippershey for a refracting telescope.[4] The actual inventor is unknown but word of it spread through Europe. Galileo heard about it and, in 1609, built his own version, and made his telescopic observations of celestial objects.[5][6]\n\nThe idea that the objective, or light-gathering element, could be a mirror instead of a lens was being investigated soon after the invention of the refracting telescope.[7] The potential advantages of using parabolic mirrors—reduction of spherical aberration and no chromatic aberration—led to many proposed designs and several attempts to build reflecting telescopes.[8] In 1668, Isaac Newton built the first practical reflecting telescope, of a design which now bears his name, the Newtonian reflector.\n\nThe invention of the achromatic lens in 1733 partially corrected color aberrations present in the simple lens and enabled the construction of shorter, more functional refracting telescopes. Reflecting telescopes, though not limited by the color problems seen in refractors, were hampered by the use of fast tarnishing speculum metal mirrors employed during the 18th and early 19th century—a problem alleviated by the introduction of silver coated glass mirrors in 1857,[9] and aluminized mirrors in 1932.[10] The maximum physical size limit for refracting telescopes is about 1 meter (40 inches), dictating that the vast majority of large optical researching telescopes built since the turn of the 20th century have been reflectors. The largest reflecting telescopes currently have objectives larger than 10 m (33 feet), and work is underway on several 30-40m designs.\n\nThe 20th century also saw the development of telescopes that worked in a wide range of wavelengths from radio to gamma-rays. The first purpose built radio telescope went into operation in 1937. Since then, a large variety of complex astronomical instruments have been developed.\n\n\nTypes[edit]\n\n  \nThe primary mirror assembly of James Webb Space Telescope under construction. This is a segmented mirror and its coated with Gold to reflect (orange-red) visible light, through near-infrared to the mid-infrared\n\n\n\nThe name \"telescope\" covers a wide range of instruments. Most detect electromagnetic radiation, but there are major differences in how astronomers must go about collecting light (electromagnetic radiation) in different frequency bands.\n\nTelescopes may be classified by the wavelengths of light they detect:\n\n\n\tX-ray telescopes, using shorter wavelengths than ultraviolet light\n\tUltraviolet telescopes, using shorter wavelengths than visible light\n\tOptical telescopes, using visible light\n\tInfrared telescopes, using longer wavelengths than visible light\n\tSubmillimetre telescopes, using microwave wavelengths that are longer than those of infrared light\n\tRadio telescopess that use even longer wavelengths\n\n\nAs wavelengths become longer, it becomes easier to use antenna technology to interact with electromagnetic radiation (although it is possible to make very tiny antenna). The near-infrared can be collected much like visible light, however in the far-infrared and submillimetre range,  telescopes can operate more like a radio telescope. For example, the James Clerk Maxwell Telescope observes from wavelengths from 3 μm (0.003 mm) to 2000 μm (2 mm), but uses a parabolic aluminum antenna.[11] On the other hand, the Spitzer Space Telescope, observing from about 3 μm (0.003 mm) to 180 μm (0.18 mm) uses a mirror (reflecting optics). Also using reflecting optics, the Hubble Space Telescope with Wide Field Camera 3 can observe in the frequency range from about 0.2 μm (0.0002 mm) to 1.7 μm (0.0017 mm) (from ultra-violet to infrared light).[12]\n\nWith photons of the shorter wavelengths, with the higher frequencies, glancing-incident optics, rather than fully reflecting optics are used. Telescopes such as TRACE and SOHO use special mirrors to reflect Extreme ultraviolet, producing higher resolution and brighter images than are otherwise possible. A larger aperture does not just mean that more light is collected, it also enables a finer angular resolution.\n\nTelescopes may also be classified by location: ground telescope, space telescope, or flying telescope.  They may also be classified by whether they are operated by professional astronomers or amateur astronomers.  A vehicle or permanent campus containing one or more telescopes or other instruments is called an observatory.\n\n\n  \nModern telescopes typically use CCDs instead of film for recording images. This is the sensor array in the Kepler spacecraft.\n\n\n\n\tLight Comparison\n\n\tName\tWavelength\tFrequency (Hz)\tPhoton Energy (eV)\t\n\n\tGamma ray\tless than 0.01 nm\tmore than 10 EHz\t100 keV – 300+ GeV\tX\n\n\tX-Ray\t0.01 to 10 nm\t30 EHz – 30 PHz\t120 eV to 120 keV\tX\n\n\tUltraviolet\t10 nm – 400 nm\t30 PHz – 790 THz\t3 eV to 124 eV\t\n\n\tVisible\t390 nm – 750 nm\t790 THz – 405 THz\t1.7 eV – 3.3 eV\tX\n\n\tInfrared\t750 nm – 1 mm\t405 THz – 300 GHz\t1.24 meV – 1.7 eV\tX\n\n\tMicrowave\t1 mm – 1 meter\t300 GHz – 300 MHz\t1.24 meV – 1.24  µeV\t\n\n\tRadio\t1 mm – km\t300 GHz  – 3 Hz\t1.24 meV – 12.4 feV\tX\n\n\n\n\n\nOptical telescopes[edit]\n\n  \n50 cm refracting telescope at Nice Observatory.\n\n\n\nMain article: Optical telescope\n\nAn optical telescope gathers and focuses light mainly from the visible part of the electromagnetic spectrum (although some work in the infrared and ultraviolet).[13] Optical telescopes increase the apparent angular size of distant objects as well as their apparent brightness. In order for the image to be observed, photographed, studied, and sent to a computer, telescopes work by employing one or more curved optical elements, usually made from glass lenses and/or mirrors, to gather light and other electromagnetic radiation to bring that light or radiation to a focal point. Optical telescopes are used for astronomy and in many non-astronomical instruments, including: theodolites (including transits), spotting scopes, monoculars, binoculars, camera lenses, and spyglasses. There are three main optical types:\n\n\n\tThe refracting telescope which uses lenses to form an image.\n\tThe reflecting telescope which uses an arrangement of mirrors to form an image.\n\tThe catadioptric telescope which uses mirrors combined with lenses to form an image.\n\n\nA Fresnel Imager is a proposed ultra-lightweight design for a space telescope that uses a Fresnel lens to focus light.\n\nBeyond these basic optical types there are many sub-types of varying optical design classified by the task they perform such as astrographs, comet seekers and solar telescopes.\n\n\nRadio telescopes[edit]\n\n  \nThe Very Large Array at Socorro, New Mexico, United States.\n\n\n\nMain articles: Radio telescope and Radio astronomy\n\nRadio telescopes are directional radio antennas that typically employ a large dish to collect radio waves. The dishes are sometimes constructed of a conductive wire mesh whose openings are smaller than the wavelength being observed.\n\nUnlike an optical telescope, which produces a magnified image of the patch of sky being observed, a traditional radio telescope dish contains a single receiver and records a single time-varying signal characteristic of the observed region; this signal may be sampled at various frequencies. In some newer radio telescope designs, a single dish contains an array of several receivers; this is known as a focal-plane array.\n\nBy collecting and correlating signals simultaneously received by several dishes, high-resolution images can be computed. Such multi-dish arrays are known as astronomical interferometers and the technique is called aperture synthesis. The 'virtual' apertures of these arrays are similar in size to the distance between the telescopes. As of 2005, the record array size is many times the diameter of the Earth — utilizing space-based Very Long Baseline Interferometry (VLBI) telescopes such as the Japanese HALCA (Highly Advanced Laboratory for Communications and Astronomy) VSOP (VLBI Space Observatory Program) satellite.\n\nAperture synthesis is now also being applied to optical telescopes using optical interferometers (arrays of optical telescopes) and aperture masking interferometry at single reflecting telescopes.\n\nRadio telescopes are also used to collect microwave radiation, which has the advantage of being able to pass through the atmosphere and interstellar gas and dust clouds.\n\nSome radio telescopes are used by programs such as SETI and the Arecibo Observatory to search for extraterrestrial life.\n\n\nX-ray telescopes[edit]\n\n  \nEinstein Observatory was a space-based focusing optical X-ray telescope from 1978.[14]\n\n\n\nMain article: X-ray telescope\n\nX-rays are much harder to collect and focus than electromagnetic radiation of longer wavelengths. X-ray telescopes can use X-ray optics, such as Wolter telescopes composed of ring-shaped 'glancing' mirrors made of heavy metals that are able to reflect the rays just a few degrees. The mirrors are usually a section of a rotated parabola and a hyperbola, or ellipse. In 1952, Hans Wolter outlined 3 ways a telescope could be built using only this kind of mirror.[15][16] Examples of observatories using this type of telescope are the Einstein Observatory, ROSAT, and the Chandra X-Ray Observatory. By 2010, Wolter focusing X-ray telescopes are possible up to photon energies of 79 keV.[14]\n\n\nGamma-ray telescopes[edit]\n\nHigher energy X-ray and Gamma-ray telescopes refrain from focusing completely and use coded aperture masks: the patterns of the shadow the mask creates can be reconstructed to form an image.\n\nX-ray and Gamma-ray telescopes are usually installed on Earth-orbiting satellites or high-flying balloons since the Earth's atmosphere is opaque to this part of the electromagnetic spectrum. An example of this type of telescope is the Fermi Gamma-ray Space Telescope.\n\nThe detection of very high energy gamma rays, with shorter wavelength and higher frequency than regular gamma rays, requires further specialization. An example of this type of observatory is VERITAS.\n\nA discovery in 2012 may allow focusing gamma-ray telescopes.[17] At photon energies greater than 700 keV, the index of refraction starts to increase again.[17]\n\n\nOther types of telescopes[edit]\n\nAstronomy is not limited to using electromagnetic radiation. Additional information can be obtained by detecting other signals, with detectors analogous to telescopes. These are:\n\n\n\tCosmic-ray telescopes detect cosmic rays and usually consist of an array of different detector types spread out over a large area.\n\tEnergetic neutral atom instruments study the magnetosphere of various bodies by detecting fast moving electrically neutral atoms created by the solar wind.\n\tNeutrino detectors, the equivalent of neutrino telescopes, used for neutrino astronomy. They consist of a large mass of water and ice, surrounded by an array of sensitive light detectors known as photomultiplier tubes. Originating direction of the neutrinos is determined by reconstructing the path of secondary particles scattered by neutrino impacts, from their interaction with multiple detectors.\n\tGravitational-wave detectors, the equivalent of gravitational wave telescopes, are used for gravitational-wave astronomy. Gravitational waves, caused by violent collisions in space, are detected by extremely precise measurements of the change in length of large earth-bound structures.\n\n\n  \nEquatorial-mounted Keplerian telescope\n\n\n\nTypes of mount[edit]\n\nMain article: Telescope mount\n\nA telescope mount is a mechanical structure which supports a telescope. Telescope mounts are designed to support the mass of the telescope and allow for accurate pointing of the instrument. Many sorts of mounts have been developed over the years, with the majority of effort being put into systems that can track the motion of the stars as the Earth rotates. The two main types of tracking mount are:\n\n\n\tAltazimuth mount\n\tEquatorial mount\n\n\nAtmospheric electromagnetic opacity[edit]\n\nSee also: Airmass\n\nSince the atmosphere is opaque for most of the electromagnetic spectrum, only a few bands can be observed from the Earth's surface. These bands are visible – near-infrared and a portion of the radio-wave part of the spectrum. For this reason there are no X-ray or far-infrared ground-based telescopes as these have to be observed from orbit. Even if a wavelength is observable from the ground, it might still be advantageous to place a telescope on a satellite due to astronomical seeing.\n\n\n  \nA diagram of the electromagnetic spectrum with the Earth's atmospheric transmittance (or opacity) and the types of telescopes used to image parts of the spectrum.\n\n\n\n\nTelescopic image from different telescope types[edit]\n\nDifferent types of telescope, operating in different wavelength bands, provide different information about the same object.  Together they provide a more comprehensive understanding.\n\n\n  \nA 6′ wide view of the Crab nebula supernova remnant, viewed at different wavelengths of light by various telescopes\n\n\n\n\nBy spectrum[edit]\n\nTelescopes that operate in the electromagnetic spectrum:\n\n\n\tName\n\tTelescope\n\tAstronomy\n\tWavelength\n\n\tRadio\tRadio telescope\tRadio astronomy\n(Radar astronomy)\tmore than 1 mm\n\n\tSubmillimetre\tSubmillimetre telescopes*\tSubmillimetre astronomy\t0.1 mm – 1 mm\n\n\tFar Infrared\t–\tFar-infrared astronomy\t30 µm – 450 µm\n\n\tInfrared\tInfrared telescope\tInfrared astronomy\t700 nm – 1 mm\n\n\tVisible\tVisible spectrum telescopes\tVisible-light astronomy\t400 nm – 700 nm\n\n\tUltraviolet\tUltraviolet telescopes*\tUltraviolet astronomy\t10 nm – 400 nm\n\n\tX-ray\tX-ray telescope\tX-ray astronomy\t0.01 nm – 10 nm\n\n\tGamma-ray\t–\tGamma-ray astronomy\tless than 0.01 nm\n\n\n\n*Links to categories.\n\n\nLists of telescopes[edit]\n\n\n\tList of optical telescopes\n\tList of largest optical reflecting telescopes\n\tList of largest optical refracting telescopes\n\tList of largest optical telescopes historically\n\tList of radio telescopes\n\tList of solar telescopes\n\tList of space observatories\n\tList of telescope parts and construction\n\tList of telescope types\n\tCategory:Telescopes\n\tCategory:Cosmic-ray telescopes\n\tCategory:Gamma-ray telescopes\n\tCategory:Gravitational wave telescopes\n\tCategory:High energy particle telescopes\n\tCategory:Infrared telescopes\n\tCategory:Submillimetre telescopes\n\tCategory:Ultraviolet telescopes\n\tCategory:X-ray telescopes\n\n\n\n\nSee also[edit]\n\n\n\tAirmass\n\tAmateur telescope making\n\tAngular resolution\n\tASCOM open standards for computer control of telescopes\n\tBahtinov mask\n\tBioptic telescope\n\tCarey mask\n\tDew shield\n\tDynameter\n\tf-number\n\tFirst light\n\tGoTo telescope\n\tHartmann mask\n\tKeyhole problem\n\tMicroscope\n\tRemote Telescope Markup Language\n\tRobotic telescope\n\tTheodolite\n\tTimeline of telescope technology\n\tTimeline of telescopes, observatories, and observing technology\n\n\n\n\nReferences[edit]\n\n\n\t^ Company, Houghton Mifflin Harcourt Publishing. \"The American Heritage Dictionary entry: TELESCOPE\". www.ahdictionary.com.\n\n\t^ Sobel (2000, p.43), Drake (1978, p.196)\n\n\t^ Rosen, Edward, The Naming of the Telescope (1947)\n\n\t^ galileo.rice.edu The Galileo Project > Science > The Telescope by Al Van Helden: The Hague discussed the patent applications first of Hans Lipperhey of Middelburg, and then of Jacob Metius of Alkmaar... another citizen of Middelburg, Zacharias Janssen is sometimes associated with the invention\n\n\t^ \"NASA - Telescope History\". www.nasa.gov.\n\n\n\t^ Loker, Aleck (20 November 2017). Profiles in Colonial History. Aleck Loker. ISBN 978-1-928874-16-4 – via Google Books.\n\n\n\t^ Watson, Fred (20 November 2017). Stargazer: The Life and Times of the Telescope. Allen & Unwin. ISBN 978-1-74176-392-8 – via Google Books.\n\n\n\t^ Attempts by Niccolò Zucchi and James Gregory and theoretical designs by Bonaventura Cavalieri, Marin Mersenne, and Gregory among others\n\n\t^ \"Jean-Bernard-Léon Foucault Biography (1819–1868)\". www.madehow.com.\n\n\n\t^ \"Home\" (PDF). Cambridge University Press.\n\n\n\t^ ASTROLab du parc national du Mont-Mégantic (January 2016). \"The James-Clerk-Maxwell Observatory\". Canada under the stars. Retrieved 2017-04-16.\n\n\n\t^ \"Hubble's Instruments: WFC3 - Wide Field  Camera 3\". www.spacetelescope.org. Retrieved 2017-04-16.\n\n\n\t^ Jones, Barrie W. (2 September 2008). The Search for Life Continued: Planets Around Other Stars. Springer Science & Business Media. ISBN 978-0-387-76559-4.\n\n\n\t^ a b \"NuStar: Instrumentation: Optics\". Archived from the original on 2010-11-01.\n\n\n\t^ Wolter, H. (1952), \"Glancing Incidence Mirror Systems as Imaging Optics for X-rays\", Annalen der Physik, 10 (1): 94–114, Bibcode:1952AnP...445...94W, doi:10.1002/andp.19524450108.\n\n\n\t^ Wolter, H. (1952), \"Verallgemeinerte Schwarzschildsche Spiegelsysteme streifender Reflexion als Optiken für Röntgenstrahlen\", Annalen der Physik, 10 (4–5): 286–295, Bibcode:1952AnP...445..286W, doi:10.1002/andp.19524450410.\n\n\n\t^ a b \"Silicon 'prism' bends gamma rays – Physics World\". 9 May 2012.\n\n\n\n\n\n\nFurther reading[edit]\n\n\tContemporary Astronomy – Second Edition, Jay M. Pasachoff, Saunders Colleges Publishing – 1981, \nISBN 0-03-057861-2\n\tElliott, Robert S. (1966), Electromagnetics, McGraw-Hill\n\n\tRashed, Roshdi; Morelon, Régis (1996), Encyclopedia of the History of Arabic Science, 1 & 3, Routledge, ISBN 978-0-415-12410-2\n\n\tSabra, A.I.; Hogendijk, J.P. (2003). The Enterprise of Science in Islam: New Perspectives. MIT Press. pp. 85–118. ISBN 978-0-262-19482-2.\n\n\tWade, Nicholas J.; Finger, Stanley (2001), \"The eye as an optical instrument: from camera obscura to Helmholtz's perspective\", Perception, 30 (10): 1157–1177, doi:10.1068/p3210, PMID 11721819\n\n\n\nExternal links[edit]\n\n\t\tWikiquote has quotations related to: Telescope\n\n\n\t\tWikimedia Commons has media related to Telescope.\n\n\n\tGalileo to Gamma Cephei – The History of the Telescope\n\tThe Galileo Project – The Telescope by Al Van Helden \n\t\"The First Telescopes\". Part of an exhibit from Cosmic Journey: A History of Scientific Cosmology by the American Institute of Physics\n\tTaylor, Harold Dennis; Gill, David (1911). \"Telescope\" . Encyclopædia Britannica. 26 (11th ed.). pp. 557–573.\n\n\tOutside the Optical: Other Kinds of Telescopes\n\tGray, Meghan; Merrifield, Michael (2009). \"Telescope Diameter\". Sixty Symbols. Brady Haran for the University of Nottingham.\n\n\n\n\tAuthority control \t\n\tNARA: 10666372\n\tNDL: 00560817\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Telescope&oldid=918086562\"\n\n\t\t\n\t\tCategories: \tTelescopes\n\tAstronomical imaging\n\tAstronomical instruments\n\tScience and technology in the Dutch Republic\n\tDutch inventions\n\t17th-century introductions\n\n\nHidden categories: \tWikipedia indefinitely move-protected pages\n\tArticles with short description\n\tCS1: long volume value\n\tWikipedia articles incorporating a citation from the 1911 Encyclopaedia Britannica with Wikisource reference\n\tWikipedia articles with NARA identifiers\n\tWikipedia articles with NDL identifiers\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\tWikiquote\n\tWikiversity\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tአማርኛ\n\tالعربية\n\tArmãneashti\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tBân-lâm-gú\n\tБашҡортса\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tभोजपुरी\n\tБългарски\n\tBoarisch\n\tBosanski\n\tCatalà\n\tЧӑвашла\n\tČeština\n\tChiShona\n\tCorsu\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tFrysk\n\tGaeilge\n\tGalego\n\t贛語\n\tગુજરાતી\n\t한국어\n\tՀայերեն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tInterlingua\n\tÍslenska\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tქართული\n\tकॉशुर / کٲشُر\n\tҚазақша\n\tKiswahili\n\tKreyòl ayisyen\n\tКыргызча\n\tLatina\n\tLatviešu\n\tLëtzebuergesch\n\tLietuvių\n\tLimburgs\n\tLumbaart\n\tMagyar\n\tМакедонски\n\tമലയാളം\n\tमराठी\n\tმარგალური\n\tBahasa Melayu\n\tMìng-dĕ̤ng-ngṳ̄\n\tMirandés\n\tမြန်မာဘာသာ\n\tNederlands\n\tनेपाली\n\tनेपाल भाषा\n\t日本語\n\tNapulitano\n\tNorsk\n\tNorsk nynorsk\n\tOʻzbekcha/ўзбекча\n\tਪੰਜਾਬੀ\n\tپنجابی\n\tPatois\n\tPolski\n\tPortuguês\n\tQaraqalpaqsha\n\tRomână\n\tРусский\n\tScots\n\tSesotho sa Leboa\n\tShqip\n\tSicilianu\n\tසිංහල\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tTagalog\n\tதமிழ்\n\tТатарча/tatarça\n\tతెలుగు\n\tไทย\n\tТоҷикӣ\n\tᏣᎳᎩ\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\tWinaray\n\t吴语\n\tייִדיש\n\tYorùbá\n\t粵語\n\tZazaki\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 26 September 2019, at 23:41 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "5", "dc:title": "Telescope - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/a/ac/100inchHooker.jpg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-telescope", "title": "Telescope - Wikipedia"}}