{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTelemetry - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tTelemetry\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tFor the online advertising security and optimization firm, see Telemetry (company).\n\n  \nAn expendable dropsonde used to capture weather data. The telemetry consists of sensors for pressure, temperature, and humidity and a wireless transmitter to return the captured data to an aircraft.\n\n\n\n  \nA saltwater crocodile with a GPS-based satellite transmitter attached to its head for tracking\n\n\n\nTelemetry is the collection of measurements or other data at remote or inaccessible points and their automatic transmission to receiving equipment for monitoring.[1] The word is derived from Greek the roots tele, \"remote\", and metron, \"measure\". Systems that need external instructions and data to operate require the counterpart of telemetry, telecommand.[2]\n\nAlthough the term commonly refers to wireless data transfer mechanisms (e.g., using radio, ultrasonic, or infrared systems), it also encompasses data transferred over other media such as a telephone or computer network, optical link or other wired communications like power line carriers. Many modern telemetry systems take advantage of the low cost and ubiquity of GSM networks by using SMS to receive and transmit telemetry data.\n\nA telemeter is a device used to remotely measure any quantity. It consists of a sensor, a transmission path, and a display, recording, or control device. Telemeters are the physical devices used in telemetry. Electronic devices are widely used in telemetry and can be wireless or hard-wired, analog or digital. Other technologies are also possible, such as mechanical, hydraulic and optical.[3]\n\nTelemetry may be commutated to allow the transmission of multiple data streams in a fixed frame.\n\n\nContents\n\n\n\t1 History\n\t2 Applications\n\t2.1 Meteorology\n\t2.2 Oil and gas industry\n\t2.3 Motor racing\n\t2.4 Transportation\n\t2.5 Agriculture\n\t2.6 Water management\n\t2.7 Defense, space and resource exploration\n\t2.7.1 Space science\n\t2.7.2 Rocketry\n\t2.7.3 Flight testing\n\t2.7.4 Military intelligence\n\n\n\n\t2.8 Energy monitoring\n\t2.9 Resource distribution\n\t2.9.1 Dry goods\n\t2.9.2 Fluids\n\t2.9.3 Bulk solids\n\n\n\n\t2.10 Medicine/healthcare\n\t2.11 Fishery and wildlife research and management\n\t2.12 Retail\n\t2.13 Law enforcement\n\t2.14 Energy providers\n\t2.15 Falconry\n\t2.16 Testing\n\t2.17 Communications\n\t2.18 Mining\n\t2.19 Software\n\n\n\n\t3 International standards\n\t4 See also\n\t5 References\n\t6 External links\n\n\n\n\n\nHistory[edit]\n\nTelemetering information over wire had its origins in the 19th century. One of the first data-transmission circuits was developed in 1845 between the Russian Tsar's Winter Palace and army headquarters. In 1874, French engineers built a system of weather and snow-depth sensors on Mont Blanc that transmitted real-time information to Paris. In 1901 the American inventor C. Michalke patented the selsyn, a circuit for sending synchronized rotation information over a distance. In 1906 a set of seismic stations were built with telemetering to the Pulkovo Observatory in Russia.  In 1912, Commonwealth Edison developed a system of telemetry to monitor electrical loads on its power grid. The Panama Canal (completed 1913–1914) used extensive telemetry systems to monitor locks and water levels.[4]\n\nWireless telemetry made early appearances in the radiosonde, developed concurrently in 1930 by Robert Bureau in France and Pavel Molchanov in Russia.  Molchanov's system modulated temperature and pressure measurements by converting them to wireless Morse code. The German V-2 rocket used a system of primitive multiplexed radio signals called \"Messina\" to report four rocket parameters, but it was so unreliable that Wernher von Braun once claimed it was more useful to watch the rocket through binoculars. In the US and the USSR, the Messina system was quickly replaced with better systems (in both cases, based on pulse-position modulation).[5]\n\nEarly Soviet missile and space telemetry systems which were developed in the late 1940s used either pulse-position modulation (e.g., the Tral telemetry system developed by OKB-MEI) or pulse-duration modulation (e.g., the RTS-5 system developed by NII-885).  In the United States, early work employed similar systems, but were later replaced by pulse-code modulation (PCM) (for example, in the Mars probe Mariner 4).  Later Soviet interplanetary probes used redundant radio systems, transmitting telemetry by PCM on a decimeter band and PPM on a centimeter band.[6]\n\n\nApplications[edit]\n\nMeteorology[edit]\n\nTelemetry has been used by weather balloons for transmitting meteorological data since 1920.\n\n\nOil and gas industry[edit]\n\nTelemetry is used to transmit drilling mechanics and formation evaluation information uphole, in real time, as a well is drilled. These services are known as Measurement while drilling and Logging while drilling. Information acquired thousands of feet below ground, while drilling, is sent through the drilling hole to the surface sensors and the demodulation software. The pressure wave (sana) is translated into useful information after DSP and noise filters. This information is used for Formation evaluation, Drilling Optimization, and Geosteering.\n\n\nMotor racing[edit]\n\nTelemetry is a key factor in modern motor racing, allowing race engineers to interpret data collected during a test or race and use it to properly tune the car for optimum performance.  Systems used in series such as Formula One have become advanced to the point where the potential lap time of the car can be calculated, and this time is what the driver is expected to meet. Examples of measurements on a race car include accelerations (G forces) in three axes, temperature readings, wheel speed, and suspension displacement.  In Formula One, driver input is also recorded so the team can assess driver performance and (in case of an accident) the FIA can determine or rule out driver error as a possible cause.\n\nLater developments include two-way telemetry which allows engineers to update calibrations on the car in real time (even while it is out on the track). In Formula One, two-way telemetry surfaced in the early 1990s and consisted of a message display on the dashboard which the team could update. Its development continued until May 2001, when it was first allowed on the cars. By 2002, teams were able to change engine mapping and deactivate engine sensors from the pit while the car was on the track.[citation needed] For the 2003 season, the FIA banned two-way telemetry from Formula One;[citation needed] however, the technology may be used in other types of racing or on road cars.\n\nTelemetry has also been applied in yacht racing[clarification needed For what purpose? By whom?] on Oracle Racing's USA 76.[citation needed]\n\nOne way telemetry system has also been applied in R/C racing car to get information by car's sensors like: engine RPM, voltage, temperatures, throttle.\n\n\nTransportation[edit]\n\nIn the transportation industry, telemetry provides meaningful information about a vehicle or driver's performance by collecting data from sensors within the vehicle. This is undertaken for various reasons ranging from staff compliance monitoring, insurance rating to predictive maintenance.\n\nTelemetry is also used to link traffic counter devices to data recorders to measure traffic flows and vehicle lengths and weights.[7]\n\n\nAgriculture[edit]\n\nMost activities related to healthy crops and good yields depend on timely availability of weather and soil data. Therefore, wireless weather stations play a major role in disease prevention and precision irrigation. These stations transmit parameters necessary for decision-making to a base station: air temperature and relative humidity, precipitation and leaf wetness (for disease prediction models), solar radiation and wind speed (to calculate evapotranspiration), water deficit stress (WDS) leaf sensors and soil moisture (crucial to irrigation decisions).\n\nBecause local micro-climates can vary significantly, such data needs to come from within the crop. Monitoring stations usually transmit data back by terrestrial radio, although occasionally satellite systems are used. Solar power is often employed to make the station independent of the power grid.\n\n\nWater management[edit]\n\nTelemetry is important in water management, including water quality and stream gauging functions. Major applications include AMR (automatic meter reading), groundwater monitoring, leak detection in distribution pipelines and equipment surveillance. Having data available in almost real time allows quick reactions to events in the field. Telemetry control allows engineers to intervene with assets such as pumps and by remotely switching pumps on or off depending on the circumstances.  Watershed telemetry is an excellent strategy of how to implement a water management system.\n[8]\n\n\nDefense, space and resource exploration[edit]\n\nTelemetry is used in complex systems such as missiles, RPVs, spacecraft, oil rigs, and chemical plants since it allows the automatic monitoring, alerting, and record-keeping necessary for efficient and safe operation. Space agencies such as NASA, ISRO, the European Space Agency (ESA), and other agencies use telemetry and/or telecommand systems to collect data from spacecraft and satellites.\n\nTelemetry is vital in the development of missiles, satellites and aircraft because the system might be destroyed during or after the test. Engineers need critical system parameters to analyze (and improve) the performance of the system. In the absence of telemetry, this data would often be unavailable.\n\n\nSpace science[edit]\n\nTelemetry is used by manned or unmanned spacecraft for data transmission. Distances of more than 10 billion kilometres have been covered, e.g., by Voyager 1.\n\n\nRocketry[edit]\n\nIn rocketry, telemetry equipment forms an integral part of the rocket range assets used to monitor the position and health of a launch vehicle to determine range safety flight termination criteria (Range purpose is for public safety). Problems include the extreme environment (temperature, acceleration and vibration), the energy supply, antenna alignment and (at long distances, e.g., in spaceflight) signal travel time.\n\n\nFlight testing[edit]\n\nToday nearly every type of aircraft, missiles, or spacecraft carries a wireless telemetry system as it is tested.[9] Aeronautical mobile telemetry is used for the safety of the pilots and persons on the ground during flight tests. Telemetry from an on-board flight test instrumentation system is the primary source of real-time measurement and status information transmitted during the testing of manned and unmanned aircraft.[10]\n\n\nMilitary intelligence[edit]\n\nIntercepted telemetry was an important source of intelligence for the United States and UK when Soviet missiles were tested; for this purpose, the United States operated a listening post in Iran. Eventually, the Russians discovered the United States intelligence-gathering network and encrypted their missile-test telemetry signals. Telemetry was also a source for the Soviets, who operated listening ships in Cardigan Bay to eavesdrop on UK missile tests performed in the area.\n\n\nEnergy monitoring[edit]\n\nIn factories, buildings and houses, energy consumption of systems such as HVAC are monitored at multiple locations; related parameters (e.g., temperature) are sent via wireless telemetry to a central location. The information is collected and processed, enabling the most efficient use of energy. Such systems also facilitate predictive maintenance.\n\n\nResource distribution[edit]\n\nMany resources need to be distributed over wide areas. Telemetry is useful in these cases, since it allows the logistics system to channel resources where they are needed, as well as provide security for those assets; principal examples of this are dry goods, fluids, and granular bulk solids.\n\n\nDry goods[edit]\n\nDry goods, such as packaged merchandise, may be tracked and remotely monitored, tracked and inventoried by RFID sensing systems, barcode reader, optical character recognition (OCR) reader, or other sensing devices -- coupled to telemetry devices, to detect RFID tags, barcode labels or other identifying markers affixed to the item, its package, or (for large items and bulk shipments) affixed to its shipping container or vehicle. This facilitates knowledge of their location, and can record their status and disposition, as when merchandise with barcode labels is scanned through a checkout scanner at point-of-sale systems in a retail store.  Stationary or hand-held barcode scanners or RFID scanners, with remote communications, can be used to expedite inventory tracking and counting in stores, warehouses, shipping terminals, transportation carriers and factories.[11][12][13]\n\n\nFluids[edit]\n\nFluids stored in tanks are a principal object of constant commercial telemetry. This typically includes monitoring of tank farms in gasoline refineries and chemical plants -- and distributed or remote tanks, which must be replenished when empty (as with gas station storage tanks, home heating oil tanks, or ag-chemical tanks at farms), or emptied when full (as with production from oil wells, accumulated waste products, and newly produced fluids).[14] Telemetry is used to communicate the variable measurements of flow and tank level sensors detecting fluid movements and/or volumes by pneumatic, hydrostatic, or differential pressure;  tank-confined ultrasonic, radar or Doppler effect echoes; or mechanical or magnetic sensors.[14][15][16]\n\n\nSee also: level sensor\n\nBulk solids[edit]\n\nTelemetry of bulk solids is common for tracking and reporting the volume status and condition of grain and livestock feed bins, powdered or granular food, powders and pellets for manufacturing, sand and gravel, and other granular bulk solids. While technology associated with fluid tank monitoring also applies, in part, to granular bulk solids, reporting of overall container weight, or other gross characteristics and conditions, are sometimes required, owing to bulk solids' more complex and variable physical characteristics.\n[17][18]\n\n\nMedicine/healthcare[edit]\n\nTelemetry is used for patients (biotelemetry) who are at risk of abnormal heart activity, generally in a coronary care unit. Telemetry specialists are sometimes used to monitor many patients with a hospital.[19] Such patients are outfitted with measuring, recording and transmitting devices. A data log can be useful in diagnosis of the patient's condition by doctors.  An alerting function can alert nurses if the patient is suffering from an acute (or dangerous) condition.\n\nSystems are available in medical-surgical nursing for monitoring to rule out a heart condition, or to monitor a response to antiarrhythmic medications such as amiodarone.\n\nA new and emerging application for telemetry is in the field of neurophysiology, or neurotelemetry. Neurophysiology is the study of the central and peripheral nervous systems through the recording of bioelectrical activity, whether spontaneous or stimulated.  In neurotelemetry (NT) the electroencephalogram (EEG) of a patient is monitored remotely by a registered EEG technologist using advanced communication software.  The goal of neurotelemetry is to recognize a decline in a patient's condition before physical signs and symptoms are present.\n\nNeurotelemetry is synonymous with real-time continuous video EEG monitoring and has application in the epilepsy monitoring unit, neuro ICU, pediatric ICU and newborn ICU.  Due to the labor-intensive nature of continuous EEG monitoring NT is typically done in the larger academic teaching hospitals using in-house programs that include R.EEG Technologists, IT support staff, neurologist and neurophysiologist and monitoring support personnel.\n\nModern microprocessor speeds, software algorithms and video data compression allow hospitals to centrally record and monitor continuous digital EEGs of multiple critically ill patients simultaneously.\n\nNeurotelemetry and continuous EEG monitoring provides dynamic information about brain function that permits early detection of changes in neurologic status, which is especially useful when the clinical examination is limited.\n\n\nFishery and wildlife research and management[edit]\n\nMain article: Wildlife radio telemetry\n\n  \nA bumblebee worker with a transponder attached to its back, visiting an oilseed rape flower\n\n\n\nTelemetry is used to study wildlife,[20] and has been useful for monitoring threatened species at the individual level.  Animals under study can be outfitted with instrumentation tags, which include sensors that measure temperature, diving depth and duration (for marine animals), speed and location (using GPS or Argos packages).  Telemetry tags can give researchers information about animal behavior, functions, and their environment. This information is then either stored (with archival tags) or the tags can send (or transmit) their information to a satellite or handheld receiving device.[21] Capturing and marking wild animals can put them at some risk, so it is important to minimize these impacts.[22]\n\n\nRetail[edit]\n\nAt a 2005 workshop in Las Vegas, a seminar noted the introduction of telemetry equipment which would allow vending machines to communicate sales and inventory data to a route truck or to a headquarters.[citation needed] This data could be used for a variety of purposes, such as eliminating the need for drivers to make a first trip to see which items needed to be restocked before delivering the inventory.\n\nRetailers also use RFID tags to track inventory and prevent shoplifting. Most of these tags passively respond to RFID readers (e.g., at the cashier), but active RFID tags are available which periodically transmit location information to a base station.\n\n\nLaw enforcement[edit]\n\nTelemetry hardware is useful for tracking persons and property in law enforcement. An ankle collar worn by convicts on probation can warn authorities if a person violates the terms of his or her parole, such as by straying from authorized boundaries or visiting an unauthorized location. Telemetry has also enabled bait cars, where law enforcement can rig a car with cameras and tracking equipment and leave it somewhere they expect it to be stolen. When stolen the telemetry equipment reports the location of the vehicle, enabling law enforcement to deactivate the engine and lock the doors when it is stopped by responding officers.\n\n\nEnergy providers[edit]\n\nIn some countries, telemetry is used to measure the amount of electrical energy consumed. The electricity meter communicates with a concentrator, and the latter sends the information through GPRS or GSM to the energy provider's server. Telemetry is also used for the remote monitoring of substations and their equipment. For data transmission, phase line carrier systems operating on frequencies between 30 and 400 kHz are sometimes used.\n\n\nFalconry[edit]\n\nIn falconry, \"telemetry\" means a small radio transmitter carried by a bird of prey that will allow the bird's owner to track it when it is out of sight.\n\n\nTesting[edit]\n\nTelemetry is used in testing hostile environments which are dangerous to humans. Examples include munitions storage facilities, radioactive sites, volcanoes, deep sea, and outer space.\n\n\nCommunications[edit]\n\nTelemetry is used in many battery operated wireless systems to inform monitoring personnel when the battery power is reaching a low point and the end item needs fresh batteries.\n\n\nMining[edit]\n\nIn the mining industry, telemetry serves two main purposes: the measurement of key parameters from mining equipment and the monitoring of safety practices.[23] The information provided by the collection and analysis of key parameters allows for root-cause identification of inefficient operations, unsafe practices and incorrect equipment usage for maximizing productivity and safety.[24] Further applications of the technology allow for sharing knowledge and best practices across the organization.[24]\n\n\nSoftware[edit]\n\nIn software, telemetry is used to gather data on the use and performance of applications and application components, e.g. how often certain features are used, measurements of start-up time and processing time, hardware, application crashes, and general usage statistics and/or user behavior. In some cases, very detailed data is reported like individual window metrics, counts of used features, and individual function timings.\n\nThis kind of telemetry can be essential to software developers to receive data from a wide variety of endpoints that can't possibly all be tested in-house, as well as getting data on the popularity of certain features and whether they should be given priority or be considered for removal. Due to concerns about privacy since software telemetry can easily be used to  profile users, telemetry in user software is often user choice, commonly presented as an opt-in feature (requiring explicit user action to enable it) or user choice during the software installation process.\n\nSee also: Phoning home\n\n\nInternational standards[edit]\n\nAs in other telecommunications fields, international standards exist for telemetry equipment and software. International standards producing bodies include Consultative Committee for Space Data Systems (CCSDS) for space agencies, Inter-Range Instrumentation Group (IRIG) for missile ranges, and  Telemetering Standards Coordination Committee (TSCC), an organisation of the International Foundation for Telemetering.\n\n\nSee also[edit]\n\n\tInstrumentation\n\tMachine to Machine (M2M)\n\tMQ Telemetry Transport (MQTT)\n\tPortable telemetry\n\tReconnaissance satellite, tapping of communications routing or switching centers (e.g., Echelon)\n\tRemote monitoring and control\n\tRemote sensing\n\tRemote Terminal Unit (RTU)\n\tSCADA\n\tTelecommand\n\tTelematics\n\tWireless sensor network\n\n\nReferences[edit]\n\n\n\t^ Telemetry: Summary of concept and rationale (Report). Bibcode:1987STIN...8913455.\n\n\t^ Mary Bellis, \"Telemetry\"\n\n\t^ Bakshi et al., pages 8.1–8.3\n\n\t^ Mayo-Wells, \"The Origins of Space Telemetry\", Technology and Culture, 1963\n\n\t^ Joachim & Muehlner, \"Trends in Missile and Space Radio Telemetry\" declassified Lockheed report\n\n\t^ Molotov, E. L., Nazemnye Radiotekhnicheskie Sistemy Upravleniya Kosmicheskiymi Apparatami\n\n\t^ TRAFFIC MONITORING FOR STATE HIGHWAYS (PDF). NZTA. May 2004. ISBN 978-0-478-10549-0.\n\n\n\t^ PAUL, DORSEY (8 May 2018). \"WATERSHED SENSOR NETWORK NON-LINE-OF-SIGHT DATA TELEMETRY SYSTEM\". ohiolink.edu. Archived from the original on 4 March 2016. Retrieved 8 May 2018.\n\n\n\t^ “Foster, Leroy.\" \"Telemetry Systems\", John Wiley & Sons”, New York, 1965.\n\n\t^ ”  ITU-R M.2286-0 Operational characteristics of aeronautical mobile telemetry systems”, International Telecommunication Union”', Geneva 2014.\n\n\t^ \"RFID Technology,\" University of Arizona, retrieved April 8, 2019\n\n\t^ Burke, Eric M., Maj. U.S. Army and Ewing, Danny L., Jr., Lt., U.S. Navy, MBA Professional Report: \"Improving Warehouse Inventory Management Through RFID, Barcoding And Robotics Technologies,\" December 2014, Graduate School of Business and Public Policy, Naval Postgraduate School, Monterey, CA, retrieved April 8, 2019\n\n\t^ White, Gareth R.T.; Georgina Gardiner; Guru Prabhakar; and Azley Abd Razak (Bristol Business School, University of the West of England, UK), \"A Comparison of Barcoding and RFID Technologies in Practice,\" Journal of Information, Information Technology, and Organizations, Volume 2 (2007), retrieved April 8, 2019\n\n\t^ a b Rues, Gerald, MSEE, \"Remote Tank Monitoring Can Save Time and Money,\" March, 2019, Tank Transport, magazine, retrieved March 6, 2019\n\n\t^ Tank Sensors & Probes, Electronic Sensors, Inc., retrieved August 8, 2018\n\n\t^ Henry Hopper, \"A Dozen Ways to Measure Fluid Level and How They Work,\" December 1, 2018, Sensors Magazine, retrieved August 29 2018\n\n\t^ \"Accurately Measuring Dry Bulk Solids,\" January 4, 2016, Powder-Bulk Solids magazine, retrieved April 8, 2019\n\n\t^ \"Dynamic Measurement and Simulation of Bulk Solids...,\", Task Quarterly 7 No 4 (2003), 611–621, retrieved April 8, 2019\n\n\t^ Segall N, Hobbs G, Granger CB, Anderson AE, Bonifacio AS, Taekman JM, Wright MC (2015). \"Patient load effects on response time to critical arrhythmias in cardiac telemetry: a randomized trial\". Critical Care Medicine. 43 (5): 1036–42. doi:10.1097/CCM.0000000000000923. PMC 6226252. PMID 25746509. Retrieved 2015-12-24.CS1 maint: multiple names: authors list (link)\n\n\n\t^ \"Marine Wildlife Telemetry\". Pinniped Ecology Applied Research Laboratory. Archived from the original on 15 February 2012. Retrieved 30 January 2012.\n\n\n\t^ \"What Is Telemetry?\". Pinniped Ecology Applied Research Laboratory. Archived from the original on 15 March 2012. Retrieved 25 July 2011.\n\n\n\t^ Livezey, K.B. 1990. Toward the reduction of marking-induced abandonment of newborn ungulates. Wildlife Society Bulletin 18:193–203.\n\n\t^ Telemetry in the Mining Industry. IETE Journal of Research. Volume 29, Issue 8, 1983. Retrieved August 20th 2015.\n\n\t^ a b Operational Safety and Efficiency of Mobile Equipment through Operator Behavior Monitoring. Canadian Institute of Mining. 2015.\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Radio telemetry.\n\n\n\tInternational Foundation for Telemetering\n\tIRIG 106 — Digital telemetry standard\n\tThe European Society of Telemetering\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Telemetry&oldid=917718806\"\n\n\t\t\n\t\tCategories: \tTelemetry\n\tTelecommunications\n\tWireless locating\n\tMeasurement\n\tSpaceflight technologies\n\n\nHidden categories: \tCS1 maint: multiple names: authors list\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from January 2009\n\tWikipedia articles needing clarification from March 2009\n\tCommons category link is on Wikidata\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tБългарски\n\tBosanski\n\tCatalà\n\tЧӑвашла\n\tČeština\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tفارسی\n\tFrançais\n\tGaeilge\n\t한국어\n\tHrvatski\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tಕನ್ನಡ\n\tҚазақша\n\tLatviešu\n\tLietuvių\n\tMagyar\n\tNederlands\n\t日本語\n\tNorsk\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tSimple English\n\tSlovenčina\n\tSlovenščina\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tTürkçe\n\tУкраїнська\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 25 September 2019, at 03:47 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "8", "dc:title": "Telemetry - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Dropsonde_U.S._Air_Force.jpeg", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-telemetry", "title": "Telemetry - Wikipedia"}}