{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVoyager 1 - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\n\n\tVoyager 1\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tFor other uses, see Voyager 1 (disambiguation).\n\nPlanetary space probe; farthest human-made object from Earth\n\n\n\n\n\n\nVoyager 1\tModel of the Voyager spacecraft design\n\n\t\n\tMission type\tOuter planetary, heliosphere, and interstellar medium exploration\n\tOperator\tNASA / Jet Propulsion Laboratory\n\tCOSPAR ID\t1977-084A[1]\n\tSATCAT no.\t10321[2]\n\tWebsite\tvoyager.jpl.nasa.gov\n\tMission duration\t\n\t42 years and 26 days elapsed\n\tPlanetary mission: 3 years, 3 months, 9 days\n\n\n\tInterstellar mission: 38 years, 9 months and 17 days elapsed (continuing)\n\n\n\n\n\t\n\n\t\n\tSpacecraft properties\n\tSpacecraft type\tMariner Jupiter-Saturn\n\tManufacturer\tJet Propulsion Laboratory\n\tLaunch mass\t825.5 kg (1,820 lb)\n\tPower\t470 watts (at launch)\n\t\n\n\t\n\tStart of mission\n\tLaunch date\tSeptember 5, 1977, 12:56:00 (1977-09-05UTC12:56Z) UTC\n\tRocket\tTitan IIIE\n\tLaunch site\tCape Canaveral Launch Complex 41\n\t\n\n\t\n\tFlyby of Jupiter\n\tClosest approach\tMarch 5, 1979\n\tDistance\t349,000 km (217,000 mi)\n\tFlyby of Saturn\n\tClosest approach\tNovember 12, 1980\n\tDistance\t124,000 km (77,000 mi)\n\tFlyby of Titan (atmosphere study)\n\tClosest approach\tNovember 12, 1980\n\tDistance\t6,490 km (4,030 mi)\n\t\n\n\tFlagship\n← Voyager 2\nGalileo →\n\n \n\n\nVoyager 1 is a space probe launched by NASA on September 5, 1977. Part of the Voyager program to study the outer Solar System, Voyager 1 was launched 16 days after its twin, Voyager 2. Having operated for 42 years and 26 days as of October 1, 2019, the spacecraft still communicates with the Deep Space Network to receive routine commands and to transmit data to Earth. At a distance of 147.347 AU (22.0 billion km; 13.7 billion mi) from Earth as of October 1, 2019[3] it is the most distant man-made object from Earth.[4]\n\nThe probe's objectives included flybys of Jupiter, Saturn, and Saturn's largest moon, Titan. Although the spacecraft's course could have been altered to include a Pluto encounter by forgoing the Titan flyby, exploration of the moon took priority because it was known to have a substantial atmosphere.[5][6][7] Voyager 1 studied the weather, magnetic fields, and rings of the two planets and was the first probe to provide detailed images of their moons.\n\nAfter completing its primary mission with the flyby of Saturn on November 12, 1980, Voyager 1 became the third of five artificial objects to achieve the escape velocity required to leave the Solar System.[citation needed] On August 25, 2012, Voyager 1 became the first spacecraft to cross the heliopause and enter the interstellar medium.[8]\n\nIn a further testament to the robustness of Voyager 1, the Voyager team completed a successful test of the spacecraft's trajectory correction maneuver (TCM) thrusters in late 2017 (the first time these thrusters were fired since 1980), a project enabling the mission to be extended by two to three years.[9]\n\nVoyager 1's extended mission is expected to continue until about 2025 when its radioisotope thermoelectric generators will no longer supply enough electric power to operate its scientific instruments.\n\n\nContents\n\n\n\t1 Mission background\n\t1.1 History\n\t1.2 Spacecraft components\n\t1.2.1 Communication system\n\t1.2.2 Power\n\t1.2.3 Computers\n\t1.2.4 Scientific instruments\n\n\n\n\n\n\n\t2 Mission profile\n\t2.1 Timeline of travel\n\t2.2 Launch and trajectory\n\t2.3 Flyby of Jupiter\n\t2.4 Flyby of Saturn\n\n\n\n\t3 Exit from the heliosphere\n\t3.1 Termination shock\n\t3.2 Heliosheath\n\t3.3 Heliopause\n\n\n\n\t4 Interstellar medium\n\t5 Future of the probe\n\t6 Golden record\n\t7 See also\n\t8 References\n\t9 External links\n\n\n\n\n\nMission background[edit]\n\nHistory[edit]\n\nIn the 1960s, a Grand Tour to study the outer planets was proposed which prompted NASA to begin work on a mission in the early 1970s.[10] Information gathered by the Pioneer 10 spacecraft helped Voyager's engineers design Voyager to cope more effectively with the intense radiation environment around Jupiter.[11] However, shortly before launch, strips of kitchen-grade aluminum foil were applied to certain cabling to further enhance radiation shielding.[12]\n\nInitially, Voyager 1 was planned as \"Mariner 11\" of the Mariner program. Due to budget cuts, the mission was scaled back to be a flyby of Jupiter and Saturn and renamed the Mariner Jupiter-Saturn probes. As the program progressed, the name was later changed to Voyager, since the probe designs began to differ greatly from previous Mariner missions.[13]\n\n\nSpacecraft components[edit]\n\nMain article: Voyager program § Spacecraft design\n\n  \nThe 3.7 m (12 ft)  diameter high gain dish antenna used on the Voyager craft\n\n\n\nVoyager 1 was constructed by the Jet Propulsion Laboratory.[14][15][16] It has 16 hydrazine thrusters, three-axis stabilization gyroscopes, and referencing instruments to keep the probe's radio antenna pointed toward Earth. Collectively, these instruments are part of the Attitude and Articulation Control Subsystem (AACS), along with redundant units of most instruments and 8 backup thrusters. The spacecraft also included 11 scientific instruments to study celestial objects such as planets as it travels through space.[17]\n\n\nCommunication system[edit]\n\nThe radio communication system of Voyager 1 was designed to be used up to and beyond the limits of the Solar System. The communication system includes a 3.7-meter (12 ft) diameter  high gain Cassegrain antenna to send and receive radio waves via the three Deep Space Network stations on the Earth.[18] The craft normally transmits data to Earth over Deep Space Network Channel 18, using a frequency of either 2.3 GHz or 8.4 GHz, while signals from Earth to Voyager are transmitted at 2.1 GHz.[19]\n\nWhen Voyager 1 is unable to communicate directly with the Earth, its digital tape recorder (DTR) can record about 64 kilobytes of data for transmission at another time.[20] Signals from Voyager 1 take over 20 hours to reach Earth.[3]\n\n\nPower[edit]\n\nVoyager 1 has three radioisotope thermoelectric generators (RTGs) mounted on a boom. Each MHW-RTG contains 24 pressed plutonium-238 oxide spheres.[21] The RTGs generated about 470 W of electric power at the time of launch, with the remainder being dissipated as waste heat.[22] The power output of the RTGs declines over time (due to the 87.7-year half-life of the fuel and degradation of the thermocouples), but the craft's RTGs will continue to support some of its operations until 2025.[17][21]\n\n\n\t\n\t\t\t\n\n\n\t\t\t\nDiagram of RTG fuel container, showing the plutonium-238 oxide spheres\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nDiagram of RTG shell, showing the power-producing silicon-germanium thermocouples\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nModel of an RTG unit\n\n\n\t\t\t\n\n\t\t\n\n\n\nAs of October 1, 2019, Voyager 1 has 71.71% of the plutonium-238 that it had at launch. By 2050, it will have 56.5% left.\n\n\nComputers[edit]\n\nUnlike the other onboard instruments, the operation of the cameras for visible light is not autonomous, but rather it is controlled by an imaging parameter table contained in one of the on-board digital computers, the Flight Data Subsystem (FDS). Since the 1990s, most space probes have had completely autonomous cameras.[23]\n\nThe computer command subsystem (CCS) controls the cameras. The CCS contains fixed computer programs, such as command decoding, fault-detection and -correction routines, antenna pointing routines, and spacecraft sequencing routines. This computer is an improved version of the one that was used in the 1970s Viking orbiters.[24] The hardware in both custom-built CCS subsystems in the Voyagers is identical. There is only a minor software modification: one of them that has a scientific subsystem that the other lacks.[citation needed]\n\nThe Attitude and Articulation Control Subsystem (AACS) controls the spacecraft orientation (its attitude). It keeps the high-gain antenna pointing towards the Earth, controls attitude changes, and points the scan platform. The custom-built AACS systems on both Voyagers are the same.[25][26]\n\n\nScientific instruments[edit]\n\nMain article: Voyager program\n\n\tInstrument name\n\tAbr.\n\tDescription\n\n\tImaging Science System \n(disabled)\n\tISS\n\tUtilized a two-camera system (narrow-angle/wide-angle) to provide images of Jupiter, Saturn and other objects along the trajectory. More\n\tFilters\n\n\t\n\tNarrow-angle camera[27]\n\n\tName\n\tWavelength\n\tSpectrum\n\tSensitivity\n\n\tClear\n\t280–640 nm\n\t\n\n\n\t\n\n\tUV\n\t280–370 nm\n\t\n\n\n\t\n\n\tViolet\n\t350–450 nm\n\t\n\n\n\t\n\n\tBlue\n\t430–530 nm\n\t\n\n\n\t\n\n\t⋮\n\t\n\t\n\t\n\n\tGreen\n\t530–640 nm\n\t\n\n\n\t\n\n\t⋮\n\t\n\t\n\t\n\n\tOrange\n\t590–640 nm\n\t\n\n\n\t\n\n\t⋮\n\t\n\t\n\t\n\n\n\n\t\n\tWide-angle camera[28]\n\n\tName\n\tWavelength\n\tSpectrum\n\tSensitivity\n\n\tClear\n\t280–640 nm\n\t\n\n\n\t\n\n\t⋮\n\t\n\t\n\t\n\n\tViolet\n\t350–450 nm\n\t\n\n\n\t\n\n\tBlue\n\t430–530 nm\n\t\n\n\n\t\n\n\tCH4-U\n\t536–546 nm\n\t\n\n\n\t\n\n\tGreen\n\t530–640 nm\n\t\n\n\n\t\n\n\tNa-D\n\t588–590 nm\n\t\n\n\n\t\n\n\tOrange\n\t590–640 nm\n\t\n\n\n\t\n\n\tCH4-JST\n\t614–624 nm\n\t\n\n\n\t\n\n\n\n\n\n\n\tPrincipal investigator: Bradford Smith / University of Arizona (PDS/PRN website)\n\tData: PDS/PDI data catalog, PDS/PRN data catalog\n\n\n\n\n\tRadio Science System \n(disabled)\n\tRSS\n\tUtilized the telecommunications system of the Voyager spacecraft to determine the physical properties of planets and satellites (ionospheres, atmospheres, masses, gravity fields, densities) and the amount and size distribution of material in Saturn's rings and the ring dimensions. More\n\tPrincipal investigator: G. Tyler / Stanford University PDS/PRN overview\n\tData: PDS/PPI data catalog, PDS/PRN data catalog (VG_2803), NSSDC data archive\n\n\n\n\n\tInfrared Interferometer Spectrometer \n(disabled)\n\tIRIS\n\tInvestigates both global and local energy balance and atmospheric composition. Vertical temperature profiles are also obtained from the planets and satellites as well as the composition, thermal properties, and size of particles in Saturn's rings. More\n\tPrincipal investigator: Rudolf Hanel / NASA Goddard Space Flight Center (PDS/PRN website)\n\tData: PDS/PRN data catalog, PDS/PRN expanded data catalog (VGIRIS_0001, VGIRIS_002), NSSDC Jupiter data archive\n\n\n\n\n\tUltraviolet Spectrometer \n(disabled)\n\tUVS\n\tDesigned to measure atmospheric properties, and to measure radiation. More\n\tPrincipal investigator: A. Broadfoot / University of Southern California (PDS/PRN website)\n\tData: PDS/PRN data catalog\n\n\n\n\n\tTriaxial Fluxgate Magnetometer \n(active)\n\tMAG\n\tDesigned to investigate the magnetic fields of Jupiter and Saturn, the interaction of the solar wind with the magnetospheres of these planets, and the magnetic field of interplanetary space out to the boundary between the solar wind and the magnetic field of interstellar space. More\n\tPrincipal investigator: Norman F. Ness / NASA Goddard Space Flight Center (website)\n\tData: PDS/PPI data catalog, NSSDC data archive\n\n\n\n\n\tPlasma Spectrometer \n(defective)\n\tPLS\n\tInvestigates the microscopic properties of the plasma ions and measures electrons in the energy range from 5 eV to 1 keV. More\n\tPrincipal investigator: John Richardson / MIT (website)\n\tData: PDS/PPI data catalog, NSSDC data archive\n\n\n\n\n\tLow Energy Charged Particle Instrument \n(active)\n\tLECP\n\tMeasures the differential in energy fluxes and angular distributions of ions, electrons and the differential in energy ion composition. More\n\tPrincipal investigator: Stamatios Krimigis / JHU / APL / University of Maryland (JHU/APL website / UMD website / KU website)\n\tData: UMD data plotting, PDS/PPI data catalog, NSSDC data archive\n\n\n\n\n\tCosmic Ray System \n(active)\n\tCRS\n\tDetermines the origin and acceleration process, life history, and dynamic contribution of interstellar cosmic rays, the nucleosynthesis of elements in cosmic-ray sources, the behavior of cosmic rays in the interplanetary medium, and the trapped planetary energetic-particle environment. More\n\tPrincipal investigator: Edward Stone / Caltech / NASA Goddard Space Flight Center (website)\n\tData: PDS/PPI data catalog, NSSDC data archive\n\n\n\n\n\tPlanetary Radio Astronomy Investigation \n(disabled)\n\tPRA\n\tUtilizes a sweep-frequency radio receiver to study the radio-emission signals from Jupiter and Saturn. More\n\tPrincipal investigator: James Warwick / University of Colorado\n\tData: PDS/PPI data catalog, NSSDC data archive\n\n\n\n\n\tPhotopolarimeter System \n(defective)\n\tPPS\n\tUtilized a telescope with a polarizer to gather information on surface texture and composition of Jupiter and Saturn and information on atmospheric scattering properties and density for both planets. More\n\tPrincipal investigator: Arthur Lane / JPL (PDS/PRN website)\n\tData: PDS/PRN data catalog\n\n\n\n\n\tPlasma Wave Subsystem \n(active)\n\tPWS\n\tProvides continuous, sheath-independent measurements of the electron-density profiles at Jupiter and Saturn as well as basic information on local wave–particle interaction, useful in studying the magnetospheres. More\n\tPrincipal investigator: Donald Gurnett / University of Iowa (website)\n\tData: PDS/PPI data catalog\n\n\n\n\n\n\nFor more details on the Voyager space probes' identical instrument packages, see the separate article on the overall Voyager Program.\nImages of the spacecraft\n\n\t\n\t\t\t\n\n\n\t\t\t\nVoyager 1 in a space simulator chamber\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nGold-Plated Record is attached to Voyager 1\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nEdward C. Stone, former director of NASA JPL, standing in front of a Voyager spacecraft model\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nLocation of the scientific instruments indicated in a diagram\n\n\n\t\t\t\n\n\t\t\n\n\n\n\n Media related to the Voyager spacecraft at Wikimedia Commons\n\n\n\n\nMission profile[edit]\n\nTimeline of travel[edit]\n\n\t\nVoyager 1's trajectory seen from Earth, diverging from the ecliptic in 1981 at Saturn and now heading into the constellation Ophiuchus\n\n\n\n\tDate\n\tEvent\n\n\t1977-09-05\n\tSpacecraft launched at 12:56:00 UTC.\n\n\t1977-12-10\n\tEntered asteroid belt.\n\n\t1977-12-19\n\tVoyager 1 overtakes Voyager 2. (see diagram)\n\n\t1978-09-08\n\tExited asteroid belt.\n\n\t1979-01-06\n\tStart Jupiter observation phase.\n\tTime\n\tEvent\n\n\t1979-03-05\n\tEncounter with the Jovian system.\n\n\t0006:54\n\tAmalthea flyby at 420,200 km.\n\n\t0012:05:26\n\tJupiter closest approach at 348,890 km from the center of mass.\n\n\t0015:14\n\tIo flyby at 20,570 km.\n\n\t0018:19\n\tEuropa flyby at 733,760 km.\n\n\t1979-03-06\n\t\n\n\t0002:15\n\tGanymede flyby at 114,710 km.\n\n\t0017:08\n\tCallisto flyby at 126,400 km.\n\n\t1979-04-13\n\tPhase end\n\n\n\n\n\t1980-08-22\n\tStart Saturn observation phase.\n\tTime\n\tEvent\n\n\t1980-11-12\n\tEncounter with the Saturnian system.\n\n\t0005:41:21\n\tTitan flyby at 6,490 km.\n\n\t0022:16:32\n\tTethys flyby at 415,670 km.\n\n\t0023:46:30\n\tSaturn closest approach at 184,300 km from the center of mass.\n\n\t1980-11-13\n\t\n\n\t0001:43:12\n\tMimas flyby at 88,440 km.\n\n\t0001:51:16\n\tEnceladus flyby at 202,040 km.\n\n\t0006:21:53\n\tRhea flyby at 73,980 km.\n\n\t0016:44:41\n\tHyperion flyby at 880,440 km.\n\n\t1980-11-14\n\tPhase end\n\n\n\n\n\t1980-11-14\n\tBegin extended mission.\n\n\n\n\tExtended mission\n\n\t1990-02-14\n\tFinal images of the Voyager program acquired by Voyager 1 to create the Solar System Family Portrait.\n\n\t1998-02-17\n\tVoyager 1 overtakes Pioneer 10 as the most distant spacecraft from the Sun, at 69.419 AU. Voyager 1 is moving away from the Sun at over 1 AU per year faster than Pioneer 10.\n\n\t2004-12-17\n\tPassed the termination shock at 94 AU and entered the heliosheath.\n\n\t2007-02-02\n\tTerminated plasma subsystem operations.\n\n\t2007-04-11\n\tTerminated plasma subsystem heater.\n\n\t2008-01-16\n\tTerminated planetary radio astronomy experiment operations.\n\n\t2012-08-25\n\tCrossed the heliopause at 121 AU and entered interstellar space.\n\n\t2014-07-07\n\tFurther confirmation probe is in interstellar space.\n\n\t2016-04-19\n\tTerminated Ultraviolet Spectrometer operations.\n\n\t2017-11-28\n\t\"Trajectory correction maneuver\" (TCM) thrusters are tested in their first use since November 1980.[29]\n\n\n\n\nLaunch and trajectory[edit]\n\n  \nVoyager 1 lifted off atop a Titan IIIE.\n\n\n\n  \nAnimation of Voyager 1's trajectory from  September 1977 to 31 December 1981\n   Voyager 1  ·   Earth ·   Jupiter ·   Saturn ·   Sun \n\n\n\nThe Voyager 1 probe was launched on September 5, 1977, from Launch Complex 41 at the Cape Canaveral Air Force Station, aboard a Titan IIIE launch vehicle. The Voyager 2 probe had been launched two weeks earlier, on August 20, 1977. Despite being launched later, Voyager 1 reached both Jupiter[30] and Saturn sooner, following a shorter trajectory.[31]\n\nVoyager 1′s initial orbit had an aphelion of 8.9 AU, just a little short of Saturn's orbit of 9.5 AU. Voyager 2′s initial orbit had an aphelion of 6.2 AU, well short of Saturn's orbit.[32]\n\n\n  \nThe trajectory of Voyager 1 through the Jupiter system\n\n\n\nFlyby of Jupiter[edit]\n\nMain article: Exploration of Jupiter\n\nVoyager 1 began photographing Jupiter in January 1979. Its closest approach to Jupiter was on March 5, 1979, at a distance of about 349,000 kilometers (217,000 miles) from the planet's center.[30] Because of the greater photographic resolution allowed by a closer approach, most observations of the moons, rings, magnetic fields, and the radiation belt environment of the Jovian system were made during the 48-hour period that bracketed the closest approach. Voyager 1 finished photographing the Jovian system in April 1979.\n\nDiscovery of ongoing volcanic activity on the moon Io was probably the greatest surprise. It was the first time active volcanoes had been seen on another body in the Solar System. It appears that activity on Io affects the entire Jovian system. Io appears to be the primary source of matter that pervades the Jovian magnetosphere – the region of space that surrounds the planet influenced by the planet's strong magnetic field. Sulfur, oxygen, and sodium, apparently erupted by Io's volcanoes and sputtered off the surface by impact of high-energy particles, were detected at the outer edge of the magnetosphere of Jupiter.[30]\n\nThe two Voyager space probes made a number of important discoveries about Jupiter, its satellites, its radiation belts, and its never-before-seen planetary rings.\n\n\n\n\t\n\t\t\tPlay media\n\n\n\n\t\t\t\nVoyager 1 time-lapse movie of Jupiter approach (full-size video)\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nJupiter's Great Red Spot, an anti-cyclonic storm larger than Earth, as seen from Voyager 1\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nView of sulfur-rich lava flows radiating from the volcano Ra Patera on Io\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nThe eruption plume of the volcano Loki rises 160 km (100 mi) over the limb of Io\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nEuropa's lineated but un-cratered face, evidence of currently active geology, at a distance of 2.8 million km.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nGanymede's tectonically disrupted surface, marked with bright impact sites, from 253,000 km.\n\n\n\t\t\t\n\n\t\t\n\n\n\n Media related to the Voyager 1 Jupiter encounter at Wikimedia Commons\n\nFlyby of Saturn[edit]\n\nMain article: Exploration of Saturn\n\nThe gravitational assist trajectories at Jupiter were successfully carried out by both Voyagers, and the two spacecraft went on to visit Saturn and its system of moons and rings. Voyager 1 encountered Saturn in November 1980, with the closest approach on November 12, 1980, when the space probe came within 124,000 kilometers (77,000 mi) of Saturn's cloud-tops. The space probe's cameras detected complex structures in the rings of Saturn, and its remote sensing instruments studied the atmospheres of Saturn and its giant moon Titan.[33]\n\nVoyager 1 found that about seven percent of the volume of Saturn's upper atmosphere is helium (compared with 11 percent of Jupiter's atmosphere), while almost all the rest is hydrogen. Since Saturn's internal helium abundance was expected to be the same as Jupiter's and the Sun's, the lower abundance of helium in the upper atmosphere may imply that the heavier helium may be slowly sinking through Saturn's hydrogen; that might explain the excess heat that Saturn radiates over energy it receives from the Sun. Winds blow at high speeds in Saturn. Near the equator, the Voyagers measured winds about 500 m/s (1,100 mph). The wind blows mostly in an easterly direction.[31]\n\nThe Voyagers found aurora-like ultraviolet emissions of hydrogen at mid-latitudes in the atmosphere, and auroras at polar latitudes (above 65 degrees). The high-level auroral activity may lead to the formation of complex hydrocarbon molecules that are carried toward the equator. The mid-latitude auroras, which occur only in sunlit regions, remain a puzzle, since bombardment by electrons and ions, known to cause auroras on Earth, occurs primarily at high latitudes. Both Voyagers measured the rotation of Saturn (the length of a day) at 10 hours, 39 minutes, 24 seconds.[33]\n\nVoyager 1's mission included a flyby of Titan, Saturn's largest moon, which had long been known to have an atmosphere. Images taken by Pioneer 11 in 1979 had indicated the atmosphere was substantial and complex, further increasing interest. The Titan flyby occurred as the spacecraft entered the system to avoid any possibility of damage closer to Saturn compromising observations, and approached to within 6,400 km (4,000 mi), passing behind Titan as seen from Earth and the Sun. Voyager's measurement of the atmosphere's effect on sunlight and Earth-based measurement of its effect on the probe's radio signal were used to determine the atmosphere's composition, density, and pressure. Titan's mass was also measured by observing its effect on the probe's trajectory. The thick haze prevented any visual observation of the surface, but the measurement of the atmosphere's composition, temperature, and pressure led to speculation that lakes of liquid hydrocarbons could exist on the surface.[34]\n\nBecause observations of Titan were considered vital, the trajectory chosen for Voyager 1 was designed around the optimum Titan flyby, which took it below the south pole of Saturn and out of the plane of the ecliptic, ending its planetary science mission.[35] Had Voyager 1 failed or been unable to observe Titan, Voyager 2's trajectory would have been altered to incorporate the Titan flyby,[34]:94 precluding any visit to Uranus and Neptune.[5] The trajectory Voyager 1 was launched into would not have allowed it to continue on to Uranus and Neptune,[35]:155 but could have been altered to avoid a Titan flyby and travel from Saturn to Pluto, arriving in 1986.[7]\n\n\n\t\n\t\t\t\n\n\n\t\t\t\nCrescent Saturn from 5.3 million km, four days after closest approach\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nVoyager 1 image of Saturn's narrow, twisted and braided F Ring.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nMimas at a range of 425,000 km; the crater Herschel is at upper right\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nTethys, with its giant rift valley Ithaca Chasma, from 1.2 million km.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nFractured 'wispy terrain' on Dione's trailing hemisphere.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nThe icy surface of Rhea is nearly saturated with impact craters.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nTitan's thick haze layer is shown in this enhanced Voyager 1 image.\n\n\n\t\t\t\n\n\t\t\n\n\t\n\t\t\t\n\n\n\t\t\t\nLayers of haze, composed of complex organic compounds, covering Saturn's satellite Titan.\n\n\n\t\t\t\n\n\t\t\n\n\n\n Media related to the Voyager 1 Saturn encounter at Wikimedia Commons\n\nExit from the heliosphere[edit]\n\n  \nThe Family Portrait of the Solar System acquired by Voyager 1\n\n\n\n  \nPosition of Voyager 1 above the plane of the ecliptic on February 14, 1990\n\n\n\n  \nVoyager 1 and 2 speed and distance from Sun\n\n\n\nOn February 14, 1990, Voyager 1 took the first \"family portrait\" of the Solar System as seen from outside,[36] which includes the image of planet Earth known as Pale Blue Dot. Soon afterwards its cameras were deactivated to conserve energy and computer resources for other equipment. The camera software has been removed from the spacecraft, so it would now be complex to get them working again. Earth-side software and computers for reading the images are also no longer available.[5]\n\n\n  \nThe Pale Blue Dot image showing Earth from 6 billion kilometers appearing as a tiny dot (the blueish-white speck approximately halfway down the brown band to the right) within the darkness of deep space\n\n\n\nOn February 17, 1998, Voyager 1 reached a distance of 69 AU from the Sun and overtook Pioneer 10 as the most distant spacecraft from Earth.[37][38] Travelling at about 17 kilometers per second (11 mi/s)[39] it has the fastest heliocentric recession speed of any spacecraft.[40]\n\nAs Voyager 1 headed for interstellar space, its instruments continued to study the Solar System. Jet Propulsion Laboratory scientists used the plasma wave experiments aboard Voyager 1 and 2 to look for the heliopause, the boundary at which the solar wind transitions into the interstellar medium.[41] As of 2013[update], the probe was moving with a relative velocity to the Sun of about 17,030 meters per second (55,900 ft/s).[42]\nWith the velocity the probe is currently maintaining, Voyager 1 is traveling about 325 million miles (523×10^6 km) per year,[43] or about one light-year per 18,000 years.\n\n\nTermination shock[edit]\n\n  \nClose flybys of gas giants gave gravity assists to both Voyagers\n\n\n\nScientists at the Johns Hopkins University Applied Physics Laboratory believe that Voyager 1 entered the termination shock in February 2003.[44] This marks the point where the solar wind slows to subsonic speeds. Some other scientists expressed doubt, discussed in the journal Nature of November 6, 2003.[45] The issue would not be resolved until other data became available, since Voyager 1's solar-wind detector ceased functioning in 1990. This failure meant that termination shock detection would have to be inferred from the data from the other instruments on board.[46][47][48]\n\nIn May 2005, a NASA press release said that the consensus was that Voyager 1 was then in the heliosheath.[49] In a scientific session at the American Geophysical Union meeting in New Orleans on May 25, 2005, Dr. Ed Stone presented evidence that the craft crossed the termination shock in late 2004.[50] This event is estimated to have occurred on December 15, 2004 at a distance of 94 AU from the Sun.[50][51]\n\n\nHeliosheath[edit]\n\nOn March 31, 2006, amateur radio operators from AMSAT in Germany tracked and received radio waves from Voyager 1 using the 20-meter (66 ft) dish at Bochum with a long integration technique. Retrieved data was checked and verified against data from the Deep Space Network station at Madrid, Spain.[52] This seems to be the first such amateur tracking of Voyager 1.[52]\n\nIt was confirmed on December 13, 2010 that Voyager 1 had passed the reach of the radial outward flow of the solar wind, as measured by the Low Energy Charged Particle device. It is suspected that solar wind at this distance turns sideways because of interstellar wind pushing against the heliosphere. Since June 2010, detection of solar wind had been consistently at zero, providing conclusive evidence of the event.[53][54] On this date, the spacecraft was approximately 116 AU or 10.8 billion miles (17.3 billion kilometers) from the Sun.[55]\n\nVoyager 1 was commanded to change its orientation to measure the sideways motion of the solar wind at that location in space on March 2011 (~33yr 6mo from launch). A test roll done in February had confirmed the spacecraft's ability to maneuver and reorient itself. The course of the spacecraft was not changed. It rotated 70 degrees counterclockwise with respect to Earth to detect the solar wind. This was the first time the spacecraft had done any major maneuvering since the Family Portrait photograph of the planets was taken in 1990. After the first roll the spacecraft had no problem in reorienting itself with Alpha Centauri, Voyager 1's guide star, and it resumed sending transmissions back to Earth. Voyager 1 was expected to enter interstellar space \"at any time\". Voyager 2 was still detecting outward flow of solar wind at that point but it was estimated that in the following months or years it would experience the same conditions as Voyager 1.[56][57]\n\nThe spacecraft was reported at 12.44° declination and 17.163 hours right ascension, and at an ecliptic latitude of 34.9° (the ecliptic latitude changes very slowly), placing it in the constellation Ophiuchus as observed from the Earth on May 21, 2011.[5]\n\nOn December 1, 2011, it was announced that Voyager 1 had detected the first Lyman-alpha radiation originating from the Milky Way galaxy. Lyman-alpha radiation had previously been detected from other galaxies, but because of interference from the Sun, the radiation from the Milky Way was not detectable.[58]\n\nNASA announced on December 5, 2011, that Voyager 1 had entered a new region referred to as a \"cosmic purgatory\". Within this stagnation region, charged particles streaming from the Sun slow and turn inward, and the Solar System's magnetic field is doubled in strength as interstellar space appears to be applying pressure. Energetic particles originating in the Solar System decline by nearly half, while the detection of high-energy electrons from outside increases 100-fold. The inner edge of the stagnation region is located approximately 113 AU from the Sun.[59]\n\n\nHeliopause[edit]\n\n\nPlot showing a dramatic increase in the rate of cosmic ray particle detection by the Voyager 1 spacecraft (October 2011 through October 2012)\n\n\n\nPlot showing a dramatic decrease in the rate of solar wind particle detection by Voyager 1 (October 2011 through October 2012)\n\n\n\n\n\nNASA announced in June 2012 that the probe was detecting changes in the environment that were suspected to correlate with arrival at the heliopause.[60] Voyager 1 had reported a marked increase in its detection of charged particles from interstellar space, which are normally deflected by the solar winds within the heliosphere from the Sun. The craft thus began to enter the interstellar medium at the edge of the Solar System.[61]\n\nVoyager 1 became the first spacecraft to cross the heliopause in August 2012, then at a distance of 121 AU from the Sun, although this was not confirmed for another year.[62][63][64][65][66]\n\nAs of September 2012, sunlight took 16.89 hours to get to Voyager 1 which was at a distance of 121 AU. The apparent magnitude of the Sun from the spacecraft was −16.3 (less than 30 times the brightness of the full moon).[67] The spacecraft was traveling at 17.043 km/s (10.590 mi/s) relative to the Sun. It would need about 17,565 years at this speed to travel a light-year.[67] To compare, Proxima Centauri, the closest star to the Sun, is about 4.2 light-years (2.65×105 AU) distant. Were the spacecraft traveling in the direction of that star, 73,775 years would pass before Voyager 1 reaches it. (Voyager 1 is heading in the direction of the constellation Ophiuchus.[67])\n\nIn late 2012, researchers reported that particle data from the spacecraft suggested that the probe had passed through the heliopause. Measurements from the spacecraft revealed a steady rise since May in collisions with high energy particles (above 70 MeV), which are thought to be cosmic rays emanating from supernova explosions far beyond the Solar System, with a sharp increase in these collisions in late August. At the same time, in late August, there was a dramatic drop in collisions with low-energy particles, which are thought to originate from the Sun.[68] Ed Roelof, space scientist at Johns Hopkins University and principal investigator for the Low-Energy Charged Particle instrument on the spacecraft declared that \"Most scientists involved with Voyager 1 would agree that [these two criteria] have been sufficiently satisfied.\"[68] However, the last criterion for officially declaring that Voyager 1 had crossed the boundary, the expected change in magnetic field direction (from that of the Sun to that of the interstellar field beyond), had not been observed (the field had changed direction by only 2 degrees[63]), which suggested to some that the nature of the edge of the heliosphere had been misjudged. On December 3, 2012, Voyager project scientist Ed Stone of the California Institute of Technology said, \"Voyager has discovered a new region of the heliosphere that we had not realized was there. We're still inside, apparently. But the magnetic field now is connected to the outside. So it's like a highway letting particles in and out.\"[69] The magnetic field in this region was 10 times more intense than Voyager 1 encountered before the termination shock. It was expected to be the last barrier before the spacecraft exited the Solar System completely and entered interstellar space.[70][71][72]\n\nIn March 2013, it was announced that Voyager 1 might have become the first spacecraft to enter interstellar space, having detected a marked change in the plasma environment on August 25, 2012. However, until September 12, 2013, it was still an open question as to whether the new region was interstellar space or an unknown region of the Solar System. At that time, the former alternative was officially confirmed.[73]\n[74]\n\nIn 2013 Voyager 1 was exiting the Solar System at a speed of about 3.6 AU per year, while Voyager 2 is going slower, leaving the Solar System at 3.3 AU per year.[75] Each year Voyager 1 increases its lead over Voyager 2.\n\nVoyager 1 reached a distance of 135 AU from the Sun on May 18, 2016.[3] By September 5, 2017, that had increased to about 139.64 AU from the Sun, or just over 19 light-hours, and at that time Voyager 2 was 115.32 AU from the Sun.[3]\n\nIts progress can be monitored at NASA's website (see: External links).[3]\n\n\n  \nVoyager 1 and the other probes that are in or on their way to interstellar space, except New Horizons.\n\n\n\nInterstellar medium[edit]\n\nPlay media\n  \nVoyager 1 transmitted audio signals generated by plasma waves from interstellar space\n\n\n\nOn September 12, 2013, NASA officially confirmed that Voyager 1 had reached the interstellar medium in August 2012 as previously observed, with a generally accepted date of August 25, 2012 (~10d short of 34yrs since launch), the date durable changes in the density of energetic particles were first detected.[64][65][66] By this point most space scientists had abandoned the hypothesis that a change in magnetic field direction must accompany crossing of the heliopause;[65] a new model of the heliopause predicted that no such change would be found.[76] A key finding that persuaded many scientists that the heliopause had been crossed was an indirect measurement of an 80-fold increase in electron density, based on the frequency of plasma oscillations observed beginning on April 9, 2013,[65] triggered by a solar outburst that had occurred in March 2012[62] (electron density is expected to be two orders of magnitude higher outside the heliopause than within).[64] Weaker sets of oscillations measured in October and November 2012[74][77] provided additional data. An indirect measurement was required because Voyager 1's plasma spectrometer had stopped working in 1980.[66] In September 2013, NASA released recordings of audio transductions of these plasma waves, the first to be measured in interstellar space.[78]\n\nWhile Voyager 1 is commonly spoken of as having left the Solar System simultaneously with having left the heliosphere, the two are not the same. The Solar System is usually defined as the vastly larger region of space populated by bodies that orbit the Sun. The craft is presently less than one-seventh the distance to the aphelion of Sedna, and it has not yet entered the Oort cloud, the source region of long-period comets, regarded by astronomers as the outermost zone of the Solar System.[63][74]\n\n\nFuture of the probe[edit]\n\nInterstellar velocity (\n  \n    \n      \n        \n          v\n          \n            ∞\n          \n        \n      \n    \n    {\\displaystyle v_{\\infty }}\n  \n)\n\tProbe\tVelocity (\n  \n    \n      \n        \n          v\n          \n            ∞\n          \n        \n      \n    \n    {\\displaystyle v_{\\infty }}\n  \n)\n\n\tPioneer 10\t11.8 km/s (2.49 au/yr)\n\n\tPioneer 11\t11.1 km/s (2.34 au/yr)\n\n\tVoyager 1\t16.9 km/s (3.57 au/yr)[79]\n\n\tVoyager 2\t15.2 km/s (3.21 au/yr)\n\n\tNew Horizons\t12.6 km/s (2.66 au/yr)\n\n\n\n  \nImage of Voyager 1's radio signal on February 21, 2013[80]\n\n\n\n\n\nSimulated view of Voyager 1 relative to the Solar System on August 2, 2018.\n\n\n\nSimulated view of the Voyager probes relative to the Solar System and heliopause on August 2, 2018.\n\n\n\n\n\nVoyager 1 is expected to reach the theorized Oort cloud in about 300 years[81][82] and take about 30,000 years to pass through it.[63][74] Though it is not heading towards any particular star, in about 40,000 years, it will pass within 1.6 light-years of the star Gliese 445, which is at present in the constellation Camelopardalis.[83] That star is generally moving towards the Solar System at about 119 km/s (430,000 km/h; 270,000 mph).[83] NASA says that \"The Voyagers are destined—perhaps eternally—to wander the Milky Way.\"[84]\nIn 300,000 years it will pass within less than 1 light year of the M3V star TYC 3135-52-1\n[85] \n\nProvided Voyager 1 does not collide with anything and is not retrieved, the New Horizons space probe will never pass it, despite being launched from Earth at a faster speed than either Voyager spacecraft.  The Voyager spacecraft benefited from multiple planetary flybys to increase their heliocentric velocities, whereas New Horizons received only a single such boost, from its Jupiter flyby. As of 2018, New Horizons is traveling at about 14 km/s, 3 km/s slower than Voyager 1, and is still slowing down.[86]\n\nIn December 2017 it was announced that NASA had successfully fired up all four of Voyager 1's trajectory correction maneuver (TCM) thrusters for the first time since 1980. The TCM thrusters will be used in the place of a degraded set of jets which were used to help keep the probe's antenna pointed towards the Earth.  Use of the TCM thrusters will allow Voyager 1 to continue to transmit data to NASA for two to three more years.[87][88]\n\n\n\tYear\tEnd of specific capabilities as a result of the available electrical power limitations[89]\n\n\t2007\tTermination of plasma subsystem (PLS)\n\n\t2008\tPower off Planetary Radio Astronomy Experiment (PRA)\n\n\t2016[90]\tTermination of scan platform and Ultraviolet Spectrometer (UVS) observations\n\n\t2018 approx.\tTermination of Data Tape Recorder (DTR) operations (limited by ability to capture 1.4 kbit/s data using a 70 m/34 m antenna array; this is the minimum rate at which the DTR can read out data). As of May 2019, a 70 m/34 m/34 m/34 m antenna array is used for capturing the data.[citation needed]\n\n\t2019–2020 approx.\tTermination of gyroscopic operations (previously 2017, but backup thrusters active for continuation of gyroscopic operations.)\n\n\t2020\tStart shutdown of science instruments (as of October 18, 2010[update] the order is undecided, however the Low-Energy Charged Particles, Cosmic Ray Subsystem, Magnetometer, and Plasma Wave Subsystem instruments are expected to still be operating)[91]\n\n\t2025–2030\tWill no longer be able to power even a single instrument.\n\n\n\nGolden record[edit]\n\n\n  \nA child's greeting in English recorded on the Voyager Golden Record\n\n\n\n  \nVoyager Golden Record\n\n\n\nMain article: Voyager Golden Record\n\nEach Voyager space probe carries a gold-plated audio-visual disc, should the spacecraft ever be found by intelligent life forms from other planetary systems.[92] The disc carries photos of the Earth and its lifeforms, a range of scientific information, spoken greetings from people such as the Secretary-General of the United Nations and the President of the United States and a medley, \"Sounds of Earth,\" that includes the sounds of whales, a baby crying, waves breaking on a shore, and a collection of music including works by Wolfgang Amadeus Mozart, Blind Willie Johnson, Chuck Berry and Valya Balkanska. Other Eastern and Western classics are included, as well as various performances of indigenous music from around the world. The record also contains greetings in 55 different languages.[93]\n\n\n\n\nSee also[edit]\n\n  \nHeliocentric positions of the five interstellar probes (squares) and other bodies (circles) until 2020, with launch and flyby dates. Markers denote positions on 1 January of each year, with every fifth year labelled.\nPlot 1 is viewed from the north ecliptic pole, to scale; plots 2 to 4 are third-angle projections at 20% scale.\nIn the SVG file, hover over a trajectory or orbit to highlight it and its associated launches and flybys.\n\n\n\n\n\tSpaceflight portal\n\tSolar System portal\n\tAstronomy portal\n\n\n\n\n\tInterstellar probe\n\tList of artificial objects leaving the Solar System\n\tList of missions to the outer planets\n\tLocal Interstellar Cloud\n\tRings of Jupiter\n\tSpace exploration\n\tSpace probe\n\tSpecific orbital energy of Voyager 1\n\tTimeline of artificial satellites and space probes\n\tVoyager 2\n\n\n\n\nReferences[edit]\n\n\n\t^ \"Voyager 1\". NSSDC Master Catalog. NASA/NSSDC. Retrieved August 21, 2013.\n\n\t^ \"Voyager 1\". N2YO. Retrieved August 21, 2013.\n\n\n\t^ a b c d e \"Voyager - Mission Status\". Jet Propulsion Laboratory. National Aeronautics and Space Administration. Retrieved February 16, 2019.\n,\n\n\t^ \"Voyager 1\". BBC Solar System. Archived from the original on February 3, 2018. Retrieved September 4, 2018.\n\n\n\t^ a b c d \"Voyager – Frequently Asked Questions\". NASA. February 14, 1990. Retrieved August 4, 2017.\n\n\n\t^ \"New Horizons conducts flyby of Pluto in historic Kuiper Belt encounter\". Retrieved September 2, 2015.\n\n\n\t^ a b \"What If Voyager Had Explored Pluto?\". Retrieved September 2, 2015.\n\n\n\t^ Barnes, Brooks (September 12, 2013). \"In a Breathtaking First, NASA Craft Exits the Solar System\". New York Times. Retrieved September 12, 2013.\n\n\n\t^ Wall, Mike (December 1, 2017). \"Voyager 1 Just Fired Up its Backup Thrusters for the 1st Time in 37 Years\". Space.com. Retrieved December 3, 2017.\n\n\n\t^ \"1960s\". JPL. Archived from the original on December 8, 2012. Retrieved August 18, 2013.\n\n\n\t^ \"The Pioneer missions\". NASA. 2007. Retrieved August 19, 2013.\n\n\n\t^ \"Preview Screening: The Farthest - Voyager in Space\". informal.jpl.nasa.gov. NASA Museum Alliance. August 2017. Retrieved August 18, 2019. supermarket aluminum foil added at the last minute to protect the craft from radiation\n\n\n\t^ Mack, Pamela (1998). \"Chapter 11\". From engineering science to big science: The NACA and NASA Collier Trophy research project winners. History Office. p. 251. ISBN 978-0-16-049640-0.\n\n\n\t^ Landau, Elizabeth (October 2, 2013). \"Voyager 1 becomes first human-made object to leave solar system\". CNN. CNN. Retrieved May 29, 2014.\n\n\n\t^ \"NASA Spacecraft Embarks on Historic Journey into Interstellar Space\". NASA. September 12, 2013. Retrieved May 29, 2014. NASA's Voyager 1 spacecraft officially is the first human-made object to venture into interstellar space.\n\n\n\t^ \"Viking: Trailblazer for All Mars Research\". NASA. June 22, 2006. Retrieved May 29, 2014. All of these missions relied on Viking technologies. As it did for the Viking program team in 1976, Mars continues to hold a special fascination. Thanks to the dedication of men and women working at NASA centers across the country, the mysterious Mars of our past is becoming a much more familiar place.\n\n\n\t^ a b \"VOYAGER 1:Host Information\". JPL. 1989. Retrieved April 29, 2015.\n\n\n\t^ \"High Gain Antenna\". JPL. Retrieved August 18, 2013.\n\n\n\t^ Ludwig, Roger; Taylor, Jim (March 2002). \"Voyager Telecommunications\" (PDF). DESCANSO Design and Performance Summary Series. NASA/JPL. Retrieved September 16, 2013.\n\n\n\t^ \"NASA News Press Kit 77–136\". JPL/NASA. Retrieved December 15, 2014.\n\n\n\t^ a b Furlong, Richard R.; Wahlquist, Earl J. (1999). \"U.S. space missions using radioisotope power systems\" (PDF). Nuclear News. 42 (4): 26–34.\n\n\n\t^ \"Spacecraft Lifetime\". JPL. Retrieved August 19, 2013.\n\n\n\t^ \"pds-rings\". Retrieved May 23, 2015.\n\n\n\t^ Tomayko, James (April 1987). Computers in Spaceflight: The NASA Experience. NASA. Bibcode:1988csne.book.....T. Retrieved February 6, 2010.\n\n\n\t^ \"au.af\". Archived from the original on October 16, 2015. Retrieved May 23, 2015.\n\n\n\t^ \"airandspace\". Retrieved May 23, 2015.\n\n\n\t^ \n \"Voyager 1 Narrow Angle Camera Description\". NASA. Retrieved January 17, 2011.\n\n\n\t^ \n \"Voyager 1 Wide Angle Camera Description\". NASA. Retrieved January 17, 2011.\n\n\n\t^ Greicius, Tony (December 1, 2017). \"Voyager 1 Fires Up Thrusters After 37 Years\". NASA. Retrieved December 13, 2017.\n\n\n\t^ a b c \"Encounter with Jupiter\". NASA. Retrieved August 18, 2013.\n\n\n\t^ a b \"Planetary voyage\". NASA. Retrieved August 18, 2013.\n\n\n\t^ HORIZONS, JPL Solar System Dynamics (Ephemeris Type ELEMENTS; Target Body: Voyager n (spacecraft); Center: Sun (body center); Time Span: launch + 1 month to Jupiter encounter - 1 month)\n\n\t^ a b \"Encounter with saturn\". NASA. Retrieved August 29, 2013.\n\n\n\t^ a b Jim Bell (February 24, 2015). The Interstellar Age: Inside the Forty-Year Voyager Mission. Penguin Publishing Group. p. 93. ISBN 978-0-698-18615-6.\n\n\n\t^ a b David W. Swift (January 1, 1997). Voyager Tales: Personal Views of the Grand Tour. AIAA. p. 69. ISBN 978-1-56347-252-7.\n\n\n\t^ \"Photo Caption\". Public Information Office. Retrieved August 26, 2010.\n\n\n\t^ \"Voyager 1 now most distant man-made object in space\". CNN. February 17, 1998. Archived from the original on June 20, 2012. Retrieved July 1, 2012.\n\n\n\t^ Clark, Stuart (September 13, 2013). \"Voyager 1 leaving solar system matches feats of great human explorers\". The Guardian.\n\n\n\t^ Webb, Stephen (October 4, 2002). If the Universe is Teeming with Aliens … WHERE IS EVERYBODY?: Fifty Solutions to the Fermi Paradox and the Problem of Extraterrestrial Life. ISBN 978-0-387-95501-8.\n\n\n\t^ Darling, David. \"Fastest Spacecraft\". Retrieved August 19, 2013.\n\n\n\t^ \"Voyager 1 in heliopause\". JPL. Retrieved August 18, 2013.\n\n\n\t^ \"Voyager Mission Operations Status Report # 2013-09-06, Week Ending September 6, 2013\". JPL. Retrieved September 15, 2013.\n\n\n\t^ Wall, Mike (September 12, 2013). \"It's Official! Voyager 1 Spacecraft Has Left Solar System\". Space.com. Retrieved May 30, 2014.\n\n\n\t^ Tobin, Kate (November 5, 2003). \"Spacecraft reaches edge of Solar System\". CNN. Retrieved August 19, 2013.\n\n\n\t^ Fisk, Len A. (2003). \"Planetary Science: Over the edge?\" (PDF). Nature. 426 (6962): 21–2. Bibcode:2003Natur.426...21F. doi:10.1038/426021a. PMID 14603294.\n\n\n\t^ Krimigis, S. M.; Decker, R. B.; Hill, M. E.; Armstrong, T. P.; Gloeckler, G.; Hamilton, D. C.; Lanzerotti, L. J.; Roelof, E. C. (2003). \"Voyager 1 exited the solar wind at a distance of ∼85 au from the Sun\". Nature. 426 (6962): 45–8. Bibcode:2003Natur.426...45K. doi:10.1038/nature02068. PMID 14603311.\n\n\n\t^ McDonald, Frank B.; Stone, Edward C.; Cummings, Alan C.; Heikkila, Bryant; Lal, Nand; Webber, William R. (2003). \"Enhancements of energetic particles near the heliospheric termination shock\". Nature. 426 (6962): 48–51. Bibcode:2003Natur.426...48M. doi:10.1038/nature02066. PMID 14603312.\n\n\n\t^ Burlaga, L. F. (2003). \"Search for the heliosheath with Voyager 1 magnetic field measurements\" (PDF). Geophysical Research Letters. 30 (20): n/a. Bibcode:2003GeoRL..30.2072B. doi:10.1029/2003GL018291.\n\n\n\t^ \"Voyager Enters Solar System's Final Frontier\". NASA. May 24, 2005. Retrieved August 7, 2007.\n\n\n\t^ a b \"Voyager crosses termination shock\". Retrieved August 29, 2013.\n\n\n\t^ \"Voyager Timeline\". NASA/JPL. February 2013. Retrieved December 2, 2013.\n\n\n\t^ a b \"ARRL article\" (in German). AMSAT-DL. Archived from the original on October 14, 2006.\n \"ARRL article\".\n\n\n\t^ \"Voyager 1 Sees Solar Wind Decline\". NASA. December 13, 2010. Archived from the original on June 14, 2011. Retrieved September 16, 2013.\n\n\n\t^ Krimigis, S. M.; Roelof, E. C.; Decker, R. B.; Hill, M. E. (2011). \"Zero outward flow velocity for plasma in a heliosheath transition layer\". Nature. 474 (7351): 359–361. Bibcode:2011Natur.474..359K. doi:10.1038/nature10115. PMID 21677754.\n\n\n\t^ Amos, Jonathan (December 14, 2010). \"Voyager near Solar System's edge\". BBC News. Retrieved December 21, 2010.\n\n\n\t^ NASA. \"Voyager – The Interstellar Mission\". NASA. Retrieved September 16, 2013.\n\n\n\t^ \"Voyager: Still dancing 17 billion km from Earth\". BBC News. March 9, 2011.\n\n\n\t^ \"Voyager Probes Detect \"invisible\" Milky Way Glow\". National Geographic. December 1, 2011. Retrieved December 4, 2011.\n\n\n\t^ \"Spacecraft enters 'cosmic purgatory'\". CNN. December 6, 2011. Retrieved December 7, 2011.\n\n\n\t^ \"NASA Voyager 1 Spacecraft Nears Interstellar Space\". Space.com. Retrieved August 19, 2013.\n\n\n\t^ \"Data From NASA's Voyager 1 Point to Interstellar Future\". NASA. June 14, 2012. Retrieved June 16, 2012.\n\n\n\t^ a b Cook, J.-R. C.; Agle, D.C.; Brown, D. (September 12, 2013). \"NASA Spacecraft Embarks on Historic Journey into Interstellar Space\". NASA. Retrieved September 14, 2013.\n\n\n\t^ a b c d Ghose, Tia (September 13, 2013). \"Voyager 1 Really Is in Interstellar Space: How NASA Knows\". Space.com. TechMedia Network. Retrieved September 14, 2013.\n\n\n\t^ a b c Cowen, R. (2013). \"Voyager 1 has reached interstellar space\". Nature. doi:10.1038/nature.2013.13735.\n\n\n\t^ a b c d Kerr, R. A. (2013). \"It's Official—Voyager Has Left the Solar System\". Science. 341 (6151): 1158–1159. Bibcode:2013Sci...341.1158K. doi:10.1126/science.341.6151.1158. PMID 24030991.\n\n\n\t^ a b c Gurnett, D. A.; Kurth, W. S.; Burlaga, L. F.; Ness, N. F. (2013). \"In Situ Observations of Interstellar Plasma with Voyager 1\". Science. 341 (6153): 1489–1492. Bibcode:2013Sci...341.1489G. doi:10.1126/science.1241681. PMID 24030496.\n\n\n\t^ a b c Peat, Chris (September 9, 2012). \"Spacecraft escaping the Solar System\". Heavens-Above. Retrieved March 16, 2014.\n\n\n\t^ a b Wolchover, Natalie. \"Did NASA's Voyager 1 Spacecraft Just Exit the Solar System?\". livescience. Retrieved August 20, 2013.\n\n\n\t^ Matson, John (December 4, 2012). \"Despite Tantalizing Hints, Voyager 1 Has Not Crossed into the Interstellar Medium\". Scientific American. Retrieved August 20, 2013.\n\n\n\t^ \"Voyager 1 Can 'Taste' the Interstellar Shore\". Discovery News. Discovery Channel. December 3, 2012. Retrieved September 16, 2013.\n\n\n\t^ Oakes, Kelly (December 3, 2012). \"Voyager 1 is still not out of the Solar System\". Basic Space Blog. Scientific American. Retrieved September 16, 2013.\n\n\n\t^ \"Voyager 1 probe leaving Solar System reaches 'magnetic highway' exit\". Daily News & Analysis. Reuters. December 4, 2012. Retrieved December 4, 2012.\n\n\n\t^ \"Voyager 1 has entered a new region of space, sudden changes in cosmic rays indicate\". American Geophysical Union. March 20, 2013. Archived from the original on March 22, 2013.\n\n\n\t^ a b c d Cook, J.-R (September 12, 2013). \"How Do We Know When Voyager Reaches Interstellar Space?\". NASA / Jet Propulsion Lab. Retrieved September 15, 2013.\n\n\n\t^ \"Voyager - Fast Facts\". voyager.jpl.nasa.gov.\n\n\n\t^ Swisdak, M.; Drake, J. F.; Opher, M. (2013). \"A Porous, Layered Heliopause\". The Astrophysical Journal. 774 (1): L8. arXiv:1307.0850. Bibcode:2013ApJ...774L...8S. doi:10.1088/2041-8205/774/1/L8.\n\n\n\t^ Morin, Monte (September 12, 2013). \"NASA confirms Voyager 1 has left the Solar System\". Los Angeles Times.\n\n\n\t^ \"Voyage 1 Records \"Sounds\" of Interstellar Space\". Space.com. Retrieved December 20, 2013.\n\n\n\t^ Voyager Fast Facts\n\n\t^ \"Voyager Signal Spotted By Earth Radio Telescopes\". NASA. NASA TV. September 5, 2013. Retrieved May 20, 2015.\n\n\n\t^ \"Catalog Page for PIA17046\". Photo Journal. NASA. Retrieved April 27, 2014.\n\n\n\t^ \"It's Official: Voyager 1 Is Now In Interstellar Space\". UniverseToday. September 12, 2013. Retrieved April 27, 2014.\n\n\n\t^ a b \"Voyager – Mission – Interstellar Mission\". NASA. August 9, 2010. Retrieved March 17, 2011.\n\n\n\t^ \"Future\". NASA. Retrieved October 13, 2013.\n\n\n\t^ Bailer-Jones, Coryn A. L.; Farnocchia, Davide (April 3, 2019). \"Future stellar flybys of the Voyager and Pioneer spacecraft\". Research Notes of the AAS. RNAAS 3, 59. 3 (4): 59. Bibcode:2019RNAAS...3d..59B. doi:10.3847/2515-5172/ab158e.\n\n\n\t^ \"New Horizons Salutes Voyager\". New Horizons. August 17, 2006. Archived from the original on November 13, 2014. Retrieved November 3, 2009.\n\n\n\t^ \"Voyager 1 spacecraft thrusters fire up after decades idle\". The Irish Times. December 4, 2017.\n\n\n\t^ \"Voyager 1 Fires Up Thrusters After 37 Years\". NASA. December 1, 2017.\n\n\n\t^ \"Voyger: Spacecraft Lifetime\". Jet Propulsion Laboratory. NASA. March 3, 2015. Retrieved May 20, 2015.\n\n\n\t^ \"Voyager - Mission Status\". voyager.jpl.nasa.gov.\n\n\n\t^ \"Voyager – Spacecraft – Spacecraft Lifetime\". NASA Jet Propulsion Laboratory. October 18, 2010. Retrieved September 30, 2011. shutdown order has not been determined\n\n\n\t^ Ferris, Timothy (May 2012). \"Timothy Ferris on Voyagers' Never-Ending Journey\". Smithsonian Magazine. Retrieved August 19, 2013.\n\n\n\t^ \"Voyager Golden record\". JPL. Retrieved August 18, 2013.\n\n\n\n\n\n\nExternal links[edit]\n\n\t\tWikimedia Commons has media related to Voyager 1.\n\n\n\tNASA Voyager website\n\tVoyager 1 Mission Profile by NASA's Solar System Exploration\n\tPosition of Voyager 1 (Live-Counter)\n\tVoyager 1 (NSSDC Master Catalog)\n\tHeavens-above.com: Spacecraft Escaping the Solar System – current positions and diagrams\n\tJPL Voyager Telecom Manual\n\tVoyager 1 Has Outdistanced the Solar Wind\n\tGray, Meghan. \"Voyager and Interstellar Space\". Deep Space Videos. Brady Haran.\n\n\tWebGL-based 3D artist's view of Voyager @ SPACECRAFTS 3D\n\n\n\t\tv\n\tt\n\te\n\n\nVoyager program\n\n\tSpacecraft\t\n\tVoyager 1\n\tVoyager 2\n\n\n\n\t\n\n\n\tComponents \nexamples\n\t\n\tMHW-RTG\n\tCosmic Ray Subsystem (CRS)\n\tPlasma Wave Subsystem (PWS)\n\tVoyager Golden Record (Contents)\n\n\n\n\n\tWork\t\n\tPale Blue Dot\n\tFamily Portrait\n\n\n\n\n\tVoyager team\t\n\tStamatios Krimigis\n\tCarolyn Porco\n\tRaymond Heacock\n\tJim Blinn\n\tEdward C. Stone\n\tTimothy Ferris\n\n\n\n\n\tRelated\t\n\tGravity assist\n\tRadioisotope thermoelectric generator\n\tSpecific orbital energy of Voyager 1\n\tTitan IIIE\n\tGrand Tour program\n\tNASA Deep Space Network\n\n\n\n\n\tObservation Targets\t\n\tEnceladus\n\tMasubi (volcano)\n\tExploration of Jupiter\n\tExploration of Saturn\n\tExploration of Uranus\n\tPrometheus (volcano)\n\tExploration of Io\n\tRings of Neptune\n\tDunyazad (crater)\n\tSurt (volcano)\n\tShahrazad (crater)\n\tPele (volcano)\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft missions to Jupiter\n\n\tFlybys\t\n\tPioneer program\n\tPioneer 10\n\t11\n\n\n\tVoyager program\n\tVoyager 1\n\t2\n\n\n\tUlysses\n\tCassini–Huygens\n\tNew Horizons\n\n\n\n\t\n\n\tOrbiters\t\n\tGalileo\n\tJuno (active)\n\n\n\n\n\tAtmospheric probes\t\n\tGalileo Probe\n\n\n\n\n\tPlanned missions\t\n\tJupiter Icy Moons Explorer (JUICE) (2022)\n\tEuropa Clipper (2023)\n\n\n\n\n\tProposed missions\t\n\tIo Volcano Observer (2021)\n\tLaplace-P (2023)\n\tEuropa Lander (2024)\n\tFIRE (2024)\n\tOKEANOS (2027)\n\tSmara (2030)\n\n\n\n\n\tCancelled / Concepts\t\n\tArgo (proposed)\n\tEuropa Jupiter System Mission-Laplace\n\tJupiter Europa Orbiter\n\tJupiter Ganymede Orbiter\n\tJupiter Magnetospheric Orbiter\n\n\n\tEuropa Orbiter\n\tInnovative Interstellar Explorer\n\tJovian Europa Orbiter\n\tJupiter Icy Moons Orbiter\n\tNeptune Orbiter\n\tNew Horizons 2\n\tPioneer H\n\tTsiolkovsky mission\n\n\n\n\n\tRelated topics\t\n\tExploration of Jupiter\n\tAtmosphere of Jupiter\n\tMagnetosphere of Jupiter\n\tMoons of Jupiter\n\tIo\n\tExploration\n\n\n\tEuropa\n\tColonization\n\n\n\tGanymede\n\tCallisto\n\n\n\tRings of Jupiter\n\tDeep Space Network\n\tMissions to the outer planets\n\tColonization of the outer Solar System\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nSpacecraft missions to Saturn\n\n\tPast\t\n\tFlybys\t\n\tPioneer 11\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\tOrbiters\t\n\tCassini–Huygens\n\ttimeline\n\tretirement\n\n\n\n\n\n\n\tLanders\t\n\tHuygens (on Titan)\n\n\n\n\n\n\n\t\n\n\n\tProposed\t\n\tto Saturn and rings\t\n\tKronos\n\tSaturn Atmospheric Entry Probe\n\tSPRITE\n\tTitan Saturn System Mission\n\n\n\n\n\tto Enceladus\t\n\tEnceladus Life Finder\n\tEnceladus Explorer\n\tLife Investigation For Enceladus\n\n\n\n\n\tto Titan\t\n\tAVIATR\n\tOceanus\n\tTALISE\n\tTitan Mare Explorer\n\n\n\n\n\tto several moons\t\n\tExplorer of Enceladus and Titan\n\tJourney to Enceladus and Titan\n\n\n\n\n\n\n\n\tPlanned\t\n\tDragonfly (to Titan, 2026)\n\n\n\n\n\t\n\tThere are no ongoing missions to Saturn\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nNASA\n\n\tPolicy and history\t\n\tHistory\t\n\tNACA (1915)\n\tNational Aeronautics and Space Act (1958)\n\tSpace Task Group (1958)\n\tPaine (1986)\n\tRogers (1986)\n\tRide (1987)\n\tSpace Exploration Initiative (1989)\n\tAugustine (1990)\n\tU.S. National Space Policy (1996)\n\tCFUSAI (2002)\n\tCAIB (2003)\n\tVision for Space Exploration (2004)\n\tAldridge (2004)\n\tAugustine (2009)\n\n\n\n\n\tGeneral\t\n\tSpace Race\n\tAdministrator and Deputy Administrator\n\tChief Scientist\n\tAstronaut Corps\n\tRanks and positions\n\tChief\n\n\n\tBudget\n\tSpin-off technologies\n\tNASA TV\n\tNASA Social\n\tLaunch Services Program\n\tMercury Control Center\n\tKennedy Space Center\n\tVehicle Assembly Building\n\tLaunch Complex 39\n\tLaunch Control Center\n\tOperations and Checkout Building\n\n\n\tJohnson Space Center\n\tMission Control\n\tLunar Sample Laboratory\n\n\n\n\n\n\n\n\n\t\n\n\tRobotic programs\t\n\tPast\t\n\tHitchhiker\n\tMariner\n\tMariner Mark II\n\tMESUR\n\tMars Surveyor '98\n\tNew Millennium\n\tLunar Orbiter\n\tPioneer\n\tPlanetary Observer\n\tRanger\n\tSurveyor\n\tViking\n\tProject Prometheus\n\tMars Scout\n\tMars Exploration Rover\n\n\n\n\n\tCurrent\t\n\tLiving With a Star\n\tLunar Precursor Robotic Program\n\tEarth Observing System\n\tGreat Observatories program\n\tExplorer\n\tSmall explorer\n\tVoyager\n\tDiscovery\n\tNew Frontiers\n\tSolar Terrestrial Probes\n\tCommercial Lunar Payload Services\n\n\n\n\n\n\n\n\tHuman spaceflight\nprograms\t\n\tPast\t\n\tX-15 (suborbital)\n\tMercury\n\tGemini\n\tApollo\n\tApollo–Soyuz Test Project (with the Soviet space program)\n\tSkylab\n\tSpace Shuttle\n\tShuttle–Mir (with Roscosmos State Corporation)\n\tConstellation\n\n\n\n\n\tCurrent\t\n\tInternational Space Station\n\tCommercial Orbital Transportation Services\n\tCommercial Crew Development\n\tOrion\n\tArtemis\n\tLunar Gateway\n\n\n\n\n\n\n\n\tIndividual featured\n missions\n(human and robotic)\t\n\tPast\t\n\tCOBE\n\tMercury 3\n\tMercury-Atlas 6\n\tMagellan\n\tPioneer 10\n\tPioneer 11\n\tGalileo\n\tGALEX\n\tGRAIL\n\tWMAP\n\tSpace Shuttle\n\tSojourner rover\n\tSpirit rover\n\tLADEE\n\tMESSENGER\n\tAquarius\n\tCassini\n\tDawn\n\tKepler space telescope\n\tOpportunity rover\n\tRHESSI\n\tobserved\n\n\n\n\n\n\n\tCurrently\noperating\t\n\tMars Reconnaissance Orbiter\n\t2001 Mars Odyssey\n\tNew Horizons\n\tInternational Space Station\n\tHubble Space Telescope\n\tSpitzer\n\tSwift\n\tTHEMIS\n\tMars Exploration Rover\n\tCuriosity rover\n\ttimeline\n\n\n\tInSight\n\tGOES 14\n\tLunar Reconnaissance Orbiter\n\tGOES 15\n\tVan Allen Probes\n\tSolar Dynamics Observatory\n\tJuno\n\tMars Science Laboratory\n\ttimeline\n\n\n\tNuSTAR\n\tVoyager 1\n\tVoyager 2\n\tWISE\n\tMAVEN\n\tMMS\n\tOSIRIS-REx\n\tTransiting Exoplanet Survey Satellite\n\n\n\n\n\tFuture\t\n\tJoint Polar Satellite System\n\tJames Webb Space Telescope\n\tWide Field Infrared Survey Telescope\n\tMars 2020\n\tNISAR\n\tEuropa Clipper\n\n\n\n\n\n\n\n\tCommunications\nand navigation\t\n\tNear Earth Network\n\tSpace Network\n\tDeep Space Network (Goldstone\n\tMadrid\n\tCanberra\n\tSpace Flight Operations Facility)\n\tDeep Space Atomic Clock\n\n\n\n\n\tNASA lists\t\n\tAstronauts\n\tby name\n\tby year\n\tGemini astronauts\n\tApollo astronauts\n\n\n\tList of NASA aircraft\n\tList of NASA missions\n\tuncrewed missions\n\n\n\tList of NASA contractors\n\tList of United States rockets\n\tList of NASA cancellations\n\tList of Space Shuttle missions\n\tcrews\n\n\n\tList of NASA cameras on spacecraft\n\n\n\n\n\tNASA images\nand artwork\t\n\tEarthrise\n\tThe Blue Marble\n\tFamily Portrait\n\tPale Blue Dot\n\n\n\tPillars of Creation\n\tMystic Mountain\n\tSolar System Family Portrait\n\tThe Day the Earth Smiled\n\tFallen Astronaut\n\tLunar plaques\n\tPioneer plaques\n\tVoyager Golden Record\n\tApollo 11 goodwill messages\n\tNASA insignia\n\tGemini and Apollo medallions\n\tMission patches\n\n\n\n\n\tRelated\t\n\tApollo 15 postal covers incident\n\tSpace Mirror Memorial\n\tThe Astronaut Monument\n\tU.S. Astronaut Hall of Fame\n\tSpace program on U.S. stamps\n\tApollo 17 Moon mice\n\tOther primates in space\n\tNASA spinoff technologies\n\n\n\n\n\t\n\t Category\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n21st-century space probes\n\n\tActive space probes\n(deep space missions)\t\n\tMoon\t\n\tARTEMIS\n\tChandrayaan-2\n\tChang'e 3\n\tChang'e 4 (Yutu-2)\n\tLunar Reconnaissance Orbiter\n\n\n\n\n\tMars\t\n\tExoMars TGO\n\tInSight\n\tMars Orbiter Mission\n\tMars Express\n\t2001 Mars Odyssey\n\tMAVEN\n\tMRO\n\tMSL Curiosity\n\n\n\n\n\tVenus\t\n\tAkatsuki\n\n\n\n\n\tMinor planet\t\n\tChang'e 2\n\tHayabusa2 / MINERVA-II\n\tNew Horizons\n\tOSIRIS-REx\n\n\n\n\n\tSolar science\t\n\tACE\n\tDSCOVR\n\tParker Solar Probe\n\tSOHO\n\tSTEREO\n\tWind\n\n\n\n\n\tOthers\t\n\tBepiColombo\n\tGaia\n\tJuno\n\tTHEMIS\n\tVoyager 1\n\tVoyager 2\n\n\n\n\n\n\n\n\tCompleted after 2000\n(by termination date)\t\n\t2000s\t\n\t2001\n\tNEAR Shoemaker\n\tDeep Space 1\n\n\n\t2003\n\tPioneer 10\n\tGalileo\n\tNozomi\n\n\n\t2004\n\tGenesis\n\n\n\t2005\n\tHuygens\n\n\n\t2006\n\tMars Global Surveyor\n\n\n\t2008\n\tPhoenix\n\n\n\t2009\n\tChang'e 1\n\tUlysses\n\tChandrayaan-1\n\tSELENE\n\tLCROSS\n\n\n\n\n\n\n\t2010s\t\n\t2010\n\tHayabusa\n\tMER Spirit\n\n\n\t2011\n\tStardust\n\n\n\t2012\n\tGRAIL\n\n\n\t2013\n\tDeep Impact\n\n\n\t2014\n\tLADEE\n\tVenus Express\n\tChang'e 5-T1\n\n\n\t2015\n\tMESSENGER\n\tPROCYON\n\tIKAROS\n\n\n\t2016\n\tRosetta / Philae\n\tYutu\n\tExoMars Schiaparelli\n\n\n\t2017\n\tLISA Pathfinder\n\tCassini\n\n\n\t2018\n\tMASCOT\n\tDawn\n\tLongjiang-1\n\n\n\t2019\n\tMarCO\n\tMER Opportunity\n\tBeresheet\n\tLongjiang-2\n\tVikram / Pragyan\n\n\n\n\n\n\n\n\n\n\t\n\tList of Solar System probes\n\tList of lunar probes\n\tList of space telescopes\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\nExtremes of motion\n\n\tSpeed\t\n\tWave (Light\n\tSound)\n\tVehicle\n\tSpacecraft\n\tAircraft\n\tpropeller-based\n\ttranscontinental\n\tFAI records\n\n\n\tWater-borne vehicle\n\tsailing\n\tunderwater\n\ttransatlantic\n\n\n\tLand vehicle (rocket-based\n\twheel-driven\n\tproduction car (by speed / by acceleration)\n\n\n\trailed\n\tmotorcycle\n\tproduction motorcycle (by speed / by acceleration)\n\n\n\tBritish\n\n\n\n\n\n\n\tDistance\t\n\tSpace (furthest spacecraft\n\tfurthest landing on another world\n\tfurthest travels on another world\n\tfurthest humans\n\tclosest spacecraft to the Sun)\n\tAircraft (furthest flight\n\thighest altitude\n\tFAI records)\n\tDeepest Earth ocean dive\n\n\n\n\n\tEndurance\t\n\tSpace (most enduring spaceflight\n\tmost endurance on another world\n\tmost time as a person in space\n\tmost enduring population of a spacecraft)\n\tAircraft\n\n\n\n\n\tSee also\t\n\tSpaceflight records\n\n\n\n\n\n\n\n\t\tv\n\tt\n\te\n\n\n← 1976  ·  Orbital launches in 1977  ·  1978 →\n\n\tKosmos 888 | Meteor-2 No.2 | Kosmos 889 | Kosmos 890 | NATO 3B | Kosmos 891 | OPS 3151 | Soyuz 24 | Kosmos 892 | Molniya-2-17 | Kosmos 893 | Tansei 3 | Kosmos 894 | Unnamed | Kiku 2 | Kosmos 895 | Kosmos 896 | Kosmos 897 | Palapa A2 | OPS 4915 | Kosmos 898 | Molniya-1-36 | Kosmos 899 | Kosmos 900 | Meteor-M No.39 | Kosmos 901 | Kosmos 902 | Kosmos 903 | Kosmos 904 | GEOS-1 | Kosmos 905 | Kosmos 906 | Molniya-3 No.19 | Kosmos 907 | OPS 9437 ·  OPS 9438 | Kosmos 908 | Kosmos 909 | Kosmos 910 | OPS 9751 | Kosmos 911 | Kosmos 912 | Intelsat IVA F-4 | Kosmos 913 | Kosmos 914 | OPS 5644 | Kosmos 915 | Kosmos 916 | Kosmos 917 | GOES 2 | Signe 3 | Kosmos 918 | Kosmos 919 | Kosmos 920 | NTS-2 | Molniya-1 No.45 | Kosmos 921 | OPS 4800 | Meteor-Priroda No.2-2 | Kosmos 922 | Kosmos 923 | Kosmos 924 | Kosmos 925 | Kosmos 926 | Kosmos 927 | Kosmos 928 | Himawari 1 | Kosmos 929 | Kosmos 930 | Kosmos 931 | Kosmos 932 | Kosmos 933 | Gran' No.13L | Kosmos 934 | Kosmos 935 | Kosmos 936 | TKS-VA No.009P ·  TKS-VA No.009A | Unnamed | HEAO-1 | Voyager 2 | Kosmos 937 | Kosmos 938 | Kosmos 939 ·  Kosmos 940 ·  Kosmos 941 ·  Kosmos 942 ·  Kosmos 943 ·  Kosmos 944 ·  Kosmos 945 ·  Kosmos 946 | Sirio 1 | Kosmos 947 | Molniya-1-38 | Kosmos 948 | Voyager 1 | Kosmos 949 | Kosmos 950 | Kosmos 951 | OTS-1 | Kosmos 952 | Kosmos 953 | Kosmos 954 | Kosmos 955 | Ekran No.12L | Prognoz 6 | OPS 7471 | Kosmos 956 | Interkosmos 17 | Salyut 6 | Intelsat IVA F-5 | Kosmos 957 | Soyuz 25 | Kosmos 958 | Kosmos 959 | ISEE-1 ·  ISEE-2 | Kosmos 960 | Kosmos 961 | Molniya-3 No.18 | Transat | Kosmos 962 | Meteosat 1 | Kosmos 963 | Unnamed | Kosmos 964 | Kosmos 965 | OPS 8781 ·  OPS 8781 SSU-1 ·  OPS 8781 SSU-2 ·  OPS 8781 SSU-3 | Soyuz 26 | OPS 4258 | Kosmos 966 | Kosmos 967 | Meteor-2 No.3 | Sakura 1 | Kosmos 968 | Kosmos 969 | Kosmos 970 | Kosmos 971 | Kosmos 972 | Kosmos 973\n\n\tPayloads are separated by bullets ( · ), launches by pipes ( | ). Manned flights are indicated in bold text. Uncatalogued launch failures are listed in italics. Payloads deployed from other spacecraft are denoted in (brackets).\n\n\n\n\n\tAuthority control \t\n\tGND: 4658791-3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Voyager_1&oldid=919091535\"\n\n\t\t\n\t\tCategories: \tVoyager program\n\tNASA space probes\n\tMissions to Saturn\n\tMissions to Jupiter\n\tRadio frequency propagation\n\tSpacecraft escaping the Solar System\n\t1977 in spaceflight\n\t1977 in the United States\n\t1977 events in the United States\n\t1977 robots\n\tNuclear-powered robots\n\tSpacecraft launched by Titan rockets\n\tSpacecraft launched in 1977\n\n\nHidden categories: \tCS1 German-language sources (de)\n\tArticles with short description\n\tGood articles\n\tUse mdy dates from June 2016\n\tUse American English from March 2018\n\tAll Wikipedia articles written in American English\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from July 2019\n\tArticles with unsourced statements from February 2016\n\tArticles containing potentially dated statements from 2013\n\tAll articles containing potentially dated statements\n\tArticles with unsourced statements from May 2019\n\tArticles containing potentially dated statements from October 2010\n\tCommons category link from Wikidata\n\tWikipedia articles with GND identifiers\n\tArticles containing video clips\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tIn other projects\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWikimedia Commons\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAfrikaans\n\tAlemannisch\n\tالعربية\n\tAragonés\n\tঅসমীয়া\n\tAsturianu\n\tAzərbaycanca\n\tবাংলা\n\tБеларуская\n\tБеларуская (тарашкевіца)‎\n\tБългарски\n\tBosanski\n\tBrezhoneg\n\tCatalà\n\tČeština\n\tCymraeg\n\tDansk\n\tDeutsch\n\tEesti\n\tΕλληνικά\n\tEspañol\n\tEsperanto\n\tEuskara\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tՀայերեն\n\tԱրեւմտահայերէն\n\tहिन्दी\n\tHrvatski\n\tIdo\n\tBahasa Indonesia\n\tÍslenska\n\tItaliano\n\tעברית\n\tKabɩyɛ\n\tKiswahili\n\tLatina\n\tLatviešu\n\tLietuvių\n\tLumbaart\n\tMagyar\n\tമലയാളം\n\tमराठी\n\tBahasa Melayu\n\tMirandés\n\tМонгол\n\tမြန်မာဘာသာ\n\tNederlands\n\t日本語\n\tNorsk\n\tNorsk nynorsk\n\tOccitan\n\tOʻzbekcha/ўзбекча\n\tPlattdüütsch\n\tPolski\n\tPortuguês\n\tRomână\n\tРусский\n\tScots\n\tShqip\n\tSicilianu\n\tSimple English\n\tسنڌي\n\tSlovenčina\n\tSlovenščina\n\tکوردی\n\tСрпски / srpski\n\tSrpskohrvatski / српскохрватски\n\tSuomi\n\tSvenska\n\tதமிழ்\n\tไทย\n\tТоҷикӣ\n\tTürkçe\n\tУкраїнська\n\tاردو\n\tTiếng Việt\n\t吴语\n\t粵語\n\tŽemaitėška\n\t中文\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 1 October 2019, at 19:56 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "15", "dc:title": "Voyager 1 - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.24", "og:image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Voyager_spacecraft_model.png/1200px-Voyager_spacecraft_model.png", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-voyager_1", "title": "Voyager 1 - Wikipedia"}}