{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTelecommunications link - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tTelecommunications link\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\"Uplink\" redirects here. For other uses, see Uplink (disambiguation).\n\nIn telecommunications a link is a communication channel that connects two or more devices. The link may be physical or logical that uses one or more physical links or shares a physical link with other telecommunications links.\n\nA telecommunications link is generally one of several types of information transmission paths such as those provided by communication satellites, terrestrial radio communications infrastructure and computer networks to connect two or more points.\n\nThe term link is widely used in computer networking to refer to the communications facilities that connect nodes of a network.[1][a] When the link is a logical link the type of physical link should always be specified (e.g., data link, uplink, downlink, fiber optic link, point-to-point link, etc.)\n\n\nContents\n\n\n\t1 Types\n\t1.1 Point-to-point\n\t1.2 Broadcast\n\t1.3 Multipoint\n\t1.4 Point-to-multipoint\n\t1.5 Private and public — accessibility and ownership\n\n\n\n\t2 Direction\n\t2.1 Uplink\n\t2.2 Downlink\n\t2.3 Forward link\n\t2.4 Reverse link\n\n\n\n\t3 See also\n\t4 Notes\n\t5 References\n\n\n\n\n\nTypes[edit]\n\nPoint-to-point[edit]\n\nMain article: Point-to-point (telecommunications)\n\nA point-to-point link is a dedicated link that connects exactly two communication facilities (e.g., two nodes of a network, an intercom station at an entryway with a single internal intercom station, a radio path between two points, etc.).\n\n\nBroadcast[edit]\n\nBroadcast links connect two or more nodes and support broadcast transmission, where one node can transmit so that all other nodes can receive the same transmission. Ethernet is an example.\n\n\nMultipoint[edit]\n\nAlso known as a multidrop link, a multipoint link is a link that connects two or more nodes.  Also known as general topology networks, these include ATM and Frame Relay links, as well as X.25 networks when used as links for a network layer protocol like IP.\n\nUnlike broadcast links, there is no mechanism to efficiently send a single message to all other nodes without copying and retransmitting the message.\n\n\nPoint-to-multipoint[edit]\n\nMain article: Point-to-multipoint communication (telecommunications)\n\nA point-to-multipoint link (or simply a multipoint) is a specific type of multipoint link which consists of a central connection endpoint (CE) that is connected to multiple peripheral CEs. Any transmission of data that originates from the central CE is received by all of the peripheral CEs while any transmission of data that originates from any of the peripheral CEs is only received by the central CE.\n\n\nPrivate and public — accessibility and ownership[edit]\n\nLinks are often referred to by terms which refer to the ownership and / or accessibility of the link.\n\n\n\tA private link is a link that is either owned by a specific entity or a link that is only accessible by a specific entity.\n\tA public link is a link that uses the public switched telephone network or other public utility or entity to provide the link and which may also be accessible by anyone.\n\n\nDirection[edit]\n\n  \n Feeder links, here: uplink / downlink\n\n\n\nUplink[edit]\n\n\tPertaining to radiocommunication service, an uplink (UL or U/L) is the portion of a feeder link used for the transmission of signals from an earth station to a space radio station, space radio system or high altitude platform station.\n\tPertaining to GSM and cellular networks, the radio uplink is the transmission path from the mobile station (cell phone) to a base station (cell site). Traffic and signalling flowing within the BSS and NSS may also be identified as uplink and downlink.\n\tPertaining to computer networks, an uplink is a connection from data communications equipment toward the network core. This is also known as an upstream connection.\n\n\nDownlink[edit]\n\n\tPertaining to radiocommunication service, a downlink (DL or D/L) is the portion of a feeder link used for the transmission of signals from a space radio station, space radio system or high altitude platform station to an earth station.\n\tIn the context of satellite communications, a downlink (DL) is the link from a satellite to a ground station.\n\tPertaining to cellular networks, the radio downlink is the transmission path from a cell site to the cell phone. Traffic and signalling flowing within the base station subsystem (BSS) and network switching subsystem (NSS) may also be identified as uplink and downlink.\n\tPertaining to computer networks, a downlink is a connection from data communications equipment towards data terminal equipment. This is also known as a downstream connection.\n\n\nForward link[edit]\n\nA forward link is the link from a fixed location (e.g., a base station) to a mobile user. If the link includes a communications relay satellite, the forward link will consist of both an uplink (base station to satellite) and a downlink (satellite to mobile user).[2]\n\n\nReverse link[edit]\n\nSee also: Backhaul (telecommunications) and Return channel\n\nThe reverse link (sometimes called a return channel) is the link from a mobile user to a fixed base station.\n\nIf the link includes a communications relay satellite, the reverse link will consist of both an uplink (mobile station to satellite) and a downlink (satellite to base station) which together constitute a half hop.\n\n\nSee also[edit]\n\n\tData transmission\n\tTelecommunications network\n\n\nNotes[edit]\n\n\n\t^ Sometimes the communications facilities that provide the communications channel that constitutes a link are also included in the definition of link.\n\n\n\n\n\nReferences[edit]\n\n\n\t^ ATIS committee PRQC. \"network topology\". ATIS Telecom Glossary 2007. Alliance for Telecommunications Industry Solutions. Retrieved 2008-10-10.\n\n\t^ Basics of C & Ku Band Scatmag.com\n\n\n\n\n\n\t This article incorporates public domain material from the General Services Administration document \"Federal Standard 1037C\" (in support of MIL-STD-188).\n\t This article incorporates public domain material from the United States Department of Defense document  \"Dictionary of Military and Associated Terms\".\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Telecommunications_link&oldid=910076443\"\n\n\t\t\n\t\tCategories: \tTelecommunications\n\tTelecommunications engineering\n\tCommunication circuits\n\tBroadcast engineering\n\tTelecommunications infrastructure\n\n\nHidden categories: \tWikipedia articles incorporating text from the Federal Standard 1037C\n\tWikipedia articles incorporating text from MIL-STD-188\n\tWikipedia articles incorporating text from the Department of Defense Dictionary of Military and Associated Terms\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tالعربية\n\tCatalà\n\tEspañol\n\tفارسی\n\t한국어\n\tहिन्दी\n\tBahasa Melayu\n\tPolski\n\tРусский\n\tSunda\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 9 August 2019, at 14:18 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "82", "dc:title": "Telecommunications link - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.25", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-telecommunications_link", "title": "Telecommunications link - Wikipedia"}}