{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOn-board data handling - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tOn-board data handling\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\t\t\n\tThis article does not cite any sources. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.  (December 2009) (Learn how and when to remove this template message)\n\n\n\nThe on-board data handling (OBDH) subsystem of a spacecraft is the subsystem which carries and stores data between the various electronics units and the ground segment, via the telemetry, tracking and command (TT&C) subsystem.\n\nIn the earlier decades of the space industry, the OBDH function was usually considered a part of the TT&C, particularly before computers became common on board. In recent years, the OBDH function has expanded, so much that it is generally considered a separate subsystem to the TT&C, which is these days concerned solely with the RF link between the ground and the spacecraft.\n\nFunctions commonly performed by the OBDH are:\n\n\n\tReception, error correction and decoding of telecommands (TCs) from the TT&C\n\tForwarding of telecommands for execution by the target Avionics\n\tStorage of telecommands until a defined time ('time tagged' TCs)\n\tStorage of telecommands until a defined position ('position tagged' TCs)\n\tMeasurement of discrete values such as voltages, temperatures, binary statuses etc.\n\tCollection of measurements made by other units and subsystems via one or more data busses, such as MIL-STD-1553.\n\tReal-time buffering of the measurements in a data pool\n\tProvision of a processing capability to achieve the aims of the mission, often using the data collected.\n\tCollation and encoding of pre-defined telemetry frames\n\tStorage of telemetry frames in a mass memory\n\tDownlinking of telemetry to the ground, via the TT&C.\n\tManagement and distribution of time signals\n\n\n\n\n\n\nContents\n\n\n\t1 Telecommand reception\n\t2 Telecommand execution\n\t3 Time-tagged telecommands\n\t4 Position-tagged telecommands\n\t5 Processing function\n\t6 See also\n\t7 External links\n\n\n\n\n\nTelecommand reception[edit]\n\nThe OBDH receives the TCs as a synchronous PCM data stream from the TT&C\n\n\nTelecommand execution[edit]\n\nThe desired effect of the telecommand may be just to change a value in the on-board software, or to open/close a latching relay to reconfigure or power a unit, or maybe to fire a thruster or main engine. Whichever effect is desired, the OBDH subsystem will facilitate this either by sending an electric pulse from the OBC, or by passing the command through a data bus to the unit which will eventually execute the TC. Some TCs are part of a large block of commands, used to upload updated software or data tables to fine tune the operation of the spacecraft, or to deal with anomalies.\n\n\nTime-tagged telecommands[edit]\n\nIt is often required to delay a command's execution until a certain time. This is often because the spacecraft is not in view of the ground station, but may also be for reasons of precision. The OBC will store the TC until the required time in a queue, and then execute it.\n\n\nPosition-tagged telecommands[edit]\n\nSimilar to time-tagged commands are commands that are stored for execution until the spacecraft is at a specified position. These are most useful for earth observation satellites, which need to start an observation over a specified point of the Earth's surface. The spacecraft, often in sun-synchronous orbits, take a precisely repeating track over the earth. Observations which are taken from the same position may be compared using interferometry, if they are in close enough register.  \n\nThe precise position required is sensed using GPS.\n\nOnce a position tagged command has been executed, it may be flagged for deletion or left to execute again when the spacecraft is once again over the same point.\n\n\nProcessing function[edit]\n\nThe modern OBDH always uses an on-board computer (OBC) that is reliable, usually with redundant processors. The processing power is made available to other applications which support the spacecraft bus, such as attitude control algorithms, thermal control, failure detection isolation and recovery. If the mission itself requires only a small amount of computing power (such as a small scientific satellite) then the payload may also be controlled by the software running on the OBC, to save launch mass and the considerable expense of a dedicated payload computer.\n\n\nSee also[edit]\n\n\tSpacecraft bus\n\n\nExternal links[edit]\n\n\thttps://ecss.nl/standard/ecss-e-st-50-04c-space-data-links-telecommand-protocols-synchronization-and-channel-coding/\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=On-board_data_handling&oldid=878690727\"\n\n\t\t\n\t\tCategories: \tAvionics\n\n\nHidden categories: \tArticles lacking sources from December 2009\n\tAll articles lacking sources\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\n\n\t\t\t\tAdd links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 16 January 2019, at 10:57 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "114", "dc:title": "On-board data handling - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.25", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-on-board_data_handling", "title": "On-board data handling - Wikipedia"}}