{"status": 200, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPayload - Wikipedia\n\n\n\n\n\n\n\n\t\n\t\n\n\t\n\n\n\n\tPayload\n\n\t\n\t\n\t\tFrom Wikipedia, the free encyclopedia\n\n\t\t\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\tJump to navigation\n\t\tJump to search\n\t\tFor other uses, see Payload (disambiguation).\n\nPayload is the carrying capacity of an aircraft or launch vehicle, usually measured in terms of weight. Depending on the nature of the flight or mission, the payload of a vehicle may include cargo, passengers, flight crew, munitions, scientific instruments or experiments, or other equipment. Extra fuel, when optionally carried, is also considered part of the payload. In a commercial context (i.e., an airline or air freight carrier), payload may refer only to revenue-generating cargo or paying passengers.[1]\n\nFor a rocket, the payload can be a satellite, space probe, or spacecraft carrying humans, animals, or cargo. For a ballistic missile, the payload is one or more warheads and related systems; the total weight of these systems is referred to as the throw-weight.\n\nThe fraction of payload to the total liftoff weight of the air or spacecraft is known as the \"payload fraction\". When the weight of the payload and fuel are considered together, it is known as the \"useful load fraction\". In spacecraft, \"mass fraction\" is normally used, which is the ratio of payload to everything else, including the rocket structure.[2]\n\n\nContents\n\n\n\t1 Relationship of range and payload\n\t2 Examples\n\t3 Structural capacity\n\t4 Payload constraints\n\t5 See also\n\t6 References\n\t7 External links\n\n\n\n\n\nRelationship of range and payload[edit]\n\n  \n\n\n\n\nThere is a natural trade-off between the payload and the range of an aircraft. A payload range diagram (also known as the \"elbow chart\") illustrates the trade-off.\n\nThe top horizontal line represents the maximum payload. It is limited structurally by maximum zero-fuel weight (MZFW) of the aircraft. Maximum payload is the difference between maximum zero-fuel weight and operational empty weight (OEW). Moving left-to-right along the line shows the constant maximum payload as the range increases. More fuel needs to be added for more range.\n\nThe vertical line represents the range at which the combined weight of the aircraft, maximum payload and needed fuel reaches the maximum take-off weight (MTOW) of the aircraft. If the range is increased beyond that point, payload has to be sacrificed for fuel.\n\nThe maximum take-off weight is limited by a combination of the maximum net power of the engines and the lift/drag ratio of the wings. The diagonal line after the range-at-maximum-payload point shows how reducing the payload allows increasing the fuel (and range) when taking off with the maximum take-off weight.\n\nThe second kink in the curve represents the point at which the maximum fuel capacity is reached. Flying further than that point means that the payload has to be reduced further, for an even lesser increase in range. The absolute range is thus the range at which an aircraft can fly with maximum possible fuel without carrying any payload.\n\n\nExamples[edit]\n\nExamples of payload capacity:\n\n\n\tAntonov An-225 Mriya: 250,000 kg\n\tSaturn V:\n\tPayload to Low Earth Orbit 118,000 kg\n\tPayload to Lunar orbit 47,000 kg\n\n\n\tSpace Shuttle:\n\tPayload to Low Earth Orbit 24,400 kg (53,700 lb)\n\tPayload to geostationary transfer orbit 3,810 kg (8,390 lb)\n\n\n\tTrident (missile): 2800 kg[specify][citation needed]\n\tAutomated Transfer Vehicle\n\tPayload:[3] 7,667 kg 8 racks with 2 x 0.314 m3 and 2 x 0.414 m3\n\tEnvelope: each 1.146 m3 in front of 4 of these 8 racks\n\tCargo mass: Dry cargo: 1,500 - 5,500 kg\n\tWater: 0 – 840 kg\n\tGas (Nitrogen, Oxygen, air, 2 gases/flight): 0 – 100 kg\n\tISS Refueling propellant: 0 – 860 kg (306 kg of fuel, 554 kg of oxidizer)\n\tISS re-boost and attitude control propellant: 0 - 4,700 kg\n\tTotal cargo upload capacity: 7,667 kg\n\n\n\n\nStructural capacity[edit]\n\nFor aircraft, the weight of fuel in wing tanks does not contribute as significantly to the bending moment of the wing as does weight in the fuselage. So even when the airplane has been loaded with its maximum payload that the wings can support, it can still carry a significant amount of fuel.\n\n\nPayload constraints[edit]\n\nLaunch and transport system differ not only on the payload that can be carried but also in the stresses and other factors placed on the payload.  The payload must not only be lifted to its target, it must also arrive safely, whether elsewhere on the surface of the Earth or a specific orbit.  To ensure this the payload, such as a warhead or satellite, is designed to withstand certain amounts of various types of \"punishment\" on the way to its destination.  Most rocket payloads are fitted within a payload fairing to protect them against dynamic pressure of high-velocity travel through the atmosphere, and to improve the overall aerodynamics of the launch vehicle. Most aircraft payloads are carried within the fuselage for similar reasons.  Outsize cargo may require a fuselage with unusual proportions, such as the Super Guppy.\n\nThe various constraints placed on the launch system can be roughly categorized into those that cause physical damage to the payload and those that can damage its electronic or chemical makeup. Examples of physical damage include extreme accelerations over short time scales caused by atmospheric buffeting or oscillations, extreme accelerations over longer time scales caused by rocket thrust and gravity, and sudden changes in the magnitude or direction of the acceleration caused by how quick engines are throttled and shut down, etc. Electrical, chemical, or biological payloads can be damage by extreme temperatures (hot or cold), rapid changes in temperature or pressure, contact with fast moving air streams causing ionization, and radiation exposure from cosmic rays, the van Allen belt, or solar wind.\n\n\nSee also[edit]\n\n\tHeavy-lift launch vehicle\n\tMedium-lift launch vehicle\n\tTsiolkovsky rocket equation\n\n\nReferences[edit]\n\n\n\t^ \"Payload - Define Payload at Dictionary.com\". Dictionary.com. Archived from the original on 2013-12-12.\n\n\t^ Launius, Roger D. Jenkins, Dennis R. 2002. To Reach the High Frontier: A History of U.S. Launch Vehicles. Univ. Pr. of Kentucky. \nISBN 978-0-8131-2245-8\n\n\t^ http://esamultimedia.esa.int/docs/ATV/FS003_12_ATV_updated_launch_2008.pdf European Space Agency\n\n\n\n\n\nExternal links[edit]\n\n\tShannon Ackert (April 2013). \"Aircraft Payload-Range Analysis for Financiers\" (PDF). Aircraft Monitor.\n\n\t\"Using the Payload/Range and Takeoff Field Length Charts in the Airplane Characteristics for Airport Planning Documents\" (PDF). Boeing Commercial Airplanes. Feb 12, 2014.\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\tRetrieved from \"https://en.wikipedia.org/w/index.php?title=Payload&oldid=917363409\"\n\n\t\t\n\t\tCategories: \tAerospace engineering\n\tAir freight\n\n\nHidden categories: \tArticles needing more detailed references\n\tAll articles with unsourced statements\n\tArticles with unsourced statements from February 2015\n\n\n\n\n\t\t\n\n\t\t\n\t\n\n\n\n\n\t\n\n\n\n\n\n\t\t\n\t\t\tNavigation menu\n\n\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tPersonal tools\n\n\t\t\t\t\t\t\tNot logged in\n\tTalk\n\tContributions\n\tCreate account\n\tLog in\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNamespaces\n\n\t\t\t\t\t\t\tArticle\n\tTalk\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tVariants\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tViews\n\n\t\t\t\t\t\t\tRead\n\tEdit\n\tView history\n\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tMore\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSearch\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\tNavigation\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tMain page\n\tContents\n\tFeatured content\n\tCurrent events\n\tRandom article\n\tDonate to Wikipedia\n\tWikipedia store\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tInteraction\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tHelp\n\tAbout Wikipedia\n\tCommunity portal\n\tRecent changes\n\tContact page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tTools\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tWhat links here\n\tRelated changes\n\tUpload file\n\tSpecial pages\n\tPermanent link\n\tPage information\n\tWikidata item\n\tCite this page\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tPrint/export\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tCreate a book\n\tDownload as PDF\n\tPrintable version\n\n\n\t\t\t\t\t\t\t\n\n\t\t\n\n\t\t\t\n\t\t\tLanguages\n\n\t\t\t\n\t\t\t\t\t\t\t\t\tAsturianu\n\tБългарски\n\tCatalà\n\tDeutsch\n\tEspañol\n\tEsperanto\n\tفارسی\n\tFrançais\n\tGalego\n\t한국어\n\tBahasa Indonesia\n\tItaliano\n\tעברית\n\tLatviešu\n\tLëtzebuergesch\n\tNederlands\n\t日本語\n\tNorsk\n\tPortuguês\n\tРусский\n\tSuomi\n\tSvenska\n\tTürkçe\n\tУкраїнська\n\n\n\t\t\t\tEdit links\n\t\t\t\n\n\t\t\n\n\t\t\t\t\n\n\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t This page was last edited on 23 September 2019, at 13:59 (UTC).\n\tText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\n\t\t\t\t\t\t\tPrivacy policy\n\tAbout Wikipedia\n\tDisclaimers\n\tContact Wikipedia\n\tDevelopers\n\tCookie statement\n\tMobile view\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\n\n\t\t\n\n\t\t\n\n\n\n\n", "metadata": {"Content-Encoding": "UTF-8", "Content-Language": "en", "Content-Type": "text/html; charset=UTF-8", "ResourceLoaderDynamicStyles": "", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.html.HtmlParser"], "X-TIKA:parse_time_millis": "90", "dc:title": "Payload - Wikipedia", "generator": "MediaWiki 1.34.0-wmf.25", "referrer": ["origin", "origin-when-crossorigin", "origin-when-cross-origin"], "resourceName": "https-en-wikipedia-org-wiki-payload", "title": "Payload - Wikipedia"}}